{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46865129"
                        ],
                        "name": "Jianbo Shi",
                        "slug": "Jianbo-Shi",
                        "structuredName": {
                            "firstName": "Jianbo",
                            "lastName": "Shi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jianbo Shi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153652147"
                        ],
                        "name": "J. Malik",
                        "slug": "J.-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 30
                            }
                        ],
                        "text": "Recently, a number of authors [11, 10, 8, 9, 2] have suggested alternative segmentation methods that are based on eigenvectors of the (possibly normalized) \\a nity matrix\"."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 0
                            }
                        ],
                        "text": "Shi and Malik have argued for using a quite di erent eigenvector for solving these type of segmentation problems."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 50,
                                "start": 46
                            }
                        ],
                        "text": "Figure 6a shows the baseball player gure from [11]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 3
                            }
                        ],
                        "text": "As Shi and Malik noted, there is no guarantee that the solution obtained by ignoring the constraints and optimizing equation 4 will bear any relationship to the correct discrete solution."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 244,
                                "start": 231
                            }
                        ],
                        "text": "Let D be the degree matrix of W :\nD(i; i) = X j W (i; j) (2)\nDe ne the generalized eigenvector yi as a solution to:\n(D W )yi = iDyi (3)\nand de ne the second generalized eigenvector as the yi corresponding to the second smallest i. Shi and Malik suggested thresholding this second generalized eigenvector of W in order to cut the image into two parts."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 0
                            }
                        ],
                        "text": "Shi and Malik have shown that the second generalized eigenvector is a solution to a continuous version of a discrete problem in\nwhich the goal is to minimize:\nyT (D W )y\nyTDy (4)\nsubject to the constraint that yi 2 f1; bg and yTD1 = 0 (where 1 is the vector of all ones)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 133,
                                "start": 120
                            }
                        ],
                        "text": "As suggested by the analysis, we found that for real images, unless the W matrix is normalized in the form suggested by Shi and Malik [11] it is nearly impossible to extract segmentation information from the eigenvectors."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 77,
                                "start": 64
                            }
                        ],
                        "text": "Note that while Perona and Freeman use the largest eigenvector, Shi and Malik use the second smallest generalized eigenvector."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 4
                            }
                        ],
                        "text": "The Shi and Malik (SM) algorithm thus di ers from PF in that (1) it uses a normalized W matrix and (2) it uses the rst two eigenvectors rather than just the rst one."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 111,
                                "start": 98
                            }
                        ],
                        "text": "In this paper we have presented a uni ed view of three of these methods | Perona and Freeman [8], Shi and Malik [11] and Scott and LonguetHiggins [10]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 31
                            }
                        ],
                        "text": "I thank W. Freeman, J. Shi, J. Malik and T. Leung for helpful comments and discussions."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 186,
                                "start": 182
                            }
                        ],
                        "text": "4 Discussion Why do eigendecomposition methods for segmentation work? In this paper we have presented a uni ed view of three of these methods | Perona and Freeman [8], Shi and Malik [11] and Scott and LonguetHiggins [10]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 14848918,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b94c7ff9532ab26c3aedbee3988ec4c7a237c173",
            "isKey": true,
            "numCitedBy": 12812,
            "numCiting": 55,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a novel approach for solving the perceptual grouping problem in vision. Rather than focusing on local features and their consistencies in the image data, our approach aims at extracting the global impression of an image. We treat image segmentation as a graph partitioning problem and propose a novel global criterion, the normalized cut, for segmenting the graph. The normalized cut criterion measures both the total dissimilarity between the different groups as well as the total similarity within the groups. We show that an efficient computational technique based on a generalized eigenvalue problem can be used to optimize this criterion. We have applied this approach to segmenting static images and found results very encouraging."
            },
            "slug": "Normalized-cuts-and-image-segmentation-Shi-Malik",
            "title": {
                "fragments": [],
                "text": "Normalized cuts and image segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work treats image segmentation as a graph partitioning problem and proposes a novel global criterion, the normalized cut, for segmenting the graph, which measures both the total dissimilarity between the different groups as well as the total similarity within the groups."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34734622"
                        ],
                        "name": "D. Jacobs",
                        "slug": "D.-Jacobs",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Jacobs",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Jacobs"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1789171"
                        ],
                        "name": "D. Weinshall",
                        "slug": "D.-Weinshall",
                        "structuredName": {
                            "firstName": "Daphna",
                            "lastName": "Weinshall",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Weinshall"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1915667"
                        ],
                        "name": "Y. Gdalyahu",
                        "slug": "Y.-Gdalyahu",
                        "structuredName": {
                            "firstName": "Yoram",
                            "lastName": "Gdalyahu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Gdalyahu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[7]), we will only assume that d(xi; xj) = d(xj; xi)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5767711,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7b7eff8f78c533a7d098f1e37c1fb2c40d9e9b0d",
            "isKey": false,
            "numCitedBy": 33,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "One of the key problems in appearance-based vision is understanding how to use a set of labeled images to classify new images. Classification systems that can model human performance, or that use robust image matching methods, often make use of similarity judgments that are non-metric; but when the triangle inequality is not obeyed, most existing pattern recognition techniques are not applicable. We note that exemplar-based (or nearest-neighbor) methods can be applied naturally when using a wide class of non-metric similarity functions. The key issue, however, is to find methods for choosing good representatives of a class that accurately characterize it. We show that existing condensing techniques for finding class representatives are ill-suited to deal with non-metric dataspaces. We then focus on developing techniques for solving this problem, emphasizing two points: First, we show that the distance between two images is not a good measure of how well one image can represent another in non-metric spaces. Instead, we use the vector correlation between the distances from each image to other previously seen images. Second, we show that in non-metric spaces, boundary points are less significant for capturing the structure of a class than they are in Euclidean spaces. We suggest that atypical points may be more important in describing classes. We demonstrate the importance of these ideas to learning that generalizes"
            },
            "slug": "Class-Representation-and-Image-Retrieval-with-Jacobs-Weinshall",
            "title": {
                "fragments": [],
                "text": "Class Representation and Image Retrieval with Non-Metric Distances"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is shown that the distance between two images is not a good measure of how well one image can represent another in non-metric spaces, and it is suggested that atypical points may be more important in describing classes."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34734622"
                        ],
                        "name": "D. Jacobs",
                        "slug": "D.-Jacobs",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Jacobs",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Jacobs"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1789171"
                        ],
                        "name": "D. Weinshall",
                        "slug": "D.-Weinshall",
                        "structuredName": {
                            "firstName": "Daphna",
                            "lastName": "Weinshall",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Weinshall"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1915667"
                        ],
                        "name": "Y. Gdalyahu",
                        "slug": "Y.-Gdalyahu",
                        "structuredName": {
                            "firstName": "Yoram",
                            "lastName": "Gdalyahu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Gdalyahu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40857979,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7cb4199d5961e64f548a9641f2d1dfe99acdd8ec",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "One of the key problems in appearance-based vision is understanding how to use a set of labeled images to classify new images. Classification systems that can model human performance, or that use robust image matching methods, often make use of similarity judgments that are non-metric but when the triangle inequality is not obeyed, most existing pattern recognition techniques are not applicable. We note that exemplar-based (or nearest-neighbor) methods can be applied naturally when using a wide class of non-metric similarity functions. The key issue, however, is to find methods for choosing good representatives of a class that accurately characterize it. We note that existing condensing techniques for finding class representatives are ill-suited to deal with non-metric dataspaces. We then focus on developing techniques for solving this problem, emphasizing two points: First, we show that the distance between two images is not a good measure of how well one image can represent another in non-metric spaces. Instead, we use the vector correlation between the distances from each image to other previously seen images. Second, we show that in non-metric spaces, boundary points are less significant for capturing the structure of a class than they are in Euclidean spaces. We suggest that atypical points may be more important in describing classes. We demonstrate the importance of these ideas to learning that generalizes from experience by improving performance using both synthetic and real images."
            },
            "slug": "Condensing-image-databases-when-retrieval-is-based-Jacobs-Weinshall",
            "title": {
                "fragments": [],
                "text": "Condensing image databases when retrieval is based on non-metric distances"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is shown that the distance between two images is not a good measure of how well one image can represent another in non-metric spaces, and it is suggested that atypical points may be more important in describing classes."
            },
            "venue": {
                "fragments": [],
                "text": "Sixth International Conference on Computer Vision (IEEE Cat. No.98CH36271)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46865129"
                        ],
                        "name": "Jianbo Shi",
                        "slug": "Jianbo-Shi",
                        "structuredName": {
                            "firstName": "Jianbo",
                            "lastName": "Shi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jianbo Shi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143751119"
                        ],
                        "name": "Jitendra Malik",
                        "slug": "Jitendra-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jitendra Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11286145,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cda4d5b174cb14462094b213d4c37d51c72a7971",
            "isKey": false,
            "numCitedBy": 30,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a new feature distance which is derived from an optimal relational graph matching criterion. Instead of defining an arbitrary similarity measure for grouping, we will use the criterion of reducing instability in the relational graph to induce a similarity measure. This similarity measure not only improves the stability of the matching, but more importantly, also captures the relative importance of relational similarity in the feature space for the purpose of grouping. We will call this similarity measure the self-induced relational distance. We demonstrate the distance measure on a brightness-texture feature space and apply it to the segmentation of complex natural images."
            },
            "slug": "Self-Inducing-Relational-Distance-and-Its-to-Image-Shi-Malik",
            "title": {
                "fragments": [],
                "text": "Self Inducing Relational Distance and Its Application to Image Segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "A new feature distance is proposed which is derived from an optimal relational graph matching criterion and is called the self-induced relational distance, which captures the relative importance of relational similarity in the feature space for the purpose of grouping."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145848221"
                        ],
                        "name": "J. Costeira",
                        "slug": "J.-Costeira",
                        "structuredName": {
                            "firstName": "João",
                            "lastName": "Costeira",
                            "middleNames": [
                                "Paulo"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Costeira"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733113"
                        ],
                        "name": "T. Kanade",
                        "slug": "T.-Kanade",
                        "structuredName": {
                            "firstName": "Takeo",
                            "lastName": "Kanade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kanade"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 289,
                                "start": 283
                            }
                        ],
                        "text": "4 The Costeira and Kanade (1995) algorithm Independently of the recent work on using eigenvectors of a nity matrices to segment points in feature space, there has been interest in using singular values of the measurement matrix to segment the points into rigidly moving bodies in 3D [2, 4]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 30
                            }
                        ],
                        "text": "Recently, a number of authors [11, 10, 8, 9, 2] have suggested alternative segmentation methods that are based on eigenvectors of the (possibly normalized) \\a nity matrix\"."
                    },
                    "intents": []
                }
            ],
            "corpusId": 5182349,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "105ef36b90a63ba80d26b728ad4a5ac2ca624ed1",
            "isKey": false,
            "numCitedBy": 147,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "The structure from motion problem has been extensively studied in the field of computer vision. Yet, the bulk of the existing work assumes that the scene contains only a single moving object. The more realistic case where an unknown number of objects move in the scene has received little attention, especially for its theoretical treatment. We present a new method for separating and recovering the motion and shape of multiple independently moving objects in a sequence of images. The method does not require prior knowledge of the number of objects, nor is dependent on any grouping of features into an object at the image level. For this purpose, we introduce a mathematical construct of object shapes, called the shape interaction matrix, which is invariant to both the object motions and the selection of coordinate systems. This invariant structure is computable solely from the observed trajectories of image features without grouping them into individual objects. Once the structure is computed, it allows for segmenting features into objects by the process of transforming it into a canonical form, as well as recovering the shape and motion of each object.<<ETX>>"
            },
            "slug": "A-multi-body-factorization-method-for-motion-Costeira-Kanade",
            "title": {
                "fragments": [],
                "text": "A multi-body factorization method for motion analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A new method for separating and recovering the motion and shape of multiple independently moving objects in a sequence of images is presented, which does not require prior knowledge of the number of objects, nor is dependent on any grouping of features into an object at the image level."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE International Conference on Computer Vision"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701931"
                        ],
                        "name": "G. Scott",
                        "slug": "G.-Scott",
                        "structuredName": {
                            "firstName": "Guy",
                            "lastName": "Scott",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Scott"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "92269846"
                        ],
                        "name": "H. C. Longuet-Higgins",
                        "slug": "H.-C.-Longuet-Higgins",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Longuet-Higgins",
                            "middleNames": [
                                "Christopher"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. C. Longuet-Higgins"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 30
                            }
                        ],
                        "text": "Recently, a number of authors [11, 10, 8, 9, 2] have suggested alternative segmentation methods that are based on eigenvectors of the (possibly normalized) \\a nity matrix\"."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 29,
                                "start": 0
                            }
                        ],
                        "text": "The Scott and Longuet-Higgins [10] relocalisation algorithm gets as input an a nity matrix W and a number k and outputs a new matrix Q calculated by:"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 8
                            }
                        ],
                        "text": "1.3 The Scott and Longuet-Higgins (1990) algorithm."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 145,
                                "start": 121
                            }
                        ],
                        "text": "In this paper we have presented a uni ed view of three of these methods | Perona and Freeman [8], Shi and Malik [11] and Scott and LonguetHiggins [10]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 220,
                                "start": 216
                            }
                        ],
                        "text": "4 Discussion Why do eigendecomposition methods for segmentation work? In this paper we have presented a uni ed view of three of these methods | Perona and Freeman [8], Shi and Malik [11] and Scott and LonguetHiggins [10]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 34,
                                "start": 30
                            }
                        ],
                        "text": "The Scott and Longuet-Higgins [10] relocalisation algorithm gets as input an a nity matrix W and a number k and outputs a new matrix Q calculated by: Constructing the matrix V whose columns are the rst k eigenvectors of W ."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 7957479,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a36b175da3a91795906193efc257d3a31333f008",
            "isKey": true,
            "numCitedBy": 126,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a widely applicable method of grouping or clustering image features (such as points, lines, corners, flow vectors and the like). It takes as input a \"proximity matrix\" H a square, symmetric matrix of dimension N (where N is the number of features). The element i,j of H is an initial estimate of the \"proximity\" between the ith and yth features. As output it delivers another square symmetric matrix S whose i-)th element is near to, or much less than unity according as features i and j are to be assigned to the same or different clusters."
            },
            "slug": "Feature-grouping-by-'relocalisation'-of-of-the-Scott-Longuet-Higgins",
            "title": {
                "fragments": [],
                "text": "Feature grouping by 'relocalisation' of eigenvectors of the proximity matrix"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "This work describes a widely applicable method of grouping or clustering image features (such as points, lines, corners, flow vectors and the like) by taking as input a \"proximity matrix\" H a square, symmetric matrix of dimension N."
            },
            "venue": {
                "fragments": [],
                "text": "BMVC"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1690922"
                        ],
                        "name": "P. Perona",
                        "slug": "P.-Perona",
                        "structuredName": {
                            "firstName": "Pietro",
                            "lastName": "Perona",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Perona"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768236"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Freeman",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 30
                            }
                        ],
                        "text": "Recently, a number of authors [11, 10, 8, 9, 2] have suggested alternative segmentation methods that are based on eigenvectors of the (possibly normalized) \\a nity matrix\"."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 64,
                                "start": 61
                            }
                        ],
                        "text": "1 The Perona and Freeman (1998) algorithm Perona and Freeman [8] suggested a clustering algorithm based on thresholding the rst eigenvector of the a nity matrix (throughout this paper we refer to the \\ rst\" eigenvector as the one whose corresponding eigenvalue is largest in magnitude)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 22
                            }
                        ],
                        "text": "Claim 4 was proven in [8] and the proof of claim 6 is analogous: if v is an eigenvector of A then v = (v; 0) is an eigenvector ofW with the same eigenvalue."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 18,
                                "start": 0
                            }
                        ],
                        "text": "Perona and Freeman have shown that for block diagonal a nity matrices, the rst eigenvector will have nonzero components corresponding to points in the dominant cluster and zeros in components corresponding to points outside the dominant cluster."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 34,
                                "start": 16
                            }
                        ],
                        "text": "Note that while Perona and Freeman use the largest eigenvector, Shi and Malik use the second smallest generalized eigenvector."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 18,
                                "start": 0
                            }
                        ],
                        "text": "Perona and Freeman [8] suggested a clustering algorithm based on thresholding the rst eigenvector of the a nity matrix (throughout this paper we refer to the \\ rst\" eigenvector as the one whose corresponding eigenvalue is largest in magnitude)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 92,
                                "start": 74
                            }
                        ],
                        "text": "In this paper we have presented a uni ed view of three of these methods | Perona and Freeman [8], Shi and Malik [11] and Scott and LonguetHiggins [10]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 166,
                                "start": 163
                            }
                        ],
                        "text": "4 Discussion Why do eigendecomposition methods for segmentation work? In this paper we have presented a uni ed view of three of these methods | Perona and Freeman [8], Shi and Malik [11] and Scott and LonguetHiggins [10]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 41
                            }
                        ],
                        "text": "Figure 3 shows another example where the Perona and Freeman (PF) algorithm works successfully."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 18,
                                "start": 0
                            }
                        ],
                        "text": "Perona and Freeman conducted a comparison between the rst eigenvector of W and the second generalized eigenvector of W when W is constructed by representing each pixel with a (position,intensity) feature vector."
                    },
                    "intents": []
                }
            ],
            "corpusId": 12973477,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "23d31d6c75a3c62ee2cedd22308c5c0ba34217e7",
            "isKey": true,
            "numCitedBy": 327,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "The foreground group in a scene may be ‘discovered’ and computed as a factorized approximation to the pairwise affinity of the elements in the scene. A pointwise approximation of the pairwise affinity information may in fact be interpreted as a ‘saliency’ index, and the foreground of the scene may be obtained by thresholding it. An algorithm called ‘affinity factorization’ is thus obtained which may be used for grouping."
            },
            "slug": "A-Factorization-Approach-to-Grouping-Perona-Freeman",
            "title": {
                "fragments": [],
                "text": "A Factorization Approach to Grouping"
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "The foreground group in a scene may be ‘discovered’ and computed as a factorized approximation to the pairwise affinity of the elements in the scene, and an algorithm called ‘affinity factorization’ is obtained which may be used for grouping."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144202719"
                        ],
                        "name": "C. W. Gear",
                        "slug": "C.-W.-Gear",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Gear",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. W. Gear"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 61320760,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "980ff6b7ab4f898ed257a616b08311489f2cdc74",
            "isKey": false,
            "numCitedBy": 21,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "We address the problem of grouping points or features common to a single object. In this paper we consider the processing of a sequence of two-dimensional orthogonal projections of a three-dimensional scene containing an unknown number of independently-moving rigid objects. We describe a computationally inexpensive algorithm that can determine the number of bodies and which points belong to which body.<<ETX>>"
            },
            "slug": "Feature-grouping-in-moving-objects-Gear",
            "title": {
                "fragments": [],
                "text": "Feature grouping in moving objects"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "This paper considers the processing of a sequence of two-dimensional orthogonal projections of a three-dimensional scene containing an unknown number of independently-moving rigid objects and describes a computationally inexpensive algorithm that can determine the number of bodies and which points belong to which body."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 1994 IEEE Workshop on Motion of Non-rigid and Articulated Objects"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4231116"
                        ],
                        "name": "F. Chung",
                        "slug": "F.-Chung",
                        "structuredName": {
                            "firstName": "Fan",
                            "lastName": "Chung",
                            "middleNames": [
                                "R.",
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Chung"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 106,
                                "start": 103
                            }
                        ],
                        "text": "De ne the normalized a nity matrix: N = D WD 1=2 (6) We call this a normalized a nity matrix following [1]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 60624922,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "95d6ff6279fa0f92df6fae0e6bd4c259acfc8f09",
            "isKey": false,
            "numCitedBy": 4221,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Eigenvalues and the Laplacian of a graph Isoperimetric problems Diameters and eigenvalues Paths, flows, and routing Eigenvalues and quasi-randomness Expanders and explicit constructions Eigenvalues of symmetrical graphs Eigenvalues of subgraphs with boundary conditions Harnack inequalities Heat kernels Sobolev inequalities Advanced techniques for random walks on graphs Bibliography Index."
            },
            "slug": "Spectral-Graph-Theory-Chung",
            "title": {
                "fragments": [],
                "text": "Spectral Graph Theory"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35043531"
                        ],
                        "name": "A. Dempster",
                        "slug": "A.-Dempster",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Dempster",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Dempster"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7890796"
                        ],
                        "name": "N. Laird",
                        "slug": "N.-Laird",
                        "structuredName": {
                            "firstName": "Nan",
                            "lastName": "Laird",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Laird"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2235217"
                        ],
                        "name": "D. Rubin",
                        "slug": "D.-Rubin",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Rubin",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Rubin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 33
                            }
                        ],
                        "text": "The frequently used EM algorithm [3] often converges to a local maximum that depends on the initial conditions."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 4193919,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "d36efb9ad91e00faa334b549ce989bfae7e2907a",
            "isKey": false,
            "numCitedBy": 48403,
            "numCiting": 134,
            "paperAbstract": {
                "fragments": [],
                "text": "Vibratory power unit for vibrating conveyers and screens comprising an asynchronous polyphase motor, at least one pair of associated unbalanced masses disposed on the shaft of said motor, with the first mass of a pair of said unbalanced masses being rigidly fastened to said shaft and with said second mass of said pair being movably arranged relative to said first mass, means for controlling and regulating the conveying rate during conveyer operation by varying the rotational speed of said motor between predetermined minimum and maximum values, said second mass being movably outwardly by centrifugal force against the pressure of spring means, said spring means being prestressed in such a manner that said second mass is, at rotational motor speeds lower than said minimum speed, held in its initial position, and at motor speeds between said lower and upper values in positions which are radially offset with respect to the axis of said motor to an extent depending on the value of said rotational motor speed."
            },
            "slug": "Maximum-likelihood-from-incomplete-data-via-the-EM-Dempster-Laird",
            "title": {
                "fragments": [],
                "text": "Maximum likelihood from incomplete data via the EM - algorithm plus discussions on the paper"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Gear. feature grouping in moving images"
            },
            "venue": {
                "fragments": [],
                "text": "Proc IEEE workshop on motion of non-rigid and articulated objects"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Gear . multibody grouping from motion images"
            },
            "venue": {
                "fragments": [],
                "text": "IJCV"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 289,
                                "start": 283
                            }
                        ],
                        "text": "4 The Costeira and Kanade (1995) algorithm Independently of the recent work on using eigenvectors of a nity matrices to segment points in feature space, there has been interest in using singular values of the measurement matrix to segment the points into rigidly moving bodies in 3D [2, 4]."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "feature grouping in moving images"
            },
            "venue": {
                "fragments": [],
                "text": "Proc IEEE workshop on motion of non-rigid and articulated objects, pages 214{219"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "feature grouping in moving images Gear. multibody grouping from motion images"
            },
            "venue": {
                "fragments": [],
                "text": "Proc IEEE workshop on motion of non-rigid and articulated objects"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Gear. multibody grouping from motion images"
            },
            "venue": {
                "fragments": [],
                "text": "IJCV"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Featuregrouping by relocalisation of eigenvectors of theproxmity matrix"
            },
            "venue": {
                "fragments": [],
                "text": "Proc . British Machine Vision Conference"
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Gear . multibody grouping from motion images"
            },
            "venue": {
                "fragments": [],
                "text": "IJCV"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "quantitative measuresof change based on feature organization : eigenvalues and eigenvectors"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Maximum likelihood from incomplete data viathe EM algorithm"
            },
            "venue": {
                "fragments": [],
                "text": "J . R . Statist . Soc . B"
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 4,
            "methodology": 5
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 19,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Segmentation-using-eigenvectors:-a-unifying-view-Weiss/e9d7f589a3d368a3701832e28d90ca09ec9e5577?sort=total-citations"
}