{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11551491,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "f70c54029c17f50914996c834930ecbfacda195f",
            "isKey": false,
            "numCitedBy": 2615,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "To UNDERSTAND VISION in physiological terms represents a formidable problem for the biologist. I t am0 unts to learning how the nervous system handles incoming messages so that form, color, movement, and depth can be perceived and interpreted. One approach, perhaps the most direct, is to stimulate the retina with patterns of light while recording from single cells or fibers at various points along the visual pa thway. For each cell the optimum stimulus can be determined, and one can note the charac teristics common to cells at the next. each level in the visual pathway, and compare a given level with"
            },
            "slug": "RECEPTIVE-FIELDS-AND-FUNCTIONAL-ARCHITECTURE-IN-TWO-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "RECEPTIVE FIELDS AND FUNCTIONAL ARCHITECTURE IN TWO NONSTRIATE VISUAL AREAS (18 AND 19) OF THE CAT."
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "To UNDERSTAND VISION in physiological terms represents a formidable problem for the biologist, and one approach is to stimulate the retina with patterns of light while recording from single cells or fibers at various points along the visual pathway."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 149
                            }
                        ],
                        "text": "As in the cat, these cells are defined as having receptive fields with spatially distinct 'on' and 'off' areas separated by parallel straight lines (Hubel & Wiesel, 1959)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14801990,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6f20e254e3993538c79e0ff2b9b8f198d3359cb3",
            "isKey": false,
            "numCitedBy": 4212,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "In the central nervous system the visual pathway from retina to striate cortex provides an opportunity to observe and compare single unit responses at several distinct levels. Patterns of light stimuli most effective in influencing units at one level may no longer be the most effective at the next. From differences in responses at successive stages in the pathway one may hope to gain some understanding of the part each stage plays in visual perception. By shining small spots of light on the light-adapted cat retina Kuffler (1953) showed that ganglion cells have concentric receptive fields, with an 'on' centre and an 'off ' periphery, or vice versa. The 'on' and 'off' areas within a receptive field were found to be mutually antagonistic, and a spot restricted to the centre of the field was more effective than one covering the whole receptive field (Barlow, FitzHugh & Kuffler, 1957). In the freely moving lightadapted cat it was found that the great majority of cortical cells studied gave little or no response to light stimuli covering most of the animal's visual field, whereas small spots shone in a restricted retinal region often evoked brisk responses (Hubel, 1959). A moving spot of light often produced stronger responses than a stationary one, and sometimes a moving spot gave more activation for one direction than for the opposite. The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex. Receptive fields of the cells considered in this paper were divided into separate excitatory and inhibitory ('on' and 'off') areas. In this respect they resembled retinal ganglion-cell receptive fields. However, the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinal ganglion cells. An attempt was made to correlate responses to moving stimuli"
            },
            "slug": "Receptive-fields-of-single-neurones-in-the-cat's-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields of single neurones in the cat's striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex, which resembled retinal ganglion-cell receptive fields, but the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinalganglion cells."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 34
                            }
                        ],
                        "text": "The evidence for such connexions (Hubel & Wiesel, 1962, 1965 a) is derived from the properties of the fields themselves, and also from the functional architecture of the cortex."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 83
                            }
                        ],
                        "text": "The properties of these cells were similar to those we have described for the cat (Hubel & Wiesel, 1962)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 255,
                                "start": 235
                            }
                        ],
                        "text": "…is less distinct, and the tendency for each layer to contain a mixture of cell types seems to be greater-in any case the physiological evidence for segregation of different cell types in different layers, while suggestive in the cat (Hubel & Wiesel, 1962), was not nearly as clear as in the monkey."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 127,
                                "start": 100
                            }
                        ],
                        "text": "Aggregation of cells according to ocular dominance was first established in the cat striate cortex (Hubel & Wiesel, 1962; 1965b), but in the cat the organization was less clear cut, since, besides regions in which all cells had similar eye preference, there were regions of mixed allegiance, in…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 144,
                                "start": 124
                            }
                        ],
                        "text": "Even in this small sampling, we found representatives of all of the 'simple' receptive field subtypes described in the cat (Hubel & Wiesel, 1962, Fig."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 35,
                                "start": 15
                            }
                        ],
                        "text": "As in the cat (Hubel & Wiesel, 1962), the fields of successively recorded cells in a perpendicular track are not precisely superimposed: instead there is an irregular variation in field position from\n229\nD. H. HUBEL AND T. N. WIESEL cell to cell, small enough so that the fields overlap, and large…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 32
                            }
                        ],
                        "text": "As we have discussed elsewhere (Hubel & Wiesel, 1962), acuity is probably not closely related to over-all receptive field dimensions, but rather to the widths of optimally shaped stimuli."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 80
                            }
                        ],
                        "text": "These mixed regions tended to obscure the parcellation into columns in the cat (Hubel & Wiesel, 1962, p. 140), and indeed it was not until the columns had been accentuated by raising cats with strabismus that we became fully convinced of their existence (Hubel & Wiesel, 1965b)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 119
                            }
                        ],
                        "text": "The tendency for neighbouring cells to favour the same eye was thus very pronounced, more so than is usual in the cat (Hubel & Wiesel, 1962)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 99,
                                "start": 79
                            }
                        ],
                        "text": "Details of stimulating and recording procedures have been published elsewhere (Hubel & Wiesel, 1962; Wiesel & Hubel, 1966)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12428,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 121,
                                "start": 101
                            }
                        ],
                        "text": "Details of stimulating and recording procedures have been published elsewhere (Hubel & Wiesel, 1962; Wiesel & Hubel, 1966)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 285,
                                "start": 265
                            }
                        ],
                        "text": "In the rhesus lateral geniculate body the majority of the dorsal-layer cells have opponent-colour properties, light exciting them at some wave-lengths, inhlibiting them at others, diffuse white liglht evoking little or no response (De Valois, Jacobs & Jones, 1963; Wiesel & Hubel, 1966)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 159,
                                "start": 139
                            }
                        ],
                        "text": "The study may be regarded as a continuation of previous work on the monkey optic nerve (Hubel & Wiesel, 1960) and lateral geniculate body (Wiesel & Hubel, 1966)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 253,
                                "start": 233
                            }
                        ],
                        "text": "Of the twenty-five simple cells recorded in rhesus, six had more specific colour-coded behaviour, the excitatory and inhibitory parts of the receptive field differing in spectral sensitivity in the manner of geniculate Type I cells (Wiesel & Hubel, 1966)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1035815,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b952bab086707e7bee44f05762393e6b8a951415",
            "isKey": false,
            "numCitedBy": 1241,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "THE RECEPTORS AND NERVE CELLS that make up the visual pathway must convey and interpret information on both the form and the color of retinal images. In higher mammals little is known about the degree to which nerve cells are specialized for handling these types of information. In a visual stimulus the importance of spatial attributes, and especially of dark-light contours, first became obvious with the discovery by Hartline (20 ) of lateral inhibition in the Limulus, a type of study that was extended to mammals when Kuffler (28) demonstrated t,hat the receptive fields of retinal ganglion cells in the cat are subdivided into a center and an opponent surround. The opponent principle, in which spatially separated excitatory and inhibitory regions are pitted against each other, has now been observed for retinal ganglion cells in the frog (1), the lizard (9), the rabbit (3), the rat (4), the ground squirrel (33), and the monkey (24). Similar effects have been seen in the lateral genie ulate bod .y and visual cortex in the cat (23, 25, 26), and also recently at these levels in the monkey. In 1958 De Valois and his collaborators (15) observed geniculate cells in the macaque monkey that were excited by one set of wavelengths and inhibited by another, making it apparent that in higher mammals the spectral composition of the stimulus was also an important variable. Similar opponent-color effects have since been described in the primate at the level of the retin .a1 ganglion cell (24), and in the visual cortex (34). I n the cat the absence or rarity of oppon .ent-color mecha nisms (19, 36 > may be related to an inferior ability to discriminate color (31, 32, 40); indeed since Svaetichin’s (41) original observation of opponent-color responses in the fish retina (Spotentials), similar response patterns have been seen only in animals thought to have good color vision. Given the existence of two opponent mechanisms system, one for the spatial variable and the other for in the monkey visual color, it is natural to ask whether these occupy the same channels, or are confined to separate groups of cells. In the goldfish it is clear from the work of Wagner, MacNichol, and Wolbarsht (43, 45) that opponent-color and opponent-spatial"
            },
            "slug": "Spatial-and-chromatic-interactions-in-the-lateral-Wiesel-Hubel",
            "title": {
                "fragments": [],
                "text": "Spatial and chromatic interactions in the lateral geniculate body of the rhesus monkey."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The opponent principle, in which spatially separated excitatory and inhibitory regions are pitted against each other, has now been observed for retinal ganglion cells in the frog, the lizard, the rabbit, the rat, the ground squirrel, and the monkey."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 108,
                                "start": 88
                            }
                        ],
                        "text": "The study may be regarded as a continuation of previous work on the monkey optic nerve (Hubel & Wiesel, 1960) and lateral geniculate body (Wiesel & Hubel, 1966)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 33565783,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b0b13465c36789ebd0751178c5403efd4dd390b9",
            "isKey": false,
            "numCitedBy": 357,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Receptive fields of retinal ganglion cells were studied in the light-adapted spider monkey. All fields mapped with white light had a concentric arrangement sililar to that of the cat retinal ganglion cells, with a sharply demarcated 'on' centre surrounded by an antagonistic 'off' periphery, or the reverse. The smallest receptive field centres were found near the fovea, and the size of centres tended to increase with increasing distance from the fovea. The smallest centre had a diameter of 4 minutes of arc (corresponding to about 20 microns on the retina) and was located 4 degrees from the fovea; the largest centre had a diameter of 2 degrees. Three ganglion cells out of about 100 responded in a specific way to coloured stimuli. In these cells light of short wave-length produced an 'on' response and light of long wave-length evoked inhibition followed by an 'off' response. Transition between the two types of response occurred at about 500 millimicrons, light of this wave-length evoked only feebel 'off' responses. Very weak responses were obtained to white light, presumably owing to the antagonism between light of short and long wavelengths. (Author)"
            },
            "slug": "Receptive-fields-of-optic-nerve-fibres-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields of optic nerve fibres in the spider monkey"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "Receptive fields of retinal ganglion cells were studied in the light-adapted spider monkey with very weak responses to white light, presumably owing to the antagonism between light of short and long wavelengths."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 227,
                                "start": 207
                            }
                        ],
                        "text": "In the cat the most direct evidence that aggregations were columnar in shape came from multiple closely spaced parallel penetrations in which a lesion was made at each change of receptive field orientation (Hubel & Wiesel, 1963)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 95
                            }
                        ],
                        "text": "The possible purpose served by such an ordered system of columns has been discussed elsewhere (Hubel & Wiesel, 1963)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 107,
                                "start": 87
                            }
                        ],
                        "text": "In the cat this sort of geometry was also suggested in one surface-mapping experiment (Hubel & Wiesel, 1963, Text-fig."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 137,
                                "start": 117
                            }
                        ],
                        "text": "In a few experiments designed to explore a wider area of cortex a modified Davies chamber was cemented to the skull (Hubel & Wiesel, 1963)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 6171259,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d7fb932bca642615fcbcf3f5d26b2c26666603d3",
            "isKey": false,
            "numCitedBy": 805,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Cells in the cat's striate cortex show marked specificity in their responses to restricted retinal stimulation (Hubel & Wiesel, 1959, 1962). The most effective stimulus shapes are long narrow rectangles of light ('slits'), dark bars against a light background ('dark bars'), and straight-line borders separating areas of different brightness ('edges'). A given cell responds vigorously when an appropriate stimulus is shone on the receptive field or moved across it, provided the stimulus is presented in a specific orientation. This orientation is termed the 'receptive-field axis orientation'. It is critical, and constant for any particular cell, but may differ for different cells. The visual cortex is subdivided into discrete regions or columns extending from surface to white matter, in which all cells have the same receptivefield axis orientation (Hubel & Wiesel, 1962). The present experiments were undertaken with the object of learning more about the anatomical configuration of the columns. We wished to have a clearer idea of their shape, especially if the walls of a column were, as previous work suggested, parallel to the radial fibre bundles of the cortex and perpendicular to the cortical layers, and whether the columns were uniform or irregular in their cross-sectional shape and size. Furthermore, we were curious to know if there was any relationship between the receptive-field axis orientations of neighbouring columns, or whether, on the contrary, the different columns were intermixed in a random way throughout the cortex. These questions were approached: (1) by making several deep, closely spaced, parallel micro-electrode penetrations, placing electrolytic lesions at every shift in receptive-field orientation, and(2) by making many short penetrations in a small cortical area, noting the axis orientation of cells lying in the upper one or two layers of cortex."
            },
            "slug": "Shape-and-arrangement-of-columns-in-cat's-striate-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Shape and arrangement of columns in cat's striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Questions were approached by making several deep, closely spaced, parallel micro-electrode penetrations, placing electrolytic lesions at every shift in receptive-field orientation, and by making many short penetrations in a small cortical area, noting the axis orientation of cells lying in the upper one or two layers of cortex."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3008579"
                        ],
                        "name": "K. Motokawa",
                        "slug": "K.-Motokawa",
                        "structuredName": {
                            "firstName": "Koiti",
                            "lastName": "Motokawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Motokawa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3257197"
                        ],
                        "name": "N. Taira",
                        "slug": "N.-Taira",
                        "structuredName": {
                            "firstName": "Norio",
                            "lastName": "Taira",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Taira"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "84016258"
                        ],
                        "name": "J. Okuda",
                        "slug": "J.-Okuda",
                        "structuredName": {
                            "firstName": "J",
                            "lastName": "Okuda",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Okuda"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 581961,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "32eb84773c5531c816f1eb958a9d85a1ad1de37c",
            "isKey": false,
            "numCitedBy": 45,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "Spectral response behavior of single units was investigated in the visual cortex of the unanesthetized macaque monkeys with test stimuli of 0.5° in visual angle. 1. Cortical and optic radiation units were distinguished by the configuration of spikes and spontaneous discharge rate. 2. “On” units responding to a narrow-band of the spectrum were designated as “chromatic” or C type units. Their response maxima were found in three selected regions of the spectrum, orange-red (600-640 mμ), green (520-540 mμ) and blue (460 mμ) respectively. Most units showed one or two submaxima besides the dominant peak in their spectral response curves. 3. Some units responded to a certain limited region of the spectrum with “on” or “off”, but to another with “off” or “on”, thus changing discharge type depending on the wavelengths. These units were designated as “opponent” or O type units. 4. Some units responded to the whole parts of the spectrum, but showed no clear-cut response maxima anywhere in the visible parts of the spectrum. 5. Some “on-off” units and pure “off” units showed two response maxima towards both ends of the spectrum. 6. Two kinds of units, A and B, relating to rod receptors were distinguished. The common feature of these units was that the sensitivity maximum was found at about 500 mμ The unit A had a large receptive field and gave “on-off” discharges. Its photosensitivity is low compared with that of B. The unit B was always linked with photopic units and worked in a range of low intensities in which the linked photopic unit was almost inactive. Its receptive field was very small as compared with that of A."
            },
            "slug": "Spectral-responses-of-single-units-in-the-primate-Motokawa-Taira",
            "title": {
                "fragments": [],
                "text": "Spectral responses of single units in the primate visual cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 86,
                "text": "Spectral response behavior of single units was investigated in the visual cortex of the unanesthetized macaque monkeys with test stimuli of 0.5° in visual angle, and two kinds of units relating to rod receptors were distinguished."
            },
            "venue": {
                "fragments": [],
                "text": "The Tohoku journal of experimental medicine"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "88900034"
                        ],
                        "name": "P. Daniel",
                        "slug": "P.-Daniel",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Daniel",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Daniel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2837738"
                        ],
                        "name": "D. Whitteridge",
                        "slug": "D.-Whitteridge",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Whitteridge",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Whitteridge"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 292,
                                "start": 265
                            }
                        ],
                        "text": "…mapping, but in a limited exploration of the dorsal convexity and ten or so additional penetrations through the buried calcarine fissure, our results agree well with Talbot & Marshall's early survey of the convexity (1941), and the subsequent extensive mapping by Daniel & Whitteridge (1961)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 29375114,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "831efb7246ac22a24c41570c7741ed1204fe2919",
            "isKey": false,
            "numCitedBy": 1107,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "On the basis of his extensive and elegant anatomical investigations on the visual cortex, Poliak (1932) suggested that a mathematical projection of the retina on the cerebral cortex must exist. Talbot & Marshall (1941) used physiological methods to map the central part of the visual field on to the posterolateral surface ofthe cortex in the monkey. They devised an index of cortical representation expressed as the increment of the angle, measured radially from the centre of gaze, which is represented on each millimetre of cortex. We have confirmed their observations and have extended the mapping to the buried visual cortex in the horizontal and vertical calcarine fissures. We have preferred to use the reciprocal of their index and to call it the cortical magnification, M. When this is measured along radii and at right angles to them, it provides the empirical quantitative relation which Polyak wanted. It also defines the shape and size of the visual receptive field. We have made such a surface, folded it and compared it with the calcarine cortex of the monkey. A preliminary account of this work has been published (Daniel & Whitteridge, 1959)."
            },
            "slug": "The-representation-of-the-visual-field-on-the-in-Daniel-Whitteridge",
            "title": {
                "fragments": [],
                "text": "The representation of the visual field on the cerebral cortex in monkeys"
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "On the basis of his extensive and elegant anatomical investigations on the visual cortex, Poliak (1932) suggested that a mathematical projection of the retina on the cerebral cortex must exist and this work has made such a surface, folded it and compared it with the calcarine cortex of the monkey."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 154,
                                "start": 143
                            }
                        ],
                        "text": "There is some intermixing between these groups, in that two simultaneously recorded cells are often driven by opposite directions of movement (Hubel, 1958)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 24026246,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "62986ed55e8420663b0157e372df1606e4896bca",
            "isKey": false,
            "numCitedBy": 56,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Cortical-unit-responses-to-visual-stimuli-in-cats.-Hubel",
            "title": {
                "fragments": [],
                "text": "Cortical unit responses to visual stimuli in nonanesthetized cats."
            },
            "venue": {
                "fragments": [],
                "text": "American journal of ophthalmology"
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2627540,
            "fieldsOfStudy": [
                "Biology",
                "Medicine"
            ],
            "id": "77734bcbfe2e939b340d870bf676775a879f747a",
            "isKey": false,
            "numCitedBy": 1290,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "BEFORE A KITTEN OPENS ITS EYES, and long before the eyes are used in visual exploration, single cells of the primary visual cortex respond to natural stimulation with the same specificity as is found in the adult (5). This suggests that the anatomical connections between retina and striate cortex are for the most part innate. During the first 3 months of life the connections are highly susceptible to the effects of visual deprivation, to the extent that exclusion of all form and some light from one eye leads to a severe decline in the ability of that eye to influence cortical cells. Anatomical and physiological evidence suggests that the defect is chiefly, though not entirely, a cortical one (7-9). The object of the present study was to influence cortical connections by some means less drastic than covering one or both eyes. We wished if possible to alter the input in such a way that there would be no question of effects on the visual pathway below the level of the striate cortex. A method was suggested by the well-known clinical observation that a child with a squint (strabismus or nonparallel visual axes) may suffer a deterioration of vision in one eye (amblyopia ex anopsia). Since the visual pathways from the two eyes are for practical purposes separate up to the level of the striate cortex, it is unlikely that in these children the defect is in the retina or geniculate. An artificial squint therefore seemed to provide a possible means of obtaining a cortical defect while sparing the retina and lateral geniculate body. Accordingly , we produced a divergent strabismus by cutting one of the extraocular muscles in each of four newborn kittens, with the plan of testing vision and recording from single cortical cells after several months to a year. When at length each eye was tested in these kittens by observing the ani-mal's behavior with the other eye covered the results were disappointing: there was not the slightest suggestion of any defect in vision in either eye. This was not entirely unexpected, since with both eyes uncovered the animals had appeared to fix at times with one eye and at times with the other. At this stage there seemed to be little point in proceeding further, for there- ."
            },
            "slug": "Binocular-interaction-in-striate-cortex-of-kittens-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Binocular interaction in striate cortex of kittens reared with artificial squint."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The object of the present study was to influence cortical connections by some means less drastic than covering one or both eyes, and produced a divergent strabismus by cutting one of the extraocular muscles in each of four newborn kittens."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3809364"
                        ],
                        "name": "V. Mountcastle",
                        "slug": "V.-Mountcastle",
                        "structuredName": {
                            "firstName": "Vernon",
                            "lastName": "Mountcastle",
                            "middleNames": [
                                "B."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Mountcastle"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 196,
                                "start": 178
                            }
                        ],
                        "text": "This presumably simply reflects the tendency for afferents to the cortex to be grouped (Hubel & Wiesel, 1965b), as is so for the columns of the somatosensory cortex described by Mountcastle (1957)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 35
                            }
                        ],
                        "text": "The term 'column' as first used by Mountcastle (1957) and as it is used here, refers to a discrete aggregation of cells, each aggregation being separated from its neighbours by vertical walls that intersect the surface (or a given layer) in a mosaic."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 110,
                                "start": 93
                            }
                        ],
                        "text": "The columnar system seems to represent a method by which many areas of cortex-somatosensory (Mountcastle, 1957) visual, including 17, 18 and 19, and perhaps motor (Asanuma & Sakata, 1967)-deal with multidimensional problems using a two-dimensional surface."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 6822072,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6ded76b03bd0612974d86a826ce70d2a2b143fb2",
            "isKey": false,
            "numCitedBy": 2208,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "THE PRESENT PAPER describes some observations upon the modality and topographical attributes of single neurons of the first somatic sensory area of the cat’s cerebral cortex, the analogue of the cortex of the postcentral gyrus in the primate brain. These data, together with others upon the response latencies of the cells of different layers of the cortex to peripheral stimuli, support an hypothesis of the functional organization of this cortical area. This is that the neurons which lie in narrow vertical columns, or cylinders, extending from layer II through layer VI make up an elementary unit of organization, for they are activated by stimulation of the same single class of peripheral receptors, from almost identical peripheral receptive fields, at latencies ers. It is early These which are not significantly different for the cells of the various layemphasized that this pattern of organization obtains only for the repetitiv neurons ‘e responses may be rela of ted cortical in quite neurons different to brief peripheral stimuli. organization patterns when analyzed in terms of later discharges. A report of these experiments was made to the American Physiological Society in September, 1955 (10, 17)."
            },
            "slug": "Modality-and-topographic-properties-of-single-of-Mountcastle",
            "title": {
                "fragments": [],
                "text": "Modality and topographic properties of single neurons of cat's somatic sensory cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "Observations upon the modality and topographical attributes of single neurons of the first somatic sensory area of the cat’s cerebral cortex, the analogue of the cortex of the postcentral gyrus in the primate brain, support an hypothesis of the functional organization of this cortical area."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 186,
                                "start": 175
                            }
                        ],
                        "text": "The spikes of these units were small and negative, being quite different from the typical spikes of myelinated fibres seen in optic tract and radiations, and corpus callosum (Hubel, 1959; Hubel & Wiesel, 1967)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 181,
                                "start": 170
                            }
                        ],
                        "text": "216\nMONKEY STRIATE CORTEX To help reconstruct the electrode tracks, one or several lesions were made in each penetration by passing direct current through the electrode (Hubel, 1959)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 15771537,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5a0c4a618425328ba0bbb9737b02e2ac18f94646",
            "isKey": false,
            "numCitedBy": 413,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "A beginning has recently been made in recording single neurone activity from animals with chronically implanted electrodes (Hubel, 1957a; Gusel'nikov, 1957; Ricci, Doane & Jasper, 1957; Strumwasser, 1958). These methods eliminate anaesthetics, paralysing drugs, brain-stem lesions, and other acute experimental procedures. They make it possible to record electrical events in the higher central nervous system with the animal in a normal state, and to correlate these electrical events with such variables as waking state, attention, learning, and motor activity. The present paper describes a method for unit recording from the cortex of unanaesthetized, unrestrained cats, and presents some observations from the striate cortex. The objectives have been (1) to observe maintained unit activity under various conditions such as sleep and wakefulness, and (2) to find for each unit the natural stimuli which most effectively influence firing. Of 400 units observed, some 200 are presented here because of their common characteristics. Since there is reason to believe that the remainiing 200 units were afferent fibres from the lateral geniculate nucleus, these will be described in a separate paper. A preliminary account of some of this work has been given elsewhere (Hubel, 1958)."
            },
            "slug": "Single-unit-activity-in-striate-cortex-of-cats-Hubel",
            "title": {
                "fragments": [],
                "text": "Single unit activity in striate cortex of unrestrained cats"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "A method for unit recording from the cortex of unanaesthetized, unrestrained cats is described, some observations from the striate cortex are presented, and the objectives have been to observe maintained unit activity under various conditions such as sleep and wakefulness."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 128,
                                "start": 108
                            }
                        ],
                        "text": "We know, for example, that in the cat the posterior corpus callosum contains axons of all three cell types (Hubel & Wiesel, 1967)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 208,
                                "start": 188
                            }
                        ],
                        "text": "The spikes of these units were small and negative, being quite different from the typical spikes of myelinated fibres seen in optic tract and radiations, and corpus callosum (Hubel, 1959; Hubel & Wiesel, 1967)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9465823,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "38c04a46b532d25ef8463c45613252d1c24d4bfd",
            "isKey": false,
            "numCitedBy": 399,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "IN HIGHER MAMMALS the left half of the visual field is represented in the right visual cortex, and the right half in the left cortex. The fact that our visual fields appear uniform, with no obvious interruption along the vertical midline, would seem to call for connections linking the two hemispheres. The present paper deals with the physiological properties of some of these connections. In the cat the vertical midline of the visual field has its primary representation in and close to the poorly defined boundary between areas 17 and 18 (7, 10). Each half-visual field is represented in both 17 and 18 in mirror fashion, so that as one proceeds away from the 17-18 boundary in either direction, medially along 17 or laterally along 18, the corresponding region of visual fields moves outward from the vertical meridian into the contralateral visual field. Recent anatomical evidence indicates that the part of area 17 adjacent to the 17-18 boundary sends callosal projections to the other hemisphere, ending in 18 near the 17-18 boundary (2,7,8) and possibly also in the adjacent part of 17 (8). Thus the parts of 17 and 18 having to do with the vertical midline of the visual fields are apparently connected on the two sides by the corpus callosum. In contrast, the more medial parts of 17, representing the peripheral parts of the visual fields, seem not to be reciprocally interconnected, and indeed one would hardly expect that cells concerned with a particular part of the left visual field should be connected specifically to cells concerned with the corresponding region in the right field. These anatomical findings have lately been confirmed in the elegant physiological experiments of Choudhury, Whitteridge, and Wilson (1). They showed that with one opti c trac t cut responses to light could be evoked in the ipsilateral hemisphere only near the 17-18 border, and only when the stimulus was applied near the vertical meridian. The responses were abolished either by cooling the corresponding region in the contralateral hemisphere or by cooling or cutting the posterior corpus callosum. Several lines of evidence thus indicate that fibers in the corpus callosum originating in the most lateral part of 17 and projecting to 18 on the other side have special functions involving the vertical midline of the visual field."
            },
            "slug": "Cortical-and-callosal-connections-concerned-with-of-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Cortical and callosal connections concerned with the vertical meridian of visual fields in the cat."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Several lines of evidence indicate that fibers in the corpus callosum originating in the most lateral part of 17 and projecting to 18 on the other side have special functions involving the vertical midline of the visual field."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2320366"
                        ],
                        "name": "J. Dowling",
                        "slug": "J.-Dowling",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Dowling",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Dowling"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4892099"
                        ],
                        "name": "B. Boycott",
                        "slug": "B.-Boycott",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Boycott",
                            "middleNames": [
                                "Blundell"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Boycott"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 102
                            }
                        ],
                        "text": "At a synaptic level the correlation of structure with physiology, as is now being done in the retina (Dowling & Boycott, 1966), is still lacking in the cortex."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 37950158,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7d648b05370e900921de74057c369f05963e808f",
            "isKey": false,
            "numCitedBy": 955,
            "numCiting": 59,
            "paperAbstract": {
                "fragments": [],
                "text": "The retinae of monkey and man have been studied by electron microscopy to identify cell types, their processes and synaptic contacts. In the inner plexiform layer, the morphological characteristics of the three types of cells (bipolar, ganglion and amacrine) are described and seven synaptic relationships are identified. The bipolar terminals contain ribbons at points of synaptic contact, and, at these points, there are typically two postsynaptic processes, one a ganglion cell dendrite, the other an amacrine cell process. This synaptic arrangement is here termed a dyad. The amacrine cell processes themselves make synaptic contacts with ganglion cell dendrites and somata, other amacrine cell processes, and, most frequently, with the bipolar cell terminals. Often, the amacrine-bipolar contact is adjacent to a bipolar-amacrine junction, forming a reciprocal synaptic arrangement between the bipolar and the amacrine. In the more peripheral retina, large bipolar cell terminals (probably of rod bipolars) are occasionally observed adjacent to the perikarya of the ganglion cells. At these junctions, areas of fusion between the plasma membranes are seen, suggesting that such axosomatic junctions could be electrical. In the outer plexiform layer, synapses have been identified only in the receptor cell bases where receptor cells contact bipolar and horizontal cell processes. Synaptic contacts of the horizontal cells have not been clearly identified, but their strategic terminations in the receptor cell ending are described and interpreted as possibly synaptic. A model of the retina, based on the described anatomy, is presented and correlated with ganglion cell physiology."
            },
            "slug": "Organization-of-the-primate-retina:-electron-Dowling-Boycott",
            "title": {
                "fragments": [],
                "text": "Organization of the primate retina: electron microscopy"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "The retinae of monkey and man have been studied by electron microscopy to identify cell types, their processes and synaptic contacts, and a model of the retina, based on the described anatomy, is presented and correlated with ganglion cell physiology."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52555257"
                        ],
                        "name": "J. Kulikowski",
                        "slug": "J.-Kulikowski",
                        "structuredName": {
                            "firstName": "Janus",
                            "lastName": "Kulikowski",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kulikowski"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 58,
                                "start": 30
                            }
                        ],
                        "text": "In view of the recent work of Campbell & Kulikowski (1966) showing a difference in ability ofhumans to discriminate between horizontal or vertical lines and oblique lines, we have looked for any differences in the occurrence of horizontally and vertically oriented fields as opposed to oblique…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 24219387,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "5a7e6b47e6e83592412bce8416f69ed15c03a44c",
            "isKey": false,
            "numCitedBy": 675,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "1. It is known that an object is less detectable when it is viewed against a background containing structures similar to the object. The effect of changing the orientation between the object and background is investigated."
            },
            "slug": "Orientational-selectivity-of-the-human-visual-Campbell-Kulikowski",
            "title": {
                "fragments": [],
                "text": "Orientational selectivity of the human visual system"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "The effect of changing the orientation between the object and background is investigated and it is known that an object is less detectable when it is viewed against a background containing structures similar to the object."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 83
                            }
                        ],
                        "text": "Microelectrodes were sharpened tungsten wire insulated with a clear vinyl lacquer (Hubel, 1957)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 26895691,
            "fieldsOfStudy": [
                "Materials Science",
                "Medicine"
            ],
            "id": "663eb5b9acf0e9cc404728d98669012fbfcaa9c2",
            "isKey": false,
            "numCitedBy": 764,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Tungsten-Microelectrode-for-Recording-from-Single-Hubel",
            "title": {
                "fragments": [],
                "text": "Tungsten Microelectrode for Recording from Single Units."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1957
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 1646,
                                "start": 266
                            }
                        ],
                        "text": "In the cat the layering is less distinct, and the tendency for each layer to contain a mixture of cell types seems to be greater-in any case the physiological evidence for segregation of different cell types in different layers, while suggestive in the cat (Hubel & Wiesel, 1962), was not nearly as clear as in the monkey. The present demonstration of a clear difference in function between cells in different cortical layers is, of course, only a first step toward the goal of correlating histologically defined cell types with function. The form taken by the two systems of columns deserves some comment. The existence of regions in which orientation columns are highly ordered continues to be baffling, for if there are two kinds of striate cortex, one ordered and the other not, the anatomy gives no hint of this. There is a suggestion that the narrow orderly columns may sometimes correspond to the radial fascicles seen microscopically, but these are seen everywhere in 17, and the ordered regions seem not to be present everywhere. Where columns are ordered, it seems likely that they are very long narrow slabs, perhaps not straight, but swirling, if one can judge from the reversals in shifts seen in Text-fig. 9. It is possible that these ordered regions may be more common than we realize, for their detection depends on rather ideal recording conditions in which the electrode moves forward steadily rather than in jumps, and records activity at all times. The possible purpose served by such an ordered system of columns has been discussed elsewhere (Hubel & Wiesel, 1963). In view of the recent work of Campbell & Kulikowski (1966) showing a difference in ability ofhumans to discriminate between horizontal or vertical lines and oblique lines, we have looked for any differences in the occurrence of horizontally and vertically oriented fields as opposed to oblique fields, but have seen none, in cat or in monkey."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 438,
                                "start": 265
                            }
                        ],
                        "text": "In the rhesus lateral geniculate body the majority of the dorsal-layer cells have opponent-colour properties, light exciting them at some wave-lengths, inhlibiting them at others, diffuse white liglht evoking little or no response (De Valois, Jacobs & Jones, 1963; Wiesel & Hubel, 1966). For cortical cells, we expected that -ith this input there might be a similar emphasis on wave-length discrimination. MotokawNa, Taira & Okuda (1962) have in fact described opponent colour cells in monkey cortex."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 2073,
                                "start": 0
                            }
                        ],
                        "text": "Where the steps are discrete one can try to discover the shape and extent of the regions. In the visual cortex a number of variables remain unchanged, or at least show no systematic trend, in penetrations extending vertically from surface to white matter. The most fundamental are the two position co-ordinates by which the retinal surface is mapped on to the cortex. This mapping is continuous. Besides this, in the monkey striate cortex, as in that of the cat, each small area dealing with a particular part of the retina is subdivided by sets ofvertical partitions into several independent systems ofdiscrete cell aggregations. One of these systems is defined by receptive-field orientation, another by ocular dominance. It seems very likely that these aggregations are columnar, with walls parallel to the vertically running fibre bundles and perpendicular to the layering pattern. The evidence for this is chiefly that sequences of cells with common physiological characteristics tend to be long in penetrations that are perpendicular or almost perpendicular to the cortical surface, and short in oblique penetrations. In the cat the most direct evidence that aggregations were columnar in shape came from multiple closely spaced parallel penetrations in which a lesion was made at each change of receptive field orientation (Hubel & Wiesel, 1963). This type of experiment was not done in the monkey, but we have no reason to think that the results would be different. Retinotopic representation. Neighbouring cells in area 17 invariably have receptive fields in roughly the same part of the retina, and movement along the cortex corresponds to movement along the retina according to the well known retinotopic representation. We have not tried to make a detailed topographic mapping, but in a limited exploration of the dorsal convexity and ten or so additional penetrations through the buried calcarine fissure, our results agree well with Talbot & Marshall's early survey of the convexity (1941), and the subsequent extensive mapping by Daniel & Whitteridge (1961). This detailed topographic representation does not hold at a microscopic level."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 1031,
                                "start": 0
                            }
                        ],
                        "text": "WIESEL cell to cell, small enough so that the fields overlap, and large enough so that, in a perpendicular penetration with fifteen or twenty fields superimposed, the area covered is about 2-4 times that of the average receptive field. In a long oblique penetration one finds some drift in field position corresponding to the gross topography, but when the component of movement along the surface is only a millimetre or so, for the part of the cortex subserving regions of retina within about 50 of the fovea, the drift is considerably less than the random staggering, and is obscured by it. In the peripheral retina the topographic representation becomes coarser, but to compensate for this the receptive fields become larger, and the situation is therefore similar. This topographic representation does not by itself constitute a columnar system even though the retinal position co-ordinates remain virtually constant in a penetration perpendicular to the cortical surface. The term 'column' as first used by Mountcastle (1957) and as it is used here, refers to a discrete aggregation of cells, each aggregation being separated from its neighbours by vertical walls that intersect the surface (or a given layer) in a mosaic."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 197,
                                "start": 96
                            }
                        ],
                        "text": "This presumably simply reflects the tendency for afferents to the cortex to be grouped (Hubel & Wiesel, 1965b), as is so for the columns of the somatosensory cortex described by Mountcastle (1957). As the visual input is transmitted over several stages to the more complex cells in the upper and lower layers, there must be progressively more intermixing between the eyes, presumably by interconnexions that run obliquely."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 2004,
                                "start": 0
                            }
                        ],
                        "text": "Where the steps are discrete one can try to discover the shape and extent of the regions. In the visual cortex a number of variables remain unchanged, or at least show no systematic trend, in penetrations extending vertically from surface to white matter. The most fundamental are the two position co-ordinates by which the retinal surface is mapped on to the cortex. This mapping is continuous. Besides this, in the monkey striate cortex, as in that of the cat, each small area dealing with a particular part of the retina is subdivided by sets ofvertical partitions into several independent systems ofdiscrete cell aggregations. One of these systems is defined by receptive-field orientation, another by ocular dominance. It seems very likely that these aggregations are columnar, with walls parallel to the vertically running fibre bundles and perpendicular to the layering pattern. The evidence for this is chiefly that sequences of cells with common physiological characteristics tend to be long in penetrations that are perpendicular or almost perpendicular to the cortical surface, and short in oblique penetrations. In the cat the most direct evidence that aggregations were columnar in shape came from multiple closely spaced parallel penetrations in which a lesion was made at each change of receptive field orientation (Hubel & Wiesel, 1963). This type of experiment was not done in the monkey, but we have no reason to think that the results would be different. Retinotopic representation. Neighbouring cells in area 17 invariably have receptive fields in roughly the same part of the retina, and movement along the cortex corresponds to movement along the retina according to the well known retinotopic representation. We have not tried to make a detailed topographic mapping, but in a limited exploration of the dorsal convexity and ten or so additional penetrations through the buried calcarine fissure, our results agree well with Talbot & Marshall's early survey of the convexity (1941), and the subsequent extensive mapping by Daniel & Whitteridge (1961)."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Color coded units in the goldfish retina"
            },
            "venue": {
                "fragments": [],
                "text": "Ph.D. Thesis,"
            },
            "year": 1967
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 227,
                                "start": 215
                            }
                        ],
                        "text": "In the cat the most direct evidence that aggregations were columnar in shape came from multiple closely spaced parallel penetrations in which a lesion was made at each change of receptive field orientation (Hubel & Wiesel, 1963)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 103
                            }
                        ],
                        "text": "The possible purpose served by such an ordered system of columns has been discussed elsewhere (Hubel & Wiesel, 1963)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 107,
                                "start": 95
                            }
                        ],
                        "text": "In the cat this sort of geometry was also suggested in one surface-mapping experiment (Hubel & Wiesel, 1963, Text-fig."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 137,
                                "start": 125
                            }
                        ],
                        "text": "In a few experiments designed to explore a wider area of cortex a modified Davies chamber was cemented to the skull (Hubel & Wiesel, 1963)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Shape and arrangement of columns"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 42
                            }
                        ],
                        "text": "The evidence for such connexions (Hubel & Wiesel, 1962, 1965 a) is derived from the properties of the fields themselves, and also from the functional architecture of the cortex."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 127,
                                "start": 108
                            }
                        ],
                        "text": "Aggregation of cells according to ocular dominance was first established in the cat striate cortex (Hubel & Wiesel, 1962; 1965b), but in the cat the organization was less clear cut, since, besides regions in which all cells had similar eye preference, there were regions of mixed allegiance, in…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 92,
                                "start": 79
                            }
                        ],
                        "text": "No higher-order hypercomplex cells were seen in monkey striate cortex (Hubel & Wiesel, 1965a)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 109,
                                "start": 96
                            }
                        ],
                        "text": "This presumably simply reflects the tendency for afferents to the cortex to be grouped (Hubel & Wiesel, 1965b), as is so for the columns of the somatosensory cortex described by Mountcastle (1957)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 276,
                                "start": 263
                            }
                        ],
                        "text": "These mixed regions tended to obscure the parcellation into columns in the cat (Hubel & Wiesel, 1962, p. 140), and indeed it was not until the columns had been accentuated by raising cats with strabismus that we became fully convinced of their existence (Hubel & Wiesel, 1965b)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Binocular interaction"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9424829"
                        ],
                        "name": "H. Asanuma",
                        "slug": "H.-Asanuma",
                        "structuredName": {
                            "firstName": "Hiroshi",
                            "lastName": "Asanuma",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Asanuma"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49862268"
                        ],
                        "name": "H. Sakata",
                        "slug": "H.-Sakata",
                        "structuredName": {
                            "firstName": "Hideo",
                            "lastName": "Sakata",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Sakata"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 186,
                                "start": 174
                            }
                        ],
                        "text": "The columnar system seems to represent a method by which many areas of cortex-somatosensory (Mountcastle, 1957) visual, including 17, 18 and 19, and perhaps motor (Asanuma & Sakata, 1967)-deal with multidimensional problems using a two-dimensional surface."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 146622110,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0ef3d06f70848941b150beb08a08de347718de01",
            "isKey": false,
            "numCitedBy": 333,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Functional-Organization-of-a-Cortical-Efferent-with-Asanuma-Sakata",
            "title": {
                "fragments": [],
                "text": "Functional Organization of a Cortical Efferent System Examined with Focal Depth Stimulation in Cats"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40636767"
                        ],
                        "name": "G. Bonin",
                        "slug": "G.-Bonin",
                        "structuredName": {
                            "firstName": "Gerhardt",
                            "lastName": "Bonin",
                            "middleNames": [
                                "von"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Bonin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 20
                            }
                        ],
                        "text": "1) combines that of von Bonin (1942) for layers I-IV, and that of Lorente de No (1943) and Brodmann (1909) for V and VI."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 85049396,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "fd243b7720583a33ef7312a82995064e4d1313b6",
            "isKey": false,
            "numCitedBy": 47,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-striate-area-of-primates-Bonin",
            "title": {
                "fragments": [],
                "text": "The striate area of primates"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1942
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50431698"
                        ],
                        "name": "S. A. Talbot",
                        "slug": "S.-A.-Talbot",
                        "structuredName": {
                            "firstName": "Samuel",
                            "lastName": "Talbot",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. A. Talbot"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "92060670"
                        ],
                        "name": "W. H. Marshall",
                        "slug": "W.-H.-Marshall",
                        "structuredName": {
                            "firstName": "Wade",
                            "lastName": "Marshall",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. H. Marshall"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 72257458,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "92e66e4fccb455fbebfb46bc90254207c90f5090",
            "isKey": false,
            "numCitedBy": 471,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Physiological-Studies-on-Neural-Mechanisms-of-and-Talbot-Marshall",
            "title": {
                "fragments": [],
                "text": "Physiological Studies on Neural Mechanisms of Visual Localization and Discrimination"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1941
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Nissl-stained section through the electrode track of Text-fig. 9, showing first part of the track outlined by inflammatory reaction"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 157
                            }
                        ],
                        "text": "As in the cat, these cells are defined as having receptive fields with spatially distinct 'on' and 'off' areas separated by parallel straight lines (Hubel & Wiesel, 1959)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Receptive fields of single neurones"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Nissl-stained section corresponding to the experiment of Text-figs. 7 and 8, showing part of penetration and two lesions. Layers are indicated to left"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 263,
                                "start": 252
                            }
                        ],
                        "text": "In the rhesus lateral geniculate body the majority of the dorsal-layer cells have opponent-colour properties, light exciting them at some wave-lengths, inhlibiting them at others, diffuse white liglht evoking little or no response (De Valois, Jacobs & Jones, 1963; Wiesel & Hubel, 1966)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Responses of single cells in primate red-green color vision system"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Nissl section showing four of the five lesions of Text-fig"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 106,
                                "start": 91
                            }
                        ],
                        "text": "1) combines that of von Bonin (1942) for layers I-IV, and that of Lorente de No (1943) and Brodmann (1909) for V and VI."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Vergleichende Lokalisation8lehre der Grosshirnrinde"
            },
            "venue": {
                "fragments": [],
                "text": "Vergleichende Lokalisation8lehre der Grosshirnrinde"
            },
            "year": 1909
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 58,
                                "start": 30
                            }
                        ],
                        "text": "In view of the recent work of Campbell & Kulikowski (1966) showing a difference in ability ofhumans to discriminate between horizontal or vertical lines and oblique lines, we have looked for any differences in the occurrence of horizontally and vertically oriented fields as opposed to oblique…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Orientational selectivity of thehuman visual system. J"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1966
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Cerebral cortex: architecture, intracortical connections, motor"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1943
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 76
                            }
                        ],
                        "text": "Ganglion cells with somewhat similar fields have been described recently by Daw (1967) in the retina of the goldfish."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Color coded units in the goldfish retina"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1967
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Responses of single cells in primate red-green color vision system"
            },
            "venue": {
                "fragments": [],
                "text": "Optik"
            },
            "year": 1963
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Hi8tologie du 8yWteme nerveux de l'homme et des verte'br48"
            },
            "venue": {
                "fragments": [],
                "text": "Hi8tologie du 8yWteme nerveux de l'homme et des verte'br48"
            },
            "year": 1911
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Cerebral cortex : architecture , intracortical connections , motor projections"
            },
            "venue": {
                "fragments": [],
                "text": "Physiology of the Nervous System"
            },
            "year": 1943
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Cerebral cortex : architecture , intracortical connections , motor projections"
            },
            "venue": {
                "fragments": [],
                "text": "Physiology of the Nervous System"
            },
            "year": 1943
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 83
                            }
                        ],
                        "text": "Microelectrodes were sharpened tungsten wire insulated with a clear vinyl lacquer (Hubel, 1957)."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Tungsten microelectrode for recording"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1957
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Color coded units in the goldfish retina"
            },
            "venue": {
                "fragments": [],
                "text": "Color coded units in the goldfish retina"
            },
            "year": 1967
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Responses of single cells in primate red - green color vision system"
            },
            "venue": {
                "fragments": [],
                "text": "Optik"
            },
            "year": 1963
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 19,
            "methodology": 8,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 38,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Receptive-fields-and-functional-architecture-of-Hubel-Wiesel/c5f5311fa1f34159ab3a0a1d58da51cd0340a640?sort=total-citations"
}