{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45362697,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "55baa7cbcebe262f24a29e4e47db331f9f9ba40a",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "Various psychophysical experiments investigating the role of spatial frequency tuned channels in stereopsis are reviewed and a computational model of stereopsis deriving from these studies is described. The distinctive features of the model are: (1) it identifies edge locations in each monocular field by searching for zero crossings in non-orientated centre-surround convolution profiles; (2) it selects among all possible binocular point-for-point combinations of edge locations only those which satisfy a (quasi-) collinear figural grouping rule; (3) it presents a concept of the orientated and spatial frequency tuned channel as a nonlinear grouping operator. The success of the model is demonstrated both on a stereo pair of a natural scene and on a random-dot stereogram."
            },
            "slug": "Spatial-frequency-tuned-channels:-implications-for-Frisby-Mayhew",
            "title": {
                "fragments": [],
                "text": "Spatial frequency tuned channels: implications for structure and function from psychophysical and computational studies of stereopsis."
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "A computational model of stereopsis deriving from psychophysical experiments investigating the role of spatial frequency tuned channels in stereopsis is described and it presents a concept of the orientated and spatial frequency tuning channel as a nonlinear grouping operator."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10762887,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "f7aa07fa42e67d43aa58dd107da856b98235863c",
            "isKey": false,
            "numCitedBy": 307,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "Recently, Marr & Poggio (1979) presented a theory of human stereo vision. An implementation of that theory is presented, and consists of five steps. (i) The left and right images are each filtered with masks of four sizes that increase with eccentricity; the shape of these masks is given by delta 2G, the Laplacian of a Gaussian function. (ii) Zero crossings in the filtered images are found along horizontal scan lines. (iii) For each mask size, matching takes place between zero crossings of the same sign and roughly the same orientation in the two images, for a range of disparities up to about the width of the mask's central region. Within this disparity range, it can be shown that false targets pose only a simple problem. (iv) The output of the wide masks can control vergence movements, thus causing small masks to come into correspondence. In this way, the matching process gradually moves from dealing with large disparities at a low resolution to dealing with small disparities at a high resolution. (v) When a correspondence is achieved, it is stored in a dynamic buffer, called the 2 1/2-dimensional sketch. To support the adequacy of the Marr-Poggio model of human stereo vision, the implementation was tested on a wide range of stereograms from the human stereopsis literature. The performance of the implementation is illustrated and compared with human perception. Also statistical assumptions made by Marr & Poggio are supported by comparison with statistics found in practice. Finally, the process of implementing the theory has led to the clarification and refinement of a number of details within the theory; these are discussed in detail."
            },
            "slug": "A-computer-implementation-of-a-theory-of-human-Grimson",
            "title": {
                "fragments": [],
                "text": "A computer implementation of a theory of human stereo vision."
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "To support the adequacy of the Marr-Poggio model of human stereo vision, the implementation was tested on a wide range of stereograms from the human stereopsis literature and was illustrated and compared with human perception."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "118988170"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "Dale",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120306234,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ab46fdac0a3b484cd58978ba71dc71631b49f70a",
            "isKey": false,
            "numCitedBy": 989,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm is proposed for solving the stereoscopic matching problem. The algorithm consists of five steps: (1) Each image is filtered at different orientations with bar masks of four sizes that increase with eccentricity; the equivalent filters are one or two octaves wide. (2) Zero-crossings in the filtered images, which roughly correspond to edges, are localized. Positions of the ends of lines and edges are also found. (3) For each mask orientation and size, matching takes place between pairs of zero-crossings or terminations of the same sign in the two images, for a range of disparities up to about the width of the mask’s central region. (4) Wide masks can control vergence movements, thus causing small masks to come into correspondence. (5) When a correspondence is achieved, it is stored in a dynamic buffer, called the 2½-D sketch. It is shown that this proposal provides a theoretical framework for most existing psychophysical and neurophysiological data about stereopsis. Several critical experimental predictions are also made, for instance about the size of Panum’s area under various conditions. The results of such experiments would tell us whether, for example, co-operativity is necessary for the matching process."
            },
            "slug": "A-computational-theory-of-human-stereo-vision-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "A computational theory of human stereo vision"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5405213"
                        ],
                        "name": "A. Saye",
                        "slug": "A.-Saye",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Saye",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Saye"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144717270,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f50fff5b924ac4b34e9a4b8324e97e4c1f0e622e",
            "isKey": false,
            "numCitedBy": 35,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Two experiments are reported which investigated the effects on stereopsis perception times of including monocularly conspicuous features in random-dot stereograms. It was found that such features facilitated stereopsis in large-disparity but not in small-disparity stereograms, perception times for the latter being relatively short with or without monocular features. Facilitation in the large-disparity stimuli came about both from features which delineated the shape of the whole disparate area and from features which merely happened to lie in the same depth plane as the disparate area, but which did not give any shape cues. It is argued that these various results can be well accounted for by a ‘vergence hypothesis’, which supposes that the long perception times often found with random-dot stereograms are due in part to the absence of stimulus features which can guide the vergence movements necessary for fusing the display."
            },
            "slug": "The-Role-of-Monocularly-Conspicuous-Features-in-Saye-Frisby",
            "title": {
                "fragments": [],
                "text": "The Role of Monocularly Conspicuous Features in Facilitating Stereopsis from Random-Dot Stereograms"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1904180,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a0abc0270968a033efd040d59beff15aacde4efd",
            "isKey": false,
            "numCitedBy": 68,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "A computational model is described which effects the binocular combination of monocular edge information. The distinctive features of the model are: (i) it identifies edge locations in each monocular field by searching for zero crossings in nonorientated centre-surround convolution profiles; (ii) it selects amongst all possible binocular point-for-point combinations of edge locations only those which satisfy a (quasi-)collinear figural grouping rule; (iii) it presents a concept of the orientated and spatial-frequency-tuned channel as a nonlinear grouping operator. The success of the model is demonstrated both on a stereo pair of a natural scene and on a random-dot stereogram."
            },
            "slug": "The-Computation-of-Binocular-Edges-Mayhew-Frisby",
            "title": {
                "fragments": [],
                "text": "The Computation of Binocular Edges"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "A computational model is described which effects the binocular combination of monocular edge information and presents a concept of the orientated and spatial-frequency-tuned channel as a nonlinear grouping operator."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 29051934,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "64bca74910be2465147282135b0fc09aadcf6a17",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Contrast thresholds for stereopsis were measured for a variety of bandpass-filtered random-dot stereograms in a series of experiments. The principal finding was that contrast thresholds for stereopsis from ‘complex’ stereograms composed of mixtures of (a) two widely different spatial frequencies or (b) two or more widely different oriented random textures, are considerably lower than would be expected if stereopsis from such stimuli is mediated by the first component to rise above its own stereopsis contrast threshold. Instead, it appears that stereopsis comes about whenever the supradetection-threshold contrast of a stereogram exceeds a certain level, regardless of whether this contrast is provided by a single component or by a mix of two different ones. The implications of these findings for models of stereopsis are discussed."
            },
            "slug": "Contrast-Summation-Effects-and-Stereopsis-Mayhew-Frisby",
            "title": {
                "fragments": [],
                "text": "Contrast Summation Effects and Stereopsis"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "It appears that stereopsis comes about whenever the supradetection-threshold contrast of a stereogram exceeds a certain level, regardless of whether this contrast is provided by a single component or by a mix of two different ones."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5473877,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b31231e21cb6a4f75ac84ecaa534e9b2e2d0432d",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-role-of-spatial-frequency-tuned-channels-in-Frisby-Mayhew",
            "title": {
                "fragments": [],
                "text": "The role of spatial frequency tuned channels in vergence control"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4180863,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "0803c12b201e9314618777f439c753525dc9f8c0",
            "isKey": false,
            "numCitedBy": 68,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "THE two eyes receive slightly differing views of the world and it has been known since the invention of the stereoscope, 140 yr ago, that these slight differences are utilised by the visual system for stereopsis—the perception of the relative depths of objects on the basis of binocular disparity. The central theoretical problem in stereopsis is simply stated: how is disparity information extracted from the two retinal images? We examine here various possible answers to this question."
            },
            "slug": "Rivalrous-texture-stereograms-Mayhew-Frisby",
            "title": {
                "fragments": [],
                "text": "Rivalrous texture stereograms"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "41179592"
                        ],
                        "name": "A. Kidd",
                        "slug": "A.-Kidd",
                        "structuredName": {
                            "firstName": "Alison",
                            "lastName": "Kidd",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Kidd"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4321522,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5680fe48e94d5de3cadadb1b164e1f4eab87739e",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "IN man the two eyes receive slightly differing views of the world. The visual system utilises this disparity for stereoscopic depth perception. This involves a difficult correspondence problem for establishing binocular fusion: for each surface feature extracted from one eye's image, the brain has to decide which is the equivalent feature in the other eye's image. Ambiguities often exist, particularly for densely-textured visual surfaces, but one aspect of binocular visual processing which helps reduce the scale of the problem is that for any given vergence angle, the visual system considers only those potential left/right fusions with disparities under a certain limiting size (defined by Panum's fusional areas1,2). This disparity limit, however, requires that when disparities greater than Panum's area are presented, a suitable vergence change must be initiated to bring corresponding features within the allowable range for fusion. A question currently of considerable theoretical interest concerns the nature of the stimulus characteristics used to initiate these essential vergence movements. The interest stems mainly from Marr and Poggio's model of human stereo vision3,4 in which false correspondences are avoided by seeking left/right fusions within spatial frequency tuned disparity channels whose disparity range is closely tied to their spatial frequency sensitivity5. By setting the disparity range of any given channel to about ± w (where w = the width of the centre of the receptive fields of the channel in question) Marr and Poggio have demonstrated that false matches are improbable and any that do emerge are easily eliminated using quite simple rules. A further feature of the model is that the outputs of low spatial frequency tuned channels (that is units capable of dealing with large disparities because of their relatively large receptive fields) can initiate vergence movements bringing into correspondence higher spatial frequency channels mediating smaller disparities. The theory predicts that in the case of a two-planar densely-textured stereogram (for example Fig. 1a–c] in which the disparity range exceeds the size appropriate for the lowest spatial frequency channels activated by the stereogram's texture, vergence movements should exhibit only a random-search structure. We report here an experimental test of this prediction which shows that vergence movements are not always random in the stimulus circumstances just specified. Rather, vergence can be guided by texture contours (Fig. 1b) depicted by differences of texture orientation between regions of relatively high spatial frequency content for the disparity range incorporated in the stereogram. Moreover, we find that such texture contours can facilitate stereopsis in a way consistent with the idea that they do so by initiating appropriate eye movements."
            },
            "slug": "Texture-contours-can-facilitate-stereopsis-by-eye-Kidd-Frisby",
            "title": {
                "fragments": [],
                "text": "Texture contours can facilitate stereopsis by initiating vergence eye movements"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "An experimental test of the model of human stereo vision in which false correspondences are avoided by seeking left/right fusions within spatial frequency tuned disparity channels whose disparity range is closely tied to their spatial frequency sensitivity finds that such texture contours can facilitate stereopsis in a way consistent with the idea that they do so by initiating appropriate eye movements."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40762910,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "c3204dff07959c23c8975ce83c83197cd8f4a3af",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "Surfaces possessing steep variations in depth present severe difficulties for orientationally tuned filter models of stereopsis. These difficulties are discussed in connection with a random-dot stereogram depicting a surface with steep horizontal corrugations. As expected on theoretical grounds, we find that a vertical ±45° orientationally filtered version of this stereogram cannot be fused. Moreover, it is demonstrated that a horizontal ±45° filtered version can be fused only with difficulty and its stereo percept is poor compared to that of the unfiltered original. It is concluded that orientated filters seem ill-designed to mediate the extraction of disparity cues, at least in the cases under consideration."
            },
            "slug": "Surfaces-with-Steep-Variations-in-Depth-Pose-for-Mayhew-Frisby",
            "title": {
                "fragments": [],
                "text": "Surfaces with Steep Variations in Depth Pose Difficulties for Orientationally Tuned Disparity Filters"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is concluded that orientated filters seem ill-designed to mediate the extraction of disparity cues, at least in the cases under consideration."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45833191,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "98e6f2a7327d476f55869a50e55f2082ae7d6e8b",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "The use of the term ‘global’ in the context of stereopsis is discussed. It is concluded that different meanings of this term need to be kept carefully distinguished at all times. The discussion centres around a series of demonstrations introduced by Ramachandran and Nelson, and interpretations are offered for these demonstrations in terms of spatial-frequency-tuned stereopsis channels."
            },
            "slug": "Global-Processes-in-Stereopsis:-Some-Comments-on-Frisby-Mayhew",
            "title": {
                "fragments": [],
                "text": "Global Processes in Stereopsis: Some Comments on Ramachandran and Nelson (1976)"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The discussion centres around a series of demonstrations introduced by Ramachandran and Nelson, and interpretations are offered for these demonstrations in terms of spatial-frequency-tuned stereopsis channels."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32886558,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "5b7f3fa962b119fa6e8165e756e31a7edc3b5c49",
            "isKey": false,
            "numCitedBy": 50,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "A series of experiments is reported on rivalrous-texture stereograms composed of narrow-band-filtered random noise. Experiment 1 found that the apparent depth—disparity function for such stereograms was different from that observed with similar but nonrivalrous stimuli. In particular, rivalrous divergent disparities produced the same depth as rivalrous zero disparity and this latter disparity itself produced a significant degree of protruding (i.e. ‘convergent’) depth in a certain type of rivalrous-texture stereogram. Free inspection was permitted and disparities were in the range 16 min convergent to 16 min divergent. Experiment 2 found no convincing evidence for reliable qualitative depth discriminations from tachistoscopic presentations of rivalrous-texture stereograms, using a forced-choice task requiring a discrimination between 16 min convergent and 16 min divergent conditions. This task was solved easily for equivalent nonrivalrous stimuli. Experiment 3 measured a hitherto unreported binocular depth effect, termed ‘paradepth’, which is produced by presenting a target in one field only. This effect appears to be a genuine binocular depth effect and not just the result of an ordinary monocular masking depth cue. The size of the depth effect was found to be a function of the width of the target. The overall conclusion derived from the series of experiments is that rivalrous-texture stereograms are complex stimuli capable of yielding curious and unexpected depth effects which are not readily explained in detail within any existing theoretical framework."
            },
            "slug": "The-Relationship-between-Apparent-Depth-and-in-Frisby-Mayhew",
            "title": {
                "fragments": [],
                "text": "The Relationship between Apparent Depth and Disparity in Rivalrous-Texture Stereograms"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "The overall conclusion derived from the series of experiments is that rivalrous-texture stereograms are complex stimuli capable of yielding curious and unexpected depth effects which are not readily explained in detail within any existing theoretical framework."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122868787,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "8c698a0e0e54ef70bdb5a41585598b84400db178",
            "isKey": false,
            "numCitedBy": 736,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "The perception of depth involves monocular and binocular depth cues. The latter seem simpler and more suitable for investigation. Particularly important is the problem of finding binocular parallax, which involves matching patterns of the left and right visual fields. Stereo pictures of familiar objects or line drawings preclude the separation of interacting cues, and thus this pattern-matching process is difficult to investigate. More insight into the process can be gained by using unfamiliar picture material devoid of all cues except binocular parallax. To this end, artificial stereo picture pairs were generated on a digital computer. When viewed monocularly, they appear completely random, but if viewed binocularly, certain correlated point domains are seen in depth. By introducing distortions in this material and testing for perception of depth, it is possible to show that pattern-matching of corresponding points of the left and right visual fields can be achieved by first combining the two fields and then searching for patterns in the fused field. By this technique, some interesting properties of this fused binocular field are revealed, and a simple analog model is derived. The interaction between the monocular and binocular fields is also describea. A number of stereo images that demonstrate these and other findings are presented."
            },
            "slug": "Binocular-depth-perception-of-computer-generated-Julesz",
            "title": {
                "fragments": [],
                "text": "Binocular depth perception of computer-generated patterns"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 767650,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6bb6eba248b6ef8d228dc33e6113c3e12dd48fee",
            "isKey": false,
            "numCitedBy": 1168,
            "numCiting": 82,
            "paperAbstract": {
                "fragments": [],
                "text": "The extraction of stereo-disparity information from two images depends upon establishing a correspondence between them. In this article we analyze the nature of the correspondence computation and derive a cooperative algorithm that implements it. We show that this algorithm successfully extracts information from random-dot stereograms, and its implications for the psychophysics and neurophysiology of the visual system are briefly discussed."
            },
            "slug": "Cooperative-computation-of-stereo-disparity.-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "Cooperative computation of stereo disparity."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that this algorithm successfully extracts information from random-dot stereograms, and its implications for the psychophysics and neurophysiology of the visual system are briefly discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1753317"
                        ],
                        "name": "P. Mowforth",
                        "slug": "P.-Mowforth",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Mowforth",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Mowforth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 22977284,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "086a6c69f1733f03800c2ad986f7a227991fdefa",
            "isKey": false,
            "numCitedBy": 46,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Vergence responses were recorded from practised observers viewing narrow-band spatial-frequency-filtered planar random-dot stereograms. It was found that low spatial frequencies of 1·75–3·5 cycles deg−1 could trigger appropriate vergence responses to larger disparities than could the relatively high spatial frequency of 7·0 cycles deg−1. Nevertheless, appropriate vergence shifts were observed reliably for spatial-frequency/disparity combinations well outside the range predicted by Marr and Poggio's (1979) model of stereo vision. It was also found that for large-disparity/high-spatial-frequency combinations which the subjects could not fuse, the vergence system went into oscillation with the eyes diverging and converging at a frequency of about 1·5 Hz and with an amplitude of about 10–20 min arc. Finally, it was demonstrated that when a prominent monocular cue was superimposed upon a large-disparity/high-spatial-frequency stereogram then a speedy vergence response occurred which resulted in successful fusion. This latter finding supports the hypothesis advanced earlier that monocular cues can facilitate stereopsis by triggering appropriate vergence shifts."
            },
            "slug": "Vergence-Eye-Movements-Made-in-Response-to-Mowforth-Mayhew",
            "title": {
                "fragments": [],
                "text": "Vergence Eye Movements Made in Response to Spatial-Frequency-Filtered Random-Dot Stereograms"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It was demonstrated that when a prominent monocular cue was superimposed upon a large-disparity/high-spatial-frequency stereogram then a speedy vergence response occurred which resulted in successful fusion, which supports the hypothesis advanced earlier that monocular cues can facilitate stereopsis by triggering appropriate vergence shifts."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32733837"
                        ],
                        "name": "H. Wilson",
                        "slug": "H.-Wilson",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Wilson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "51925280"
                        ],
                        "name": "Stephen C. Giese",
                        "slug": "Stephen-C.-Giese",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Giese",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Stephen C. Giese"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34051727,
            "fieldsOfStudy": [
                "Physics",
                "Environmental Science"
            ],
            "id": "4af0b5b557b4067a22a9c4c59fdf7bf0ff938eae",
            "isKey": false,
            "numCitedBy": 139,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Threshold-visibility-of-frequency-gradient-patterns-Wilson-Giese",
            "title": {
                "fragments": [],
                "text": "Threshold visibility of frequency gradient patterns"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37758178,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "33348bc773146d1bcbfca55f63db5cb041a39d60",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "A stereopsis signal carried by an oriented random texture and masked by a similar noise texture is not unmasked when the orientation of the noise is rotated. This result is discussed in connection with the orientational tuning of local and global stereopsis processes."
            },
            "slug": "Stereopsis-Masking-in-Humans-is-Not-Orientationally-Mayhew-Frisby",
            "title": {
                "fragments": [],
                "text": "Stereopsis Masking in Humans is Not Orientationally Tuned"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "A stereopsis signal carried by an oriented random texture and masked by a similar noise texture is not unmasked when the orientation of the noise is rotated, which is discussed in connection with the orientational tuning of local and global stereopsis processes."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 40175393,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aa4b60b5847999c2f778e3e67ca1f2201e396abb",
            "isKey": false,
            "numCitedBy": 1004,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "An introduction is given to a theory of early visual information processing. The theory has been implemented, and examples are given of images at various stages of analysis. It is argued that the first step of consequence is to compute a primitive but rich description of the grey-level changes present in an image. The description is expressed in a vocabulary of kinds of intensity change (EDGE, SHADING-EDGE, EXTENDED-EDGE, LINE, BLOB etc.). Modifying parameters are bound to the elements in the description, specifying their POSITION, ORIENTATION, TERMINATION points, CONTRAST, SIZE and FUZZINESS. This description is obtained from the intensity array by fixed techniques, and it is called the primal sketch. For most images, the primal sketch is large and unwieldy. The second important step in visual information processing is to group its contents in a way that is appropriate for later recognition. From our ability to interpret drawings with little semantic content, one may infer the presence in our perceptual equipment of symbolic processes that can define \"place-tokens\" in an image in various ways, and can group them according to certain rules. Homomorphic techniques fail to account for many of these grouping phenomena, whose explanations require mechanisms of construction rather than mechanisms of detection. The necessary grouping of elements in the primal sketch may be achieved by a mechanism that has available the processes inferred from above, together with the ability to select items by first order discriminations acting on the elements' parameters. Only occasionally do these mechanisms use downward-flowing information about the contents of the particular image being processed. It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch. The class of computations so obtained differs slightly from the class of second order operations on the intensity array. The extraction of a form from the primal sketch using these techniques amounts to the separation of figure from ground. It is concluded that most of the separation can be carried out by using techniques that do not depend upon the particular image in question. Therefore, figure-ground separation can normally precede the description of the shape of the extracted form. Up to this point, higher-level knowledge and purpose are brought to bear on only a few of the decisions taken during the processing. This relegates the widespread use of downward-flowing information to a later stage than is found in current machine-vision programs, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "slug": "Early-processing-of-visual-information.-Marr",
            "title": {
                "fragments": [],
                "text": "Early processing of visual information."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 38715307,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bd32c8c89e52f5b4142b848d9b4dae2ececc2892",
            "isKey": false,
            "numCitedBy": 123,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Under appropriate conditions zero-crossings of a bandpass signal are very rich in information. The authors examine here the relevance of this result to the early stages of visual information processing, where zero-crossings in the output of independent spatial-frequency-tuned channels may contain sufficient information for much of the subsequent processing."
            },
            "slug": "Bandpass-channels,-zero-crossings,-and-early-visual-Marr-Ullman",
            "title": {
                "fragments": [],
                "text": "Bandpass channels, zero-crossings, and early visual information processing."
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "Under appropriate conditions zero-crossings of a bandpass signal are very rich in information and may contain sufficient information for much of the subsequent processing in the early stages of visual information processing."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2707896"
                        ],
                        "name": "B. Logan",
                        "slug": "B.-Logan",
                        "structuredName": {
                            "firstName": "Benjamin",
                            "lastName": "Logan",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Logan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1636877,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "ecc6cdfe63a5803e71cc1eae3c52ac1e4b036e49",
            "isKey": false,
            "numCitedBy": 281,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "An interesting subclass of bandpass signals {h} is described wherein the zero crossings of h determine h within a multiplicative constant. The members may have complex zeros, but it is necessary that h should have no zeros in common with its Hilbert transform h other than real simple zeros. It is then sufficient that the band be less than an octave in width. The subclass is shown to include full-carrier upper-sideband signals (of less than an octave bandwidth). Also it is shown that full-carrier lower-sideband signals have only real simple zeros (for any ratio of upper and tower frequencies) and, hence, are readily identified by their zero crossings. However, under the most general conditions for uniqueness, the problem of actually recovering h from its sign changes appears to be very difficult and impractical."
            },
            "slug": "Information-in-the-zero-crossings-of-bandpass-Logan",
            "title": {
                "fragments": [],
                "text": "Information in the zero crossings of bandpass signals"
            },
            "venue": {
                "fragments": [],
                "text": "The Bell System Technical Journal"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30297475,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "0b69dc1d56f80c02478a76925cda39a233126783",
            "isKey": false,
            "numCitedBy": 161,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Reconstructing-the-visual-image-in-space-and-time-Barlow",
            "title": {
                "fragments": [],
                "text": "Reconstructing the visual image in space and time"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1979
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 22,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/Psychophysical-and-Computational-Studies-Towards-a-Mayhew-Frisby/5d206bde2f0613b54708913c2c99c44314a8d8d1?sort=total-citations"
}