{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49353544"
                        ],
                        "name": "R. Fisher",
                        "slug": "R.-Fisher",
                        "structuredName": {
                            "firstName": "Rory",
                            "lastName": "Fisher",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Fisher"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15354499,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "bd2e048c676ad778351bd7d7660240a978422117",
            "isKey": false,
            "numCitedBy": 3233,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "Centre of Location. That abscissa of a frequency curve for which the sampling errors of optimum location are uncorrelated with those of optimum scaling. (9.)"
            },
            "slug": "On-the-Mathematical-Foundations-of-Theoretical-Fisher",
            "title": {
                "fragments": [],
                "text": "On the Mathematical Foundations of Theoretical Statistics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1922
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7544534"
                        ],
                        "name": "H. Jeffreys",
                        "slug": "H.-Jeffreys",
                        "structuredName": {
                            "firstName": "Harold",
                            "lastName": "Jeffreys",
                            "middleNames": [
                                "Sir"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Jeffreys"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 8,
                                "start": 0
                            }
                        ],
                        "text": "Jeffreys (par."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 81,
                                "start": 77
                            }
                        ],
                        "text": "The particular measure of divergence we use has been considered by Jeffreys ([10), [111) in another connection."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 19490929,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "301b0efa2b959321b46c2c7b0c514ded59e2adfa",
            "isKey": false,
            "numCitedBy": 2066,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown that a certain differential form depending on the values of the parameters in a law of chance is invariant for all transformations of the parameters when the law is differentiable with regard to all parameters. For laws containing a location and a scale parameter a form with a somewhat restricted type of invariance is found even when the law is not everywhere differentiable with regard to the parameters. This form has the properties required to give a general rule for stating the prior probability in a large class of estimation problems."
            },
            "slug": "An-invariant-form-for-the-prior-probability-in-Jeffreys",
            "title": {
                "fragments": [],
                "text": "An invariant form for the prior probability in estimation problems"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "It is shown that a certain differential form depending on the values of the parameters in a law of chance is invariant for all transformations of the parameter when the law is differentiable with regard to all parameters."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series A. Mathematical and Physical Sciences"
            },
            "year": 1946
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733849"
                        ],
                        "name": "P. Halmos",
                        "slug": "P.-Halmos",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Halmos",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Halmos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48700578"
                        ],
                        "name": "L. J. Savage",
                        "slug": "L.-J.-Savage",
                        "structuredName": {
                            "firstName": "Leonard",
                            "lastName": "Savage",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. J. Savage"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 34
                            }
                        ],
                        "text": "8 Note that the X in Theorem 1 of [8] is different from the X here."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 37
                            }
                        ],
                        "text": "Then by Lemma 2 of Halmos and Savage [8] and the definition of g9 and g9 , fl(x) = g1T(x) [XN f2(x) = 92T(x) [Xl and the result in (4."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 76
                            }
                        ],
                        "text": "8) fl(X) (e)?W1(T) [X], f2 (X) which is by Corollary 2 of Halmos and Savage [8] necessary and sufficient that the statistic T be sufficient for a homogeneous set of measures on S."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 50,
                                "start": 47
                            }
                        ],
                        "text": "We shall use the notation of Halmos and Savage [8] and that of [7]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 80,
                                "start": 77
                            }
                        ],
                        "text": "If T is sufficient then by the same proof8 as Theorem 1 of Halmos and Savage [8] fi(x) and f2(x) are (c)T '(T)[X]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 119959959,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8470c21d8e0f9ac48a916ad51b7d4247015ba5fd",
            "isKey": true,
            "numCitedBy": 284,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The body of this paper is written in terms of very general and abstract ideas which have been popular in pure mathematical work on the theory of probability for the last two or three decades. It seems to us that these ideas, so fruitful in pure mathematics, have something to contribute to mathematical statistics also, and this paper is an attempt to illustrate the sort of contribution we have in mind. The purpose of generality here is not to solve immediate practical problems, but rather to capture the logical essence of an important concept (sufficient statistic), and in particular to disentangle that concept from such ideas as Euclidean space, dimensionality, partial differentiation, and the distinction between continuous and discrete distributions, which seem to us extraneous. In accordance with these principles the center of the stage is occupied by a completely abstract sample space--that is a set $X$ of objects $x$, to be thought of as possible outcomes of an experimental program, distributed according to an unknown one of a certain set of probability measures. Perhaps the most familiar concrete example in statistics is the one in which $X$ is $n$ dimensional Cartesian space, the points of which represent $n$ independent observations of a normally distributed random variable with unknown parameters, and in which the probability measures considered are those induced by the various common normal distributions of the individual observations. A statistic is defined, as usual, to be a function $T$ of the outcome, whose values, however, are not necessarily real numbers but may themselves be abstract entities. Thus, in the concrete example, the entire set of $n$ observations, or, less trivially, the sequence of all sample moments about the origin are statistics with values in an $n$ dimensional and in an infinite dimensional space respectively. Another illuminating and very general example of a statistic may be obtained as follows. Suppose that the outcomes of two not necessarily statistically independent programs are thought of as one united outcome--then the outcome $T$ of the first program alone is a statistic relative to the united program. A technical measure theoretic result, known as the Radon-Nikodym theorem, is important in the study of statistics such as $T$. It is, for example, essential to the very definition of the basic concept of conditional probability of a subset $E$ of $X$ given a value $y$ of $T$. The statistic $T$ is called sufficient for the given set $\\mathcal{M}$ of probability measures if (somewhat loosely speaking) the conditional probability of a subset $E$ of $X$ given a value $y$ of $T$ is the same for every probability measure in $\\mathcal{M}$. It is, for instance, well known that the sample mean and variance together form a sufficient statistic for the measures described in the concrete example. The theory of sufficiency is in an especially satisfactory state for the case in which the set $\\mathcal{M}$ of probability measures satisfies a certain condition described by the technical term dominated. A set $\\mathcal{M}$ of probability measures is called dominated if each measure in the set may be expressed as the indefinite integral of a density function with respect to a fixed measure which is not itself necessarily in the set. It is easy to verify that both classical extremes, commonly referred to as the discrete and continuous cases, are dominated. One possible formulation of the principal result concerning sufficiency for dominated sets is a direct generalization to the abstract case of the well known Fisher-Neyman result: $T$ is sufficient if and only if the densities can be written as products of two factors, the first of which depends on the outcome through $T$ only and the second of which is independent of the unknown measure. Another way of phrasing this result is to say that $T$ is sufficient if and only if the likelihood ratio of every pair of measures in $\\mathcal{M}$ depends on the outcome through $T$ only. The latter formulation makes sense even in the not necessarily dominated case but unfortunately it is not true in that case. The situation can be patched up somewhat by introducing a weaker notion called pairwise sufficiency. In ordinary statistical parlance one often speaks of a statistic sufficient for some of several parameters. The abstract results mentioned above can undoubtedly be extended to treat this concept."
            },
            "slug": "Application-of-the-Radon-Nikodym-Theorem-to-the-of-Halmos-Savage",
            "title": {
                "fragments": [],
                "text": "Application of the Radon-Nikodym Theorem to the Theory of Sufficient Statistics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1949
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49353544"
                        ],
                        "name": "R. Fisher",
                        "slug": "R.-Fisher",
                        "structuredName": {
                            "firstName": "Rory",
                            "lastName": "Fisher",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Fisher"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 62064968,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "3744110be1b657ab6335ade4f43224a33d3edd87",
            "isKey": false,
            "numCitedBy": 2173,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "It has been pointed out to me that some of the statistical ideas employed in the following investigation have never received a strictly logical definition and analysis. The idea of a frequency curve, for example, evidently implies an infinite hypothetical population distributed in a definite manner; but equally evidently the idea of an infinite hypothetical population requires a more precise logical specification than is contained in that phrase. The same may be said of the intimately connected idea of random sampling. These ideas have grown up in the minds of practical statisticians and lie at the basis especially of recent work; there can be no question of their pragmatic value. It was no part of my original intention to deal with the logical bases of these ideas, but some comments which Dr Burnside has kindly made have convinced me that it may be desirable to set out for criticism the manner in which I believe the logical foundations of these ideas may be established."
            },
            "slug": "Theory-of-Statistical-Estimation-Fisher",
            "title": {
                "fragments": [],
                "text": "Theory of Statistical Estimation"
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "It has been pointed out to me that some of the statistical ideas employed in the following investigation have never received a strictly logical definition and analysis, and it is desirable to set out for criticism the manner in which the logical foundations of these ideas may be established."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1925
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2052840456"
                        ],
                        "name": "A. Bhattacharyya",
                        "slug": "A.-Bhattacharyya",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Bhattacharyya",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bhattacharyya"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 177,
                                "start": 174
                            }
                        ],
                        "text": "We are also concerned with the statistical problem of discrimination ([31, [17]), by considering a measure of the \"distance\" or \"divergence\" between statistical populations ([1), [21, [131) in terms of our measure of information."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 235941388,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "26953a65d5136ce54ca43ca916e9454de5aac084",
            "isKey": false,
            "numCitedBy": 1616,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-a-measure-of-divergence-between-two-statistical-Bhattacharyya",
            "title": {
                "fragments": [],
                "text": "On a measure of divergence between two statistical populations defined by their probability distributions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1943
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "86960918"
                        ],
                        "name": "A. Kolmogoroff",
                        "slug": "A.-Kolmogoroff",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Kolmogoroff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Kolmogoroff"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 155960161,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "6b37e2f4383a77c781f4e73825b0471af3dbb145",
            "isKey": false,
            "numCitedBy": 1081,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Grundbegriffe-der-Wahrscheinlichkeitsrechnung-Kolmogoroff",
            "title": {
                "fragments": [],
                "text": "Grundbegriffe der Wahrscheinlichkeitsrechnung"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1933
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "92713091"
                        ],
                        "name": "G. Brown",
                        "slug": "G.-Brown",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Brown",
                            "middleNames": [
                                "Williams"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Brown"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143724555,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f9f55f7fffeee6fca29e6fff70d605dfa6ac0075",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Basic-principles-for-construction-and-application-Brown",
            "title": {
                "fragments": [],
                "text": "Basic principles for construction and application of discriminators"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1950
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "12481981"
                        ],
                        "name": "P. Mahalanobis",
                        "slug": "P.-Mahalanobis",
                        "structuredName": {
                            "firstName": "Prasanta",
                            "lastName": "Mahalanobis",
                            "middleNames": [
                                "Chandra"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Mahalanobis"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 75,
                                "start": 71
                            }
                        ],
                        "text": "A special case of this divergence is Mahalanobis' generalized distance [13]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 117765088,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "fa97c2238a16e9226f386ecffe22095e3d3d9dff",
            "isKey": false,
            "numCitedBy": 6001,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-the-generalized-distance-in-statistics-Mahalanobis",
            "title": {
                "fragments": [],
                "text": "On the generalized distance in statistics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1936
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "123729051"
                        ],
                        "name": "L. M. M.-T.",
                        "slug": "L.-M.-M.-T.",
                        "structuredName": {
                            "firstName": "L.",
                            "lastName": "M.-T.",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. M. M.-T."
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 9,
                                "start": 5
                            }
                        ],
                        "text": "9 of [11) mentioned the symmetry, positive definiteness and additivity, and invariance for non-singular transformations."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 4036480,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f1f4386524be3ed96caaf05f661aacb94db1e566",
            "isKey": false,
            "numCitedBy": 5289,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Theory-of-Probability-M.-T.",
            "title": {
                "fragments": [],
                "text": "Theory of Probability"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1929
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "AND G"
            },
            "venue": {
                "fragments": [],
                "text": "P6LYA, Inequalities, Cambridge University Press"
            },
            "year": 1934
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On a measure of divergence between two multinomial populations,"
            },
            "venue": {
                "fragments": [],
                "text": "Sankhya, Vol"
            },
            "year": 1946
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 7
                            }
                        ],
                        "text": "774 of [4]), to within second order terms it is found that (2."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "DOOB,  \"Probability and statistics,"
            },
            "venue": {
                "fragments": [],
                "text": "Trans. Am. Math. Soc., Vol"
            },
            "year": 1934
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 29
                            }
                        ],
                        "text": "By the Radon-Nikodym theorem [7] there exist fi(x), i = 1, 2, unique up to sets of measure zero in X,"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 66,
                                "start": 63
                            }
                        ],
                        "text": "We shall use the notation of Halmos and Savage [8] and that of [7]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Measure 7'heory"
            },
            "venue": {
                "fragments": [],
                "text": "D. Van Nostrand"
            },
            "year": 1950
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 6,
            "methodology": 3
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 13,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/On-Information-and-Sufficiency-Zhu/87cbed883368d4a9efd42fdd91f47038f8d8fbe6?sort=total-citations"
}