{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "79977033"
                        ],
                        "name": "H. S. Forbes",
                        "slug": "H.-S.-Forbes",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Forbes",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. S. Forbes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144319778,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "21ba4332d216353bdee691f66dd18512411ced3d",
            "isKey": false,
            "numCitedBy": 206,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The purpose of this paper is to describe a new technic for observing and measuring the changing diameters of the blood vessels of the piaarachnoid, together with fluctuations in intracranial and intravascular pressures. Of the many ways devised in the past for studying the factors which operate to control the blood supply of the brain, two general procedures have been found most useful. First, the recording of pressures within the skull and within arteries and veins in divers situations and under varying experimental conditions, and second, the direct observation of blood vessels on the surface of the brain through an opening in the skull. Each method has its advantages and its limitations. Up to the present time, the method of measurement and comparison of pressures has yielded more important data than that of direct observation. The technic of the latter, however, has never been perfected, nor have its possibilities been"
            },
            "slug": "THE-CEREBRAL-CIRCULATION:-I.-OBSERVATION-AND-OF-Forbes",
            "title": {
                "fragments": [],
                "text": "THE CEREBRAL CIRCULATION: I. OBSERVATION AND MEASUREMENT OF PIAL VESSELS"
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "A new technic for observing and measuring the changing diameters of the blood vessels of the piaarachnoid, together with fluctuations in intracranial and intravascular pressures is described."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1928
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2670334"
                        ],
                        "name": "C. Li",
                        "slug": "C.-Li",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Li",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47331492"
                        ],
                        "name": "H. Jasper",
                        "slug": "H.-Jasper",
                        "structuredName": {
                            "firstName": "Herbert",
                            "lastName": "Jasper",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Jasper"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 31046660,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7cb40e1d2a264952f0b3f645a0cc964c10874312",
            "isKey": false,
            "numCitedBy": 215,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "After over twenty years of study, the neurophysiological basis of the rhythmic oscillations in electrical potential which can be recorded from the cerebral cortex remains poorly understood. The most direct approach to this problem, and the only one which will eventually give a definite answer, is by means of microelectrodes which will record the discharge of single nerve cells simultaneously with the slower potential oscillations as well as the direct-current potential field in which the single units lie. The original studies of Renshaw, Forbes & Morrison (1940) on the hippocampus of the cat showed that unitary discharge of the pyramidal cells could be recorded with the microelectrodes when they were placed within the stratum pyramidale. Only slow waves were seen when recording from the surface and there was no suggestion that the slow waves were made up of envelopes of spike discharge. In fact there seemed to be no clear relationship between the slow wave oscillations and the unitary spike potentials obtained from the pyramidal cells. Similar results have recently been obtained by Brookhart, Moruzzi & Snider (1950) in the cerebellum, who concluded that the 200-300 per sec rhythmic activity of the cerebellum did not correspond to unitary discharge of cells within the cortex of cerebellum as recorded with microelectrodes. Woldring & Dirken (1950) have, however, recently reported rapid spike activity from the surface of the cerebral cortex obtained with electrodes made with platinum wires of 30, gauge, and which was most prominent in the waking animal, with grouped spike potentials related to slow waves in light narcosis. In the present report we wish to present the results of microelectrode studies of unit activity within the cerebral cortex of the cat in relation to slow potential oscillations under different excitatory states as affected by barbiturate"
            },
            "slug": "Microelectrode-studies-of-the-electrical-activity-*-Li-Jasper",
            "title": {
                "fragments": [],
                "text": "Microelectrode studies of the electrical activity of the cerebral cortex in the cat *"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The results of microelectrode studies of unit activity within the cerebral cortex of the cat in relation to slow potential oscillations under different excitatory states as affected by barbiturate are presented."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1953
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 2,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Chamber-for-microelectrode-studies-in-the-cerebral-Davies/345e94cf3db0022721f649d9eb75a443a39c31ba?sort=total-citations"
}