{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35729970"
                        ],
                        "name": "Yiming Yang",
                        "slug": "Yiming-Yang",
                        "structuredName": {
                            "firstName": "Yiming",
                            "lastName": "Yang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yiming Yang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1792682"
                        ],
                        "name": "C. Chute",
                        "slug": "C.-Chute",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Chute",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Chute"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "have tested ExpNet and LLSF in categorization of another text collection which includes 6134 surgical procedures from Mayo patient records [ 12 ]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "other retrieval and categorization systems [5] [8] [ 12 ] [13]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "to the space limit of this paper; more description can be found in previous papers [8] [ 12 ]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "sensitive. Further discussions regarding this aspect can be found in a previous paper [ 12 ]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 16063479,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f926a0022e794485ec469124894aaaf29b087d70",
            "isKey": false,
            "numCitedBy": 489,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "A unified model for text categorization and text retrieval is introduced. We use a training set of manually categorized documents to learn word-category associations, and use these associations to predict the categories of arbitrary documents. Similarly, we use a training set of queries and their related documents to obtain empirical associations between query words and indexing terms of documents, and use these associations to predict the related documents of arbitrary queries. A Linear Least Squares Fit (LLSF) technique is employed to estimate the likelihood of these associations. Document collections from the MEDLINE database and Mayo patient records are used for studies on the effectiveness of our approach, and on how much the effectiveness depends on the choices of training data, indexing language, word-weighting scheme, and morphological canonicalization. Alternative methods are also tested on these data collections for comparison. It is evident that the LLSF approach uses the relevance information effectively within human decisions of categorization and retrieval, and achieves a semantic mapping of free texts to their representations in an indexing language. Such a semantic mapping lead to a significant improvement in categorization and retrieval, compared to alternative approaches."
            },
            "slug": "An-example-based-mapping-method-for-text-and-Yang-Chute",
            "title": {
                "fragments": [],
                "text": "An example-based mapping method for text categorization and retrieval"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is evident that the LLSF approach uses the relevance information effectively within human decisions of categorization and retrieval, and achieves a semantic mapping of free texts to their representations in an indexing language."
            },
            "venue": {
                "fragments": [],
                "text": "TOIS"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35729970"
                        ],
                        "name": "Yiming Yang",
                        "slug": "Yiming-Yang",
                        "structuredName": {
                            "firstName": "Yiming",
                            "lastName": "Yang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yiming Yang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1792682"
                        ],
                        "name": "C. Chute",
                        "slug": "C.-Chute",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Chute",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Chute"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 170,
                                "start": 167
                            }
                        ],
                        "text": "Example-baaed matching methods include the relevance feedback approach [6], the Darmstadt Indexing Approach (DIA) [7], the Linear Least Squares Fit (LLSF) mapping [3] [8], Bayesian belief networks [9] [1 O], and neural networks [11]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 136
                            }
                        ],
                        "text": "We omit the details of the data set construction due to the space limit of this paper; more description can be found in previous papers [8] [12]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 154,
                                "start": 151
                            }
                        ],
                        "text": "The third layer relates training documents to training categories; the weight of a document-to-category link is the product of the IDF category weight [8] and the conditional"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 190,
                                "start": 187
                            }
                        ],
                        "text": "In our evaluations of text retrieval, LLSF has shown a performance comparable to relevance feedback, and significant improvements over surface-based matching and thesaurus-based matching [8]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 131
                            }
                        ],
                        "text": "Our current implementation of LLSF uses the LINPACK algorithm for singular value decomposition, which requires roughly 0(ZV3) time [8] (our on-going research shows that the cubic time complexity can be reduced to quadratic)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 50,
                                "start": 47
                            }
                        ],
                        "text": "other retrieval and categorization systems [5] [8] [12] [13]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 183,
                                "start": 180
                            }
                        ],
                        "text": "In the evaluations of text categorization (where relevance feedback is not applicable), LLSF has significantly outperformed surface-based mat thing and thesaurusbased matching [3] [8] [13]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6243197,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b688e610d6b52fcba62b3e47b6ec7c90e16ff2df",
            "isKey": false,
            "numCitedBy": 66,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a unique example-based mapping method for document retrieval. We discovered that the knowledge about relevance among queries and documents can be used to obtain empirical connections between query terms and the canonical concepts which are used for indexing the content of documents. These connections do not depend on whether there are shared terms among the queries and documents; therefore, they are especially effective for a mapping from queries to the documents where the concepts are relevant but the terms used by article authors happen to be different from the terms of database users. We employ a Linear Least Squares Fit (LLSF) technique to compute such connections from a collection of queries and documents where the relevance is assigned by humans, and then use these connections in the retrieval of documents where the relevance is unknown. We tested this method on both retrieval and indexing with a set of MEDLINE documents which has been used by other information retrieval systems for evaluations. The effectiveness of the LLSF mapping and the significant improvement over alternative approaches was evident in the tests."
            },
            "slug": "An-application-of-least-squares-fit-mapping-to-text-Yang-Chute",
            "title": {
                "fragments": [],
                "text": "An application of least squares fit mapping to text information retrieval"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "It is discovered that the knowledge about relevance among queries and documents can be used to obtain empirical connections between query terms and the canonical concepts which are used for indexing the content of documents."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35729970"
                        ],
                        "name": "Yiming Yang",
                        "slug": "Yiming-Yang",
                        "structuredName": {
                            "firstName": "Yiming",
                            "lastName": "Yang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yiming Yang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1792682"
                        ],
                        "name": "C. Chute",
                        "slug": "C.-Chute",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Chute",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Chute"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 131
                            }
                        ],
                        "text": "As a result, no reliable improvements have been observed by using general-purpose thesauri compared to surface-based mat thing [2] [3] [4] [5]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 166,
                                "start": 163
                            }
                        ],
                        "text": "Example-baaed matching methods include the relevance feedback approach [6], the Darmstadt Indexing Approach (DIA) [7], the Linear Least Squares Fit (LLSF) mapping [3] [8], Bayesian belief networks [9] [1 O], and neural networks [11]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 179,
                                "start": 176
                            }
                        ],
                        "text": "In the evaluations of text categorization (where relevance feedback is not applicable), LLSF has significantly outperformed surface-based mat thing and thesaurusbased matching [3] [8] [13]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14473522,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "33536f0bf7925517ead9f44419617edfb24922d2",
            "isKey": false,
            "numCitedBy": 85,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a unique method for mapping natural language texts to canonical terms that identify the contents of the texts. This method learns empirical associations between free-form texts and canonical terms from human-assigned matches and determines a Linear Least Squares Fit (LLSF) mapping function which represents weighted connections between words in the texts and the canonical terms. The mapping function enables us to project an arbitrary text to the canonical term space where the \"transformed\" text is compared with the terms, and similarity scores are obtained which quantify the relevance between the the text and the terms. This approach has superior power to discover synonyms or related terms and to preserve the context sensitivity of the mapping. We achieved a rate of 84% in both the recall and the precision with a testing set of 6,913 texts, outperforming other techniques including string matching (15%), morphological parsing (17%) and statistical weighting (21%)."
            },
            "slug": "A-Linear-Least-Squares-Fit-Mapping-Method-for-From-Yang-Chute",
            "title": {
                "fragments": [],
                "text": "A Linear Least Squares Fit Mapping Method for Information Retrieval From Natural Language Texts"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "This method learns empirical associations between free-form texts and canonical terms from human-assigned matches and determines a Linear Least Squares Fit (LLSF) mapping function which represents weighted connections between words in the texts and the canonical terms."
            },
            "venue": {
                "fragments": [],
                "text": "COLING"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46286298"
                        ],
                        "name": "Y. Yang",
                        "slug": "Y.-Yang",
                        "structuredName": {
                            "firstName": "Y",
                            "lastName": "Yang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Yang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1792682"
                        ],
                        "name": "C. Chute",
                        "slug": "C.-Chute",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Chute",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Chute"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "feedback is not applicable), LLSF has significantly outperformed surface-based mat thing and thesaurus- based matching [3] [8] [ 13 ]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "other retrieval and categorization systems [5] [8] [12] [ 13 ]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 8016764,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3dc8dd7e7f50401e89c55d9579161c2e73887814",
            "isKey": false,
            "numCitedBy": 33,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Words or Concepts, which are a better choice for indexing the contents of documents? The answer depends on what method is used for retrieval. This paper studies the effects of using canonical concepts versus document words in different retrieval systems with a testing collection of MEDLINE documents. In our tests, for a retrieval system which does not use any human knowledge, using words yielded better retrieval results, while using concepts suffered from a vocabulary difference between canonical expressions of concepts and non-canonical words in queries or documents. For a system which depends on the UMLS synonym set for a mapping from queries or documents to canonical concepts, the retrieval results were slightly better than the case of not using the synonyms, but still worse than the systems using words. For the systems which automatically \"learn\" empirical connections between words and concepts from examples in the testing collection, the vocabulary problem was effectively solved, and the results of using concepts were competitive or better, compared to those using words."
            },
            "slug": "Words-or-concepts:-the-features-of-indexing-units-Yang-Chute",
            "title": {
                "fragments": [],
                "text": "Words or concepts: the features of indexing units and their optimal use in information retrieval."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "In tests, for a retrieval system which does not use any human knowledge, using words yielded better retrieval results, while using concepts suffered from a vocabulary difference between canonical expressions of concepts and non-canonical words in queries or documents."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. Symposium on Computer Applications in Medical Care"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688124"
                        ],
                        "name": "W. Hersh",
                        "slug": "W.-Hersh",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Hersh",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Hersh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1760869"
                        ],
                        "name": "D. Hickam",
                        "slug": "D.-Hickam",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hickam",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hickam"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2089238953"
                        ],
                        "name": "T. J. Leone",
                        "slug": "T.-J.-Leone",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Leone",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. J. Leone"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 142,
                                "start": 139
                            }
                        ],
                        "text": "As a result, no reliable improvements have been observed by using general-purpose thesauri compared to surface-based mat thing [2] [3] [4] [5]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 46,
                                "start": 43
                            }
                        ],
                        "text": "other retrieval and categorization systems [5] [8] [12] [13]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 46287429,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2b0cedb5913ee793b4f62f956845d80cf414c1ee",
            "isKey": false,
            "numCitedBy": 52,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "What is the best way to represent the content of documents in an information retrieval system? This study compares the retrieval effectiveness of five different methods for automated (machine-assigned) indexing using three test collections. The consistently best methods are those that use indexing based on the words that occur in the available text of each document. Methods used to map text into concepts from a controlled vocabulary showed no advantage over the word-based methods. This study also looked at an approach to relevance feedback which showed benefit for both word-based and concept-based methods."
            },
            "slug": "Words,-concepts,-or-both:-optimal-indexing-units-Hersh-Hickam",
            "title": {
                "fragments": [],
                "text": "Words, concepts, or both: optimal indexing units for automated information retrieval."
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "This study compares the retrieval effectiveness of five different methods for automated (machine-assigned) indexing using three test collections and looks at an approach to relevance feedback which showed benefit for both word-based and concept-based methods."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. Symposium on Computer Applications in Medical Care"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2058025776"
                        ],
                        "name": "David Haines",
                        "slug": "David-Haines",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Haines",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David Haines"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144456145"
                        ],
                        "name": "W. Bruce Croft",
                        "slug": "W.-Bruce-Croft",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Croft",
                            "middleNames": [
                                "Bruce"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Bruce Croft"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 0
                            }
                        ],
                        "text": "Haines and Croft [9] implemented \nrelevance feedback on simplified inference networks for text retrieval; Tzeras and Hartmann [10] proposed \na Bayesian belief network approach to text categorization."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 17
                            }
                        ],
                        "text": "Haines and Croft [9] implemented relevance feedback on simplified inference networks for text retrieval; Tzeras and Hartmann [10] proposed a Bayesian belief network approach to text categorization."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 200,
                                "start": 197
                            }
                        ],
                        "text": "Example-baaed matching methods include the relevance feedback approach [6], the Darmstadt Indexing Approach (DIA) [7], the Linear Least Squares Fit (LLSF) mapping [3] [8], Bayesian belief networks [9] [1 O], and neural networks [11]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 11
                            }
                        ],
                        "text": "Haines \nD., Croft B. Relevance Feedback and inference networks."
                    },
                    "intents": []
                }
            ],
            "corpusId": 5242812,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "67977b5f51a3cd57364f2b1e9bbcee7d6f3d4486",
            "isKey": true,
            "numCitedBy": 136,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": "Relevance feedback, which modifies queries using judgements of the relevance of a few, highly-ranked documents, has historically been an important method for increasing the performance of information retrieval systems. In this paper, we extend the inference network model introduced by Turtle and Croft to include relevance feedback techniques. The difference between relevance feedback on text abstracts and full text collections is studied. Preliminary results for relevance feedback on the structured queries supported by the inference net model are also reported."
            },
            "slug": "Relevance-feedback-and-inference-networks-Haines-Croft",
            "title": {
                "fragments": [],
                "text": "Relevance feedback and inference networks"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The inference network model introduced by Turtle and Croft is extended to include relevance feedback techniques, and the difference between relevance feedback on text abstracts and full text collections is studied."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334474"
                        ],
                        "name": "Kostas Tzeras",
                        "slug": "Kostas-Tzeras",
                        "structuredName": {
                            "firstName": "Kostas",
                            "lastName": "Tzeras",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kostas Tzeras"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145103447"
                        ],
                        "name": "S. Hartmann",
                        "slug": "S.-Hartmann",
                        "structuredName": {
                            "firstName": "Stephan",
                            "lastName": "Hartmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Hartmann"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "on simplified inference networks for text retrieval; Tzeras and Hartmann [ 10 ] proposed a Bayesian belief"
                    },
                    "intents": []
                }
            ],
            "corpusId": 2861704,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0a283fb395343cd26984425306ca24c85b09ccdb",
            "isKey": false,
            "numCitedBy": 165,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, a Bayesian inference network model for automatic indexing with index terms (descriptors) from a prescribed vocabulary is presented. It requires an indexing dictionary with rules mapping terms of the respective subject field onto descriptors and inverted lists for terms occuring in a set of documents of the subject field and descriptors manually assigned to these documents. The indexing dictionary can be derived automatically from a set of manually indexed documents. An application of the network model is described, followed by an indexing example and some experimental results about the indexing performance of the network model."
            },
            "slug": "Automatic-indexing-based-on-Bayesian-inference-Tzeras-Hartmann",
            "title": {
                "fragments": [],
                "text": "Automatic indexing based on Bayesian inference networks"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "A Bayesian inference network model for automatic indexing with index terms (descriptors) from a prescribed vocabulary is presented, followed by an indexing example and some experimental results about the indexing performance of the network model."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144169170"
                        ],
                        "name": "D. Harman",
                        "slug": "D.-Harman",
                        "structuredName": {
                            "firstName": "Donna",
                            "lastName": "Harman",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Harman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 138,
                                "start": 135
                            }
                        ],
                        "text": "As a result, no reliable improvements have been observed by using general-purpose thesauri compared to surface-based mat thing [2] [3] [4] [5]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 12675599,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "727c7527c3981db176d3357344bd00419309c633",
            "isKey": false,
            "numCitedBy": 201,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "The first Text REtrieval Conference (TREC-1) was held in early November 1992 and was attended by about 100 people working in the 25 participating groups. The goal of the conference was to bring research groups together to discuss their work on a new large test collection. There was a large variety of retrieval techniques reported on, including methods using automatic thesaurii, sophisticated term weighting, natural language techniques, relevance feedback, and advanced pattern matching. As results had been run through a common evaluation package, groups were able to compare the effectiveness of different techniques, and discuss how differences among the sytems affected performance."
            },
            "slug": "Overview-of-the-first-TREC-conference-Harman",
            "title": {
                "fragments": [],
                "text": "Overview of the first TREC conference"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "There was a large variety of retrieval techniques reported on, including methods using automatic thesaurii, sophisticated term weighting, natural language techniques, relevance feedback, and advanced pattern matching."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1703148"
                        ],
                        "name": "N. Fuhr",
                        "slug": "N.-Fuhr",
                        "structuredName": {
                            "firstName": "Norbert",
                            "lastName": "Fuhr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Fuhr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145103447"
                        ],
                        "name": "S. Hartmann",
                        "slug": "S.-Hartmann",
                        "structuredName": {
                            "firstName": "Stephan",
                            "lastName": "Hartmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Hartmann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2084356644"
                        ],
                        "name": "G. Lustig",
                        "slug": "G.-Lustig",
                        "structuredName": {
                            "firstName": "Gerhard",
                            "lastName": "Lustig",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Lustig"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1959019"
                        ],
                        "name": "M. Schwantner",
                        "slug": "M.-Schwantner",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Schwantner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Schwantner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334474"
                        ],
                        "name": "Kostas Tzeras",
                        "slug": "Kostas-Tzeras",
                        "structuredName": {
                            "firstName": "Kostas",
                            "lastName": "Tzeras",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kostas Tzeras"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2084310078"
                        ],
                        "name": "Gerhard Knorz",
                        "slug": "Gerhard-Knorz",
                        "structuredName": {
                            "firstName": "Gerhard",
                            "lastName": "Knorz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gerhard Knorz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 15004699,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f61812ea95500993fada9f12c23577d2ba670d33",
            "isKey": false,
            "numCitedBy": 102,
            "numCiting": 56,
            "paperAbstract": {
                "fragments": [],
                "text": "AIR/X is a rule-based system for indexing with terms (descriptors) from a prescribed vocabulary. For this task, an indexing dictionary with rules for mapping terms from the text onto descriptors is required, which can be derived automatically from a set of manually indexed documents. Based on the Darmstadt Indexing Approach, the indexing task is divided into a description step and a decision step. First, terms (single words or phrases) are identiied in the document text. With term-descriptor rules from the dictionary, descriptor indications are formed. The set of all indications from a document leading to the same descriptor is called a relevance description. A probabilistic classiication procedure computes indexing weights for each relevance description. Since the whole system is rule-based, it can be adapted to diierent subject elds by appropriate modiications of the rule bases. A major application of AIR/X is the AIR/PHYS system developed for a large physics database. This application is described in more detail along with experimental results."
            },
            "slug": "AIR/X-A-rule-based-multistage-indexing-system-for-Fuhr-Hartmann",
            "title": {
                "fragments": [],
                "text": "AIR/X - A rule-based multistage indexing system for Iarge subject fields"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "A rule-based system for indexing with terms (descriptors) from a prescribed vocabulary, AIR/X is the AIR/PHYS system developed for a large physics database and can be adapted to diierent subject elds by appropriate modiications of the rule bases."
            },
            "venue": {
                "fragments": [],
                "text": "RIAO"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688124"
                        ],
                        "name": "W. Hersh",
                        "slug": "W.-Hersh",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Hersh",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Hersh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1760869"
                        ],
                        "name": "D. Hickam",
                        "slug": "D.-Hickam",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hickam",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hickam"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145891332"
                        ],
                        "name": "R. Haynes",
                        "slug": "R.-Haynes",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haynes",
                            "middleNames": [
                                "Brian"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haynes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5193506"
                        ],
                        "name": "K. McKibbon",
                        "slug": "K.-McKibbon",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "McKibbon",
                            "middleNames": [
                                "Ann"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. McKibbon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 202,
                                "start": 199
                            }
                        ],
                        "text": "MEDLINE, for example, the world’s largest and most frequently used on-line bibliographic database, spends over two million dollars per year for the manual categorization of about 350,000 new entries [1]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 7026483,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b717fc4373e3bc4a4b895198c4b5900e249aa82a",
            "isKey": false,
            "numCitedBy": 35,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "An analysis of SAPHIRE, an experimental information retrieval system featuring automated indexing and natural language retrieval, was performed on MEDLINE references using data previously generated for a MEDLINE evaluation. Compared with searches performed by novice and expert physicians using MEDLINE, SAPHIRE achieved comparable recall and precision. While its combined recall and precision performance did not equal the level of librarians, SAPHIRE did achieve a significantly higher level of absolute recall. SAPHIRE has other potential advantages over existing MEDLINE systems. Its natural language interface does not require knowledge of MeSH, and it provides relevance ranking of retrieved references."
            },
            "slug": "Evaluation-of-SAPHIRE:-an-automated-approach-to-and-Hersh-Hickam",
            "title": {
                "fragments": [],
                "text": "Evaluation of SAPHIRE: an automated approach to indexing and retrieving medical literature."
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "An analysis of SAPHIRE, an experimental information retrieval system featuring automated indexing and natural language retrieval, was performed on MEDLINE references using data previously generated for a MEDLINE evaluation."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. Symposium on Computer Applications in Medical Care"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1797808"
                        ],
                        "name": "G. Salton",
                        "slug": "G.-Salton",
                        "structuredName": {
                            "firstName": "Gerard",
                            "lastName": "Salton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Salton"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44521016,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "36b3711f06725def5884d9d9a48ad689d8187149",
            "isKey": false,
            "numCitedBy": 712,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "Recent developments in the storage, retrieval, and manipulation of large text files are described. The text analysis problem is examined, and modern approaches leading to the identification and retrieval of selected text items in response to search requests are discussed."
            },
            "slug": "Developments-in-Automatic-Text-Retrieval-Salton",
            "title": {
                "fragments": [],
                "text": "Developments in Automatic Text Retrieval"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The text analysis problem is examined, and modern approaches leading to the identification and retrieval of selected text items in response to search requests are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1797808"
                        ],
                        "name": "G. Salton",
                        "slug": "G.-Salton",
                        "structuredName": {
                            "firstName": "Gerard",
                            "lastName": "Salton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Salton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144009691"
                        ],
                        "name": "C. Buckley",
                        "slug": "C.-Buckley",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Buckley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Buckley"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 74,
                                "start": 71
                            }
                        ],
                        "text": "Example-baaed matching methods include the relevance feedback approach [6], the Darmstadt Indexing Approach (DIA) [7], the Linear Least Squares Fit (LLSF) mapping [3] [8], Bayesian belief networks [9] [1 O], and neural networks [11]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 17637032,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "2ebb3dd597bbd7028d8c68bcf509e5bb09ea1e78",
            "isKey": false,
            "numCitedBy": 1442,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "Relevance feedback is an automatic process, introduced over 20 years ago, designed to produce query formulations following an initial retrieval operation. The principal relevance feedback methods described over the years are examined briefly, and evaluation data are included to demonstrate the effectiveness of the various methods. Prescriptions are given for conducting text retrieval operations iteratively using relevance feedback."
            },
            "slug": "Improving-retrieval-performance-by-relevance-Salton-Buckley",
            "title": {
                "fragments": [],
                "text": "Improving retrieval performance by relevance feedback"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Prescriptions are given for conducting text retrieval operations iteratively using relevance feedback, and evaluation data are included to demonstrate the effectiveness of the various methods."
            },
            "venue": {
                "fragments": [],
                "text": "J. Am. Soc. Inf. Sci."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107261059"
                        ],
                        "name": "S. K. Wong",
                        "slug": "S.-K.-Wong",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Wong",
                            "middleNames": [
                                "K.",
                                "Michael"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. K. Wong"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107740709"
                        ],
                        "name": "Y. Cai",
                        "slug": "Y.-Cai",
                        "structuredName": {
                            "firstName": "Y.",
                            "lastName": "Cai",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Cai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698696"
                        ],
                        "name": "Yiyu Yao",
                        "slug": "Yiyu-Yao",
                        "structuredName": {
                            "firstName": "Yiyu",
                            "lastName": "Yao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yiyu Yao"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "network [ 11 ] for learning term associations, and demonstrated its use on a small retrieval data set (32"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "belief networks [9] [1 O], and neural networks [ 11 ]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 28722629,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "adcd93653af210d06c7aef3d9a0a3ddb898ab931",
            "isKey": false,
            "numCitedBy": 60,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper suggests a method for computing term associations based on an adaptive bilinear retrieval model. Such a model can be implemented by using a three-layer feedforward neural network. Term associations are modeled by weighted links connecting different neurons, and are derived by the perception learning algorithm without the need for introducing any ad hoc parameters. The preliminary results indicate the usefulness of neural networks in the design of adaptive information retrieval systems."
            },
            "slug": "Computation-of-term-associations-by-a-neural-Wong-Cai",
            "title": {
                "fragments": [],
                "text": "Computation of term associations by a neural network"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "The preliminary results indicate the usefulness of neural networks in the design of adaptive information retrieval systems and the need for introducing any ad hoc parameters."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145891332"
                        ],
                        "name": "R. Haynes",
                        "slug": "R.-Haynes",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haynes",
                            "middleNames": [
                                "Brian"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haynes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5193506"
                        ],
                        "name": "K. McKibbon",
                        "slug": "K.-McKibbon",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "McKibbon",
                            "middleNames": [
                                "Ann"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. McKibbon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2145995"
                        ],
                        "name": "C. Walker",
                        "slug": "C.-Walker",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Walker",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Walker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2127651891"
                        ],
                        "name": "N. Ryan",
                        "slug": "N.-Ryan",
                        "structuredName": {
                            "firstName": "Nick",
                            "lastName": "Ryan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Ryan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48561438"
                        ],
                        "name": "D. Fitzgerald",
                        "slug": "D.-Fitzgerald",
                        "structuredName": {
                            "firstName": "Dorothy",
                            "lastName": "Fitzgerald",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Fitzgerald"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38308094"
                        ],
                        "name": "M. Ramsden",
                        "slug": "M.-Ramsden",
                        "structuredName": {
                            "firstName": "M",
                            "lastName": "Ramsden",
                            "middleNames": [
                                "F"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Ramsden"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35031585,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "adfe69b367f335ab8aabdc40dfadbff46597940c",
            "isKey": false,
            "numCitedBy": 259,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "STUDY OBJECTIVE\nWe introduced self-service access to the medical literature database, MEDLINE, into clinical settings to assess the frequency, patterns, purposes, and success of use.\n\n\nDESIGN\nLongitudinal descriptive study.\n\n\nSETTING\nInpatient and outpatient services of a university medical center.\n\n\nPARTICIPANTS\nAll trainees and attending staff working at the service sites were invited to participate; 158 (84%) did so.\n\n\nINTERVENTIONS\nFree online access was provided to MEDLINE through GRATEFUL MED software. Participants were offered a 2-hour introduction to online searching and 2 hours of free search time.\n\n\nMEASUREMENTS AND MAIN RESULTS\nFor each search, a computer program requested identification of the user and the question to be addressed. Search transactions were recorded automatically. Interviews were conducted after a random sample of searches, and search questions were given to more expert searchers to run for comparison with the original. Eighty-one percent of participants did searches on study computers, at a mean rate of 2.7 searches per month. On comparison searches, participants retrieved 55% of the number of relevant articles retrieved by reference librarians (P = 0.024) and 50% more irrelevant articles (P less than 0.001). Forty-seven percent of searches on patient problems affected clinical decisions, but often on scanty information.\n\n\nCONCLUSIONS\nMEDLINE searching from clinical settings is feasible with brief training and affects clinical decisions. However, inexperienced searchers miss many relevant citations and search inefficiently. Further studies are needed to assess the impact of searching on physician performance and patient care."
            },
            "slug": "Online-access-to-MEDLINE-in-clinical-settings.-A-of-Haynes-McKibbon",
            "title": {
                "fragments": [],
                "text": "Online access to MEDLINE in clinical settings. A study of use and usefulness."
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "Self-service access to the medical literature database, MEDLINE, into clinical settings is feasible with brief training and affects clinical decisions, however, inexperienced searchers miss many relevant citations and search inefficiently."
            },
            "venue": {
                "fragments": [],
                "text": "Annals of internal medicine"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145891332"
                        ],
                        "name": "R. Haynes",
                        "slug": "R.-Haynes",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haynes",
                            "middleNames": [
                                "Brian"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haynes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5193506"
                        ],
                        "name": "K. McKibbon",
                        "slug": "K.-McKibbon",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "McKibbon",
                            "middleNames": [
                                "Ann"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. McKibbon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2145995"
                        ],
                        "name": "C. Walker",
                        "slug": "C.-Walker",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Walker",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Walker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2127651891"
                        ],
                        "name": "N. Ryan",
                        "slug": "N.-Ryan",
                        "structuredName": {
                            "firstName": "Nick",
                            "lastName": "Ryan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Ryan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48561438"
                        ],
                        "name": "D. Fitzgerald",
                        "slug": "D.-Fitzgerald",
                        "structuredName": {
                            "firstName": "Dorothy",
                            "lastName": "Fitzgerald",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Fitzgerald"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38308094"
                        ],
                        "name": "M. Ramsden",
                        "slug": "M.-Ramsden",
                        "structuredName": {
                            "firstName": "M",
                            "lastName": "Ramsden",
                            "middleNames": [
                                "F"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Ramsden"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 68016831,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "369d81cc3a8d91cd80b3c9394f10900849f915d5",
            "isKey": false,
            "numCitedBy": 71,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract Study Objective:We introduced self-service access to the medical literature database, MEDLINE, into clinical settings to assess the frequency, patterns, purposes, and success of use. Desig..."
            },
            "slug": "Online-access-to-medline-in-clinical-settings-Haynes-McKibbon",
            "title": {
                "fragments": [],
                "text": "Online access to medline in clinical settings"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "Self-service access to the medical literature database, MEDLINE, was introduced into clinical settings to assess the frequency, patterns, purposes, and success of use."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1797808"
                        ],
                        "name": "G. Salton",
                        "slug": "G.-Salton",
                        "structuredName": {
                            "firstName": "Gerard",
                            "lastName": "Salton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Salton"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "term frequency (TF), Inverse Document Frequency (IDF), and the combination TF xIDF [ 14 ]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 34382228,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3f2f6772d96d972e3b2da5aaa8a0f2feefdf827f",
            "isKey": false,
            "numCitedBy": 3884,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Automatic-Text-Processing:-The-Transformation,-and-Salton",
            "title": {
                "fragments": [],
                "text": "Automatic Text Processing: The Transformation, Analysis, and Retrieval of Information by Computer"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 10,
            "methodology": 5,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 16,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Expert-network:-effective-and-efficient-learning-in-Yang/bc8e59e4c7c2cbb6695ee5488aa569780449b212?sort=total-citations"
}