{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737063"
                        ],
                        "name": "I. Daubechies",
                        "slug": "I.-Daubechies",
                        "structuredName": {
                            "firstName": "Ingrid",
                            "lastName": "Daubechies",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Daubechies"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9718015,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "913352b1422fcea77b5b4cfe2300596515f92eec",
            "isKey": false,
            "numCitedBy": 589,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "The author defines a set of operators which localize in both time and frequency. These operators are similar to but different from the low-pass time-limiting operator, the singular functions of which are the prolate spheroidal wave functions. The author's construction differs from the usual approach in that she treats the time-frequency plane as one geometric whole (phase space) rather than as two separate spaces. For disk-shaped or ellipse-shaped domains in time-frequency plane, the associated localization operators are remarkably simple. Their eigenfunctions are Hermite functions, and the corresponding eigenvalues are given by simple explicit formulas involving the incomplete gamma functions. >"
            },
            "slug": "Time-frequency-localization-operators:-A-geometric-Daubechies",
            "title": {
                "fragments": [],
                "text": "Time-frequency localization operators: A geometric phase space approach"
            },
            "tldr": {
                "abstractSimilarityScore": 91,
                "text": "The author defines a set of operators which localize in both time and frequency, similar to but different from the low-pass time-limiting operator, the singular functions of which are the prolate spheroidal wave functions."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2052863"
                        ],
                        "name": "T. Claasen",
                        "slug": "T.-Claasen",
                        "structuredName": {
                            "firstName": "Theo",
                            "lastName": "Claasen",
                            "middleNames": [
                                "A.",
                                "C.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Claasen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "98206069"
                        ],
                        "name": "W. Mecklenbrauker",
                        "slug": "W.-Mecklenbrauker",
                        "structuredName": {
                            "firstName": "Wolfgang",
                            "lastName": "Mecklenbrauker",
                            "middleNames": [
                                "F.",
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Mecklenbrauker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 26861255,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aaaa54b49fd67a483a5547b54aa96426db6a3e1d",
            "isKey": false,
            "numCitedBy": 1052,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "In this second part of the paper the Wigner distribution is adapted to the case of discrete-time signals. It is shown that most of the properties of this time-frequency signal representation carry over directly to the discrete-time case, but some.others cause problems. These problems are associated with the fact that in general the Wigner distribution of a discrete-time signal contains aliasing contributions. It is indicated that these aliasing components will not be present if the signal is either oversampled by a factor of at least two, or is analytic. 1. Introduetion In part I of this paper 1) the Wigner distribution (WD) of continuous-time signals was discussed, and it was shown that this function has some very interesting properties. The determination of this distribution function requires, like the spectrum, an integral of the Fourier type to be evaluated. Ideally this requires the signal to be known for all. time, but in practice windowing techniques can be used to relax this requirement. The effects of windowing on the WD were discussed in part 1. In general two different approaches can be distinguished to compute these Fourier-type integrals. The first is by means of analogue signal processing, and recently optical signal processing methods have been proposed for determining suitable approximations to the WD 2). The second approach is based on digital signal processing. This opens the way to apply computationally efficient methods for evaluating the discrete Fourier transform, but requires the concept of the Wigner distribution to be transferred to the case of discretetime signals. This is the aim of this part of the paper. As can be expected, the WD for discrete-time signals shows much similarity with that for continuous-time signals, but in some respects it has characteristic differences. To emphasize the similarities and point out the differences we will try to follow as closely as possible the same lines as in part I, and give comments only on those results that differ from that of the continuous-time counterpart. 276 Phillps Journalof Research Vol.35 Nos.4/5 1980 Philips Journalof Research Vol.35 Nos.4/5 1980 277 The Wigner distribution Also the numbering of the equations is made such that corresponding equations have the same number. This has the consequence that sometimes equation numbers are not successive if equations have been deleted, and that equations that do not occur in part I have a special numbering. If reference is made to an equation in part I the equation is given the prefix I. All sections, except sec. 7, have the same topic and heading as in part I. Section 7, which in part I deals with the WD of band-limited signals, now deals with the WD of finite duration sequences. Equations in this section do not correspond in general with an equation of part I. 2. The Wigner distribution for discrete-time signals 2.1 Preliminaries In this paper Weconsider in general complex valued, discrete-time signals f(n), feC, n e Z for which the (Fourier) spectrum is defined by 3) 00 F(e) = (fJdf) (e) = L f(n) e -jnlJ. (2.l.a) n=-c:o The inverse transform is given by 11 f(n) = (fJd-l F) (n) = _1_ J F(e) ejnlJ de, 21t (2.l.b) -11 Inner products are defined for the signals and spectra by 00 (I, g) = L f(n) g*(n) (2.2.a) n=-oo and 11 (F, G) = _1 J F(e) G*(e) de 21t (2.2.b) -11 respectively. Norms and Parseval's relation are then the same as in eqs (1.2.3) and (1.2.4) respectively. The following operators will be used. The shift operator for the signals (9{f) (n) = f(n k), kEZ (2.5.a) and for the spectrum (.9'cF) (e) = F(e C), CE R, (complex) modulation in the time domain T. A. C. M. Claasen and W. F. G. Mecklenbrauker ( .At!!,!) (n) = f (n) ein!!, and in the frequency domain . c;«; F) (0) = F(O) einD ceR (2.6.a) neZ, (2.6.b) differentiation of the spectrum 1 (fi))F) (0) = -;-F 1(0), J (2.7) multiplication by the running variable (Rlf) (n) = nf(n), (2.8) time reversal (f!JlJ)(n) = f( -nl· (2.9) There are several different ways to link analogue and. digital signals and systems, and hence a variety of ways to define a discrete-time version of the Wigner distribution. What one would like with such a definition is (1) to obtain a simple concept; (2) to retain as many as possible of the properties of the WD of continuoustime signals; (3) to find a simple relation between the discrete-time and continuous-time WD's for discrete-time signals that are obtained by sampling of analogue signals. The definition which, in our opinion, best matches these requirements is the one suggested by eq. (1.7.10). 2.2. Definition of the Wigner distribution The cross-Wigner distribution of two discrete-time signals f(n) and g(n) is defined by 00 u-j,g(n, 0) = 2 L e-i2kDf(n + k)g*(n kl. (2.10) k=-oo The autoWigner distribution of a signal is then given by 00 u-j(n, 0) = Wj,f(n, 0) = 2 L e-i2kDf(n+k)f*(n kl. (2.11) k=-oo Both functions will be called a Wigner distribution (WD). Aiming at obtaining a relation similar to (1.2.13) the WD for the spectra must be defined by 278 Philips Journalor Research Vol.35 Nos.4/5 1980 The Wigner distribution so that 11 wF,G(e, n)= ~ J et; F(e + C) G*(e C) dc (2.12)"
            },
            "slug": "THE-WIGNER-DISTRIBUTION-A-TOOL-FOR-TIME-FREQUENCY-Claasen-Mecklenbrauker",
            "title": {
                "fragments": [],
                "text": "THE WIGNER DISTRIBUTION - A TOOL FOR TIME-FREQUENCY SIGNAL ANALYSIS"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "In this second part of the paper the Wigner distribution is adapted to the case of discrete-time signals, and it is shown that most of the properties of this time-frequency signal representation carry over directly to the discrete- time case, but some cause problems."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737063"
                        ],
                        "name": "I. Daubechies",
                        "slug": "I.-Daubechies",
                        "structuredName": {
                            "firstName": "Ingrid",
                            "lastName": "Daubechies",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Daubechies"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145256478"
                        ],
                        "name": "T. Paul",
                        "slug": "T.-Paul",
                        "structuredName": {
                            "firstName": "Thierry",
                            "lastName": "Paul",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Paul"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 43389010,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "cf03590ef3e9d2d68fd7544ba568fab9a47be42c",
            "isKey": false,
            "numCitedBy": 140,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Operators which localise both in time and frequency are constructed. They restrict to a finite time interval and cut off low as well as high frequencies (band-pass filters). Explicit expressions for eigenvalues and eigenfunctions (Laguerre functions) are given."
            },
            "slug": "Time-frequency-localisation-operators-a-geometric-Daubechies-Paul",
            "title": {
                "fragments": [],
                "text": "Time-frequency localisation operators-a geometric phase space approach: II. The use of dilations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746242"
                        ],
                        "name": "S. Mallat",
                        "slug": "S.-Mallat",
                        "structuredName": {
                            "firstName": "Stéphane",
                            "lastName": "Mallat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mallat"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17360391,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "37542b485661f7fcdfc17c165e997c87400df2fd",
            "isKey": false,
            "numCitedBy": 2123,
            "numCiting": 85,
            "paperAbstract": {
                "fragments": [],
                "text": "The author reviews recent multichannel models developed in psychophysiology, computer vision, and image processing. In psychophysiology, multichannel models have been particularly successful in explaining some low-level processing in the visual cortex. The expansion of a function into several frequency channels provides a representation which is intermediate between a spatial and a Fourier representation. The author describes the mathematical properties of such decompositions and introduces the wavelet transform. He reviews the classical multiresolution pyramidal transforms developed in computer vision and shows how they relate to the decomposition of an image into a wavelet orthonormal basis. He discusses the properties of the zero crossings of multifrequency channels. Zero-crossing representations are particularly well adapted for pattern recognition in computer vision. >"
            },
            "slug": "Multifrequency-channel-decompositions-of-images-and-Mallat",
            "title": {
                "fragments": [],
                "text": "Multifrequency channel decompositions of images and wavelet models"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The author describes the mathematical properties of such decompositions and introduces the wavelet transform, which relates to the decomposition of an image into a wavelet orthonormal basis."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Acoust. Speech Signal Process."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746242"
                        ],
                        "name": "S. Mallat",
                        "slug": "S.-Mallat",
                        "structuredName": {
                            "firstName": "Stéphane",
                            "lastName": "Mallat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mallat"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2356353,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b78626ce1a562c05b1c06f9c805e839f9760b9ab",
            "isKey": false,
            "numCitedBy": 20814,
            "numCiting": 87,
            "paperAbstract": {
                "fragments": [],
                "text": "Multiresolution representations are effective for analyzing the information content of images. The properties of the operator which approximates a signal at a given resolution were studied. It is shown that the difference of information between the approximation of a signal at the resolutions 2/sup j+1/ and 2/sup j/ (where j is an integer) can be extracted by decomposing this signal on a wavelet orthonormal basis of L/sup 2/(R/sup n/), the vector space of measurable, square-integrable n-dimensional functions. In L/sup 2/(R), a wavelet orthonormal basis is a family of functions which is built by dilating and translating a unique function psi (x). This decomposition defines an orthogonal multiresolution representation called a wavelet representation. It is computed with a pyramidal algorithm based on convolutions with quadrature mirror filters. Wavelet representation lies between the spatial and Fourier domains. For images, the wavelet representation differentiates several spatial orientations. The application of this representation to data compression in image coding, texture discrimination and fractal analysis is discussed. >"
            },
            "slug": "A-Theory-for-Multiresolution-Signal-Decomposition:-Mallat",
            "title": {
                "fragments": [],
                "text": "A Theory for Multiresolution Signal Decomposition: The Wavelet Representation"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is shown that the difference of information between the approximation of a signal at the resolutions 2/sup j+1/ and 2/Sup j/ can be extracted by decomposing this signal on a wavelet orthonormal basis of L/sup 2/(R/sup n/), the vector space of measurable, square-integrable n-dimensional functions."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398530308"
                        ],
                        "name": "R. Kronland-Martinet",
                        "slug": "R.-Kronland-Martinet",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Kronland-Martinet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kronland-Martinet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145515955"
                        ],
                        "name": "J. Morlet",
                        "slug": "J.-Morlet",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Morlet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Morlet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "100862406"
                        ],
                        "name": "A. Grossmann",
                        "slug": "A.-Grossmann",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Grossmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Grossmann"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 22642014,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bc02779ea500ca781d6f2f235ce0da6f39481f58",
            "isKey": false,
            "numCitedBy": 615,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper starts with a brief discussion of so-called wavelet transforms, i.e., decompositions of arbitrary signals into localized contributions labelled by a scale parameter. The main features of the method are first illustrated through simple mathematical examples. Then we present the first applications of the method to the recognition and visualisation of characteristic features of speech and of musical sounds."
            },
            "slug": "Analysis-of-Sound-Patterns-through-Wavelet-Kronland-Martinet-Morlet",
            "title": {
                "fragments": [],
                "text": "Analysis of Sound Patterns through Wavelet transforms"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The main features of so-called wavelet transforms are illustrated through simple mathematical examples and the first applications of the method to the recognition and visualisation of characteristic features of speech and of musical sounds are presented."
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Pattern Recognit. Artif. Intell."
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "96943691"
                        ],
                        "name": "Mj Martin Bastiaans",
                        "slug": "Mj-Martin-Bastiaans",
                        "structuredName": {
                            "firstName": "Mj",
                            "lastName": "Bastiaans",
                            "middleNames": [
                                "Martin"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mj Martin Bastiaans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121411206,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1669528da2d7d56bd8ae4c401c01ff48f44795b7",
            "isKey": false,
            "numCitedBy": 165,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The complex spectrogram of a signal is defined as the Fourier transform of the product of the signal and the shifted and complex conjugated version of a so-called window function; it is thus a function of time and frequency, simultaneously, from which the signal can be reconstructed uniquely. It is shown that the complex spectrogram is completely determined by its values on the points of a certain time-frequency lattice. This lattice is exactly the one suggested by Gabor in 1946; it arose in connection with Gabor's sugges-tion to expand a signal into a discrete set of Gaussian elementary signals. Such an expansion is a special case of the more general expansion of a signal into a discrete set of properly shifted and modulated window functions. It is shown that this expansion exists. Furthermore, a set of functions is constructed, which is bi-orthonormal to the set of shifted and modulated window functions. With the help of this bi-orthonormal set of functions, the expansion coefficients can be determined easily."
            },
            "slug": "A-Sampling-Theorem-For-The-Complex-Spectrogram,-And-Bastiaans",
            "title": {
                "fragments": [],
                "text": "A Sampling Theorem For The Complex Spectrogram, And Gabor's Expansion Of A Signal In Gaussian Elementary Signals"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145515955"
                        ],
                        "name": "J. Morlet",
                        "slug": "J.-Morlet",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Morlet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Morlet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "97899696"
                        ],
                        "name": "G. Arens",
                        "slug": "G.-Arens",
                        "structuredName": {
                            "firstName": "Georges",
                            "lastName": "Arens",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Arens"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2311427"
                        ],
                        "name": "E. Fourgeau",
                        "slug": "E.-Fourgeau",
                        "structuredName": {
                            "firstName": "Eliane",
                            "lastName": "Fourgeau",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Fourgeau"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102858639"
                        ],
                        "name": "D. Giard",
                        "slug": "D.-Giard",
                        "structuredName": {
                            "firstName": "Dominique",
                            "lastName": "Giard",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Giard"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 17991241,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "c10bfdd96c42eb866f169d14d5809dad8f639018",
            "isKey": false,
            "numCitedBy": 532,
            "numCiting": 86,
            "paperAbstract": {
                "fragments": [],
                "text": "Morlet et al (1982, this issue) showed the advantages of using complex values for both waves and characteristics of the media. We simulated the theoretical tools we present here, using the Goupillaud-Kunetz algorithm. Now we present sampling methods for complex signals or traces corresponding to received waves, and sampling methods for complex characterization of multilayered or heterogeneous media. Regarding the complex signals, we present a twodimecsional(2-D) method of sampling in the time-frequency domain using a special or “extended” Gabor expansion on a set of basic wavelets adapted to phase preservation. Such a 2-D expansion permits us to handle in a proper manner instantaneous frequency spectra. We show the differences between “wavelet resolution” and “sampling grid resolution.” We also show the importance of phase preservation in high-resolution seismic. Regarding the media, we show how analytical studies of wave propagation in periodic structured layers could help when trying to characterize the physical properties of the layers and their large scale granularity as a result of complex deconvolution. Analytical studies of wave propagation in periodic structures are well known in solid state physics, and lead to the so-called “Bloch waves.” The introduction of complex waves leads to replacing the classical wave equation by a Schriidinger equation. Finally, we show that complex wave equations, Gabor expansion, and Bloch waves are three different ways of ‘introducing the tools of quantum mechanics in highresolution seismic (Gabor, 1946; Kittel, 1976, Morlet, 1975). And conversely, the Goupillaud-Kunetz algorithm and an extended Gabor expansion may be of some use in solid state physics."
            },
            "slug": "Wave-propagation-and-sampling-theory—Part-II:-and-Morlet-Arens",
            "title": {
                "fragments": [],
                "text": "Wave propagation and sampling theory—Part II: Sampling theory and complex waves"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2272038"
                        ],
                        "name": "A. Arneodo",
                        "slug": "A.-Arneodo",
                        "structuredName": {
                            "firstName": "Alain",
                            "lastName": "Arneodo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Arneodo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3148236"
                        ],
                        "name": "G. Grasseau",
                        "slug": "G.-Grasseau",
                        "structuredName": {
                            "firstName": "Gilles",
                            "lastName": "Grasseau",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Grasseau"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2217430"
                        ],
                        "name": "M. Holschneider",
                        "slug": "M.-Holschneider",
                        "structuredName": {
                            "firstName": "Matthias",
                            "lastName": "Holschneider",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Holschneider"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 209,
                                "start": 205
                            }
                        ],
                        "text": "This same property also makes the wavelets a choice tool for the detection of singularities [27], [28], which is of great interest to the analysis of vision [29], [381, [40], and for the study of fractals [67]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 197437920,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "bfae6b933e78ad15d7a4d4641d51351ecd8e31fa",
            "isKey": false,
            "numCitedBy": 31,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "We present the wavelet transform as a mathematical microscope which is well suited for studying the local scaling properties of fractal measures. We apply this technique, recently introduced in signal analysis, to probability measures on self-similar Cantor sets, to the 2∞ cycle of period-doubling and to the golden-mean trajectories on two-tori at the onset of chaos. We emphasize the wide range of application of the wavelet transform which turns out to be a natural tool for characterizing the structural properties of fractal objects arising in a variety of physical situations."
            },
            "slug": "Wavelet-Transform-Analysis-of-Invariant-Measures-of-Arneodo-Grasseau",
            "title": {
                "fragments": [],
                "text": "Wavelet Transform Analysis of Invariant Measures of Some Dynamical Systems"
            },
            "tldr": {
                "abstractSimilarityScore": 79,
                "text": "The wavelet transform is presented as a mathematical microscope which is well suited for studying the local scaling properties of fractal measures and is applied to probability measures on self-similar Cantor sets, to the 2∞ cycle of period-doubling and to the golden-mean trajectories on two-tori at the onset of chaos."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746955"
                        ],
                        "name": "M. Bastiaans",
                        "slug": "M.-Bastiaans",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Bastiaans",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Bastiaans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123734237,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "996bc84d852e9adea2cc30886b14b4727d2f7e45",
            "isKey": false,
            "numCitedBy": 56,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The complex spectrogram of a signal φ(t) is defined by ∫φ(t)g*(t-to)exp[-iwot]dt ; it is, in fact, the Fourier transform of the product of the signal and the complex conjugated and shifted version of a so-called window function g(t). From the complex spectrogram the signal can be reconstructed uniquely. It is shown that the complex spectrogram is completely determined by its values on the points (to=mT, wo=nΩ), where ΩT= 2tt and m and n take all integer values. The lattice of points (mT,nΩ) is exactly the lattice suggested by Gabor as early as 1946; it arose in connection with Gabor's suggestion to expand a signal into a discrete set of Gaussian elementary signals. Such an expansion is a special case of the general expansion ∑∑mn amng(t-mT)exp[inΩt] of a signal into a discrete set of shifted and modulated window functions. It is shown that this expansion exists. Furthermore, a set of functions is constructed, which is bi-orthonormal to the set of shifted and modulated window functions. With the help of this bi-orthonormal set of functions, the expansion coefficients amn can be determined easily."
            },
            "slug": "Sampling-Theorem-For-The-Complex-Spectrogram,-And-A-Bastiaans",
            "title": {
                "fragments": [],
                "text": "Sampling Theorem For The Complex Spectrogram, And Gabor's Expansion Of A Signal In Gaussian Elementary Signals"
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2480110"
                        ],
                        "name": "D. Slepian",
                        "slug": "D.-Slepian",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Slepian",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Slepian"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35069689"
                        ],
                        "name": "H. Pollak",
                        "slug": "H.-Pollak",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Pollak",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Pollak"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122620691,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e9714646679cf66ac2aa3022846443dc8252d374",
            "isKey": false,
            "numCitedBy": 2263,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The theory developed in the preceding paper1 is applied to a number of questions about timelimited and bandlimited signals. In particular, if a finite-energy signal is given, the possible proportions of its energy in a finite time interval and a finite frequency band are found, as well as the signals which do the best job of simultaneous time and frequency concentration."
            },
            "slug": "Prolate-spheroidal-wave-functions,-fourier-analysis-Slepian-Pollak",
            "title": {
                "fragments": [],
                "text": "Prolate spheroidal wave functions, fourier analysis and uncertainty — II"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "100862406"
                        ],
                        "name": "A. Grossmann",
                        "slug": "A.-Grossmann",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Grossmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Grossmann"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118776334,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a872382fb8aadf098a3709340d9b30423f445ea4",
            "isKey": false,
            "numCitedBy": 70,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "A wavelet transform of a function is, roughly speaking, a description of this function across a range of scales. We use the technique of wavelet transforms to detect discontinuities in the n-th derivative of a function of one variable."
            },
            "slug": "Wavelet-Transforms-and-Edge-Detection-Grossmann",
            "title": {
                "fragments": [],
                "text": "Wavelet Transforms and Edge Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "This work uses the technique of wavelet transforms to detect discontinuities in the n-th derivative of a function of one variable to describe this function across a range of scales."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143801618"
                        ],
                        "name": "A. Janssen",
                        "slug": "A.-Janssen",
                        "structuredName": {
                            "firstName": "Ajem",
                            "lastName": "Janssen",
                            "middleNames": [
                                "Guido"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Janssen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 121695964,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9ffc8806f4e0cd0daaebc119ee31272b40140755",
            "isKey": false,
            "numCitedBy": 153,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Gabor-representation-of-generalized-functions-Janssen",
            "title": {
                "fragments": [],
                "text": "Gabor representation of generalized functions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737063"
                        ],
                        "name": "I. Daubechies",
                        "slug": "I.-Daubechies",
                        "structuredName": {
                            "firstName": "Ingrid",
                            "lastName": "Daubechies",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Daubechies"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 40265880,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "bc88c160efb6b66c3c54f5c8dffaa9f332b81ae6",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "We discuss expansions of L2-functions into {φmn; m,n∈Z}, where the φmn are generated from one function φ, either by translations in phase space, i.e. \\(\\phi _{mn} (x) = e^{imp_0 x} \\phi (x - nq_0 )\\), (p0, q0 fixed), or by translations and dilations, i.e. φmn(x)=a 0 −m/2 φ(a 0 −m x−nb0). These expansions can be used for phase space localization."
            },
            "slug": "Discrete-sets-of-coherent-states-and-their-use-in-Daubechies",
            "title": {
                "fragments": [],
                "text": "Discrete sets of coherent states and their use in signal analysis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "20417578"
                        ],
                        "name": "H. E. Jensen",
                        "slug": "H.-E.-Jensen",
                        "structuredName": {
                            "firstName": "Helge",
                            "lastName": "Jensen",
                            "middleNames": [
                                "Elbrønd"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. E. Jensen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9186675"
                        ],
                        "name": "T. Høholdt",
                        "slug": "T.-Høholdt",
                        "structuredName": {
                            "firstName": "Tom",
                            "lastName": "Høholdt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Høholdt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48906952"
                        ],
                        "name": "J. Justesen",
                        "slug": "J.-Justesen",
                        "structuredName": {
                            "firstName": "Jørn",
                            "lastName": "Justesen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Justesen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13955077,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "36fe2653a56347e7369780129c8b9b736334903c",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "Series representations of the form f(t) approximately Sigma /sub n=- infinity //sup infinity / Sigma /sub k=- infinity //sup infinity /a/sub n,k/ nu (t-n)/sub e//sup 2 pi /kts/ for bounded signals f(t) are studied, as are conditions on the unit function nu (t), such that coefficients a/sub n,k/ reveal the energy content of f(t) in the time interval n-(1/2) >"
            },
            "slug": "Double-series-representation-of-bounded-signals-Jensen-Høholdt",
            "title": {
                "fragments": [],
                "text": "Double series representation of bounded signals"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Series representations of the form f(t) approximately Sigma /sub n=- infinity //sup infinity / Sigma/sub k= infinity //Sup infinity /a/sub n,k/ nu (t-n)/sub e//sup 2 pi /kts/ for bounded signals f( t) are studied."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31590556"
                        ],
                        "name": "H. Landau",
                        "slug": "H.-Landau",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Landau",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Landau"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35069689"
                        ],
                        "name": "H. Pollak",
                        "slug": "H.-Pollak",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Pollak",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Pollak"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123670431,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4df515136295df5538247e8a1afccda338093a3c",
            "isKey": false,
            "numCitedBy": 1021,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The purpose of this paper is to examine the mathematical truth in the engineering intuition that there are approximately 2WT independent signals ϕ i of bandwidth W concentrated in an interval of length T. Roughly speaking, the result is true for the best choice of the ϕ i (prolate spheroidal wave functions), but not for sampling functions (of the form sin t/t). Some typical conclusions are: Let f(t), of total energy 1, be band-limited to bandwidth W, and let $\\int_{-t/2}^{t/2} \\vert f^{2}(t)\\vert dt = 1- \\epsilon_{T}^{2}$ . Then ${\\rm inf}\\limits_{\\{a_{i}\\}} \\int_{-\\infty}^{\\infty} \\left\\vert f(t)- \\sum_{0}^{[2WT]+N]} a_{n}\\varphi_{n}\\right\\vert^{2} dt \\lt C_{\\epsilon_{T}^{2}}$ is (a) true for all such f with N = 0, C = 12, if the ϕ n are the prolate spheroidal wave functions; (b) false for some such f for any finite constants N and C if the ϕ n are sampling functions."
            },
            "slug": "Prolate-spheroidal-wave-functions,-fourier-analysis-Landau-Pollak",
            "title": {
                "fragments": [],
                "text": "Prolate spheroidal wave functions, fourier analysis and uncertainty — III: The dimension of the space of essentially time- and band-limited signals"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1872232"
                        ],
                        "name": "W. Schempp",
                        "slug": "W.-Schempp",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Schempp",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Schempp"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6588219,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "5e11754df75435390f9feab1ac6036014e371d2a",
            "isKey": false,
            "numCitedBy": 54,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "The concept of linear Schrodinger representation of the real Heisenberg nilpotent group and its various realizations is used to link the theory of radar ambiguity functions with nilpotent harmonic analysis. This group-representation theoretic approach allows us to analyze the radar ambi- guity functions simultaneously in time and frequency. Moreover, it allows us to determine the group of all transformations that leave the radar ambiguity surfaces invariant and to specify all admissible envelope functions that belong to radar signals of the same finite energy. In particular, an investigation of the radial, i.e., S0(2, R)-invariant radar ambiguity surfaces, gives rise to an identity for Laguerre-Weber functions of different orders, which implies on its part an identity for holomorphic theta series. 1. The basic group that stands at the crossroads of quantum mechanics and radar analysis is the real Heisenberg nilpotent group A(R). Indeed, the connected, simply connected two-step nilpotent Lie group A(R) forms the group-theoretic embodiment of the Heisenberg canonical commutation relations of quantum mechanics (whence its name) which read at the Lie algebra level as follows:"
            },
            "slug": "Radar-ambiguity-functions,-the-Heisenberg-group,-Schempp",
            "title": {
                "fragments": [],
                "text": "Radar ambiguity functions, the Heisenberg group, and holomorphic theta series"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "100862406"
                        ],
                        "name": "A. Grossmann",
                        "slug": "A.-Grossmann",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Grossmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Grossmann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145515955"
                        ],
                        "name": "J. Morlet",
                        "slug": "J.-Morlet",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Morlet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Morlet"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 48492243,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "da158644dbb23417682d915bf4bbfa934ae7f323",
            "isKey": false,
            "numCitedBy": 3330,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "An arbitrary square integrable real-valued function (or, equivalently, the associated Hardy function) can be conveniently analyzed into a suitable family of square integrable wavelets of constant shape, (i.e. obtained by shifts and dilations from any one of them.) The resulting integral transform is isometric and self-reciprocal if the wavelets satisfy an “admissibility condition” given here. Explicit expressions are obtained in the case of a particular analyzing family that plays a role analogous to that of coherent states (Gabor wavelets) in the usual $L_2 $ -theory. They are written in terms of a modified $\\Gamma $-function that is introduced and studied. From the point of view of group theory, this paper is concerned with square integrable coefficients of an irreducible representation of the nonunimodular $ax + b$-group."
            },
            "slug": "DECOMPOSITION-OF-HARDY-FUNCTIONS-INTO-SQUARE-OF-Grossmann-Morlet",
            "title": {
                "fragments": [],
                "text": "DECOMPOSITION OF HARDY FUNCTIONS INTO SQUARE INTEGRABLE WAVELETS OF CONSTANT SHAPE"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49750929"
                        ],
                        "name": "C. Chen",
                        "slug": "C.-Chen",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Chen",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Chen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35781764,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "5e5f685818fce068b26468a74acb3bd74caa59de",
            "isKey": false,
            "numCitedBy": 63,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Overview.- 1. A Common Framework for Acoustic Signal Analysis in the Ocean Environment.- Pattern Recognition Processing.- 2. Application of Signal Processing and Pattern Recognition to Underwater Acoustics.- 3. Acoustical Classification of the Sea Floor.- Artificial Intelligence Approach.- 4. Machine Analysis of Acoustical Signals.- Issues in Array Processing and Target Motion Analysis.- 5. Problems of Spatial Signal Processing in Shallow Water.- 6. Geometric Aspects in Array Processing.- 7. Adaptive Range Tracking of Underwater Maneuvering Targets Using Passive Measurements.- 8. Bearing Estimation Using Random Arrays.- 9. How VHF Acoustics Can Help Process Underwater Acoustic Signals.- Underwater Channel Characterization.- 10. Characterization of the Underwater Channel Application to Communication.- Issues in Seismic Signal Processing.- 11. Multidimensional Filtering of Acoustic Records in Seismic Signal Processing.- 12. Sampling Theory and Wave Propagation.- Image Processing.- 13. Implementation of Image Enhancement and Least Squares Filtering Techniques for Acoustic Data.- 14. Digital Processing of Time Varying Images.- 15. The Template Edge Detector and Its Performance.- 16. On a Spatial Clustering Algorithm for Image Analysis.- 17. Digital Image Processing by Means of Generalized Scale-Invariant Filters.- Report of Discussion Session on Unresolved Issues and Future Directions.- List of Participants."
            },
            "slug": "Issues-in-Acoustic-Signal-—-Image-Processing-and-Chen",
            "title": {
                "fragments": [],
                "text": "Issues in Acoustic Signal — Image Processing and Recognition"
            },
            "venue": {
                "fragments": [],
                "text": "NATO ASI Series"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143801618"
                        ],
                        "name": "A. Janssen",
                        "slug": "A.-Janssen",
                        "structuredName": {
                            "firstName": "Ajem",
                            "lastName": "Janssen",
                            "middleNames": [
                                "Guido"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Janssen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 43065900,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9e65c1a1af046951be7c98e10b868a9ba0207f22",
            "isKey": false,
            "numCitedBy": 140,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "It is well known that completeness properties of sets of coherent states associated with lattices in \nthe phase plane can be proved by using the Bargmann representation or by using the kq \nrepresentation which was introduced by J. Zak. In this paper both methods are considered, in \nparticular, in connection with expansions of generalized functions in what are called Gabor \nseries. The setting consists of two spaces of generalized functions (tempered distributions and \nelements of the class S*) which appear in a natural way in the context of the Bargmann \ntransform. Also, a thorough mathematical investigation of the Zak transform is given. This \npaper contains many comments and complements on existing literature; in particular, \nconnections with the theory of interpolation of entire functions over the Gaussian integers are \ngiven."
            },
            "slug": "Bargmann-transform,-Zak-transform,-and-coherent-Janssen",
            "title": {
                "fragments": [],
                "text": "Bargmann transform, Zak transform, and coherent states"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746955"
                        ],
                        "name": "M. Bastiaans",
                        "slug": "M.-Bastiaans",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Bastiaans",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Bastiaans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46048775,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "a912d821750a5c5ca308a28faf8b234649b95cba",
            "isKey": false,
            "numCitedBy": 379,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "It is proved that Gabor's expansion of a signal into a discrete set of Gaussian elementary signals exists. An expansion into another discrete set of functions is defined, which functions are biorthonormal, to the Gaussian elementary signals. Hence, the expansion coefficients of the two expansions can be determined easily."
            },
            "slug": "Gabor's-expansion-of-a-signal-into-Gaussian-signals-Bastiaans",
            "title": {
                "fragments": [],
                "text": "Gabor's expansion of a signal into Gaussian elementary signals"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145926556"
                        ],
                        "name": "A. Janssen",
                        "slug": "A.-Janssen",
                        "structuredName": {
                            "firstName": "Augustus",
                            "lastName": "Janssen",
                            "middleNames": [
                                "J.",
                                "E.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Janssen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 711003,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "806fe3c4979b2b7a710145c1961394c24d56ec52",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "We compare Gabor representation and the Wigner distribution on their merits for the time-frequency description of signals."
            },
            "slug": "Gabor-representation-and-Wigner-distribution-of-Janssen",
            "title": {
                "fragments": [],
                "text": "Gabor representation and Wigner distribution of signals"
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "The Gabor representation and the Wigner distribution are compared on their merits for the time-frequency description of signals."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2480110"
                        ],
                        "name": "D. Slepian",
                        "slug": "D.-Slepian",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Slepian",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Slepian"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38083190,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "e5677df1c8cc5316921258fe83887866f3ab0acb",
            "isKey": false,
            "numCitedBy": 464,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "It is easy to argue that real signals must be bandlimited. It is also easy to argue that they cannot be so. This paper presents one possible resolution of this seeming paradox. A philosophical discussion of the role of mathematical models in the exact sciences is given and a new formulation of the 2 WT theorem is presented. The paper is a written version of the second Shannon Lecture given at the 1974 International Symposium on Information Theory. An appendix giving proof of the 2 WT theorem has been added."
            },
            "slug": "On-bandwidth-Slepian",
            "title": {
                "fragments": [],
                "text": "On bandwidth"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "This paper presents one possible resolution of this seeming paradox of real signals must be bandlimited and a philosophical discussion of the role of mathematical models in the exact sciences is given and a new formulation of the 2 WT theorem is presented."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153780484"
                        ],
                        "name": "R. Young",
                        "slug": "R.-Young",
                        "structuredName": {
                            "firstName": "ROBERT M.",
                            "lastName": "Young",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Young"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118828729,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e3c9cf9f83fb682175ad13091f950cca335a04b3",
            "isKey": false,
            "numCitedBy": 1420,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Bases in Banach Spaces - Schauder Bases Schauder's Basis for C[a,b] Orthonormal Bases in Hilbert Space The Reproducing Kernel Complete Sequences The Coefficient Functionals Duality Riesz Bases The Stability of Bases in Banach Spaces The Stability of Orthonormal Bases in Hilbert Space Entire Functions of Exponential Type The Classical Factorization Theorems - Weierstrass's Factorization Theorem Jensen's Formula Functions of Finite Order Estimates for Canonical Products Hadamard's Factorization Theorem Restrictions Along a Line - The \"Phragmen-Lindelof\" Method Carleman's Formula Integrability on a line The Paley-Wiener Theorem The Paley-Wiener Space The Completeness of Sets of Complex Exponentials - The Trigonometric System Exponentials Close to the Trigonometric System A Counterexample Some Intrinsic Properties of Sets of Complex Exponentials Stability Density and the Completeness Radius Interpolation and Bases in Hilbert Space - Moment Sequences in Hilbert Space Bessel Sequences and Riesz-Fischer Sequences Applications to Systems of Complex Exponentials The Moment Space and Its Relation to Equivalent Sequences Interpolation in the Paley-Wiener Space: Functions of Sine Type Interpolation in the Paley-Wiener Space: Stability The Theory of Frames The Stability of Nonharmonic Fourier Series Pointwise Convergence Notes and Comments References List of Special Symbols Index"
            },
            "slug": "An-introduction-to-nonharmonic-Fourier-series-Young",
            "title": {
                "fragments": [],
                "text": "An introduction to nonharmonic Fourier series"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737063"
                        ],
                        "name": "I. Daubechies",
                        "slug": "I.-Daubechies",
                        "structuredName": {
                            "firstName": "Ingrid",
                            "lastName": "Daubechies",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Daubechies"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "100862406"
                        ],
                        "name": "A. Grossmann",
                        "slug": "A.-Grossmann",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Grossmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Grossmann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2066341997"
                        ],
                        "name": "Y. Meyer",
                        "slug": "Y.-Meyer",
                        "structuredName": {
                            "firstName": "Yves",
                            "lastName": "Meyer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Meyer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122580835,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "adce76b61f39bec1492224887dc3dce0e0def560",
            "isKey": false,
            "numCitedBy": 1428,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "In a Hilbert space H, discrete families of vectors {hj} with the property that f=∑j〈hj‖ f〉hj for every f in H are considered. This expansion formula is obviously true if the family is an orthonormal basis of H, but also can hold in situations where the hj are not mutually orthogonal and are ‘‘overcomplete.’’ The two classes of examples studied here are (i) appropriate sets of Weyl–Heisenberg coherent states, based on certain (non‐Gaussian) fiducial vectors, and (ii) analogous families of affine coherent states. It is believed, that such ‘‘quasiorthogonal expansions’’ will be a useful tool in many areas of theoretical physics and applied mathematics."
            },
            "slug": "PAINLESS-NONORTHOGONAL-EXPANSIONS-Daubechies-Grossmann",
            "title": {
                "fragments": [],
                "text": "PAINLESS NONORTHOGONAL EXPANSIONS"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "17065947"
                        ],
                        "name": "Arnéodo",
                        "slug": "Arnéodo",
                        "structuredName": {
                            "firstName": "",
                            "lastName": "Arnéodo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Arnéodo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30040722"
                        ],
                        "name": "Grasseau",
                        "slug": "Grasseau",
                        "structuredName": {
                            "firstName": "",
                            "lastName": "Grasseau",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Grasseau"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30163818"
                        ],
                        "name": "Holschneider",
                        "slug": "Holschneider",
                        "structuredName": {
                            "firstName": "",
                            "lastName": "Holschneider",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Holschneider"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 12387723,
            "fieldsOfStudy": [
                "Physics",
                "Medicine"
            ],
            "id": "4f34e9a11994560b3377c481ab8d84658a3911df",
            "isKey": false,
            "numCitedBy": 278,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "On presente la transformation ondelette comme un microscope mathematique qui s'applique parfaitement a l'etude des proprietes d'echelle locales d'objets fractales. On applique cette technique aux mesures de probabilite sur des ensembles de Canter autosimilaires et aux trajectoires moyennes sur deux tores au debut du chaos"
            },
            "slug": "Wavelet-transform-of-multifractals.-Arnéodo-Grasseau",
            "title": {
                "fragments": [],
                "text": "Wavelet transform of multifractals."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Cette technique applique cette technique aux mesures de probabilite sur des ensembles de Canter autosimilaires and aux trajectoires moyennes sur de two tores au debut du chaos."
            },
            "venue": {
                "fragments": [],
                "text": "Physical review letters"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "91128745"
                        ],
                        "name": "R. Glauber",
                        "slug": "R.-Glauber",
                        "structuredName": {
                            "firstName": "Roy",
                            "lastName": "Glauber",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Glauber"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 125765224,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "b2b38172df23f130f864aca45a2f4e31bc76cb91",
            "isKey": false,
            "numCitedBy": 2420,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The concept of coherence that was conventionally used in optics is found to be inadequate to the needs of recently opened areas of experiment. To provide a fuller discussion of coherence, a succession of correlation functions for the complex field strengths is defined. The nth order function expresses the correlation of values of the fields at 2n different points of space and time. Certain values of these functions are measurable by means of n-fold delayed coincidence detection of photons. A fully coherent field is defined as one whose correlation functions satisfy an infinite succession of stated conditions. Various orders of incomplete coherence are distinguished, according to the number of coherence conditions actually satisfied. It is noted that the fields historically described as coherent in optics have only first-order coherence. On the other hand, the existence, in principle, of fields coherent to all orders is shown both in quantum theory and classical theory. The methods used in these discussions apply to fields of arbitrary time dependence. It is shown, as a result, that coherence does not require monochromaticity. Coherent fields can be generated with arbitrary spectra. (auth)"
            },
            "slug": "The-Quantum-Theory-of-Optical-Coherence-Glauber",
            "title": {
                "fragments": [],
                "text": "The Quantum Theory of Optical Coherence"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "91128745"
                        ],
                        "name": "R. Glauber",
                        "slug": "R.-Glauber",
                        "structuredName": {
                            "firstName": "Roy",
                            "lastName": "Glauber",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Glauber"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124794425,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "67ad332ceba3bcbcd490a3100481e18a98980817",
            "isKey": false,
            "numCitedBy": 4565,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Methods are developed for discussing the photon statistics of arbitrary radiation fields in fully quantummechanical terms. In order to keep the classical limit of quantum electrodynamics plainly in view, extensive use is made of the coherent states of the field. These states, which reduce the field correlation functions to factorized forms, are shown to offer a convenient basis for the description of fields of all types. Although they are not orthogonal to one another, the coherent states form a complete set. It is shown that any quantum state of the field may be expanded in terms of them in a unique way. Expansions are also developed for arbitrary operators in terms of products of the coherent state vectors. These expansions are discussed as a general method of representing the density operator for the field. A particular form is exhibited for the density operator which makes it possible to carry out many quantum- mechanical calculations by methods resembling those of classical theory. This representation permits clear insights into the essential distinction between the quantum and classical descriptions of the field. It leads, in addition, to a simple formulation of a superposition law for photon fields. Detailed discussions are given of themore » incoherent fields which are generated by superposing the outputs of many stationary sources. These fields are all shown to have intimately related propenties, some of which have been known for the particular case of blackbody radiation. (auth)« less"
            },
            "slug": "Coherent-and-incoherent-states-of-the-radiation-Glauber",
            "title": {
                "fragments": [],
                "text": "Coherent and incoherent states of the radiation field"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737063"
                        ],
                        "name": "I. Daubechies",
                        "slug": "I.-Daubechies",
                        "structuredName": {
                            "firstName": "Ingrid",
                            "lastName": "Daubechies",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Daubechies"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2727398,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1d08a2ba82c351add7caf7a69d5567b2fddb025d",
            "isKey": false,
            "numCitedBy": 8724,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "We construct orthonormal bases of compactly supported wavelets, with arbitrarily high regularity. The order of regularity increases linearly with the support width. We start by reviewing the concept of multiresolution analysis as well as several algorithms in vision decomposition and reconstruction. The construction then follows from a synthesis of these different approaches."
            },
            "slug": "Orthonormal-bases-of-compactly-supported-wavelets-Daubechies",
            "title": {
                "fragments": [],
                "text": "Orthonormal bases of compactly supported wavelets"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "This work construct orthonormal bases of compactly supported wavelets, with arbitrarily high regularity, by reviewing the concept of multiresolution analysis as well as several algorithms in vision decomposition and reconstruction."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "100862406"
                        ],
                        "name": "A. Grossmann",
                        "slug": "A.-Grossmann",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Grossmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Grossmann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145515955"
                        ],
                        "name": "J. Morlet",
                        "slug": "J.-Morlet",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Morlet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Morlet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145256478"
                        ],
                        "name": "T. Paul",
                        "slug": "T.-Paul",
                        "structuredName": {
                            "firstName": "Thierry",
                            "lastName": "Paul",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Paul"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122021104,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e247b5a7789f0dd215c1b363a82c352078149e5c",
            "isKey": false,
            "numCitedBy": 424,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Let G be a locally compact group, which need not be unimodular. Let x→U(x) (x∈G) be an irreducible unitary representation of G in a Hilbert space H(U). Assume that U is square integrable, i.e., that there exists in H(U) at least one nonzero vector g such that ∫‖(U(x)g,g)‖2 dx<∞. We give here a reasonably self‐contained analysis of the correspondence associating to every vector f∈H(U) the function (U(x)g,f) on G, discussing its isometry, characterization of the range, inversion, and simplest interpolation properties. This correspondence underlies many properties of generalized coherent states."
            },
            "slug": "Transforms-associated-to-square-integrable-group-I.-Grossmann-Morlet",
            "title": {
                "fragments": [],
                "text": "Transforms associated to square integrable group representations. I. General results"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2091131"
                        ],
                        "name": "E. Aslaksen",
                        "slug": "E.-Aslaksen",
                        "structuredName": {
                            "firstName": "Erik",
                            "lastName": "Aslaksen",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Aslaksen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48261790"
                        ],
                        "name": "J. Klauder",
                        "slug": "J.-Klauder",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Klauder",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Klauder"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121552703,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "2a26360f8eb56aa41609ef138afd4be76a2b5510",
            "isKey": false,
            "numCitedBy": 71,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a continuous representation theory based on the affine group. This theory is applicable to a mechanical system which has one or more of its classical canonical coordinates restricted to a smaller range than − ∞ to ∞. Such systems are especially troublesome in the usual quantization approach since, as is well known from von Neumann's work, the relation [P, Q] = −iI implies that P and Q must have a spectrum from − ∞ to ∞ if they are to be self‐adjoint. Consequently, if the spectrum of either P or Q is restricted, at least one of the operators, say Q, is not self‐adjoint and does not have a spectral resolution. Thus Q cannot generate a coordinate representation. This leads us to consider a different pair of operators, P and B, both of which are self‐adjoint and which obey [P, B] = −iP. The Lie group corresponding to this latter algebra is the affine group, which has two unitarily inequivalent, irreducible representations, one in which the spectrum of P is positive. Using the affine group as our ki..."
            },
            "slug": "Continuous-Representation-Theory-Using-the-Affine-Aslaksen-Klauder",
            "title": {
                "fragments": [],
                "text": "Continuous Representation Theory Using the Affine Group"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102782022"
                        ],
                        "name": "J. Zak",
                        "slug": "J.-Zak",
                        "structuredName": {
                            "firstName": "Joshua",
                            "lastName": "Zak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Zak"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121578311,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "d6108f7411dee39903387bdb70bc7e80c81290e4",
            "isKey": false,
            "numCitedBy": 144,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A quantum-mechanical representation is defined by means of finite translations in direct and reciprocal space. The eigenfunctions of the finite translations are found and their connection with Bloch functions and Wannier functions is established. The new representation is used for describing the motion of a Bloch electron in a magnetic and in an electric field. For the first problem, well-known results are reproduced in an extremely simple and natural way. It is also shown that the representation introduced in this paper gives a straightforward way to compare classical and quantum dynamics for a Bloch electron in external magnetic and electric fields."
            },
            "slug": "Dynamics-of-Electrons-in-Solids-in-External-Fields-Zak",
            "title": {
                "fragments": [],
                "text": "Dynamics of Electrons in Solids in External Fields"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143799348"
                        ],
                        "name": "Michael J. Davis",
                        "slug": "Michael-J.-Davis",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Davis",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Davis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3903136"
                        ],
                        "name": "E. Heller",
                        "slug": "E.-Heller",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Heller",
                            "middleNames": [
                                "J"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Heller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 97138628,
            "fieldsOfStudy": [
                "Chemistry"
            ],
            "id": "959dae89c60705570c68975d0ce3ba9c746d9882",
            "isKey": false,
            "numCitedBy": 223,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "We present theory and numerical results for a new method for obtaining eigenfunctions and eigenvalues of molecular vibrational wave functions. The method combines aspects of the semiclassical nature of vibrational motion and variational, ab initio techniques. Localized complex Gaussian wave functions, whose parameters are chosen according to classical phase space criteria are employed in standard numerical basis set diagonalization routines. The Gaussians are extremely convenient as regards construction of Hamiltonian matrix elements, computation of derived properties such as Franck–Condon factors, and interpretation of results in terms of classical motion. The basis set is not tied to any zeroth order Hamiltonian and is readily adaptable to arbitrary smooth potentials of any dimension."
            },
            "slug": "Semiclassical-Gaussian-basis-set-method-for-wave-Davis-Heller",
            "title": {
                "fragments": [],
                "text": "Semiclassical Gaussian basis set method for molecular vibrational wave functions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737063"
                        ],
                        "name": "I. Daubechies",
                        "slug": "I.-Daubechies",
                        "structuredName": {
                            "firstName": "Ingrid",
                            "lastName": "Daubechies",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Daubechies"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "100862406"
                        ],
                        "name": "A. Grossmann",
                        "slug": "A.-Grossmann",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Grossmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Grossmann"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 22042699,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "dc9282184346604dc9926f615ed1ee3cde2456a3",
            "isKey": false,
            "numCitedBy": 192,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "We look at the decomposition of arbitrary f in L2(R) in terms of the family of functions cp,,(x) = w-'/*exp{ - iimnab + iman - i(x - nb)2}, with a, b > 0. We derive bounds and explicit formulas for the minimal expansion coefficients in the case where ab = 2w/N, N an integer 2 2. Transported to the Hilbert space F of entire functions introduced by V. Bargmann, these results are expressed as inequalities of the form"
            },
            "slug": "Frames-in-the-Bargmann-Space-of-Entire-Functions-Daubechies-Grossmann",
            "title": {
                "fragments": [],
                "text": "Frames in the Bargmann Space of Entire Functions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "96384254"
                        ],
                        "name": "G. Battle",
                        "slug": "G.-Battle",
                        "structuredName": {
                            "firstName": "Guy",
                            "lastName": "Battle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Battle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "12666267"
                        ],
                        "name": "P. Federbush",
                        "slug": "P.-Federbush",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Federbush",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Federbush"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 121207160,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "723580cbbea8a7c81ec129d16cd36333917ebd5b",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "Y. Meyer has recently developed a particularly useful o.n. basis forL2(Rd). Expansions using this basis, i.e. expansions into “ondelettes” or “wavelets,” have yielded important new results in soft and hard analysis. The expansion into ondelettes of a boson scalar field naturally leads to phase cell cluster expansions, a formalism already developed by the authors using other related bases. Adoption of ondelettes expansions into the phase cell program gives improvements of some extant results, and excises an early error.Ondelettes lend more elegance to the phase cell cluster expansion of φ34, and to us are a vindication of the fundamental nature of this approach. This provides more promise for future developments."
            },
            "slug": "Ondelettes-and-phase-cell-cluster-expansions,-a-Battle-Federbush",
            "title": {
                "fragments": [],
                "text": "Ondelettes and phase cell cluster expansions, a vindication"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102782022"
                        ],
                        "name": "J. Zak",
                        "slug": "J.-Zak",
                        "structuredName": {
                            "firstName": "Joshua",
                            "lastName": "Zak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Zak"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117908134,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "750368a7bc47998ddb413c5ed44959a1fb8cb525",
            "isKey": false,
            "numCitedBy": 88,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Kq-Representation-in-the-Dynamics-of-Electrons-Zak",
            "title": {
                "fragments": [],
                "text": "The Kq-Representation in the Dynamics of Electrons in Solids"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102782022"
                        ],
                        "name": "J. Zak",
                        "slug": "J.-Zak",
                        "structuredName": {
                            "firstName": "Joshua",
                            "lastName": "Zak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Zak"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121250395,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "54c751a7e19f247dcade703b6c51007407d20041",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The $\\mathrm{kq}$ representation is used for defining lattice operators whose eigenvalues are all the discrete vectors of the direct and the reciprocal lattices in crystals. The eigenstates of the lattice operators form a complete and orthonormal set of localized functions in both the configuration and the momentum spaces. It is shown that these eigenstates can be chosen to be closely connected to either the free electron or the extremely tightly bound electron Wannier functions. The lattice operators turn out to be conjugate to the $k$ and $q$ coordinates."
            },
            "slug": "Lattice-operators-in-crystals-for-Bravais-and-Zak",
            "title": {
                "fragments": [],
                "text": "Lattice operators in crystals for Bravais and reciprocal vectors"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2091131"
                        ],
                        "name": "E. Aslaksen",
                        "slug": "E.-Aslaksen",
                        "structuredName": {
                            "firstName": "Erik",
                            "lastName": "Aslaksen",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Aslaksen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48261790"
                        ],
                        "name": "J. Klauder",
                        "slug": "J.-Klauder",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Klauder",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Klauder"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119897267,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f1f020a128a7fdef871087b4aea1781700167ae8",
            "isKey": false,
            "numCitedBy": 108,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "The unitary representations of the affine group, or the group of linear transformations without reflections on the real line, have been found previously by Gel'fand and Naimark. The present paper gives an alternate proof, and presents several properties of the representations which will be used in a later application of this group to continuous representations of Hilbert space. The development follows closely that used by von Neumann to prove the uniqueness of the Schrodinger operators."
            },
            "slug": "Unitary-Representations-of-the-Affine-Group-Aslaksen-Klauder",
            "title": {
                "fragments": [],
                "text": "Unitary Representations of the Affine Group"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "100990754"
                        ],
                        "name": "A. Perelomov",
                        "slug": "A.-Perelomov",
                        "structuredName": {
                            "firstName": "Askold",
                            "lastName": "Perelomov",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Perelomov"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18383380,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "b8cabaae145b62603eb068b27be4e6c4e5aca223",
            "isKey": false,
            "numCitedBy": 114,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Completeness is proved for some subsystems of a system of coherent states. The linear dependence of states is investigated for the von Neumann type subsystems. A detailed study is made of the case when a regular lattice on the complex $\\alpha$ plane with cell area S=$\\pi$ corresponds to the states of the system. It is shown that in this case there exists only one linear relationship between the coherent states. This relationship is equivalent to an infinite set of identities. The symplest of these can also be obtained by means of the transformation formulas for $\\theta$ functions."
            },
            "slug": "On-the-completeness-of-a-system-of-coherent-states-Perelomov",
            "title": {
                "fragments": [],
                "text": "On the completeness of a system of coherent states"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1780112"
                        ],
                        "name": "R. Coifman",
                        "slug": "R.-Coifman",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Coifman",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Coifman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2870555"
                        ],
                        "name": "R. Rochberg",
                        "slug": "R.-Rochberg",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Rochberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Rochberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40504045"
                        ],
                        "name": "M. Taibleson",
                        "slug": "M.-Taibleson",
                        "structuredName": {
                            "firstName": "Mitchell",
                            "lastName": "Taibleson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Taibleson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143907410"
                        ],
                        "name": "G. Weiss",
                        "slug": "G.-Weiss",
                        "structuredName": {
                            "firstName": "Guido",
                            "lastName": "Weiss",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Weiss"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 118696722,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "fb8ea766dbe195c7e178273dbb7290b883c1e9c3",
            "isKey": false,
            "numCitedBy": 336,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "© Société mathématique de France, 1980, tous droits réservés. L’accès aux archives de la collection « Astérisque » (http://smf4.emath.fr/ Publications/Asterisque/) implique l’accord avec les conditions générales d’utilisation (http://www.numdam.org/conditions). Toute utilisation commerciale ou impression systématique est constitutive d’une infraction pénale. Toute copie ou impression de ce fichier doit contenir la présente mention de copyright."
            },
            "slug": "Representation-theorems-for-holomorphic-and-in-L[P]-Coifman-Rochberg",
            "title": {
                "fragments": [],
                "text": "Representation theorems for holomorphic and harmonic functions in L[P] . The molecular characterization of certain Hardy spaces"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "91848570"
                        ],
                        "name": "R. Balian",
                        "slug": "R.-Balian",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Balian",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Balian"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122466243,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "aefb2e941f41c119cb5b0f7440ced9d4b2ddebd5",
            "isKey": false,
            "numCitedBy": 161,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Un-principe-d'incertitude-fort-en-théorie-du-signal-Balian",
            "title": {
                "fragments": [],
                "text": "Un principe d'incertitude fort en théorie du signal ou en mécanique quantique"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "103109493"
                        ],
                        "name": "M. Boon",
                        "slug": "M.-Boon",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Boon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Boon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102782022"
                        ],
                        "name": "J. Zak",
                        "slug": "J.-Zak",
                        "structuredName": {
                            "firstName": "Joshua",
                            "lastName": "Zak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Zak"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50281302"
                        ],
                        "name": "I. Zucker",
                        "slug": "I.-Zucker",
                        "structuredName": {
                            "firstName": "I.",
                            "lastName": "Zucker",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Zucker"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119752231,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0c9a1166893a5366a0c3e563311ab63ba28ed876",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "A rational von Neumann lattice is defined as a lattice in phase space with the constants a and b in the x and p directions given by a ratio of integers. Zeros of harmonic oscillator functions in the kq representation on such lattices are found. It is shown that the number of zeros of the kq function determines the number of states by which a set on a von Neumann lattice is overcomplete. Interesting relations between theta functions are derived on the basis of their connection with the harmonic oscillator states in the kq representation."
            },
            "slug": "Rational-von-Neumann-lattices-Boon-Zak",
            "title": {
                "fragments": [],
                "text": "Rational von Neumann lattices"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7219653"
                        ],
                        "name": "G. Hagedorn",
                        "slug": "G.-Hagedorn",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Hagedorn",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Hagedorn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117274168,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f9f224aa05608e3d1ed56e14cc5b67c25f7e5bcb",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "For certain Gaussian states we present a simple approximate evolution which is asymptotic to the Schrodinger evolution as \n \n→ O.In 3 or more dimensions our error estimates are uniform in time if the potential is suitably chosen. Consequently, our methods apply to scattering theory. The approximate evolution is obtained by using the Trotter Product Formula and the second order Taylor expansion of the potential about the center of the wave packet."
            },
            "slug": "Semiclassical-quantum-mechanics-for-coherent-states-Hagedorn",
            "title": {
                "fragments": [],
                "text": "Semiclassical quantum mechanics for coherent states"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1848427"
                        ],
                        "name": "C. Fefferman",
                        "slug": "C.-Fefferman",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Fefferman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Fefferman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3434216"
                        ],
                        "name": "R. Llave",
                        "slug": "R.-Llave",
                        "structuredName": {
                            "firstName": "Rafael",
                            "lastName": "Llave",
                            "middleNames": [
                                "de",
                                "la"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Llave"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 120563203,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "2ac5ffbb9f60c8b5fc5caa27c80e4dc6a2fc1b38",
            "isKey": false,
            "numCitedBy": 122,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "In this article, we study the quantum mechanics of N electrons and M nuclei interacting by Coulomb forces. Motivated by an important idea of Chandrasekhar and following Herbst [H], we modify the usual kinetic energy -? to take into account an effect from special relativity. As a result, the system can implode for unfavorable values of the nuclear charge Z and the fine structure constant a. This is analogous to the gravitational collapse of a heavy star. Our goal here is to find those values of a and Z for which the system is stable."
            },
            "slug": "Relativistic-Stability-of-Matter-I-Fefferman-Llave",
            "title": {
                "fragments": [],
                "text": "Relativistic Stability of Matter - I"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "96384254"
                        ],
                        "name": "G. Battle",
                        "slug": "G.-Battle",
                        "structuredName": {
                            "firstName": "Guy",
                            "lastName": "Battle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Battle"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120435217,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "834e867d82fd1276a4c89fa4904292d320efd386",
            "isKey": false,
            "numCitedBy": 417,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Using block spin assignments, we construct anL2-orthonormal basis consisting of dyadic scalings and translates of just a finite number of functions. These functions have exponential localization, and for even values of a construction parameterM one can make them classCM−1 with vanishing moments up to orderM inclusive. Such a basis has an important application to phase cell cluster expansions in quantum field theory."
            },
            "slug": "A-block-spin-construction-of-ondelettes.-Part-I:-Battle",
            "title": {
                "fragments": [],
                "text": "A block spin construction of ondelettes. Part I: Lemarié functions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2554434"
                        ],
                        "name": "E. Lieb",
                        "slug": "E.-Lieb",
                        "structuredName": {
                            "firstName": "Elliott",
                            "lastName": "Lieb",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Lieb"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 222334095,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "430b8950adb3a191c071657d0b2ea978c4285d1f",
            "isKey": false,
            "numCitedBy": 554,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "This article is a summary of what is know rigorously about Thomas-Fermi (TF) theory with and without the Dirac and von Weizsacker corrections. It is also shown that TF theory agrees asymptotically, in a certain sense, with nonrelativistic quantum theory as the nuclear charge z tends to infinity. The von Weizsacker correction is shown to correct certain undesirable features of TF theory and to yield a theory in much better agreement with what is believed (but as yet unproved) to be the structure of real atoms. Many open problems in the theory are presented."
            },
            "slug": "Thomas-fermi-and-related-theories-of-atoms-and-Lieb",
            "title": {
                "fragments": [],
                "text": "Thomas-fermi and related theories of atoms and molecules"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16653546"
                        ],
                        "name": "V. Bargmann",
                        "slug": "V.-Bargmann",
                        "structuredName": {
                            "firstName": "Valentine",
                            "lastName": "Bargmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Bargmann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "101317483"
                        ],
                        "name": "P. Butera",
                        "slug": "P.-Butera",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Butera",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Butera"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14873154"
                        ],
                        "name": "L. Girardello",
                        "slug": "L.-Girardello",
                        "structuredName": {
                            "firstName": "Luciano",
                            "lastName": "Girardello",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Girardello"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48261790"
                        ],
                        "name": "J. Klauder",
                        "slug": "J.-Klauder",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Klauder",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Klauder"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118118564,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "613be71cf5d47642e4c5ae211a7b1805da2295ce",
            "isKey": false,
            "numCitedBy": 166,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-the-Completeness-of-Coherent-States-Bargmann-Butera",
            "title": {
                "fragments": [],
                "text": "On the Completeness of Coherent States"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7219653"
                        ],
                        "name": "G. Hagedorn",
                        "slug": "G.-Hagedorn",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Hagedorn",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Hagedorn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117798106,
            "fieldsOfStudy": [
                "Mathematics",
                "Physics"
            ],
            "id": "f72a21138e3b7b79a05b47d634bd3a0d9101a687",
            "isKey": false,
            "numCitedBy": 201,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "We consider the ℏ→0 limit of the quantum dynamics generated by the HamiltonianH(ℏ)=−(ℏ2/2m)Δ+V. We prove that the evolution of certain Gaussian states is determined asymptotically as ℏ→0 by classical mechanics. For suitable potentialsV inn≧3 dimensions, our estimates are uniform in time and our results hold for scattering theory."
            },
            "slug": "Semiclassical-quantum-mechanics-Hagedorn",
            "title": {
                "fragments": [],
                "text": "Semiclassical quantum mechanics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "96384254"
                        ],
                        "name": "G. Battle",
                        "slug": "G.-Battle",
                        "structuredName": {
                            "firstName": "Guy",
                            "lastName": "Battle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Battle"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 55447154,
            "fieldsOfStudy": [
                "Physics",
                "Mathematics"
            ],
            "id": "88db9281d01d0cdb48eb0f6f94c0149bfba401f7",
            "isKey": false,
            "numCitedBy": 91,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "We give an alternate proof of the fact that a function generating a basis of coherent states must have an infinitely long tail in either position space or momentum space. Our argument is a very natural one in which the Heisenberg Uncertainty Principle enters directly."
            },
            "slug": "Heisenberg-proof-of-the-Balian-Low-theorem-Battle",
            "title": {
                "fragments": [],
                "text": "Heisenberg proof of the Balian-Low theorem"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39916351"
                        ],
                        "name": "R. Duffin",
                        "slug": "R.-Duffin",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Duffin",
                            "middleNames": [
                                "James"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Duffin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "103048846"
                        ],
                        "name": "A. Schaeffer",
                        "slug": "A.-Schaeffer",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Schaeffer",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Schaeffer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 121172856,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "465ef08243dc82d196670eb3b9047a6e24ead020",
            "isKey": false,
            "numCitedBy": 2088,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-class-of-nonharmonic-Fourier-series-Duffin-Schaeffer",
            "title": {
                "fragments": [],
                "text": "A class of nonharmonic Fourier series"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1952
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "101518510"
                        ],
                        "name": "H. Bacry",
                        "slug": "H.-Bacry",
                        "structuredName": {
                            "firstName": "Henri",
                            "lastName": "Bacry",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Bacry"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "100862406"
                        ],
                        "name": "A. Grossmann",
                        "slug": "A.-Grossmann",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Grossmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Grossmann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102782022"
                        ],
                        "name": "J. Zak",
                        "slug": "J.-Zak",
                        "structuredName": {
                            "firstName": "Joshua",
                            "lastName": "Zak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Zak"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121409226,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "13ba1b1df45a4a965e5a313956beffdade019940",
            "isKey": false,
            "numCitedBy": 115,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Proof-of-completeness-of-lattice-states-in-the-k-q-Bacry-Grossmann",
            "title": {
                "fragments": [],
                "text": "Proof of completeness of lattice states in the k q representation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1405079730"
                        ],
                        "name": "P. Lemarié-Rieusset",
                        "slug": "P.-Lemarié-Rieusset",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Lemarié-Rieusset",
                            "middleNames": [
                                "Gilles"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Lemarié-Rieusset"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40154333"
                        ],
                        "name": "Y. Meyer",
                        "slug": "Y.-Meyer",
                        "structuredName": {
                            "firstName": "Y.",
                            "lastName": "Meyer",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Meyer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 121124952,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "38313025cf57df328898700afd5fd0f8caacd3b7",
            "isKey": false,
            "numCitedBy": 344,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Ondelettes-et-bases-hilbertiennes.-Lemarié-Rieusset-Meyer",
            "title": {
                "fragments": [],
                "text": "Ondelettes et bases hilbertiennes."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49275720"
                        ],
                        "name": "M. Rieffel",
                        "slug": "M.-Rieffel",
                        "structuredName": {
                            "firstName": "Marc",
                            "lastName": "Rieffel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Rieffel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122086404,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "408afaea48ab042756ccb2c3e01b218e5914908d",
            "isKey": false,
            "numCitedBy": 119,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Von-Neumann-algebras-associated-with-pairs-of-in-Rieffel",
            "title": {
                "fragments": [],
                "text": "Von Neumann algebras associated with pairs of lattices in Lie groups"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48261790"
                        ],
                        "name": "J. Klauder",
                        "slug": "J.-Klauder",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Klauder",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Klauder"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145789866"
                        ],
                        "name": "E. Sudarshan",
                        "slug": "E.-Sudarshan",
                        "structuredName": {
                            "firstName": "E.",
                            "lastName": "Sudarshan",
                            "middleNames": [
                                "C.",
                                "George"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Sudarshan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "101030221"
                        ],
                        "name": "M. M. Miller",
                        "slug": "M.-M.-Miller",
                        "structuredName": {
                            "firstName": "Marvin",
                            "lastName": "Miller",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. M. Miller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117928839,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "691784ec8194d9545bc2ffb1ea1ec262678d15f1",
            "isKey": false,
            "numCitedBy": 946,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Fundamentals-of-Quantum-Optics-Klauder-Sudarshan",
            "title": {
                "fragments": [],
                "text": "Fundamentals of Quantum Optics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2040832"
                        ],
                        "name": "M. Reed",
                        "slug": "M.-Reed",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Reed",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Reed"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144208985"
                        ],
                        "name": "B. Simon",
                        "slug": "B.-Simon",
                        "structuredName": {
                            "firstName": "Barry",
                            "lastName": "Simon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Simon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 118839286,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "f6b0ce8e3c241816dedb3dbc96176aef4e70379c",
            "isKey": false,
            "numCitedBy": 325,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Methods-of-Mathematical-Physics-Reed-Simon",
            "title": {
                "fragments": [],
                "text": "Methods of Mathematical Physics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47046582"
                        ],
                        "name": "R. E. Raab",
                        "slug": "R.-E.-Raab",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Raab",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. E. Raab"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118878739,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "e2996be5947f146bd1bf06e977ef0193bb88be1a",
            "isKey": false,
            "numCitedBy": 31,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Gabor's-Signal-Expansion-and-Degrees-of-Freedom-of-Raab",
            "title": {
                "fragments": [],
                "text": "Gabor's Signal Expansion and Degrees of Freedom of a Signal"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1785455"
                        ],
                        "name": "H. Feichtinger",
                        "slug": "H.-Feichtinger",
                        "structuredName": {
                            "firstName": "Hans",
                            "lastName": "Feichtinger",
                            "middleNames": [
                                "Georg"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Feichtinger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2986384"
                        ],
                        "name": "K. Gröchenig",
                        "slug": "K.-Gröchenig",
                        "structuredName": {
                            "firstName": "Karlheinz",
                            "lastName": "Gröchenig",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Gröchenig"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117047278,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e19131ebeb02fa443e1552f2d4beacc3dd288e49",
            "isKey": false,
            "numCitedBy": 228,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-unified-approach-to-atomic-decompositions-via-Feichtinger-Gröchenig",
            "title": {
                "fragments": [],
                "text": "A unified approach to atomic decompositions via integrable group representations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "98393011"
                        ],
                        "name": "F. Low",
                        "slug": "F.-Low",
                        "structuredName": {
                            "firstName": "Francis",
                            "lastName": "Low",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Low"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117339772,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "30144cdd1441a617d370940c4041177faccdf895",
            "isKey": false,
            "numCitedBy": 123,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Complete-sets-of-wave-packets-Low",
            "title": {
                "fragments": [],
                "text": "Complete sets of wave packets"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40154333"
                        ],
                        "name": "Y. Meyer",
                        "slug": "Y.-Meyer",
                        "structuredName": {
                            "firstName": "Y.",
                            "lastName": "Meyer",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Meyer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 115461231,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c1230a3911ba4c431e5640c7b365fb1de474212c",
            "isKey": false,
            "numCitedBy": 277,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Principe-d'incertitude,-bases-hilbertiennes-et-Meyer",
            "title": {
                "fragments": [],
                "text": "Principe d'incertitude, bases hilbertiennes et algèbres d'opérateurs"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "100862406"
                        ],
                        "name": "A. Grossmann",
                        "slug": "A.-Grossmann",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Grossmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Grossmann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145515955"
                        ],
                        "name": "J. Morlet",
                        "slug": "J.-Morlet",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Morlet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Morlet"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 208902939,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "86592a94f9553ac3009ef447c73ff42a940e9293",
            "isKey": false,
            "numCitedBy": 205,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "DECOMPOSITION-OF-FUNCTIONS-INTO-WAVELETS-OF-SHAPE,-Grossmann-Morlet",
            "title": {
                "fragments": [],
                "text": "DECOMPOSITION OF FUNCTIONS INTO WAVELETS OF CONSTANT SHAPE, AND RELATED TRANSFORMS"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66368197"
                        ],
                        "name": "C. Janse",
                        "slug": "C.-Janse",
                        "structuredName": {
                            "firstName": "Cornelis",
                            "lastName": "Janse",
                            "middleNames": [
                                "Pieter"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Janse"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102337197"
                        ],
                        "name": "A. Kaizer",
                        "slug": "A.-Kaizer",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Kaizer",
                            "middleNames": [
                                "J.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Kaizer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 109449398,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "84202b45bdf2457ef5eb7e99db8572dd9a04695d",
            "isKey": false,
            "numCitedBy": 117,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Time-Frequency-Distributions-of-Loudspeakers:-The-Janse-Kaizer",
            "title": {
                "fragments": [],
                "text": "Time-Frequency Distributions of Loudspeakers: The Application of the Wigner Distribution"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "100862406"
                        ],
                        "name": "A. Grossmann",
                        "slug": "A.-Grossmann",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Grossmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Grossmann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145515955"
                        ],
                        "name": "J. Morlet",
                        "slug": "J.-Morlet",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Morlet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Morlet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398530308"
                        ],
                        "name": "R. Kronland-Martinet",
                        "slug": "R.-Kronland-Martinet",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Kronland-Martinet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kronland-Martinet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2217430"
                        ],
                        "name": "M. Holschneider",
                        "slug": "M.-Holschneider",
                        "structuredName": {
                            "firstName": "Matthias",
                            "lastName": "Holschneider",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Holschneider"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62518717,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "9db6e80d6320ee08052195b4f106e08bbd3f9a7e",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Detection-of-abrupt-changes-in-sound-signals-with-Grossmann-Morlet",
            "title": {
                "fragments": [],
                "text": "Detection of abrupt changes in sound signals with the help of wavelet transforms"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16298171"
                        ],
                        "name": "D. Gabor",
                        "slug": "D.-Gabor",
                        "structuredName": {
                            "firstName": "Dennis",
                            "lastName": "Gabor",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gabor"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61327032,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a8ef7e8990527f01847845da9953896f35e489d5",
            "isKey": false,
            "numCitedBy": 4630,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Theory-of-communication-Gabor",
            "title": {
                "fragments": [],
                "text": "Theory of communication"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1946
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144572928"
                        ],
                        "name": "J. Kemperman",
                        "slug": "J.-Kemperman",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Kemperman",
                            "middleNames": [
                                "H.",
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kemperman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 54008740,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "275779fc6b3000f14e6bc9f143fe0cce5a8cdf9c",
            "isKey": false,
            "numCitedBy": 21,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-the-regularity-of-generalized-convex-functions-Kemperman",
            "title": {
                "fragments": [],
                "text": "On the regularity of generalized convex functions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3053199"
                        ],
                        "name": "C. Helstrom",
                        "slug": "C.-Helstrom",
                        "structuredName": {
                            "firstName": "Carl",
                            "lastName": "Helstrom",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Helstrom"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35052393,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d18e3414bb7cadc89d904ff30d274a5204e78ccf",
            "isKey": false,
            "numCitedBy": 80,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-expansion-of-a-signal-in-Gaussian-elementary-Helstrom",
            "title": {
                "fragments": [],
                "text": "An expansion of a signal in Gaussian elementary signals (Corresp.)"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1966
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Une nouvelle base d'ondelettes de L2(Rn),'' to be published in J . de Math"
            },
            "venue": {
                "fragments": [],
                "text": "Calcul symbolique sur les o Crateurs de"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Math. Soc"
            },
            "venue": {
                "fragments": [],
                "text": "Math. Soc"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Thomas-Fermi theory and related theories of atoms and molecules"
            },
            "venue": {
                "fragments": [],
                "text": "Re[,. Mod. Phys"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Note on the completeness of systems of coherent states Proof of the completeness of lattice states in the kq-representation"
            },
            "venue": {
                "fragments": [],
                "text": "Teor. i. Matem. Fis. Phys. Rei"
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Multiresolution approximation and wavelets"
            },
            "venue": {
                "fragments": [],
                "text": "Multiresolution approximation and wavelets"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "BiorthogonalitC et thCorie des opkrateurs"
            },
            "venue": {
                "fragments": [],
                "text": "BiorthogonalitC et thCorie des opkrateurs"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "J . Chem. Phys"
            },
            "venue": {
                "fragments": [],
                "text": "J . Chem. Phys"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Audio Eng. Soc"
            },
            "venue": {
                "fragments": [],
                "text": "Audio Eng. Soc"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Methods of Modem Mathematical Physics, 11. Fourier Analysis and Self-Adjointness"
            },
            "venue": {
                "fragments": [],
                "text": "Methods of Modem Mathematical Physics, 11. Fourier Analysis and Self-Adjointness"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Bell. Syst. Techn. J"
            },
            "venue": {
                "fragments": [],
                "text": "Bell. Syst. Techn. J"
            },
            "year": 1961
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the density of phase space functions, \" submitted for publication"
            },
            "venue": {
                "fragments": [],
                "text": "On the density of phase space functions, \" submitted for publication"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Ondelettes, function splines, et analyses graduies"
            },
            "venue": {
                "fragments": [],
                "text": "Univ. of Torino"
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A sampling theorem for signals in the joint timefrequency domain, \" to be published"
            },
            "venue": {
                "fragments": [],
                "text": "A sampling theorem for signals in the joint timefrequency domain, \" to be published"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Wave propagation and sampling theory Sampling theory and wave propagation"
            },
            "venue": {
                "fragments": [],
                "text": "NATO AS1 Series"
            },
            "year": 1982
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "methodology": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 79,
        "totalPages": 8
    },
    "page_url": "https://www.semanticscholar.org/paper/The-wavelet-transform,-time-frequency-localization-Daubechies/2384a683444b8fc03774d5af6791d81f6c48b6b2?sort=total-citations"
}