{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26229616,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "da44af7e967c0c847e63b9600811a58ee7716f45",
            "isKey": false,
            "numCitedBy": 123,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A method for analyzing the structure of the white background in document images is described, along with applications to the problem of isolating blocks of machine-printed text. The approach is based on computational-geometry algorithms for off-line enumeration of maximal white rectangles and on-line rectangle unification. These support a fast, simple, and general heuristic for geometric layout segmentation, in which white space is covered greedily by rectangles until all text blocks are isolated. Design of the heuristic can be substantially automated by an analysis of the empirical statistical distribution of properties of covering rectangles: for example, the stopping rule can be chosen by Rosenblatt’s perceptron training algorithm. Experimental trials show good behavior on the large and useful class of textual Manhattan layouts. On complex layouts from English-language technical journals of many publishers, the method finds good segmentations in a uniform and nearly parameter-free manner. On a variety of non-Latin texts, some with vertical text lines, the method finds good segmentations without prior knowledge of page and text-line orientation."
            },
            "slug": "Background-Structure-in-Document-Images-Baird",
            "title": {
                "fragments": [],
                "text": "Background Structure in Document Images"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A method for analyzing the structure of the white background in document images is described, along with applications to the problem of isolating blocks of machine-printed text."
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Pattern Recognit. Artif. Intell."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61890978,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "9b0ac5a41c2742de9695810dadab2c156028f730",
            "isKey": false,
            "numCitedBy": 94,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "An experimental printed-page reader that is easy to adapt to various languages is described. Changing the target language may involve simultaneous changes in symbol sets, typefaces, sizes of text, page layouts, linguistic contexts, and imaging defects. The strategy has been to isolate the effects of these sources of variation within separate, independent engineering subsystems. In this way, it has been possible to construct, with a minimum of manual effort, classifiers for arbitrary combinations of symbols, typefaces, sizes, and imaging defects. An attempt has been made to rid the algorithms of all language-specific rules, relying instead on automatic learning from examples and generalized table-driven methods. For some tasks it has been feasible to avoid language dependency altogether. Linguistic context can be exploited through data-directed filtering algorithms in a uniform and modular manner, so that preexisting tools developed by computational linguistics can readily be applied. These principles are illustrated by trials on English, Swedish, Tibetan, and special technical texts. >"
            },
            "slug": "Anatomy-of-a-versatile-page-reader-Baird",
            "title": {
                "fragments": [],
                "text": "Anatomy of a versatile page reader"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "An experimental printed-page reader that is easy to adapt to various languages is described, and an attempt has been made to rid the algorithms of all language-specific rules, relying instead on automatic learning from examples and generalized table-driven methods."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39692564"
                        ],
                        "name": "Simon Kahan",
                        "slug": "Simon-Kahan",
                        "structuredName": {
                            "firstName": "Simon",
                            "lastName": "Kahan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Simon Kahan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145820949"
                        ],
                        "name": "T. Pavlidis",
                        "slug": "T.-Pavlidis",
                        "structuredName": {
                            "firstName": "Theodosios",
                            "lastName": "Pavlidis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Pavlidis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 123
                            }
                        ],
                        "text": "Thereafter, splitting and merging are guided by classification confidence scores in a branch and bound manner described in [9]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 17307726,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0de98bd19065702bb44b8aa5ad43ef6923fdacb0",
            "isKey": false,
            "numCitedBy": 384,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe the current state of a system that recognizes printed text of various fonts and sizes for the Roman alphabet. The system combines several techniques in order to improve the overall recognition rate. Thinning and shape extraction are performed directly on a graph of the run-length encoding of a binary image. The resulting strokes and other shapes are mapped, using a shape-clustering approach, into binary features which are then fed into a statistical Bayesian classifier. Large-scale trials have shown better than 97 percent top choice correct performance on mixtures of six dissimilar fonts, and over 99 percent on most single fonts, over a range of point sizes. Certain remaining confusion classes are disambiguated through contour analysis, and characters suspected of being merged are broken and reclassified. Finally, layout and linguistic context are applied. The results are illustrated by sample pages."
            },
            "slug": "On-the-Recognition-of-Printed-Characters-of-Any-and-Kahan-Pavlidis",
            "title": {
                "fragments": [],
                "text": "On the Recognition of Printed Characters of Any Font and Size"
            },
            "tldr": {
                "abstractSimilarityScore": 91,
                "text": "The current state of a system that recognizes printed text of various fonts and sizes for the Roman alphabet is described, which combines several techniques in order to improve the overall recognition rate."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107761635"
                        ],
                        "name": "S. Jones",
                        "slug": "S.-Jones",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Jones",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Jones"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1798254"
                        ],
                        "name": "S. Fortune",
                        "slug": "S.-Fortune",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Fortune",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Fortune"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62735730,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fbe0be8a26a0e9d8889f7f09ded38000faa357ba",
            "isKey": false,
            "numCitedBy": 130,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "A technique for image segmentation using shape-directed covers is described and applied to the fully automatic analysis of complex printed-page layouts. The structure of the background (white space) is analyzed, assisted by an enumeration of all maximal white rectangles. For this enumeration, the most computationally expensive step, an algorithm has been developed that, aside from a sort, achieves an expected runtime linear in the number of black connected components. The crucial engineering decision is the specification of a partial order on white rectangles to express domain-specific knowledge of preferred shapes and sizes. This order determines a sequence of partial covers of the background, and thus, a sequence of nested page segmentations. In experimental trials on Manhattan layouts, good segmentations often occur early in this sequence, using a simple and uniform shape-direction rule. This is a global-to-local strategy, which for some tasks is superior to strategies currently emphasized in the literature, including bottom-up and top-down.<<ETX>>"
            },
            "slug": "Image-segmentation-by-shape-directed-covers-Baird-Jones",
            "title": {
                "fragments": [],
                "text": "Image segmentation by shape-directed covers"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "A technique for image segmentation using shape-directed covers is described and applied to the fully automatic analysis of complex printed-page layouts, which for some tasks is superior to strategies currently emphasized in the literature, including bottom-up and top-down."
            },
            "venue": {
                "fragments": [],
                "text": "[1990] Proceedings. 10th International Conference on Pattern Recognition"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2053015807"
                        ],
                        "name": "A. Nakanishi",
                        "slug": "A.-Nakanishi",
                        "structuredName": {
                            "firstName": "Akira",
                            "lastName": "Nakanishi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Nakanishi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59648815,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "a6c2773efba0c69e4d0ca5043cbafef9b5fc3d26",
            "isKey": false,
            "numCitedBy": 169,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A pipe cleaning brush assembly for attachment to the rotatable face plate of a pipe facing machine for rotation therewith to clean the outer surface of a large diameter pipe section proximate the end thereof simultaneously with the machining of the pipe end face. The assembly includes a clamp having an inverted U-shaped member for placement over the edge of the face plate with a clamp jaw lock acting as a vise to grip the face plate and a clamp wedge lock engaging the face plate to resist centrifugal forces developed during rotation. A brush arm is pivotally mounted to the clamp, with a brush attached at one end and a cam at the other. The cam upon rotation causes the brush arm to pivot between a retracted position wherein the brush is held above the pipe surface to be cleaned and a position wherein the brush rests on the pipe surface."
            },
            "slug": "Writing-Systems-of-the-World-Nakanishi",
            "title": {
                "fragments": [],
                "text": "Writing Systems of the World"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A pipe cleaning brush assembly for attachment to the rotatable face plate of a pipe facing machine for rotation therewith to clean the outer surface of a large diameter pipe section proximate the end thereof simultaneously with the machining of the pipe end face."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1382134698"
                        ],
                        "name": "H. Rogers",
                        "slug": "H.-Rogers",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Rogers",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Rogers"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66426259"
                        ],
                        "name": "F. Coulmas",
                        "slug": "F.-Coulmas",
                        "structuredName": {
                            "firstName": "Florian",
                            "lastName": "Coulmas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Coulmas"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 147333136,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "c472f1ca5f63751d08c540453fa9d8f534ef2ad7",
            "isKey": false,
            "numCitedBy": 266,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "His study takes in Egyptian hieroglyphics and the cuneiform system of the ancient Near East; he describes Chinese writing, discussing why an apparently cumbersome system has been used continuously for more than 3,000 years; he ranges across the writing systems of western Asia and the Middle East, the Indian families and the various alphabetic traditions which had its origins in the multifarious world of Semitic writing and came to full bloom in pre-Classical Greece."
            },
            "slug": "The-Writing-Systems-of-the-World-Rogers-Coulmas",
            "title": {
                "fragments": [],
                "text": "The Writing Systems of the World"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60023835,
            "fieldsOfStudy": [
                "History"
            ],
            "id": "ee1decd6020b5cf63d1d6a4ea7cfde1ab5309279",
            "isKey": false,
            "numCitedBy": 239,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-skew-angle-of-printed-documents-Baird",
            "title": {
                "fragments": [],
                "text": "The skew angle of printed documents"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "An early version of the method, developed on the Latin alphabet, is described in [ 2 ]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 59912183,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "16b474bea5eb0dea3f63d3f5ff2ef4e1b9eee8b8",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Global-to-Local-Layout-Analysis-Baird",
            "title": {
                "fragments": [],
                "text": "Global-to-Local Layout Analysis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 84,
                                "start": 81
                            }
                        ],
                        "text": "An early version of the method, developed on the Latin alphabet, is described in [2]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Global-t+hal Layout Analysis,"
            },
            "venue": {
                "fragments": [],
                "text": "Proc., I A P R Workshop on Syntactic and Structural Pattern Recognition,"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 99
                            }
                        ],
                        "text": "tached symbols (characters), as is customary in machine-print in almost all of the writing systems [lo] of West and East Europe and the Americas (Latin, Greek, Cyrillic, Armenian, etc), East Asia (Japanese, Chinese, Korean, Tibetan, etc), Southeast Asia (Burmese, Thai, Lao, etc), India (Kannada, Sinhalese, etc), West Asia (Hebrew, Urdu, etc), and Africa (Amharic) but not including Arabic and Devanagari and their derivatives."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Tuttle: Rutland"
            },
            "venue": {
                "fragments": [],
                "text": "Vermont,"
            },
            "year": 1990
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 1,
            "methodology": 3
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 10,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Language-free-layout-analysis-Ittner-Baird/4bc5bf7115142885992f99516169ea24bf18b529?sort=total-citations"
}