{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3219867"
                        ],
                        "name": "J. Hopfield",
                        "slug": "J.-Hopfield",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Hopfield",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hopfield"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 784288,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "98b4d4e24aab57ab4e1124ff8106909050645cfa",
            "isKey": false,
            "numCitedBy": 16692,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "Computational properties of use of biological organisms or to the construction of computers can emerge as collective properties of systems having a large number of simple equivalent components (or neurons). The physical meaning of content-addressable memory is described by an appropriate phase space flow of the state of a system. A model of such a system is given, based on aspects of neurobiology but readily adapted to integrated circuits. The collective properties of this model produce a content-addressable memory which correctly yields an entire memory from any subpart of sufficient size. The algorithm for the time evolution of the state of the system is based on asynchronous parallel processing. Additional emergent collective properties include some capacity for generalization, familiarity recognition, categorization, error correction, and time sequence retention. The collective properties are only weakly sensitive to details of the modeling or the failure of individual devices."
            },
            "slug": "Neural-networks-and-physical-systems-with-emergent-Hopfield",
            "title": {
                "fragments": [],
                "text": "Neural networks and physical systems with emergent collective computational abilities."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "A model of a system having a large number of simple equivalent components, based on aspects of neurobiology but readily adapted to integrated circuits, produces a content-addressable memory which correctly yields an entire memory from any subpart of sufficient size."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the National Academy of Sciences of the United States of America"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2084582"
                        ],
                        "name": "G. Reeke",
                        "slug": "G.-Reeke",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Reeke",
                            "middleNames": [
                                "N."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Reeke"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1694232"
                        ],
                        "name": "O. Sporns",
                        "slug": "O.-Sporns",
                        "structuredName": {
                            "firstName": "Olaf",
                            "lastName": "Sporns",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Sporns"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58105117,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "ed610a07bcd111907e134e62be82765ff4bd8e69",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Selectionist-models-of-perceptual-and-motor-systems-Reeke-Sporns",
            "title": {
                "fragments": [],
                "text": "Selectionist models of perceptual and motor systems and implications for functionalist theories of brain function"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1859819"
                        ],
                        "name": "K. Hintz",
                        "slug": "K.-Hintz",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Hintz",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Hintz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "121727677"
                        ],
                        "name": "J. Spofford",
                        "slug": "J.-Spofford",
                        "structuredName": {
                            "firstName": "Jeremiah",
                            "lastName": "Spofford",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Spofford"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62671293,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c5dfae26fdce2ca981aad4bda2764b909c67b60d",
            "isKey": false,
            "numCitedBy": 30,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Although artificial neural networks have been shown to be effective in the computation of solutions to difficult problems a general theory has not yet been developed to provide guidance in their design and implementation. Genetic algorithms have also been shown to be effective in evolving solutions to optimization problems which involve objective functions that are not 'nice'. The approach presented here is the utilization of genetic algorithms to evolve the number of neurons in an artificial neural network, the weights of their interconnects, and the interconnect structure itself. With this approach, no a priori assumptions about interconnect structure, weights, number of layers. or to which neurons the inputs or outputs are connected need to be made. A combined neural network evaluation and genetic algorithm evaluation program has been written in C on a Sun workstation. The method has been successfully applied to the 9*9 bit character recognition problem.<<ETX>>"
            },
            "slug": "Evolving-a-neural-network-Hintz-Spofford",
            "title": {
                "fragments": [],
                "text": "Evolving a neural network"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The approach presented here is the utilization of genetic algorithms to evolve the number of neurons in an artificial neural network, the weights of their interconnects, and the interconnect structure itself."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. 5th IEEE International Symposium on Intelligent Control 1990"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4605464"
                        ],
                        "name": "W. McCulloch",
                        "slug": "W.-McCulloch",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "McCulloch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. McCulloch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50314979"
                        ],
                        "name": "W. Pitts",
                        "slug": "W.-Pitts",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Pitts",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pitts"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15619658,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "090c5a5df345ab60c41d6de02b3e366e1a27cf43",
            "isKey": false,
            "numCitedBy": 6082,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Because of the “all-or-none” character of nervous activity, neural events and the relations among them can be treated by means of propositional logic. It is found that the behavior of every net can be described in these terms, with the addition of more complicated logical means for nets containing circles; and that for any logical expression satisfying certain conditions, one can find a net behaving in the fashion it describes. It is shown that many particular choices among possible neurophysiological assumptions are equivalent, in the sense that for every net behaving under one assumption, there exists another net which behaves under the other and gives the same results, although perhaps not in the same time. Various applications of the calculus are discussed."
            },
            "slug": "A-logical-calculus-of-the-ideas-immanent-in-nervous-McCulloch-Pitts",
            "title": {
                "fragments": [],
                "text": "A logical calculus of the ideas immanent in nervous activity"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It is shown that many particular choices among possible neurophysiological assumptions are equivalent, in the sense that for every net behaving under one assumption, there exists another net which behaves under the other and gives the same results, although perhaps not in the same time."
            },
            "venue": {
                "fragments": [],
                "text": "The Philosophy of Artificial Intelligence"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3219867"
                        ],
                        "name": "J. Hopfield",
                        "slug": "J.-Hopfield",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Hopfield",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hopfield"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2516142"
                        ],
                        "name": "D. Tank",
                        "slug": "D.-Tank",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tank",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tank"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10096429,
            "fieldsOfStudy": [
                "Computer Science",
                "Biology"
            ],
            "id": "4517ca6110dfb5de3f004f67653de3c33b8d6234",
            "isKey": false,
            "numCitedBy": 1935,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "A new conceptual framework and a minimization principle together provide an understanding of computation in model neural circuits. The circuits consist of nonlinear graded-response model neurons organized into networks with effectively symmetric synaptic connections. The neurons represent an approximation to biological neurons in which a simplified set of important computational properties is retained. Complex circuits solving problems similar to those essential in biology can be analyzed and understood without the need to follow the circuit dynamics in detail. Implementation of the model with electronic devices will provide a class of electronic circuits of novel form and function."
            },
            "slug": "Computing-with-neural-circuits:-a-model.-Hopfield-Tank",
            "title": {
                "fragments": [],
                "text": "Computing with neural circuits: a model."
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "A new conceptual framework and a minimization principle together provide an understanding of computation in model neural circuits that represent an approximation to biological neurons in which a simplified set of important computational properties is retained."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143980023"
                        ],
                        "name": "S. Kauffman",
                        "slug": "S.-Kauffman",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Kauffman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Kauffman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124840341,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "39178f6c42b5b07fb8df8b4ec91f4e47f8b5158b",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "The past decade has seen renewed interest in non Von Neuman computation by parallel processing systems. This interest on the part of solid state physicists and others has led to models of pattern recognition and associative memory (1,2,3). In these models, it is largely the dynamical attractors which are of interest as the classes, or memories, stored in the systems. Further, the mathematical tractability of threshold systems with symmetric coupling, that is, in which each binary device “fires” if a weighted sum of excitation minus inhibition exceeds some threshold, and couplings between two binary devices are symmetrical, has focused particular attention on this subclass of automata. The marked advantage of this subclass of automata is the existence of a potential function allowing prescription of weightings on inputs to each binary device in order to choose steady state attractors with desired properties such as location in state space, and stability to perturbation (1,2,3)."
            },
            "slug": "Boolean-systems,-adaptive-automata,-evolution-Kauffman",
            "title": {
                "fragments": [],
                "text": "Boolean systems, adaptive automata, evolution"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The marked advantage of this subclass of automata is the existence of a potential function allowing prescription of weightings on inputs to each binary device in order to choose steady state attractors with desired properties such as location in state space, and stability to perturbation."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116648700"
                        ],
                        "name": "Ronald J. Williams",
                        "slug": "Ronald-J.-Williams",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Williams",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ronald J. Williams"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1895771"
                        ],
                        "name": "D. Zipser",
                        "slug": "D.-Zipser",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Zipser",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Zipser"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 60666828,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "424710825d726e10b016204ed2bc979e2a342d10",
            "isKey": false,
            "numCitedBy": 336,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract The real-time recurrent learning algorithm is a gradient-following learning algorithm for completely recurrent networks running in continually sampled time. Here we use a series of simulation experiments to investigate the power and properties of this algorithm. In the recurrent networks studied here, any unit can be connected to any other, and any unit can receive external input. These networks run continually in the sense that they sample their inputs on every update cycle, and any unit can have a training target on any cycle. The storage required and computation time on each step are independent of time and are completely determined by the size of the network, so no prior knowledge of the temporal structure of the task being learned is required. The algorithm is nonlocal in the sense that each unit must have knowledge of the complete recurrent weight matrix and error vector. The algorithm is computationally intensive in sequential computers, requiring a storage capacity of the order of the thi..."
            },
            "slug": "Experimental-Analysis-of-the-Real-time-Recurrent-Williams-Zipser",
            "title": {
                "fragments": [],
                "text": "Experimental Analysis of the Real-time Recurrent Learning Algorithm"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A series of simulation experiments are used to investigate the power and properties of the real-time recurrent learning algorithm, a gradient-following learning algorithm for completely recurrent networks running in continually sampled time."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2358960"
                        ],
                        "name": "N. Margolus",
                        "slug": "N.-Margolus",
                        "structuredName": {
                            "firstName": "Norman",
                            "lastName": "Margolus",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Margolus"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2653387"
                        ],
                        "name": "T. Toffoli",
                        "slug": "T.-Toffoli",
                        "structuredName": {
                            "firstName": "Tommaso",
                            "lastName": "Toffoli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Toffoli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7791682,
            "fieldsOfStudy": [
                "Computer Science",
                "Physics"
            ],
            "id": "68c6619e6ad69b1bfeae3077e54e733cf84973ee",
            "isKey": false,
            "numCitedBy": 910,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Cellular automata are the computer scientist's counterpart to the physicist's concept of 'field'. They provide natural models for many investigations in physics, combinatorial mathematics, and computer science that deal with systems extended in space and evolving in time according to local laws. A cellular automata machine is a computer optimized for the simulation of cellular automata. Its dedicated architecture allows it to run thousands of times faster than a general-purpose computer of comparable cost programmed to do the same task. In practical terms this permits intensive interactive experimentation and opens up new fields of research in distributed dynamics, including practical applications involving parallel computation and image processing. Contents: Introduction. Cellular Automata. The CAM Environment. A Live Demo. The Rules of the Game. Our First rules. Second-order Dynamics. The Laboratory. Neighbors and Neighborhood. Running. Particle Motion. The Margolus Neighborhood. Noisy neighbors. Display and Analysis. Physical Modeling. Reversibility. Computing Machinery. Hydrodynamics. Statistical Mechanics. Other Applications. Imaging Processing. Rotations. Pattern Recognition. Multiple CAMS."
            },
            "slug": "Cellular-Automata-Machines-Margolus-Toffoli",
            "title": {
                "fragments": [],
                "text": "Cellular Automata Machines"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "A cellular automata machine is a computer optimized for the simulation of cellular Automata that allows it to run thousands of times faster than a general-purpose computer of comparable cost programmed to do the same task."
            },
            "venue": {
                "fragments": [],
                "text": "Complex Syst."
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2246319"
                        ],
                        "name": "E. Bienenstock",
                        "slug": "E.-Bienenstock",
                        "structuredName": {
                            "firstName": "Elie",
                            "lastName": "Bienenstock",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Bienenstock"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8884630"
                        ],
                        "name": "L. Cooper",
                        "slug": "L.-Cooper",
                        "structuredName": {
                            "firstName": "Leon",
                            "lastName": "Cooper",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Cooper"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2094648"
                        ],
                        "name": "P. Munro",
                        "slug": "P.-Munro",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Munro",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Munro"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1607496,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "9f22cf81654dd50b95e65b86b1125cfe6803a67b",
            "isKey": false,
            "numCitedBy": 2695,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "The development of stimulus selectivity in the primary sensory cortex of higher vertebrates is considered in a general mathematical framework. A synaptic evolution scheme of a new kind is proposed in which incoming patterns rather than converging afferents compete. The change in the efficacy of a given synapse depends not only on instantaneous pre- and postsynaptic activities but also on a slowly varying time-averaged value of the postsynaptic activity. Assuming an appropriate nonlinear form for this dependence, development of selectivity is obtained under quite general conditions on the sensory environment. One does not require nonlinearity of the neuron's integrative power nor does one need to assume any particular form for intracortical circuitry. This is first illustrated in simple cases, e.g., when the environment consists of only two different stimuli presented alternately in a random manner. The following formal statement then holds: the state of the system converges with probability 1 to points of maximum selectivity in the state space. We next consider the problem of early development of orientation selectivity and binocular interaction in primary visual cortex. Giving the environment an appropriate form, we obtain orientation tuning curves and ocular dominance comparable to what is observed in normally reared adult cats or monkeys. Simulations with binocular input and various types of normal or altered environments show good agreement with the relevant experimental data. Experiments are suggested that could test our theory further."
            },
            "slug": "Theory-for-the-development-of-neuron-selectivity:-Bienenstock-Cooper",
            "title": {
                "fragments": [],
                "text": "Theory for the development of neuron selectivity: orientation specificity and binocular interaction in visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "The development of stimulus selectivity in the primary sensory cortex of higher vertebrates is considered in a general mathematical framework and a synaptic evolution scheme of a new kind is proposed in which incoming patterns rather than converging afferents compete."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of neuroscience : the official journal of the Society for Neuroscience"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1700974"
                        ],
                        "name": "Barak A. Pearlmutter",
                        "slug": "Barak-A.-Pearlmutter",
                        "structuredName": {
                            "firstName": "Barak",
                            "lastName": "Pearlmutter",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Barak A. Pearlmutter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16813485,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "34468c0aa95a7aea212d8738ab899a69b2fc14c6",
            "isKey": false,
            "numCitedBy": 744,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "Many neural network learning procedures compute gradients of the errors on the output layer of units after they have settled to their final values. We describe a procedure for finding E/wij, where E is an error functional of the temporal trajectory of the states of a continuous recurrent network and wij are the weights of that network. Computing these quantities allows one to perform gradient descent in the weights to minimize E. Simulations in which networks are taught to move through limit cycles are shown. This type of recurrent network seems particularly suited for temporally continuous domains, such as signal processing, control, and speech."
            },
            "slug": "Learning-State-Space-Trajectories-in-Recurrent-Pearlmutter",
            "title": {
                "fragments": [],
                "text": "Learning State Space Trajectories in Recurrent Neural Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A procedure for finding E/wij, where E is an error functional of the temporal trajectory of the states of a continuous recurrent network and wij are the weights of that network, which seems particularly suited for temporally continuous domains."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1732302"
                        ],
                        "name": "J. Koza",
                        "slug": "J.-Koza",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Koza",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koza"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17882725,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ffa885d3b7a551f50e35ceb1cec37e8b1ede4aae",
            "isKey": false,
            "numCitedBy": 369,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "Existing approaches to artificial intelligence problems such as sequence induction, automatic programming, machine learning, planning, and pattern recognition typically require specification in advance of the size and shape of the solution to the problem (often in a unnatural and difficult way). This paper reports on a new approach in which the size and shape of the solution to such problems is dynamically created using Darwinian principles of reproduction and survival of the fittest. Moreover, the resulting solution is inherently hierarchical. The paper describes computer experiments, using the author's 4341 line LISP program, in five areas of artifical intelligence, namely (1) sequence induction (e.g. inducing a computational procedure for the recursive Fibonacci sequence and inducing a computational procedure for a cubic polynomial sequence), (2) automatic programming (e.g. discovering a computational procedure for solving pairs of linear equations, solving quadratic equations for complex roots, and discovering trigonometric identities), (3) machine learning of functions (e.g. learning a Boolean multiplexer function previously studied in neural net and classifier system work and learning the exclusive-or and parity function), (4) planning (e.g. developing a robotic action sequence that can stack an arbitrary initial configuration of blocks into a specified order), and (5) pattern recognition (e.g. translation-invariant recognition of a simple one dimensional shape in a linear retina)."
            },
            "slug": "Hierarchical-Genetic-Algorithms-Operating-on-of-Koza",
            "title": {
                "fragments": [],
                "text": "Hierarchical Genetic Algorithms Operating on Populations of Computer Programs"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A new approach in which the size and shape of the solution to such problems is dynamically created using Darwinian principles of reproduction and survival of the fittest is reported on."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5647202"
                        ],
                        "name": "J. Lettvin",
                        "slug": "J.-Lettvin",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Lettvin",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lettvin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2701850"
                        ],
                        "name": "H. Maturana",
                        "slug": "H.-Maturana",
                        "structuredName": {
                            "firstName": "Humberto",
                            "lastName": "Maturana",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Maturana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4605464"
                        ],
                        "name": "W. McCulloch",
                        "slug": "W.-McCulloch",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "McCulloch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. McCulloch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50314979"
                        ],
                        "name": "W. Pitts",
                        "slug": "W.-Pitts",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Pitts",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pitts"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8739509,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bc4e084831b9f987826b2cf184356e347ee155f8",
            "isKey": false,
            "numCitedBy": 1756,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we analyze the activity of single fibers in the optic nerve of a frog. Our method is to find what sort of stimulus causes the largest activity in one nerve fiber and then what is the exciting aspect of that stimulus such that variations in everything else cause little change in the response. It has been known for the past 20 years that each fiber is connected not to a few rods and cones in the retina but to very many over a fair area. Our results show that for the most part within that area, it is not the light intensity itself but rather the pattern of local variation of intensity that is the exciting factor. There are four types of fibers, each type concerned with a different sort of pattern. Each type is uniformly distributed over the whole retina of the frog. Thus, there are four distinct parallel distributed channels whereby the frog's eye informs his brain about the visual image in terms of local pattern independent of average illumination. We describe the patterns and show the functional and anatomical separation of the channels. This work has been done on the frog, and our interpretation applies only to the frog."
            },
            "slug": "What-the-Frog's-Eye-Tells-the-Frog's-Brain-Lettvin-Maturana",
            "title": {
                "fragments": [],
                "text": "What the Frog's Eye Tells the Frog's Brain"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The results show that for the most part within that area of the optic nerve of a frog, it is not the light intensity itself but rather the pattern of local variation of intensity that is the exciting factor."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IRE"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116648700"
                        ],
                        "name": "Ronald J. Williams",
                        "slug": "Ronald-J.-Williams",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Williams",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ronald J. Williams"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1895771"
                        ],
                        "name": "D. Zipser",
                        "slug": "D.-Zipser",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Zipser",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Zipser"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14711886,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ce9a21b93ba29d4145a8ef6bf401e77f261848de",
            "isKey": false,
            "numCitedBy": 3833,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "The exact form of a gradient-following learning algorithm for completely recurrent networks running in continually sampled time is derived and used as the basis for practical algorithms for temporal supervised learning tasks. These algorithms have (1) the advantage that they do not require a precisely defined training interval, operating while the network runs; and (2) the disadvantage that they require nonlocal communication in the network being trained and are computationally expensive. These algorithms allow networks having recurrent connections to learn complex tasks that require the retention of information over time periods having either fixed or indefinite length."
            },
            "slug": "A-Learning-Algorithm-for-Continually-Running-Fully-Williams-Zipser",
            "title": {
                "fragments": [],
                "text": "A Learning Algorithm for Continually Running Fully Recurrent Neural Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The exact form of a gradient-following learning algorithm for completely recurrent networks running in continually sampled time is derived and used as the basis for practical algorithms for temporal supervised learning tasks."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "101889667"
                        ],
                        "name": "Z. Ning",
                        "slug": "Z.-Ning",
                        "structuredName": {
                            "firstName": "Zhen-Qui",
                            "lastName": "Ning",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Z. Ning"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1793086"
                        ],
                        "name": "T. Mouthaan",
                        "slug": "T.-Mouthaan",
                        "structuredName": {
                            "firstName": "Ton",
                            "lastName": "Mouthaan",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Mouthaan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144567352"
                        ],
                        "name": "H. Wallinga",
                        "slug": "H.-Wallinga",
                        "structuredName": {
                            "firstName": "Hans",
                            "lastName": "Wallinga",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wallinga"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 62694638,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "17fcf221f9a45d4f265fe818a2724e0a1211e799",
            "isKey": false,
            "numCitedBy": 46,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors present a simulated evolution approach for analog circuit synthesis based on an analogy with the natural selection process in biological environments and on the iterative improvements in solving engineering problems. A prototype framework based on this idea, called SEAS, has been implemented. Measurement results show that SEAS can handle a non-fixed topology with a globally optimal solution, is easy to adapt as technology evolves, and is easy to use. Analytic circuit models, in which a set of the design equations enables one to evaluate the performance of a circuit for different sets of specifications without actually going into the circuit details, can be developed not only for operational amplifiers but also for other types of analog functional blocks, such as comparators and A/D (analog-to-digital) converters.<<ETX>>"
            },
            "slug": "SEAS:-a-simulated-evolution-approach-for-analog-Ning-Mouthaan",
            "title": {
                "fragments": [],
                "text": "SEAS: a simulated evolution approach for analog circuit synthesis"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "The authors present a simulated evolution approach for analog circuit synthesis based on an analogy with the natural selection process in biological environments and on the iterative improvements in solving engineering problems, called SEAS."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE 1991 Custom Integrated Circuits Conference"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2673251"
                        ],
                        "name": "M. Alexander",
                        "slug": "M.-Alexander",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Alexander",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Alexander"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 66,
                                "start": 32
                            }
                        ],
                        "text": "5\n1.1.1 The neocortex . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 5 1.1.2 The cerebellum . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 6 1.1.3 The hippocampus . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . ."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 170,
                                "start": 136
                            }
                        ],
                        "text": "More reading\n• Although no knowledge of neuroscience is required, there are numerous good neuroscience text books which might be helpful:(Kandel, Schwartz, and Jessel, 2000; Shepherd, 1994; Johnston and Wu, 1995)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 57799138,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "3d6ae6e9b59a871fd9259836ac9b6b7628f697f2",
            "isKey": true,
            "numCitedBy": 8083,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "I have developed \"tennis elbow\" from lugging this book around the past four weeks, but it is worth the pain, the effort, and the aspirin. It is also worth the (relatively speaking) bargain price. Including appendixes, this book contains 894 pages of text. The entire panorama of the neural sciences is surveyed and examined, and it is comprehensive in its scope, from genomes to social behaviors. The editors explicitly state that the book is designed as \"an introductory text for students of biology, behavior, and medicine,\" but it is hard to imagine any audience, interested in any fragment of neuroscience at any level of sophistication, that would not enjoy this book. The editors have done a masterful job of weaving together the biologic, the behavioral, and the clinical sciences into a single tapestry in which everyone from the molecular biologist to the practicing psychiatrist can find and appreciate his or"
            },
            "slug": "Principles-of-Neural-Science-Alexander",
            "title": {
                "fragments": [],
                "text": "Principles of Neural Science"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The editors have done a masterful job of weaving together the biologic, the behavioral, and the clinical sciences into a single tapestry in which everyone from the molecular biologist to the practicing psychiatrist can find and appreciate his or her own research."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2363971"
                        ],
                        "name": "J. Hertz",
                        "slug": "J.-Hertz",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Hertz",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hertz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46486898"
                        ],
                        "name": "A. Krogh",
                        "slug": "A.-Krogh",
                        "structuredName": {
                            "firstName": "Anders",
                            "lastName": "Krogh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Krogh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50760571"
                        ],
                        "name": "R. Palmer",
                        "slug": "R.-Palmer",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Palmer",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Palmer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "2.1 Cable equation . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 15"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 2
                            }
                        ],
                        "text": "– (Hertz, Krogh, and Palmer, 1991) Older neural networks book."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 38623065,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6c0cbbd275bb43e09f0527a31ddd61824eca295b",
            "isKey": true,
            "numCitedBy": 6517,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "From the Publisher: \nThis book is a comprehensive introduction to the neural network models currently under intensive study for computational applications. It is a detailed, logically-developed treatment that covers the theory and uses of collective computational networks, including associative memory, feed forward networks, and unsupervised learning. It also provides coverage of neural network applications in a variety of problems of both theoretical and practical interest."
            },
            "slug": "Introduction-to-the-theory-of-neural-computation-Hertz-Krogh",
            "title": {
                "fragments": [],
                "text": "Introduction to the theory of neural computation"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This book is a detailed, logically-developed treatment that covers the theory and uses of collective computational networks, including associative memory, feed forward networks, and unsupervised learning."
            },
            "venue": {
                "fragments": [],
                "text": "The advanced book program"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1785682"
                        ],
                        "name": "K. Pearson",
                        "slug": "K.-Pearson",
                        "structuredName": {
                            "firstName": "Keir",
                            "lastName": "Pearson",
                            "middleNames": [
                                "Gordon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Pearson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3906232"
                        ],
                        "name": "C. R. Fourtner",
                        "slug": "C.-R.-Fourtner",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Fourtner",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. R. Fourtner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145014306"
                        ],
                        "name": "R. K. Wong",
                        "slug": "R.-K.-Wong",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Wong",
                            "middleNames": [
                                "K.",
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. K. Wong"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 83109131,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0f7d02244e9bc948ffa509057df6a1d6b6b48214",
            "isKey": false,
            "numCitedBy": 62,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Over the past few years there have been significant advances in our knowledge of the nervous events underlying the leg movements of walking insects. These include (1) the precise description of the discharge patterns of identified motoneurones and the correlation of electrophysiological and behavioural data, (2) the demonstration of central rhythm generators for producing the basic rhythmicity of leg movements, (3) the recording of intracellular events in motoneurones and interneurones during rhythmic leg movements, and (4) the effects on motor output of changes in feedback from leg receptors. The most intensively studied animal has been the cockroach. For this animal it is clear that central mechanisms determine the basic rhythmicity and reciprocity in the activity supplying the muscles producing the alternate flexion and extension movement of the femur. Preliminary studies indicate that non-spiking interneurones are involved in the central patterning of motor output."
            },
            "slug": "NERVOUS-CONTROL-OF-WALKING-IN-THE-COCKROACH-Pearson-Fourtner",
            "title": {
                "fragments": [],
                "text": "NERVOUS CONTROL OF WALKING IN THE COCKROACH"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Preliminary studies indicate that non-spiking interneurones are involved in the central patterning of motor output in the cockroach."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2885922"
                        ],
                        "name": "W. Newsome",
                        "slug": "W.-Newsome",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Newsome",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Newsome"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4192392"
                        ],
                        "name": "K. Britten",
                        "slug": "K.-Britten",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Britten",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Britten"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707107"
                        ],
                        "name": "J. Movshon",
                        "slug": "J.-Movshon",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Movshon",
                            "middleNames": [
                                "Anthony"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Movshon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3216175,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "d4b91865a3c520b7516576dba7f81c30d1e002d2",
            "isKey": false,
            "numCitedBy": 1093,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "THE relationship between neuronal activity and psychophysical judgement has long been of interest to students of sensory processing. Previous analyses of this problem have compared the performance of human or animal observers in detection or discrimination tasks with the signals carried by individual neurons, but have been hampered because neuronal and perceptual data were not obtained at the same time and under the same conditions1–4. We have now measured the performance of monkeys and of visual cortical neurons while the animals performed a psychophysical task well matched to the properties of the neurons under study. Here we report that the reliability and sensitivity of most neurons on this task equalled or exceeded that of the monkeys. We therefore suggest that under our conditions, psychophysical judgements could be based on the activity of a relatively small number of neurons."
            },
            "slug": "Neuronal-correlates-of-a-perceptual-decision-Newsome-Britten",
            "title": {
                "fragments": [],
                "text": "Neuronal correlates of a perceptual decision"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "It is suggested that under the authors' conditions, psychophysical judgements could be based on the activity of a relatively small number of neurons."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48476037"
                        ],
                        "name": "H. L. Bryant",
                        "slug": "H.-L.-Bryant",
                        "structuredName": {
                            "firstName": "H",
                            "lastName": "Bryant",
                            "middleNames": [
                                "L"
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. L. Bryant"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2179120"
                        ],
                        "name": "J. Segundo",
                        "slug": "J.-Segundo",
                        "structuredName": {
                            "firstName": "José",
                            "lastName": "Segundo",
                            "middleNames": [
                                "Pedro"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Segundo"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 230,
                                "start": 178
                            }
                        ],
                        "text": "An interesting effect of noisy I&F neurons is that their timing precision seems to depend no only on the stimulus strength but also on the presence of transients in the stimulus (Bryant and Segundo 1976; Mainen and Sejnowski 1995)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 30763879,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "4afea1dbd2a4b011f212bb3741ecb25a22a82402",
            "isKey": false,
            "numCitedBy": 322,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Those features of a transmembrane current correlated with spike initiation were examined in Aplysia neurones using a Gaussian white‐noise stimulus. This stimulus has the advantages that it presents numerous wave forms in random order without prejudgement as to their efficacies, and that it allows straightforward statistical calculations. 2. Stimulation with a repeating segment of Gaussian white‐noise current revealed remarkable invariance in the firing times of the tested neurones and indicated a high degree of reliability of their response. 3. Frequencies (less than 5 Hz) involved in spike triggering propagated faithfully for up to several millimetres, justifying intrasomatic current injection to examine spike initiation at the trigger locus. 4. Examination of current wave forms preceding spikes indicated that a wide variety could be effective. Hence, a statistical analysis was performed, including computation of probability densities, averages, standard deviations and correlation coefficients of pairs of current values. Each statistic was displayed as a function of time before the spike. 5. The average current trajectory preceding a spike was multiphasic and depended on the presence and polarity of a d.c. bias. An early relatively small inward‐ or outward‐going phase was followed by a large outward phase before the spike. The early phase tended to oppose the polarity of the d.c. bias. 6. The late outward phase of the average current trajectory reached a maximum 40‐‐75 msec before triggering the action potential (AP) and returned to near zero values at the moment of triggering. The fact that the current peak occurs in advance of the AP may be partially explained by a phase delay between the transmembrane current and potential. The failure of the average current trajectory to return to control values immediately following the peak argues for a positive role of the declining phase in spike triggering. 7. Probability densities preceding spikes were Gaussian, indicating that the average was also the most probable value. Although the densities were broad, confirming that spikes were preceded by a wide variety of current wave forms, their standard deviations were reduced significantly with respect to controls, suggesting preferred status of the average current trajectory in spike triggering. 8. The matrix of correlation coefficients between current pairs suggested that spikes tended to be preceded by wave forms that in part kept close to the average current trajectory and in part preserved its shape. 9. The average first and second derivatives of spike‐evoking epochs revealed that current slope and acceleration, respectively, were most crucial in the last 200 msec before spike triggering, and that these dynamic stimulus components were more important for a cell maintained under a depolarizing, rather than a hyperpolarizing bias. 10..."
            },
            "slug": "Spike-initiation-by-transmembrane-current:-a-Bryant-Segundo",
            "title": {
                "fragments": [],
                "text": "Spike initiation by transmembrane current: a white‐noise analysis."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The average first and second derivatives of spike‐evoking epochs revealed that current slope and acceleration were most crucial in the last 200 msec before spike triggering, and that these dynamic stimulus components were more important for a cell maintained under a depolarizing, rather than a hyperpolarizing bias."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4211391"
                        ],
                        "name": "A. Huxley",
                        "slug": "A.-Huxley",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Huxley",
                            "middleNames": [
                                "Fielding"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Huxley"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 155,
                                "start": 141
                            }
                        ],
                        "text": "But in terms of this scaled time qt, the capacitance term becomes larger, C dV dt → qC dV d(qt) , and as a result the spikes are damped more (Huxley, 1959)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 36377829,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "9f6487538fe855543d6839e9ba26500fb5992e16",
            "isKey": false,
            "numCitedBy": 300,
            "numCiting": 56,
            "paperAbstract": {
                "fragments": [],
                "text": "There are several different ways in which the electric activity of a nerve fiber depends on movements of inorganic ions. In the first place, activity at one point on a fiber stimulates the regions ahead by means of local-circuit currents flowing forward in the axis cylinder, out through the membrane, and back in the external fluid. The current in the external fluid is clearly carried by a straightforward process of conduction in an electrolyte, and the same thing is almost certainly true of the current in the axis cylinder. Evidence for this is given by the three following facts: (1) that the longitudinal current obeys Ohm’s law fairly closely (Hodgkin and Rushton, 1946; Rashbass and Rushton, 1949); (2) that the specific resistance of the axoplasm is about what would be expected for an aqueous solution of the ions that are known by chemical analysis to be present; and (3) that the mobility and diffusion coefficient of the internal K+ are close to those in aqueous solution (Hodgkin and Keynes, 1953). The ions in question are partly inorganic-notably potassium-but organic ions are also concerned in some cases a t least. Thus, there are considerable quantities of dicarboxylic amino acids in crustacean nerve (Silber, 1941 ; Lewis, 1952); these are also present in squid nerve, but here the predominant anion appears to be isethionate (Koechlin, 1955). Phosphate esters are also likely to carry an appreciable fraction of the current in all kinds of nerve. A second way in which ion movements are important is in the maintenance of the resting potential. As is well known, Bernstein (1902) suggested, on the basis of the dependence of the demarcation potential on temperature, that the resting potential is a concentration potential, due probably to potassium ions. The ability of K ions to cross the membrane that is required on this theory has been amply demonstrated in recent years both by observing net movements (Boyle and Conway, 1941) and by tracer measurement of K exchange in the resting state (Krogh, 1946, and Keynes and Lewis, 1951u, among others). Although these downhill movements of K are clearly an important factor, they are not the only means by which positive charge is carried outward to maintain the resting potential. On the one hand, C1 ions probably act in the same way (Boyle and Conway, 1941; Hodgkin and Katz, 1949~); Bernstein himself was aware that the C1 concentration ratio was in the right direction, but he appears to have thought (1912, page 99) that an emf due to chloride ions should add to that due to K+, while in fact it is the currents carried by the various ionic species that are additive, the p.d. across the membrane being the same for all. On the other hand, there are also “active” movements of ions (Na and K), which we may regard as the third kind of ion movement of importance in nerve activity. These active movements, in which the net flux of the ion is in the direction that requires work to be done against its electrochemical gradient, have been much studied by tracer methods, and they are clearly essential for the"
            },
            "slug": "ION-MOVEMENTS-DURING-NERVE-ACTIVITY-Huxley",
            "title": {
                "fragments": [],
                "text": "ION MOVEMENTS DURING NERVE ACTIVITY"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "There are several different ways in which the electric activity of a nerve fiber depends on movements of inorganic ions, including in the maintenance of the resting potential, which Bernstein (1902) suggested was a concentration potential."
            },
            "venue": {
                "fragments": [],
                "text": "Annals of the New York Academy of Sciences"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1732302"
                        ],
                        "name": "J. Koza",
                        "slug": "J.-Koza",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Koza",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koza"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14564380,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "86eb2582a934b47a1fcaee8c84511e70d7897c1d",
            "isKey": false,
            "numCitedBy": 714,
            "numCiting": 111,
            "paperAbstract": {
                "fragments": [],
                "text": "Many seemingly different problems in artificial intelligence, symbolic processing, and machine learning can be viewed as requiring discovery of a computer program that produces some desired output for particular inputs. When viewed in this way, the process of solving these problems becomes equivalent to searching a space of possible computer programs for a most fit individual computer program. The new \"genetic programming\" paradigm described herein provides a way to search for this most fit individual computer program. In this new \"genetic programming\" paradigm, populations of computer programs are genetically bred using the Darwinian principle of survival of the fittest and using a genetic crossover (recombination) operator appropriate for genetically mating computer programs. In this paper, the process of formulating and solving problems using this new paradigm is illustrated using examples from various areas. Examples come from the areas of machine learning of a function; planning; sequence induction; function function identification (including symbolic regression, empirical discovery, \"data to function\" symbolic integration, \"data to function\" symbolic differentiation); solving equations, including differential equations, integral equations, and functional equations); concept formation; automatic programming; pattern recognition, time-optimal control; playing differential pursuer-evader games; neural network design; and finding a game-playing strategyfor a discrete game in extensive form."
            },
            "slug": "Genetic-programming:-a-paradigm-for-genetically-of-Koza",
            "title": {
                "fragments": [],
                "text": "Genetic programming: a paradigm for genetically breeding populations of computer programs to solve problems"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "In this new \"genetic programming\" paradigm, populations of computer programs are genetically bred using the Darwinian principle of survival of the fittest and using a genetic crossover (recombination) operator appropriate for genetically mating computer programs."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4354863"
                        ],
                        "name": "R. Keynes",
                        "slug": "R.-Keynes",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Keynes",
                            "middleNames": [
                                "Darwin"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Keynes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 178,
                                "start": 165
                            }
                        ],
                        "text": "Using patch-clamp recording these fluctuations can be measured, and the single channel conductance has been determined and is about 10-100 pS for most channel types (Hille, 2001)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 193,
                                "start": 180
                            }
                        ],
                        "text": "Reading: For mathematical aspects of biophysics (Koch, 1999; Johnston and Wu, 1995), everything about channels including an excellent review of the work of Hodgkin and Huxley, see (Hille, 2001)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 58,
                                "start": 45
                            }
                        ],
                        "text": "Very readable accounts can be found in Hille (Hille, 2001)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 31544573,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "437c0d2b4b845a17f1d0978ad917f4b20bbbff99",
            "isKey": false,
            "numCitedBy": 3061,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "The ionic channels in excitable membranes are of two classes: those that open and close when the membrane potential alters and those that respond to the release of an appropriate chemical transmitter. The former are responsible for the conduction of impulses in nerve and muscle fibres and the latter for synaptic transmission. It is now clear that the sodium and potassium channels in electrically excitable membranes are functionally distinct, since each can be blocked without affecting the behaviour of the other. It has recently proved possible to study, in the voltage-clamped squid giant axon, the movements of the mobile charges or dipoles that form the voltage-sensitive portion of the sodium channels, which give rise to the so-called 'gating' current. Detailed comparisons can now be made between the kinetics of the ionic conductances as described by Hodgkin & Huxley, and the steady-state distribution and kinetics of the charged controlling particles, which should lead to useful conclusions about the intramolecular organization of the sodium channels and the conformational changes that take place under the influence of the electric field. There is as yet little information about the chemical nature of the electrically excitable channels, but significant progress has been made towards the isolation and characterization of the acetylcholine receptors in muscle and electric organ."
            },
            "slug": "The-ionic-channels-in-excitable-membranes.-Keynes",
            "title": {
                "fragments": [],
                "text": "The ionic channels in excitable membranes."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Comparisons can now be made between the kinetics of the ionic conductances as described by Hodgkin & Huxley, and the steady-state distribution and kinetic changes of the charged controlling particles, which should lead to useful conclusions about the intramolecular organization of the sodium channels and the conformational changes that take place under the influence of the electric field."
            },
            "venue": {
                "fragments": [],
                "text": "Ciba Foundation symposium"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117454631"
                        ],
                        "name": "T. Sejnowski",
                        "slug": "T.-Sejnowski",
                        "structuredName": {
                            "firstName": "Terry",
                            "lastName": "Sejnowski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Sejnowski"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 62,
                                "start": 45
                            }
                        ],
                        "text": "One can introduce a covariance learning rule (Sejnowski, 1976) wi = 2(xi − 〈xi〉)(y − 〈y〉)"
                    },
                    "intents": []
                }
            ],
            "corpusId": 32481732,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "06750975439e79fcd852cbcdc38bf1ef084af89a",
            "isKey": false,
            "numCitedBy": 174,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Statistical-constraints-on-synaptic-plasticity.-Sejnowski",
            "title": {
                "fragments": [],
                "text": "Statistical constraints on synaptic plasticity."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of theoretical biology"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3672557"
                        ],
                        "name": "W. Levick",
                        "slug": "W.-Levick",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Levick",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Levick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 56
                            }
                        ],
                        "text": "Here we discuss this argument for the spatial filtering (van Hateren, 1992; Atick and Redlich, 1992; Barlow and Levick, 1965)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2958177,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e11827caa9565f1b126f97865ebc1e28501dba01",
            "isKey": false,
            "numCitedBy": 1562,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "Directionally selective single units have recently been found in the cerebral cortex of cats (Hubel, 1959; Hubel & Wiesel, 1959, 1962), the optic tectum of frogs and pigeons (Lettvin, Maturana, McCulloch & Pitts, 1959; Maturana & Frenk, 1963), and the retinae of rabbits (Barlow & Hill, 1963; Barlow, Hill & Levick, 1964). The term 'directionally selective' means that a unit gives a vigorous discharge of impulses when a stimulus object is moved through its receptive field in one direction (called the preferred direction), whereas motion in the reverse direction (called null) evokes little or no response. The preferred direction differs in different units, and the activity of a set of such units signals the direction of movement of objects in the visual field. In the rabbit the preferred and null directions cannot be predicted from a map of the receptive field showing the regions yielding on or off-responses to stationary spots. Furthermore, the preferred direction is unchanged by changing the stimulus; in particular, reversing the contrast of a spot or a black-white border does not reverse the preferred direction. Hubel & Wiesel (1962) thought that the directional selectivity of the cat's cortical neurons could be explained by the asymmetrical arrangement of on and off zones in the receptive field, and the simple interaction of effects summated over these zones, but the foregoing results rule out this explanation, at least in the rabbit's retina (Barlow & Hill, 1963). In the present paper we go on from this point to describe experiments which show, first, that directional selectivity is not due to optical aberrations of some kind and, secondly, that it is not a simple matter of the latency of response varying systematically across the receptive field. After these negative results we describe experiments upon the organization of directional selectivity within the receptive field, and upon its mechanism. These lead us to the conclusion that the ganglion cells responding to a"
            },
            "slug": "The-mechanism-of-directionally-selective-units-in-Barlow-Levick",
            "title": {
                "fragments": [],
                "text": "The mechanism of directionally selective units in rabbit's retina."
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Experiments are described which show, first, that directional selectivity is not due to optical aberrations of some kind and, secondly, that it is not a simple matter of the latency of response varying systematically across the receptive field."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143980023"
                        ],
                        "name": "S. Kauffman",
                        "slug": "S.-Kauffman",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Kauffman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Kauffman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8617805,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "aa7cc8c8ad0d6439f800e3d7d751d4e8e3c86741",
            "isKey": false,
            "numCitedBy": 427,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "M athematical discoveries are in­ viting changes in biologists' thinking about the origins of order in evolution. All living things are highly ordered systems: they have intri­ cate structures that are maintained and even duplicated through a precise bal­ let of chemical and behavioral activi­ ties. Since Darwin, biologists have seen natural selection as virtually the sole source of that order. But Darwin could not have suspected the existence of self-organization, a re­ cently discovered, innate property of some complex systems. It is possible that biological order reflects in part a spontaneous order on which selection has acted. Selection has molded, but was not compelled to invent, the na­ tive coherence of ontogeny, or biologi­ cal development. Indeed, the capacity to evolve and adapt may itself be an achievement of evolution. The studies supporting these conclu­ sions remain tentative and incomplete. Nevertheless, on the basis of mathe­ matical models for biological systems that exhibit self-organization,. one can make predictions that are consistent with the observed properties of organ­ isms. We may have begun to understand evolution as the marriage of selection and self-organization. To understand how self-organization"
            },
            "slug": "Antichaos-and-adaptation.-Kauffman",
            "title": {
                "fragments": [],
                "text": "Antichaos and adaptation."
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "The authors may have begun to understand evolution as the marriage of selection and self-organization, and one can make predictions that are consistent with the observed properties of organ­ isms."
            },
            "venue": {
                "fragments": [],
                "text": "Scientific American"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 121
                            }
                        ],
                        "text": "The idea of removing correlation (redundancies) in the visual signal before sending it on the cortex dates back to Barlow(Barlow, 1958)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 13556219,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "4fb350efc2c60f226ebcd17a914474e718c9b341",
            "isKey": false,
            "numCitedBy": 667,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "The present experiments were undertaken as part of an investigation of the suggestion made by Rose (1942, 1948) and de Vries (1943) that human visual performance is limited by the inevitable fluctuations in the numbers of quanta absorbed in the retina. In a previous paper (Barlow, 1957) it was shown that this idea (modified by assuming that there is also a weak intrinsic source of noise) leads to theoretical curves which fit experimental determinations of increment threshold made with a short duration small area test stimulus superimposed upon a large uniform adapting field. It was also shown that big changes in the amount of temporal and spatial summation occur when the background intensity is changed, with the result that when thresholds are determined with a long duration large area test stimulus the experimental points deviate from the appropriate theoretical curve and tend to obey the Weber law instead. In following up this finding there were two objectives. The quantum fluctuation hypothesis predicts that the increment threshold intensity should be inversely proportional to the square root ofthe area and duration ofthe stimulus, and the first object was to find whether the occurrence of these laws fitted in with the hypothesis: the results show that the predicted laws of summation do hold over certain ranges, but when they hold the actual values of the thresholds are higher than the theory predicts. The second objective was to determine the parameters oc and r which were introduced in the previous paper; these are the area and time over which quanta absorbed from the background light are liable to be confused with those absorbed from a short duration small area stimulus light, and here the results obtained are disappointing, for one can only derive lower limits to these quantities. On the other hand, the results do show up the complicated interrelations between temporal and spatial summation and background intensity; tentative explanations of these effects, and of the failure to perform up to the quantal fluctuation limit, are put forward. 22 PHYSIO. CXLI"
            },
            "slug": "Temporal-and-spatial-summation-in-human-vision-at-Barlow",
            "title": {
                "fragments": [],
                "text": "Temporal and spatial summation in human vision at different background intensities"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The present experiments show up the complicated interrelations between temporal and spatial summation and background intensity; tentative explanations of these effects, and of the failure to perform up to the quantal fluctuation limit, are put forward."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94059053"
                        ],
                        "name": "H. Simon",
                        "slug": "H.-Simon",
                        "structuredName": {
                            "firstName": "Herbert",
                            "lastName": "Simon",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Simon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62586095,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "724e671b43ba51113e92c68f05301c686ad2fc1c",
            "isKey": false,
            "numCitedBy": 8174,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "Continuing his exploration of the organization of complexity and the science of design, this new edition of Herbert Simon's classic work on artificial intelligence adds a chapter that sorts out the current themes and tools -- chaos, adaptive systems, genetic algorithms -- for analyzing complexity and complex systems. There are updates throughout the book as well. These take into account important advances in cognitive psychology and the science of design while confirming and extending the book's basic thesis: that a physical symbol system has the necessary and sufficient means for intelligent action. The chapter \"Economic Reality\" has also been revised to reflect a change in emphasis in Simon's thinking about the respective roles of organizations and markets in economic systems."
            },
            "slug": "The-Sciences-of-the-Artificial-Simon",
            "title": {
                "fragments": [],
                "text": "The Sciences of the Artificial"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "11969212"
                        ],
                        "name": "K. Sakai",
                        "slug": "K.-Sakai",
                        "structuredName": {
                            "firstName": "Kuniyoshi",
                            "lastName": "Sakai",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Sakai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31511108"
                        ],
                        "name": "Y. Miyashita",
                        "slug": "Y.-Miyashita",
                        "structuredName": {
                            "firstName": "Yasushi",
                            "lastName": "Miyashita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Miyashita"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 146,
                                "start": 119
                            }
                        ],
                        "text": "one found that cells pick up rather the pairing between the images rather than similarities in the shape of the images (Sakai and Miyashita, 1991)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 4371912,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "82ed0bc42108ea0ac45188d086476d621b67b649",
            "isKey": false,
            "numCitedBy": 733,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "MOST of our long-term memories of episodes or objects are organized so that we can retrieve them by association. Clinical neuropsychologists assess human memory by the paired-associate learning test, in which a series of paired words or figures is presented and the subject is then asked to retrieve the other pair member associated with each cue1. Patients with lesions of the temporal lobe show marked impairment in this test2–6. In our study, we trained monkeys in a pair-association task7 using a set of computer-generated paired patterns. We found two types of task-related neurons in the anterior temporal cortex. One type selectively responded to both pictures of the paired associates. The other type, which had the strongest response to one picture during the cue presentation, exhibited increasing activity during the delay period when the associate of that picture was used as a cue. These results provide new evidence that single neurons acquire selectivity for visual patterns through associative learning. They also indicate neural mechanisms for storage and retrieval in the long-term memory of paired associates."
            },
            "slug": "Neural-organization-for-the-long-term-memory-of-Sakai-Miyashita",
            "title": {
                "fragments": [],
                "text": "Neural organization for the long-term memory of paired associates"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Two types of task-related neurons in the anterior temporal cortex are found, which provide new evidence that single neurons acquire selectivity for visual patterns through associative learning and indicate neural mechanisms for storage and retrieval in the long-term memory of paired associates."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143980023"
                        ],
                        "name": "S. Kauffman",
                        "slug": "S.-Kauffman",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Kauffman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Kauffman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115488282"
                        ],
                        "name": "Robert G. Smith",
                        "slug": "Robert-G.-Smith",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Smith",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Robert G. Smith"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61397043,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c18540485abd5ae46f2263d0fc9ad392fa2abc1d",
            "isKey": false,
            "numCitedBy": 60,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Adaptive-automata-based-on-Darwinian-selection-Kauffman-Smith",
            "title": {
                "fragments": [],
                "text": "Adaptive automata based on Darwinian selection"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701876"
                        ],
                        "name": "P. Maes",
                        "slug": "P.-Maes",
                        "structuredName": {
                            "firstName": "Pattie",
                            "lastName": "Maes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Maes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72419159"
                        ],
                        "name": "R. Brooks",
                        "slug": "R.-Brooks",
                        "structuredName": {
                            "firstName": "Rodney",
                            "lastName": "Brooks",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Brooks"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1566702,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "269047d9b8ea3594c665399e4d029b1990307ed4",
            "isKey": false,
            "numCitedBy": 478,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe an algorithm which allows a behavior-based robot to learn on the basis of positive and negative feedback when to activate its behaviors. In accordance with the philosophy of behavior-based robots, the algorithm is completely distributed: each of the behaviors independently tries to sensors find out (i) whether it is relevant (i.e. whether it is at all correlated to positive feedback) and (ii) what the conditions are under which it becomes reliable (i.e. the conditions under which it maximises the probability of receiving positive feedback and minimises the probability of receiving negative feedback). The algorithm has been tested successfully on an autonomous 6-legged robot which had to learn how to coordinate its legs so as to walk forward."
            },
            "slug": "Learning-to-Coordinate-Behaviors-Maes-Brooks",
            "title": {
                "fragments": [],
                "text": "Learning to Coordinate Behaviors"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "An algorithm which allows a behavior-based robot to learn on the basis of positive and negative feedback when to activate its behaviors has been described and tested successfully on an autonomous 6-legged robot."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107584303"
                        ],
                        "name": "J. P. Jones",
                        "slug": "J.-P.-Jones",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Jones",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. P. Jones"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3459632"
                        ],
                        "name": "L. Palmer",
                        "slug": "L.-Palmer",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Palmer",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Palmer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17527051,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "43e0874cb25bfe27dde52776852b154564a8d3a3",
            "isKey": false,
            "numCitedBy": 833,
            "numCiting": 56,
            "paperAbstract": {
                "fragments": [],
                "text": "1. A reverse correlation (6, 8, 25, 35) method is developed that allows quantitative determination of visual receptive-field structure in two spatial dimensions. This method is applied to simple cells in the cat striate cortex. 2. It is demonstrated that the reverse correlation method yields results with several desirable properties, including convergence and reproducibility independent of modest changes in stimulus parameters. 3. In contrast to results obtained with moving stimuli, we find that the bright and dark excitatory subregions in simple receptive fields do not overlap to any great extent. This difference in results may be attributed to confounding the independent variables space and time when using moving stimuli. 4. All simple receptive fields have subregions that vary smoothly in all directions in space. There are no sharp transitions either between excitatory subregions or between subregions and the area surrounding the receptive field. 5. Simple receptive fields vary both in the number of subregions observed, in the elongation of each subregion, and in the overall elongation of the field. In contrast with results obtained using moving stimuli, we find that subregions within a given receptive field need not be the same length. 6. The hypothesis that simple receptive fields can be modeled as either even symmetric or odd symmetric about a central axis is evaluated. This hypothesis is found to be false in general. Most simple receptive fields are neither even symmetric nor odd symmetric. 7. The hypothesis that simple receptive fields can be modeled as the product of a width response profile and an orthogonal length response profile (Cartesian separability) is evaluated. This hypothesis is found to be true for only approximately 50% of the cells in our sample."
            },
            "slug": "The-two-dimensional-spatial-structure-of-simple-in-Jones-Palmer",
            "title": {
                "fragments": [],
                "text": "The two-dimensional spatial structure of simple receptive fields in cat striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "A reverse correlation method is developed that allows quantitative determination of visual receptive-field structure in two spatial dimensions and it is demonstrated that thereverse correlation method yields results with several desirable properties, including convergence and reproducibility independent of modest changes in stimulus parameters."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "13024153"
                        ],
                        "name": "C. Stevens",
                        "slug": "C.-Stevens",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Stevens",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Stevens"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 180,
                                "start": 167
                            }
                        ],
                        "text": "It turns out to be valid for small perturbations of the potential around the resting potential, but at high frequencies corrections to the simple RC behaviours exist (Stevens, 1972)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2426487,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "e126feb4b804ed7552558700b83cbef901e37fbe",
            "isKey": false,
            "numCitedBy": 255,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Inferences-about-membrane-properties-from-noise-Stevens",
            "title": {
                "fragments": [],
                "text": "Inferences about membrane properties from electrical noise measurements."
            },
            "venue": {
                "fragments": [],
                "text": "Biophysical journal"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143980023"
                        ],
                        "name": "S. Kauffman",
                        "slug": "S.-Kauffman",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Kauffman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Kauffman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124512625,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "433b530c5a19bd74600d0a53b65332407dd58220",
            "isKey": false,
            "numCitedBy": 148,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Requirements-for-evolvability-in-complex-systems:-Kauffman",
            "title": {
                "fragments": [],
                "text": "Requirements for evolvability in complex systems: orderly dynamics and frozen components"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144404817"
                        ],
                        "name": "J. Holland",
                        "slug": "J.-Holland",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Holland",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Holland"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58781161,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4b4279db68b16e20fbc56f9d41980a950191d30a",
            "isKey": false,
            "numCitedBy": 38742,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "Name of founding work in the area. Adaptation is key to survival and evolution. Evolution implicitly optimizes organisims. AI wants to mimic biological optimization { Survival of the ttest { Exploration and exploitation { Niche nding { Robust across changing environments (Mammals v. Dinos) { Self-regulation,-repair and-reproduction 2 Artiicial Inteligence Some deenitions { \"Making computers do what they do in the movies\" { \"Making computers do what humans (currently) do best\" { \"Giving computers common sense; letting them make simple deci-sions\" (do as I want, not what I say) { \"Anything too new to be pidgeonholed\" Adaptation and modiication is root of intelligence Some (Non-GA) branches of AI: { Expert Systems (Rule based deduction)"
            },
            "slug": "Adaptation-in-natural-and-artificial-systems-Holland",
            "title": {
                "fragments": [],
                "text": "Adaptation in natural and artificial systems"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "Names of founding work in the area of Adaptation and modiication, which aims to mimic biological optimization, and some (Non-GA) branches of AI."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38761052"
                        ],
                        "name": "M. Rudnick",
                        "slug": "M.-Rudnick",
                        "structuredName": {
                            "firstName": "Mike",
                            "lastName": "Rudnick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Rudnick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144409142"
                        ],
                        "name": "D. Hammerstrom",
                        "slug": "D.-Hammerstrom",
                        "structuredName": {
                            "firstName": "Dan",
                            "lastName": "Hammerstrom",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hammerstrom"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 205119110,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "0f87b35116c0721909b99178396b448121d34536",
            "isKey": false,
            "numCitedBy": 12,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-interconnect-structure-for-wafer-scale-Rudnick-Hammerstrom",
            "title": {
                "fragments": [],
                "text": "An interconnect structure for wafer scale neurocomputers"
            },
            "venue": {
                "fragments": [],
                "text": "Neural Networks"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2225570"
                        ],
                        "name": "A. Hodgkin",
                        "slug": "A.-Hodgkin",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Hodgkin",
                            "middleNames": [
                                "Lloyd"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Hodgkin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4211391"
                        ],
                        "name": "A. Huxley",
                        "slug": "A.-Huxley",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Huxley",
                            "middleNames": [
                                "Fielding"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Huxley"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 99
                            }
                        ],
                        "text": "The magnificent series of papers of Hodgkin and Huxley in 1952 explains how spike generation works(Hodgkin and Huxley, 1952)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 20873334,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0d499ac0de809d38210140ab6e21c2e399838987",
            "isKey": false,
            "numCitedBy": 15508,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "This article concludes a series of papers concerned with the flow of electric current through the surface membrane of a giant nerve fibre (Hodgkinet al., 1952,J. Physiol.116, 424–448; Hodgkin and Huxley, 1952,J. Physiol.116, 449–566). Its general object is to discuss the results of the preceding papers (Section 1), to put them into mathematical form (Section 2) and to show that they will account for conduction and excitation in quantitative terms (Sections 3–6)."
            },
            "slug": "A-quantitative-description-of-membrane-current-and-Hodgkin-Huxley",
            "title": {
                "fragments": [],
                "text": "A quantitative description of membrane current and its application to conduction and excitation in nerve."
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "This article concludes a series of papers concerned with the flow of electric current through the surface membrane of a giant nerve fibre by putting them into mathematical form and showing that they will account for conduction and excitation in quantitative terms."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1952
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145402697"
                        ],
                        "name": "M. Abeles",
                        "slug": "M.-Abeles",
                        "structuredName": {
                            "firstName": "Moshe",
                            "lastName": "Abeles",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Abeles"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 58,
                                "start": 44
                            }
                        ],
                        "text": "This behaviour is called the syn-fire chain (Abeles, 1991), and is not captured with the rate description."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 59742572,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d9102702973d1cbf55b6cf6dfa0e5f149a42c742",
            "isKey": false,
            "numCitedBy": 1579,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Preface 1. Anatomy of the cerebral cortex 2. The probability for synaptic contact between neurons in the cortex 3. Processing of spikes by neural networks 4. Relations between membrane potential and the synaptic response curve 5. Models of neural networks 6. Transmission through chains of neurons 7. Synchronous transmission Appendix Index."
            },
            "slug": "Corticonics:-Neural-Circuits-of-Cerebral-Cortex-Abeles",
            "title": {
                "fragments": [],
                "text": "Corticonics: Neural Circuits of Cerebral Cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "This work has shown that not only is the probability for synaptic contact between neurons in the cortex high, but also the relationship between membrane potential and synaptic response curve is low."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50400561"
                        ],
                        "name": "G. Miller",
                        "slug": "G.-Miller",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Miller",
                            "middleNames": [
                                "Parsons"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Miller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14024873"
                        ],
                        "name": "P. Todd",
                        "slug": "P.-Todd",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Todd",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Todd"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 141699237,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "953269c6001af71fec8752bde4cef13e1b047095",
            "isKey": false,
            "numCitedBy": 49,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Exploring-Adaptive-Agency-I:-Theory-and-Methods-for-Miller-Todd",
            "title": {
                "fragments": [],
                "text": "Exploring Adaptive Agency I: Theory and Methods for Simulating the Evolution of Learning"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1858054"
                        ],
                        "name": "P. Földiák",
                        "slug": "P.-Földiák",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Földiák",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Földiák"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 100
                            }
                        ],
                        "text": "Invariances can be learned using the trace-rule, which links inputs that are presented subsequently (Földiák, 1991)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2175819,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2da4e9984a75ffe28c5364662807996ac5bb2662",
            "isKey": false,
            "numCitedBy": 698,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "The visual system can reliably identify objects even when the retinal image is transformed considerably by commonly occurring changes in the environment. A local learning rule is proposed, which allows a network to learn to generalize across such transformations. During the learning phase, the network is exposed to temporal sequences of patterns undergoing the transformation. An application of the algorithm is presented in which the network learns invariance to shift in retinal position. Such a principle may be involved in the development of the characteristic shift invariance property of complex cells in the primary visual cortex, and also in the development of more complicated invariance properties of neurons in higher visual areas."
            },
            "slug": "Learning-Invariance-from-Transformation-Sequences-Földiák",
            "title": {
                "fragments": [],
                "text": "Learning Invariance from Transformation Sequences"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An application of the algorithm is presented in which the network learns invariance to shift in retinal position, which may be involved in the development of the characteristic shift invariance property of complex cells in the primary visual cortex and also in theDevelopment of more complicated invariance properties of neurons in higher visual areas."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Comput."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152992394"
                        ],
                        "name": "A. Engel",
                        "slug": "A.-Engel",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Engel",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Engel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40089171"
                        ],
                        "name": "P. König",
                        "slug": "P.-König",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "König",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. König"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712899"
                        ],
                        "name": "W. Singer",
                        "slug": "W.-Singer",
                        "structuredName": {
                            "firstName": "Wolf",
                            "lastName": "Singer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Singer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 24482184,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "341266b713233fda00c708e7f073079e92a3720c",
            "isKey": false,
            "numCitedBy": 412,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Theoretical studies have suggested that scene segmentation may be accomplished by a temporal coding mechanism using synchronization of neuronal responses. Here we report a direct experimental test of this hypothesis. Neuronal responses were recorded simultaneously from two to four sites with overlapping receptive fields in cat visual cortex. Correlation analysis revealed that all cells synchronized their responses irrespective of their orientation preference when they were activated by a single light bar. However, when stimulated with two superimposed light bars of different orientations, the same cells segregated into distinct assemblies according to their orientation preferences. Within each of these assemblies responses were synchronized, but correlation was absent between the two assemblies. These results are compatible with the hypothesis that responses to individual objects in a scene are distinguished by synchrony, whereas responses to different objects show no temporal correlation, thus allowing for the segmentation of superimposed stimuli. We conclude that stimulus-specific synchronization of spatially distributed neuronal responses may provide a physiological mechanism for scene segmentation."
            },
            "slug": "Direct-physiological-evidence-for-scene-by-temporal-Engel-König",
            "title": {
                "fragments": [],
                "text": "Direct physiological evidence for scene segmentation by temporal coding."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "It is concluded that stimulus-specific synchronization of spatially distributed neuronal responses may provide a physiological mechanism for scene segmentation by allowing for the segmentation of superimposed stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the National Academy of Sciences of the United States of America"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2962919"
                        ],
                        "name": "G. Gerstein",
                        "slug": "G.-Gerstein",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Gerstein",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Gerstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46561670"
                        ],
                        "name": "B. Mandelbrot",
                        "slug": "B.-Mandelbrot",
                        "structuredName": {
                            "firstName": "Benoit",
                            "lastName": "Mandelbrot",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Mandelbrot"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 51
                            }
                        ],
                        "text": "This in reasonable agreement with cortical neurons (Gerstein and Mandelbrot, 1964)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 62
                            }
                        ],
                        "text": "The voltage obeys a diffusion equation as we will see shortly (Gerstein and Mandelbrot, 1964)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 13525603,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a031fb344382eb9bce7a94e868b251d854f2a323",
            "isKey": false,
            "numCitedBy": 740,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "RANDOM-WALK-MODELS-FOR-THE-SPIKE-ACTIVITY-OF-A-Gerstein-Mandelbrot",
            "title": {
                "fragments": [],
                "text": "RANDOM WALK MODELS FOR THE SPIKE ACTIVITY OF A SINGLE NEURON."
            },
            "venue": {
                "fragments": [],
                "text": "Biophysical journal"
            },
            "year": 1964
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1726997"
                        ],
                        "name": "E. Oja",
                        "slug": "E.-Oja",
                        "structuredName": {
                            "firstName": "Erkki",
                            "lastName": "Oja",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Oja"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 23,
                                "start": 12
                            }
                        ],
                        "text": "This rule is(Oja, 1982) ∆wi = 2(xiy − wiy(2)) It is not difficult to show that the steady state needs to be an eigenvector ofQ."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 142,
                                "start": 99
                            }
                        ],
                        "text": "It is somewhat more effort to show that only the eigenvector with the largest eigenvalue is stable (Oja, 1982; Hertz, Krogh, and Palmer, 1991)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16577977,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3e00dd12caea7c4dab1633a35d1da3cb2e76b420",
            "isKey": false,
            "numCitedBy": 2357,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "A simple linear neuron model with constrained Hebbian-type synaptic modification is analyzed and a new class of unconstrained learning rules is derived. It is shown that the model neuron tends to extract the principal component from a stationary input vector sequence."
            },
            "slug": "Simplified-neuron-model-as-a-principal-component-Oja",
            "title": {
                "fragments": [],
                "text": "Simplified neuron model as a principal component analyzer"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A simple linear neuron model with constrained Hebbian-type synaptic modification is analyzed and a new class of unconstrained learning rules is derived."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of mathematical biology"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47946008"
                        ],
                        "name": "C. Langton",
                        "slug": "C.-Langton",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Langton",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Langton"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 61367843,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "83c6771fa55d8bbfae936f7fa57f90b023075abb",
            "isKey": false,
            "numCitedBy": 542,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Self-reproduction-in-cellular-automata-Langton",
            "title": {
                "fragments": [],
                "text": "Self-reproduction in cellular automata"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143898851"
                        ],
                        "name": "S. Wolfram",
                        "slug": "S.-Wolfram",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Wolfram",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Wolfram"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122449350,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "56888aec3c80b07229a96d7713ea6727e5a320c9",
            "isKey": false,
            "numCitedBy": 1650,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Theory-and-Applications-of-Cellular-Automata-Wolfram",
            "title": {
                "fragments": [],
                "text": "Theory and Applications of Cellular Automata"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143980023"
                        ],
                        "name": "S. Kauffman",
                        "slug": "S.-Kauffman",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Kauffman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Kauffman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 63866967,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "41b7a1870b582ce4be675dae5ab0ed0b3f036641",
            "isKey": false,
            "numCitedBy": 7724,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Conceptual outline of current evolutionary theory PART I: ADAPTATION ON THE EDGE OF CHAOS 2. The structure of rugged fitness landscapes 3. Biological implications of rugged fitness landscapes 4. The structure of adaptive landscapes underlying protein evolution 5. Self organization and adaptation in complex systems 6. Coevolving complex systems PART II: THE CRYSTALLIZATION OF LIFE 7. The origins of life: a new view 8. The origin of a connected metabolism 9. Autocatalytic polynucleotide systems: hypercycles, spin glasses and coding 10. Random grammars PART III: ORDER AND ONTOGENY 11. The architecture of genetic regulatory circuits and its evolution 12. Differentiation: the dynamical behaviors of genetic regulatory networks 13. Selection for gene expression in cell type 14. Morphology, maps and the spatial ordering of integrated tissues"
            },
            "slug": "Origins-of-Order:-self-organization-and-selection-Kauffman",
            "title": {
                "fragments": [],
                "text": "Origins of Order: self-organization and selection in evolution"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The structure of rugged fitness landscapes and the structure of adaptive landscapes underlying protein evolution, and the architecture of genetic regulatory circuits and its evolution."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1832489"
                        ],
                        "name": "A. Perelson",
                        "slug": "A.-Perelson",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Perelson",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Perelson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143980023"
                        ],
                        "name": "S. Kauffman",
                        "slug": "S.-Kauffman",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Kauffman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Kauffman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 83345832,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "db3c6747f5fcd7db0b8670aec4283ad069afd36e",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Rugged Landscapes and Evolution * Optimization on Rugged Landscapes Richard Palmer * A Spin-Glass Model of Evolution C. Amitrano, L. Peliti, and M. Saber * What Can Physics Do For Biology? D. L. Stein * Optimization of RNA Structure and Properties P. Schuster Somatic Evolution of Antibody Variable-Region Genes & Maturation of the Immune Response * Affinity Maturation: A Retrospective View Herman N. Eisen * Maturation through Hypermutation and Selection C. Berek and M. Apel * Affinity Maturation on Rugged Landscapes Catherine Macken and Alan S. Perelson * Maturation of the Humoral Immune Response: A Neo-Darwinian Process? Tim Manser * The NK Model of Rugged Fitness Landscapes and Its Application to Maturation of the Immune Response Stuart A. Kauffman and Edward D. Weinberger * Use of Antibodies as Molecular Mimics to Probe Intermolecular Interaction Landscapes William V. Williams, Thomas Kieber-Wmmons, David B. Weiner, and Mark I. Greene * Affinity Maturation and Leaning in Immune Networks Grard Weisbuch and Alan S. Perelson * Auto-Anti-Idiotype and Antigen as Selective Factors Driving B-Cell Affinity Maturation in the Immune System Gregory W. Siskind * Somatic Mutation and the Antibody Repertoire: A Computational Model of Shape Space Richard G. Weinand Applied Molecular Evolution * Evolution of Proteins from Random Sequences: A Model for the Protein Sequence Space and an Experimental Wlodek Mandecki * Studies in the Evolution of Biological Activity from Random Sequences Marshall S. Z. Horwitz, Dipak K. Dube, and Lawrence A. Loeb * The Catalytic Potential of RNA Debra L. Robertson and Gerald F. Joyce Origin of Life Models * Dynamics of Autocatalytic Reaction Networks P. Schuster"
            },
            "slug": "Molecular-evolution-on-rugged-landscapes-:-RNA-and-Perelson-Kauffman",
            "title": {
                "fragments": [],
                "text": "Molecular evolution on rugged landscapes : proteins, RNA and the immune system : the proceedings of the Workshop on Applied Molecular Evolution and the Maturation of the Immune Response, held March, 1989 in Santa Fe, New Mexico"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2668183"
                        ],
                        "name": "G. Buchsbaum",
                        "slug": "G.-Buchsbaum",
                        "structuredName": {
                            "firstName": "Gershon",
                            "lastName": "Buchsbaum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Buchsbaum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3485613"
                        ],
                        "name": "A. Gottschalk",
                        "slug": "A.-Gottschalk",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Gottschalk",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Gottschalk"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23369551,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a641c50f2f3c5e5dd7814af62e0b8b0f15259d09",
            "isKey": false,
            "numCitedBy": 507,
            "numCiting": 86,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a systematic analysis of the role of opponent type processing in colour vision and the relation between opponent type colour transformations and the initial three colour mechanisms. It is shown that efficient information transmission is achieved by a transformation of the initial three colour mechanisms into an achromatic and two opponent chromatic channels. The derivation of the transformation is dependent solely on criteria from information theory. Thus it provides a logical rationale reconciling opponent type processing as an optimal necessary step after the initial three colour mechanisms, unifying respectively the Hering and Young-Helmholtz approaches to colour vision. The effects of chromatic adaptation on the spectral response of the achromatic and two chromatic channels are discussed from the point of view of information theory. It is argued that adaptation serves as a dynamic readjustment of these responses, necessary to meet criteria of efficient colour information transmission. The results are confronted with empirical observations to test the principles of the theory and the relation to other theories is discussed. Within the same framework the issue of trichromacy is discussed. It is argued that a broad class of typical colour spectra can effectively be represented by three significant degrees of freedom that make up a trichromatic system."
            },
            "slug": "Trichromacy,-opponent-colours-coding-and-optimum-in-Buchsbaum-Gottschalk",
            "title": {
                "fragments": [],
                "text": "Trichromacy, opponent colours coding and optimum colour information transmission in the retina"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "It is shown that efficient information transmission is achieved by a transformation of the initial three colour mechanisms into an achromatic and two opponent chromatic channels, providing a logical rationale reconciling opponent type processing as an optimal necessary step after the initialThree colour mechanisms."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3217370"
                        ],
                        "name": "R. von der Heydt",
                        "slug": "R.-von-der-Heydt",
                        "structuredName": {
                            "firstName": "Rüdiger",
                            "lastName": "von der Heydt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. von der Heydt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47931248"
                        ],
                        "name": "E. Peterhans",
                        "slug": "E.-Peterhans",
                        "structuredName": {
                            "firstName": "Esther",
                            "lastName": "Peterhans",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Peterhans"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50475477"
                        ],
                        "name": "G. Baumgartner",
                        "slug": "G.-Baumgartner",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Baumgartner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Baumgartner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 19317325,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "191f0d6c00614f291d54042867cbae7728d56968",
            "isKey": false,
            "numCitedBy": 1074,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "Figures in which human observers perceive \"illusory contours\" were found to evoke responses in cells of area 18 in the visual cortex of alert monkeys. The cells responded as if the contours were formed by real lines or edges. Modifications that weakened the perception of contours also reduced the neuronal responses. In contrast, cells in area 17 were apparently unable to \"see\" these contours."
            },
            "slug": "Illusory-contours-and-cortical-neuron-responses.-Heydt-Peterhans",
            "title": {
                "fragments": [],
                "text": "Illusory contours and cortical neuron responses."
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "Figures in which human observers perceive \"illusory contours\" were found to evoke responses in cells of area 18 in the visual cortex of alert monkeys, and cells in area 17 were apparently unable to \"see\" these contours."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1793950"
                        ],
                        "name": "T. Ray",
                        "slug": "T.-Ray",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Ray",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Ray"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 59633479,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "2e140a4435f22a04570e35b1b442a22ae90053bd",
            "isKey": false,
            "numCitedBy": 756,
            "numCiting": 58,
            "paperAbstract": {
                "fragments": [],
                "text": "Ideally, the science of biology should embrace all forms of life. However in practice, it has been restricted to the study of a single instance of life, life on earth. Because biology is based on a sample size of one, we can not know what features of life are peculiar to earth, and what features are general, characteristic of all life. A truly comparative natural biology would require inter-planetary travel, which is Iight years away. The ideal experimental evolutionary biology would involve creation of multiple planetary systems, some essentially identical, others varying by"
            },
            "slug": "An-Approach-to-the-Synthesis-of-Life-Ray",
            "title": {
                "fragments": [],
                "text": "An Approach to the Synthesis of Life"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A truly comparative natural biology would require inter-planetary travel, which is Iight years away, and the ideal experimental evolutionary biology would involve creation of multiple planetary systems, some essentially identical, others varying by."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1861837498"
                        ],
                        "name": "G. G. Stokes",
                        "slug": "G.-G.-Stokes",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Stokes",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. G. Stokes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 221060727,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "90006064cafcb0a9ad8a30cffeb56efe7e14129b",
            "isKey": false,
            "numCitedBy": 672630,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "however (for it was the literal soul of the life of the Redeemer, John xv. io), is the peculiar token of fellowship with the Redeemer. That love to God (what is meant here is not God’s love to men) is described in such a case as a perfect love (love that has been perfected), involves no difficulty, for the simple reason that the proposition is purely hypothetical. We must, of course, also take the &dquo;keeping&dquo; in all its stringency. John knows right well that the case supposed here ncver becomes full reality. &dquo; Hereb)’,&dquo; i.e. from the actual realization of love to God. &dquo; TIli7i 7e)e are ill Hinz &dquo;"
            },
            "slug": "\"J.\"-Stokes",
            "title": {
                "fragments": [],
                "text": "\"J.\""
            },
            "venue": {
                "fragments": [],
                "text": "The New Yale Book of Quotations"
            },
            "year": 2021
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145089295"
                        ],
                        "name": "D. Stauffer",
                        "slug": "D.-Stauffer",
                        "structuredName": {
                            "firstName": "Dietrich",
                            "lastName": "Stauffer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Stauffer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23275521,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "fdd54c847a5a9f975147bc86312f25ff0c38db29",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Percolation-thresholds-in-square-lattice-Kauffman-Stauffer",
            "title": {
                "fragments": [],
                "text": "Percolation thresholds in square-lattice Kauffman model."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of theoretical biology"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "17034236"
                        ],
                        "name": "Grace Jordison",
                        "slug": "Grace-Jordison",
                        "structuredName": {
                            "firstName": "Grace",
                            "lastName": "Jordison",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Grace Jordison"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 52870834,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "f9d838defd257e45da6143dfa05951e8f00fd6f0",
            "isKey": false,
            "numCitedBy": 871,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "No wonder you activities are, reading will be always needed. It is not only to fulfil the duties that you need to finish in deadline time. Reading will encourage your mind and thoughts. Of course, reading will greatly develop your experiences about everything. Reading molecular biology of the gene is also a way as one of the collective books that gives many advantages. The advantages are not only for you, but for the other peoples with those meaningful benefits."
            },
            "slug": "Molecular-Biology-of-the-Gene-Jordison",
            "title": {
                "fragments": [],
                "text": "Molecular Biology of the Gene"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Reading molecular biology of the gene is also a way as one of the collective books that gives many advantages, not only for you, but for the other peoples with those meaningful benefits."
            },
            "venue": {
                "fragments": [],
                "text": "The Yale Journal of Biology and Medicine"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2054339568"
                        ],
                        "name": "M. Ono",
                        "slug": "M.-Ono",
                        "structuredName": {
                            "firstName": "Masatoshi",
                            "lastName": "Ono",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Ono"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 42590162,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "839fc53c164bfab21743ce68379cf09454340f52",
            "isKey": false,
            "numCitedBy": 104,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The Scanning Tunneling Microscope (STM) was developed in the early 80's at the IBM research laboratory in Rüschlikon, Switzerland, by Gerd Binnig and Heinrich Rohrer. For their revolutionary innovation Binnig and Rohrer were awarded the Nobel prize in Physics in 1986 (see Nobel prize lecture by G. Binnig, a review article, and noteworthy publications in the STM folder). Selected books are on reserve in the Physics library for this course, including: “Scanning Tunneling Microscopy I & II“, edited by H.-J. Güntherodt and R. Wiesendanser (QC173 .4 S94 S35 and S352); “Scanning Tunneling Microscopy and Spectroscopy – Theory, Technology, and Applications”, edited by D.A. Bonnell (QH212 S35 S365)."
            },
            "slug": "[Scanning-tunneling-microscope].-Ono",
            "title": {
                "fragments": [],
                "text": "[Scanning tunneling microscope]."
            },
            "tldr": {
                "abstractSimilarityScore": 84,
                "text": "The Scanning Tunneling Microscope (STM) was developed in the early 80's at the IBM research laboratory in Rüschlikon, Switzerland, by Gerd Binnig and Heinrich Rohrer, who were awarded the Nobel prize in Physics in 1986."
            },
            "venue": {
                "fragments": [],
                "text": "Tanpakushitsu kakusan koso. Protein, nucleic acid, enzyme"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "41224665"
                        ],
                        "name": "J. Neumann",
                        "slug": "J.-Neumann",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Neumann",
                            "middleNames": [
                                "von"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Neumann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144958811"
                        ],
                        "name": "A. Burks",
                        "slug": "A.-Burks",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Burks",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Burks"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 62696120,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "d86452e0b4a84bd769c6418c184965d66faedcbe",
            "isKey": false,
            "numCitedBy": 4236,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Theory-Of-Self-Reproducing-Automata-Neumann-Burks",
            "title": {
                "fragments": [],
                "text": "Theory Of Self Reproducing Automata"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50743262"
                        ],
                        "name": "T. Bliss",
                        "slug": "T.-Bliss",
                        "structuredName": {
                            "firstName": "Tim",
                            "lastName": "Bliss",
                            "middleNames": [
                                "V.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Bliss"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4148598"
                        ],
                        "name": "T. Lømo",
                        "slug": "T.-Lømo",
                        "structuredName": {
                            "firstName": "Terje",
                            "lastName": "Lømo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Lømo"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 102,
                                "start": 80
                            }
                        ],
                        "text": "Experimentally,long term potentiation (LTP) was discovered in hippocampal slice (Bliss and Lomo, 1973)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2983008,
            "fieldsOfStudy": [
                "Biology",
                "Medicine",
                "Chemistry"
            ],
            "id": "e0db01812fe8ce272c64ac3f88633f64e19ee168",
            "isKey": false,
            "numCitedBy": 6737,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The after‐effects of repetitive stimulation of the perforant path fibres to the dentate area of the hippocampal formation have been examined with extracellular micro‐electrodes in rabbits anaesthetized with urethane."
            },
            "slug": "Long‐lasting-potentiation-of-synaptic-transmission-Bliss-Lømo",
            "title": {
                "fragments": [],
                "text": "Long‐lasting potentiation of synaptic transmission in the dentate area of the anaesthetized rabbit following stimulation of the perforant path"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "The after‐effects of repetitive stimulation of the perforant path fibres to the dentate area of the hippocampal formation have been examined with extracellular micro‐electrodes in rabbits anaesthetized with urethane."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6767496"
                        ],
                        "name": "C. Musgrave",
                        "slug": "C.-Musgrave",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Musgrave",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Musgrave"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31754307"
                        ],
                        "name": "J. K. Perry",
                        "slug": "J.-K.-Perry",
                        "structuredName": {
                            "firstName": "Jason",
                            "lastName": "Perry",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. K. Perry"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1725731"
                        ],
                        "name": "R. Merkle",
                        "slug": "R.-Merkle",
                        "structuredName": {
                            "firstName": "Ralph",
                            "lastName": "Merkle",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Merkle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30144052"
                        ],
                        "name": "W. Goddard",
                        "slug": "W.-Goddard",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Goddard",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Goddard"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 45787266,
            "fieldsOfStudy": [
                "Chemistry"
            ],
            "id": "26b43bc3ffc5515540a230f7d8bfdfa34d2fd621",
            "isKey": false,
            "numCitedBy": 43,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "In the design of a nanoscale, site-specific hydrogen abstraction tool, the authors suggest the use of an alkynyl radical tip. Using ab initio quantum-chemistry techniques including electron correlation they model the abstraction of hydrogen from dihydrogen, methane, acetylene, benzene and isobutane by the acetylene radical. By conservative estimates, the abstraction barrier is small (less than 7.7 kcal mol^-1) in all cases except for acetylene and zero in the case of isobutane. Thermal vibrations at room temperature should be sufficient to supply the small activation energy. Several methods of creating the radical in a controlled vacuum setting should be feasible. The authors show how nanofabrication processes can be accurately and inexpensively designed in a computational framework."
            },
            "slug": "Theoretical-studies-of-a-hydrogen-abstraction-tool-Musgrave-Perry",
            "title": {
                "fragments": [],
                "text": "Theoretical studies of a hydrogen abstraction tool for nanotechnology"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1995280"
                        ],
                        "name": "G. Edelman",
                        "slug": "G.-Edelman",
                        "structuredName": {
                            "firstName": "Gerald",
                            "lastName": "Edelman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Edelman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34674732"
                        ],
                        "name": "Walter E. Gall",
                        "slug": "Walter-E.-Gall",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Gall",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Walter E. Gall"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145627289"
                        ],
                        "name": "W. Cowan",
                        "slug": "W.-Cowan",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Cowan",
                            "middleNames": [
                                "Maxwell"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Cowan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117840656,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "152142b73093d2c32ac94b819e6dc92cbffa8666",
            "isKey": false,
            "numCitedBy": 315,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Principles of Cortical Organization The Locales, Varieties and Uses of Maps Sense and Movement Categorization, Generalization and Memory Speech and Language Developmental and Theoretical Principles."
            },
            "slug": "Signal-and-sense-:-local-and-global-order-in-maps-Edelman-Gall",
            "title": {
                "fragments": [],
                "text": "Signal and sense : local and global order in perceptual maps"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1762240"
                        ],
                        "name": "W. Bialek",
                        "slug": "W.-Bialek",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Bialek",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Bialek"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 79
                            }
                        ],
                        "text": "And the retina works close to the physical limits in obtaining this performance(Bialek, 1987)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 12902529,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "f1b52f8cb624c88578910b7b3845a021551daf2a",
            "isKey": false,
            "numCitedBy": 220,
            "numCiting": 118,
            "paperAbstract": {
                "fragments": [],
                "text": "FOUNDATIONS 456 Signals and Noise, Detectability and Discriminability 456 Noise from Classical Statistical Mechanics 459 Noise from Quantum Mechanics 460"
            },
            "slug": "Physical-limits-to-sensation-and-perception.-Bialek",
            "title": {
                "fragments": [],
                "text": "Physical limits to sensation and perception."
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "Noise from Classical Statistical Mechanics and Noise from Quantum Mechanics and Signals and Noise, Detectability and Discriminability are compared."
            },
            "venue": {
                "fragments": [],
                "text": "Annual review of biophysics and biophysical chemistry"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144391411"
                        ],
                        "name": "J. Brust",
                        "slug": "J.-Brust",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Brust",
                            "middleNames": [
                                "C.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Brust"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 110,
                                "start": 99
                            }
                        ],
                        "text": "More reading: Quantitative anatomy (Braitenberg and Schüz, 1998), neuropsychological case studies (Sacks, 1985; Luria, 1966)\nChapter 2\nPassive properties of cells\nA living neuron maintains a voltage drop across its membrane."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 98
                            }
                        ],
                        "text": "More reading: Quantitative anatomy (Braitenberg and Schüz, 1998), neuropsychological case studies (Sacks, 1985; Luria, 1966)"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 58390307,
            "fieldsOfStudy": [
                "History"
            ],
            "id": "3f3be6a305b76c590a909020c86567f65a1e378a",
            "isKey": false,
            "numCitedBy": 225,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Are you looking to uncover the man who mistook his wife for a hat and other clinical tales Digitalbook. Correct here it is possible to locate as well as download the man who mistook his wife for a hat and other clinical tales Book. We've got ebooks for every single topic the man who mistook his wife for a hat and other clinical tales accessible for download cost-free. Search the site also as find Jean Campbell eBook in layout. We also have a fantastic collection of information connected to this Digitalbook for you. As well because the best part is you could assessment as well as download for the man who mistook his wife for a hat and other clinical tales eBook"
            },
            "slug": "The-Man-Who-Mistook-His-Wife-for-a-Hat-and-Other-Brust",
            "title": {
                "fragments": [],
                "text": "The Man Who Mistook His Wife for a Hat and Other Clinical Tales"
            },
            "venue": {
                "fragments": [],
                "text": "Neurology"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40612774"
                        ],
                        "name": "A. Watt",
                        "slug": "A.-Watt",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Watt",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Watt"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61835181,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "c3f826e48a9b50614a16ed0e9ccaf94fa3d842c5",
            "isKey": false,
            "numCitedBy": 178,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Watt provides a comprehensive introduction to the techniques needed to produce shaded images of three-dimensional solids on a computer graphics monitor. Strongly based on algorithm understanding."
            },
            "slug": "Fundamentals-of-three-dimensional-computer-graphics-Watt",
            "title": {
                "fragments": [],
                "text": "Fundamentals of three-dimensional computer graphics"
            },
            "tldr": {
                "abstractSimilarityScore": 95,
                "text": "This book provides a comprehensive introduction to the techniques needed to produce shaded images of three-dimensional solids on a computer graphics monitor."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2084582"
                        ],
                        "name": "G. Reeke",
                        "slug": "G.-Reeke",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Reeke",
                            "middleNames": [
                                "N."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Reeke"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124268831,
            "fieldsOfStudy": [
                "Psychology",
                "Mathematics"
            ],
            "id": "5d68d1462966920e1c67702f47314e6403f7ab62",
            "isKey": false,
            "numCitedBy": 2058,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-society-of-mind-Reeke",
            "title": {
                "fragments": [],
                "text": "The society of mind"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2703759"
                        ],
                        "name": "E. Jen",
                        "slug": "E.-Jen",
                        "structuredName": {
                            "firstName": "Erica",
                            "lastName": "Jen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Jen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48931743"
                        ],
                        "name": "P. Holmes",
                        "slug": "P.-Holmes",
                        "structuredName": {
                            "firstName": "Philip",
                            "lastName": "Holmes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Holmes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123855171,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "5ed7142025e442e1c683d4eaab86a6157cf6a156",
            "isKey": false,
            "numCitedBy": 23,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "1989-Lectures-in-Complex-Systems-Jen-Holmes",
            "title": {
                "fragments": [],
                "text": "1989 Lectures in Complex Systems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48493782"
                        ],
                        "name": "H. Evans",
                        "slug": "H.-Evans",
                        "structuredName": {
                            "firstName": "Howard",
                            "lastName": "Evans",
                            "middleNames": [
                                "Ensign"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Evans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 87021072,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "26677d48ffc3b9ea7736ea46e12222ae8f7c6f52",
            "isKey": false,
            "numCitedBy": 1032,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Study-of-Instinct-Evans",
            "title": {
                "fragments": [],
                "text": "The Study of Instinct"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1952
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3058211"
                        ],
                        "name": "H. Tuckwell",
                        "slug": "H.-Tuckwell",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Tuckwell",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Tuckwell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 68,
                                "start": 52
                            }
                        ],
                        "text": "More reading on statistical description of neurons: (Tuckwell, 1988)"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 81492295,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "896494036b06ebe57a36ac857e25d44ba0609eec",
            "isKey": false,
            "numCitedBy": 1271,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Introduction-to-theoretical-neurobiology-Tuckwell",
            "title": {
                "fragments": [],
                "text": "Introduction to theoretical neurobiology"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2319833"
                        ],
                        "name": "P. Werbos",
                        "slug": "P.-Werbos",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Werbos",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Werbos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 207975157,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "56623a496727d5c71491850e04512ddf4152b487",
            "isKey": false,
            "numCitedBy": 4468,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Beyond-Regression-:-\"New-Tools-for-Prediction-and-Werbos",
            "title": {
                "fragments": [],
                "text": "Beyond Regression : \"New Tools for Prediction and Analysis in the Behavioral Sciences"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47946008"
                        ],
                        "name": "C. Langton",
                        "slug": "C.-Langton",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Langton",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Langton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115490883"
                        ],
                        "name": "Charles E. Taylor",
                        "slug": "Charles-E.-Taylor",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Taylor",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Charles E. Taylor"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "98830388"
                        ],
                        "name": "J. Farmer",
                        "slug": "J.-Farmer",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Farmer",
                            "middleNames": [
                                "Doyne"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Farmer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2061880220"
                        ],
                        "name": "Steen Rasmussen",
                        "slug": "Steen-Rasmussen",
                        "structuredName": {
                            "firstName": "Steen",
                            "lastName": "Rasmussen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steen Rasmussen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59846415,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e1ca55a7911983dcb68b8c1aeb9c8a99b081078d",
            "isKey": false,
            "numCitedBy": 785,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Artificial-Life-II-Langton-Taylor",
            "title": {
                "fragments": [],
                "text": "Artificial Life II"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94653581"
                        ],
                        "name": "J. H. Holland",
                        "slug": "J.-H.-Holland",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Holland",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. H. Holland"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 56489392,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4e3cbd911b175d510a8cb3c65c79a5595915e42f",
            "isKey": false,
            "numCitedBy": 1129,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Escaping-brittleness:-the-possibilities-of-learning-Holland",
            "title": {
                "fragments": [],
                "text": "Escaping brittleness: the possibilities of general-purpose learning algorithms applied to parallel rule-based systems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2184260"
                        ],
                        "name": "D. Stein",
                        "slug": "D.-Stein",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Stein",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Stein"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 57466913,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "58338ab8782a7013e551c1efe32c5ee6790707b2",
            "isKey": false,
            "numCitedBy": 236,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Lectures-In-The-Sciences-Of-Complexity-Stein",
            "title": {
                "fragments": [],
                "text": "Lectures In The Sciences Of Complexity"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768890"
                        ],
                        "name": "B. Manderick",
                        "slug": "B.-Manderick",
                        "structuredName": {
                            "firstName": "Bernard",
                            "lastName": "Manderick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Manderick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31470118"
                        ],
                        "name": "M. D. Weger",
                        "slug": "M.-D.-Weger",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Weger",
                            "middleNames": [
                                "K.",
                                "de"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. D. Weger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2914408"
                        ],
                        "name": "Piet Spiessens",
                        "slug": "Piet-Spiessens",
                        "structuredName": {
                            "firstName": "Piet",
                            "lastName": "Spiessens",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Piet Spiessens"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43114409,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e5260df1d4fee309cfd5bab6b2e46634ecf72c74",
            "isKey": false,
            "numCitedBy": 296,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Genetic-Algorithm-and-the-Structure-of-the-Manderick-Weger",
            "title": {
                "fragments": [],
                "text": "The Genetic Algorithm and the Structure of the Fitness Landscape"
            },
            "venue": {
                "fragments": [],
                "text": "ICGA"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145738991"
                        ],
                        "name": "J. D. Schaffer",
                        "slug": "J.-D.-Schaffer",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Schaffer",
                            "middleNames": [
                                "David"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. D. Schaffer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145727186"
                        ],
                        "name": "R. Caruana",
                        "slug": "R.-Caruana",
                        "structuredName": {
                            "firstName": "Rich",
                            "lastName": "Caruana",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Caruana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3035326"
                        ],
                        "name": "L. Eshelman",
                        "slug": "L.-Eshelman",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Eshelman",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Eshelman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143863023"
                        ],
                        "name": "R. Das",
                        "slug": "R.-Das",
                        "structuredName": {
                            "firstName": "Rajarshi",
                            "lastName": "Das",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Das"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41782009,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0bdac15b9ad8d12e4ed3b5816edb51f5308d0e6d",
            "isKey": false,
            "numCitedBy": 1098,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Study-of-Control-Parameters-Affecting-Online-of-Schaffer-Caruana",
            "title": {
                "fragments": [],
                "text": "A Study of Control Parameters Affecting Online Performance of Genetic Algorithms for Function Optimization"
            },
            "venue": {
                "fragments": [],
                "text": "ICGA"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2914408"
                        ],
                        "name": "Piet Spiessens",
                        "slug": "Piet-Spiessens",
                        "structuredName": {
                            "firstName": "Piet",
                            "lastName": "Spiessens",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Piet Spiessens"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768890"
                        ],
                        "name": "B. Manderick",
                        "slug": "B.-Manderick",
                        "structuredName": {
                            "firstName": "Bernard",
                            "lastName": "Manderick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Manderick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10421054,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "91cc52e9020f72b6fb2fb23a7ff057d3f1f33411",
            "isKey": false,
            "numCitedBy": 144,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Massively-Parallel-Genetic-Algorithm:-and-First-Spiessens-Manderick",
            "title": {
                "fragments": [],
                "text": "A Massively Parallel Genetic Algorithm: Implementation and First Analysis"
            },
            "venue": {
                "fragments": [],
                "text": "ICGA"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768890"
                        ],
                        "name": "B. Manderick",
                        "slug": "B.-Manderick",
                        "structuredName": {
                            "firstName": "Bernard",
                            "lastName": "Manderick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Manderick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2914408"
                        ],
                        "name": "Piet Spiessens",
                        "slug": "Piet-Spiessens",
                        "structuredName": {
                            "firstName": "Piet",
                            "lastName": "Spiessens",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Piet Spiessens"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 19688076,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a4e1b385e9eb63c89c791af40f250d8cf31836a4",
            "isKey": false,
            "numCitedBy": 442,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Fine-Grained-Parallel-Genetic-Algorithms-Manderick-Spiessens",
            "title": {
                "fragments": [],
                "text": "Fine-Grained Parallel Genetic Algorithms"
            },
            "venue": {
                "fragments": [],
                "text": "ICGA"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "101931801"
                        ],
                        "name": "In Schoenauer",
                        "slug": "In-Schoenauer",
                        "structuredName": {
                            "firstName": "In",
                            "lastName": "Schoenauer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "In Schoenauer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "101945965"
                        ],
                        "name": "Rudolph Deb",
                        "slug": "Rudolph-Deb",
                        "structuredName": {
                            "firstName": "Rudolph",
                            "lastName": "Deb",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rudolph Deb"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102214701"
                        ],
                        "name": "M. Lutton",
                        "slug": "M.-Lutton",
                        "structuredName": {
                            "firstName": "Merelo",
                            "lastName": "Lutton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Lutton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37296647"
                        ],
                        "name": "D. Maffi",
                        "slug": "D.-Maffi",
                        "structuredName": {
                            "firstName": "Dario",
                            "lastName": "Maffi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Maffi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5309707,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "34616ac294cf56ba99d054aeaba53c4a8c001043",
            "isKey": false,
            "numCitedBy": 197,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Parallel-Problem-Solving-from-Nature-Schoenauer-Deb",
            "title": {
                "fragments": [],
                "text": "Parallel Problem Solving from Nature"
            },
            "venue": {
                "fragments": [],
                "text": "Lecture Notes in Computer Science"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1793950"
                        ],
                        "name": "T. Ray",
                        "slug": "T.-Ray",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Ray",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Ray"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 19738042,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "2779e5926e52be5035a6c2cc6aae9f41e79e2806",
            "isKey": false,
            "numCitedBy": 70,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Is-It-Alive-or-Is-It-GA-Ray",
            "title": {
                "fragments": [],
                "text": "Is It Alive or Is It GA?"
            },
            "venue": {
                "fragments": [],
                "text": "ICGA"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49792970"
                        ],
                        "name": "C. Schneiker",
                        "slug": "C.-Schneiker",
                        "structuredName": {
                            "firstName": "Conrad",
                            "lastName": "Schneiker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Schneiker"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38800998,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "a75907f04a504373f4250e9fc189d8951ed330e0",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Nanotechnology-with-Feynman-Machines:-Scanning-and-Schneiker",
            "title": {
                "fragments": [],
                "text": "Nanotechnology with Feynman Machines: Scanning Tunneling Engineering and Artificial Life"
            },
            "venue": {
                "fragments": [],
                "text": "ALIFE"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "J. Physiol"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 112
                            }
                        ],
                        "text": "More reading: Quantitative anatomy (Braitenberg and Schüz, 1998), neuropsychological case studies (Sacks, 1985; Luria, 1966)\nChapter 2\nPassive properties of cells\nA living neuron maintains a voltage drop across its membrane."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 98
                            }
                        ],
                        "text": "More reading: Quantitative anatomy (Braitenberg and Schüz, 1998), neuropsychological case studies (Sacks, 1985; Luria, 1966)"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Higher Cortical function in man"
            },
            "venue": {
                "fragments": [],
                "text": "Plenum."
            },
            "year": 1966
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Methods in Neural Modelling : From Synapses to Networks"
            },
            "venue": {
                "fragments": [],
                "text": "Methods in Neural Modelling : From Synapses to Networks"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 64,
                                "start": 49
                            }
                        ],
                        "text": "It was essentially introduced in 1907 by Lapique (Lapique, 1907)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Recherches quantitatives sur l’excitation electrique de nerfs traitee comme une polarization"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol. Pathol. Gen. 9."
            },
            "year": 1907
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Evolution of Proteins from Random Sequences : A Model for the Protein Sequence Space and an Experimental Approach"
            },
            "venue": {
                "fragments": [],
                "text": "Molecular Evolution on Rugged Landscapes : Proteins, RNA and the Immune System"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Evolving Sequential Machines in Amorphous Neural Networks"
            },
            "venue": {
                "fragments": [],
                "text": "Artificial Neural Networks"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Phonotopic Maps -Insightful Representation of Phonological Features for Speech Recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 7th. Int. Conf. on Pattern Recognition"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 157,
                                "start": 110
                            }
                        ],
                        "text": "On the other hand, man-made simple object recognition models often operate exclusively in a feed-forward mode (Fukushima, 1980; Riesenhuber and Poggio, 1999)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Neocognitron: A self-organising multi-layered neural network"
            },
            "venue": {
                "fragments": [],
                "text": "Biol. Cybern. 20: 121–136."
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Artificial Life : The Synthesis and Simulation of Living Systems"
            },
            "venue": {
                "fragments": [],
                "text": "Artificial Life : The Synthesis and Simulation of Living Systems"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 64,
                                "start": 48
                            }
                        ],
                        "text": "It introduction is often attributed to Lapicque (Lapicque, 1907) (but see (Brunel and van Rossum, 2007) for a historic perspective)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Recherches quantitatives sur l’excitation electrique de nerfs traitee comme une polarization"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol. Pathol. Gen. 9."
            },
            "year": 1907
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Theoretical Immunology Parts"
            },
            "venue": {
                "fragments": [],
                "text": "Theoretical Immunology Parts"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "J. Neurophysiol"
            },
            "venue": {
                "fragments": [],
                "text": "J. Neurophysiol"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Principles of Adaptation in Complex Systems"
            },
            "venue": {
                "fragments": [],
                "text": "Lectures in the Sciences of Complexity"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Genetic Algorithms and Evolution Strategies : Similarities and DifferencesParallel Problem Solving from Nature"
            },
            "venue": {
                "fragments": [],
                "text": "Genetic Algorithms and Evolution Strategies : Similarities and DifferencesParallel Problem Solving from Nature"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Evolution Strategy and Human Decision MakingHuman Decision Making and Manual Control"
            },
            "venue": {
                "fragments": [],
                "text": "Evolution Strategy and Human Decision MakingHuman Decision Making and Manual Control"
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proceedings of the 4th. Int. Conf. on Genetic Algorithms"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 4th. Int. Conf. on Genetic Algorithms"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Programmable Gate Array Data Book"
            },
            "venue": {
                "fragments": [],
                "text": "Xilinx Corporation"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The mind machine. BBC books"
            },
            "venue": {
                "fragments": [],
                "text": "The mind machine. BBC books"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proceedings of the 1st International Conference on Neural Networks"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 1st International Conference on Neural Networks"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "J. Physiol. Pathol. Gen"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol. Pathol. Gen"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 180,
                                "start": 167
                            }
                        ],
                        "text": "It turns out to be valid for small perturbations of the potential around the resting potential, but at high frequencies corrections to the simple RC behaviours exist (Stevens, 1972)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Interferences about membrane properties from electrical noise measurements. Biophys"
            },
            "venue": {
                "fragments": [],
                "text": "Interferences about membrane properties from electrical noise measurements. Biophys"
            },
            "year": 1972
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Quantum Semiconductor DevicesMolecular Electronic Devices"
            },
            "venue": {
                "fragments": [],
                "text": "Quantum Semiconductor DevicesMolecular Electronic Devices"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proceedings of the 1st. Int. Conf. on Simulation & Adaptive Behavior : From Animals to Animats"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 1st. Int. Conf. on Simulation & Adaptive Behavior : From Animals to Animats"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Adaptation on Rugged Fitness Landscapes"
            },
            "venue": {
                "fragments": [],
                "text": "Lectures in the Sciences of Complexity"
            },
            "year": 1989
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 23,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 99,
        "totalPages": 10
    },
    "page_url": "https://www.semanticscholar.org/paper/Neural-Computation-Rossum/2d5af1ab6368f20a4a9bb2afae23663e5b08b9c6?sort=total-citations"
}