{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5624877"
                        ],
                        "name": "S. Marčelja",
                        "slug": "S.-Marčelja",
                        "structuredName": {
                            "firstName": "Stjepan",
                            "lastName": "Marčelja",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Marčelja"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23364863,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "85af5a0b7102919e96eebe9143c082fe9e453e46",
            "isKey": false,
            "numCitedBy": 1317,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "On the basis of measured receptive field profiles and spatial frequency tuning characteristics of simple cortical cells, it can be concluded that the representation of an image in the visual cortex must involve both spatial and spatial frequency variables. In a scheme due to Gabor, an image is represented in terms of localized symmetrical and antisymmetrical elementary signals. Both measured receptive fields and measured spatial frequency tuning curves conform closely to the functional form of Gabor elementary signals. It is argued that the visual cortex representation corresponds closely to the Gabor scheme owing to its advantages in treating the subsequent problem of pattern recognition."
            },
            "slug": "Mathematical-description-of-the-responses-of-simple-Marčelja",
            "title": {
                "fragments": [],
                "text": "Mathematical description of the responses of simple cortical cells."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is argued that the visual cortex representation corresponds closely to the Gabor scheme owing to its advantages in treating the subsequent problem of pattern recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804190"
                        ],
                        "name": "Y. Zeevi",
                        "slug": "Y.-Zeevi",
                        "structuredName": {
                            "firstName": "Yehoshua",
                            "lastName": "Zeevi",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Zeevi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2161863"
                        ],
                        "name": "M. Porat",
                        "slug": "M.-Porat",
                        "structuredName": {
                            "firstName": "Moshe",
                            "lastName": "Porat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Porat"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58790232,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0430d0e85df8be2cd4ce1d49d72e2637dfa12d5e",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": "Visual representation in biological visual systems appears to be accomplished by a scheme of image decomposition into a finite set of localized operators which resemble the form of Gabor Elementary Functions (GEF). These functions achieve the lowest bound on the joint entropy, defined as the product of effective spatial extent and frequency bandwidth."
            },
            "slug": "Computer-Image-Generation-Using-Elementary-Matched-Zeevi-Porat",
            "title": {
                "fragments": [],
                "text": "Computer Image Generation Using Elementary Functions Matched to Human Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Visual representation in biological visual systems appears to be accomplished by a scheme of image decomposition into a finite set of localized operators which resemble the form of Gabor Elementary Functions (GEF)."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804190"
                        ],
                        "name": "Y. Zeevi",
                        "slug": "Y.-Zeevi",
                        "structuredName": {
                            "firstName": "Yehoshua",
                            "lastName": "Zeevi",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Zeevi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2161863"
                        ],
                        "name": "M. Porat",
                        "slug": "M.-Porat",
                        "structuredName": {
                            "firstName": "Moshe",
                            "lastName": "Porat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Porat"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62669468,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1dbc78d609f0ed867f61ceb3e1abf97b1b3f1bea",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Localized phase is extracted from images represented in the combined frequency- position space. It is shown that images represented by localized phase-only information reproduce adequately the edge relationship while compressing the gray level information, unlike the localized magnitude-only representation that distorts the edge information. We address the issue of the number of quantization levels required for adequate representation by localized phase, and present an analytical expression of the resultant image as well as computational examples. We show that image reconstruction from localized phase-only is more efficient than image reconstruction from global (Fourier) phase in that the number of required computer operations is reduced and the rate of convergence is improved. The computation efficiency can be further improved by implementation of highly- parallel architecture."
            },
            "slug": "Image-Representation-by-Localized-Phase-Zeevi-Porat",
            "title": {
                "fragments": [],
                "text": "Image Representation by Localized Phase"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is shown that image reconstruction from localized phase-only is more efficient than image reconstructions from global (Fourier) phase in that the number of required computer operations is reduced and the rate of convergence is improved."
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1861262"
                        ],
                        "name": "T. Caelli",
                        "slug": "T.-Caelli",
                        "structuredName": {
                            "firstName": "Terry",
                            "lastName": "Caelli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Caelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2076076511"
                        ],
                        "name": "P. Bevan",
                        "slug": "P.-Bevan",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Bevan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Bevan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43156961,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "1442bd072e0ccda86a2c593a27bb1f5b3d277f26",
            "isKey": false,
            "numCitedBy": 39,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "We investigate some limits to phase processing in the human visual system with two-dimensional textured images. Results indicate that, although phase sensitivity increases with contrast and energy components of the image, observers cannot discriminate between images and their 45 degrees phase-quantized versions under brief exposure and lower- (less than or equal to 30%) contrast conditions. These results seem to be frequency independent although modulated by different energy levels at each two-dimensional frequency band. Finally, we have analyzed some past texture-discrimination results that occur under identical amplitude-spectra conditions. Here also phase-quantization differences seem to constitute an adequate explanation of discrimination performance."
            },
            "slug": "Visual-sensitivity-to-two-dimensional-spatial-Caelli-Bevan",
            "title": {
                "fragments": [],
                "text": "Visual sensitivity to two-dimensional spatial phase."
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "Investigation of some limits to phase processing in the human visual system with two-dimensional textured images indicates that, although phase sensitivity increases with contrast and energy components of the image, observers cannot discriminate between images and their 45 degrees phase-quantized versions under brief exposure and lower- lower- contrast conditions."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781325"
                        ],
                        "name": "J. Daugman",
                        "slug": "J.-Daugman",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Daugman",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Daugman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9271650,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "02f89cd1fd6f013a1a301a292936ff8fb06aff25",
            "isKey": false,
            "numCitedBy": 3420,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "Two-dimensional spatial linear filters are constrained by general uncertainty relations that limit their attainable information resolution for orientation, spatial frequency, and two-dimensional (2D) spatial position. The theoretical lower limit for the joint entropy, or uncertainty, of these variables is achieved by an optimal 2D filter family whose spatial weighting functions are generated by exponentiated bivariate second-order polynomials with complex coefficients, the elliptic generalization of the one-dimensional elementary functions proposed in Gabor's famous theory of communication [J. Inst. Electr. Eng. 93, 429 (1946)]. The set includes filters with various orientation bandwidths, spatial-frequency bandwidths, and spatial dimensions, favoring the extraction of various kinds of information from an image. Each such filter occupies an irreducible quantal volume (corresponding to an independent datum) in a four-dimensional information hyperspace whose axes are interpretable as 2D visual space, orientation, and spatial frequency, and thus such a filter set could subserve an optimally efficient sampling of these variables. Evidence is presented that the 2D receptive-field profiles of simple cells in mammalian visual cortex are well described by members of this optimal 2D filter family, and thus such visual neurons could be said to optimize the general uncertainty relations for joint 2D-spatial-2D-spectral information resolution. The variety of their receptive-field dimensions and orientation and spatial-frequency bandwidths, and the correlations among these, reveal several underlying constraints, particularly in width/length aspect ratio and principal axis organization, suggesting a polar division of labor in occupying the quantal volumes of information hyperspace.(ABSTRACT TRUNCATED AT 250 WORDS)"
            },
            "slug": "Uncertainty-relation-for-resolution-in-space,-and-Daugman",
            "title": {
                "fragments": [],
                "text": "Uncertainty relation for resolution in space, spatial frequency, and orientation optimized by two-dimensional visual cortical filters."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Evidence is presented that the 2D receptive-field profiles of simple cells in mammalian visual cortex are well described by members of this optimal 2D filter family, and thus such visual neurons could be said to optimize the general uncertainty relations for joint 2D-spatial-2D-spectral information resolution."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1925241"
                        ],
                        "name": "D. Pollen",
                        "slug": "D.-Pollen",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Pollen",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pollen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1992154"
                        ],
                        "name": "S. Ronner",
                        "slug": "S.-Ronner",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Ronner",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ronner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23970541,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5ec37637d34c792a3798e9724be81d041ca0ec32",
            "isKey": false,
            "numCitedBy": 376,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper relates to the receptive field properties of neurons in the primary visual cortex, i.e. the striate cortex, to current issues in spatial visual information processing. Particular attention is given to the fact that receptive field profiles of simple cells in the visual cortex often resemble even-symmetric or odd-symmetric Gabor filters; i.e. their receptive field profiles can be described by the product of a Gaussian and either a cosine or sine function. Their spatial frequency tuning is of medium bandwidth (~one octave) which is narrow enough for a cell to distinguish the third harmonic from the fundamental frequency for square-wave gratings of low spatial frequency. The responses of adjacent simple cells, tuned to the same spatial frequency, orientation, and direction, differ in their phase response to drifting sine-wave gratings by approximately either 90° or 180°. This latter result makes it possible to consider two adjacent simple cell pairs as operating like paired Gaussian-attenuated sine and cosine filters of Gabor filters for restricted regions of visual space. The entire set of simple cells provides a complete representation of the visual scene, yet each simple cell is unique in its response properties. At the complex cell stage, the cell's mean firing rate appears to represent the amplitude of a local Fourier coefficient, but phase information is seldom conveyed with much precision in the action potential code."
            },
            "slug": "Visual-cortical-neurons-as-localized-spatial-Pollen-Ronner",
            "title": {
                "fragments": [],
                "text": "Visual cortical neurons as localized spatial frequency filters"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "The receptive field properties of neurons in the primary visual cortex, i.e. the striate cortex, are related to current issues in spatial visual information processing to consider two adjacent simple cell pairs as operating like paired Gaussian-attenuated sine and cosine filters of Gabor filters for restricted regions of visual space."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Systems, Man, and Cybernetics"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781325"
                        ],
                        "name": "J. Daugman",
                        "slug": "J.-Daugman",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Daugman",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Daugman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40518532,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5faac4d01ce2c09eabb9b025d1b3b16130e6ae00",
            "isKey": false,
            "numCitedBy": 1343,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Two-dimensional-spectral-analysis-of-cortical-field-Daugman",
            "title": {
                "fragments": [],
                "text": "Two-dimensional spectral analysis of cortical receptive field profiles"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "96943691"
                        ],
                        "name": "Mj Martin Bastiaans",
                        "slug": "Mj-Martin-Bastiaans",
                        "structuredName": {
                            "firstName": "Mj",
                            "lastName": "Bastiaans",
                            "middleNames": [
                                "Martin"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mj Martin Bastiaans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 116193758,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4641445e97a0d0d73b9b39155ce7c0c5ff4fa6aa",
            "isKey": false,
            "numCitedBy": 59,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The complex spectrogram of a signal is defined as the Fourier transform of the product of the signal and the shifted and complex conjugated version of a so-called window function; it is thus a function of time and frequency, simultaneously, from which the signal can be reconstructed uniquely. It is shown that the complex spectrogram is completely determined by its values on the points of a certain time-frequency lattice. This lattice is exactly the one suggested by Gabor in 1946; it arose in connection with Gabor's suggestion to expand a signal into a discrete set of Gaussian elementary signals. Such an expansion is a special case of the more general expansion of a signal into a discrete set of properly shifted and modulated window functions. It is shown that this expansion exists. Furthermore, a set of functions is constructed, which is bi-orthonormal to the set of shifted and modulated window functions. With the help of this bi-orthonormal set of functions, the expansion coefficients can be determined easily."
            },
            "slug": "Sampling-theorem-for-the-complex-spectrogram,-and-Bastiaans",
            "title": {
                "fragments": [],
                "text": "Sampling theorem for the complex spectrogram, and Gabor's expansion in Gaussian elementary signals"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2302358"
                        ],
                        "name": "P. Burt",
                        "slug": "P.-Burt",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Burt",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Burt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8018433,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "83074157d165b6245915508d891b2d0cd066f3ad",
            "isKey": false,
            "numCitedBy": 6693,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a technique for image encoding in which local operators of many scales but identical shape serve as the basis functions. The representation differs from established techniques in that the code elements are localized in spatial frequency as well as in space. Pixel-to-pixel correlations are first removed by subtracting a lowpass filtered copy of the image from the image itself. The result is a net data compression since the difference, or error, image has low variance and entropy, and the low-pass filtered image may represented at reduced sample density. Further data compression is achieved by quantizing the difference image. These steps are then repeated to compress the low-pass image. Iteration of the process at appropriately expanded scales generates a pyramid data structure. The encoding process is equivalent to sampling the image with Laplacian operators of many scales. Thus, the code tends to enhance salient image features. A further advantage of the present code is that it is well suited for many image analysis tasks as well as for image compression. Fast algorithms are described for coding and decoding."
            },
            "slug": "The-Laplacian-Pyramid-as-a-Compact-Image-Code-Burt-Adelson",
            "title": {
                "fragments": [],
                "text": "The Laplacian Pyramid as a Compact Image Code"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A technique for image encoding in which local operators of many scales but identical shape serve as the basis functions, which tends to enhance salient image features and is well suited for many image analysis tasks as well as for image compression."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Commun."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2533169"
                        ],
                        "name": "R. Kronauer",
                        "slug": "R.-Kronauer",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Kronauer",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kronauer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804190"
                        ],
                        "name": "Y. Zeevi",
                        "slug": "Y.-Zeevi",
                        "structuredName": {
                            "firstName": "Yehoshua",
                            "lastName": "Zeevi",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Zeevi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 25602619,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3f252af4a7c1b1a75300685c55be5ca7b54bcac1",
            "isKey": false,
            "numCitedBy": 48,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "Extensive processing and reorganization of information are required as retinally generated signals flow centrally. Insight into some principles of the reorganization and transformations that occur in the early stages of the visual pathway, prior to the higher stages of pattern recognition, is provided through an analysis of receptive fields and cell counts. The rate of information flow is reduced approximately 100-fold by a retinal position-dependent (inhomogeneous) spatial sampling scheme. This principle of specialization, or nonuniform processing, is further elaborated in the retino-cortical mapping. In the central fovea, where the retinal spatial sampling rate is the highest and processing function is uniform, there are about 4000 striate cortical neurons receiving information from each cone. This number, which provides a measure of function multiplicity, drops to about 200 over the range of the near periphery. In the peripheral field beyond eight degrees, where information is compressed at the retina, the functional multiplicity stays approximately constant at 200. As it seems that no two cells perform exactly the same operation, it is concluded that the striate cortex performs many simultaneous functional mappings."
            },
            "slug": "Reorganization-and-diversification-of-signals-in-Kronauer-Zeevi",
            "title": {
                "fragments": [],
                "text": "Reorganization and diversification of signals in vision"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is concluded that the striate cortex performs many simultaneous functional mappings, or nonuniform processing, in the retino-cortical mapping."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Systems, Man, and Cybernetics"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "28897168"
                        ],
                        "name": "L. Jacobson",
                        "slug": "L.-Jacobson",
                        "structuredName": {
                            "firstName": "Lowell",
                            "lastName": "Jacobson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Jacobson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143979395"
                        ],
                        "name": "H. Wechsler",
                        "slug": "H.-Wechsler",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Wechsler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wechsler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 12666553,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5dff9fb6ae1fe7d81777842744624e113fd9a94c",
            "isKey": false,
            "numCitedBy": 37,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "We suggest a new computational theory for position, size, and orientation invariant recognition of planar gray-scale forms in frontoparallel view. The theory employs a spatial-frequency representation which approximates the complex-logarithmic conformally mapped Wigner distribution of a gray-scale image. Our discussion emphasizes the theoretical significance, method of computation, and practical utility of this powerful new representation for image pattern recognition."
            },
            "slug": "A-Theory-for-Invariant-Object-Recognition-in-the-Jacobson-Wechsler",
            "title": {
                "fragments": [],
                "text": "A Theory for Invariant Object Recognition in the Frontoparallel Plane"
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "A new computational theory for position, size, and orientation invariant recognition of planar gray-scale forms in frontoparallel view is suggested which employs a spatial-frequency representation which approximates the complex-logarithmic conformally mapped Wigner distribution of agray-scale image."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746955"
                        ],
                        "name": "M. Bastiaans",
                        "slug": "M.-Bastiaans",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Bastiaans",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Bastiaans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123734237,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "996bc84d852e9adea2cc30886b14b4727d2f7e45",
            "isKey": false,
            "numCitedBy": 56,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The complex spectrogram of a signal φ(t) is defined by ∫φ(t)g*(t-to)exp[-iwot]dt ; it is, in fact, the Fourier transform of the product of the signal and the complex conjugated and shifted version of a so-called window function g(t). From the complex spectrogram the signal can be reconstructed uniquely. It is shown that the complex spectrogram is completely determined by its values on the points (to=mT, wo=nΩ), where ΩT= 2tt and m and n take all integer values. The lattice of points (mT,nΩ) is exactly the lattice suggested by Gabor as early as 1946; it arose in connection with Gabor's suggestion to expand a signal into a discrete set of Gaussian elementary signals. Such an expansion is a special case of the general expansion ∑∑mn amng(t-mT)exp[inΩt] of a signal into a discrete set of shifted and modulated window functions. It is shown that this expansion exists. Furthermore, a set of functions is constructed, which is bi-orthonormal to the set of shifted and modulated window functions. With the help of this bi-orthonormal set of functions, the expansion coefficients amn can be determined easily."
            },
            "slug": "Sampling-Theorem-For-The-Complex-Spectrogram,-And-A-Bastiaans",
            "title": {
                "fragments": [],
                "text": "Sampling Theorem For The Complex Spectrogram, And Gabor's Expansion Of A Signal In Gaussian Elementary Signals"
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1932236"
                        ],
                        "name": "N. Graham",
                        "slug": "N.-Graham",
                        "structuredName": {
                            "firstName": "N.",
                            "lastName": "Graham",
                            "middleNames": [
                                "V.",
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Graham"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4734126"
                        ],
                        "name": "J. Nachmias",
                        "slug": "J.-Nachmias",
                        "structuredName": {
                            "firstName": "Jacob",
                            "lastName": "Nachmias",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Nachmias"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7449780,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "ff6b05a0fc9f9730a8de08e584fe55ddea242a80",
            "isKey": false,
            "numCitedBy": 432,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Detection-of-grating-patterns-containing-two-a-of-Graham-Nachmias",
            "title": {
                "fragments": [],
                "text": "Detection of grating patterns containing two spatial frequencies: a comparison of single-channel and multiple-channels models."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1772264"
                        ],
                        "name": "E. Schwartz",
                        "slug": "E.-Schwartz",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Schwartz",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Schwartz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12798398,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5c4408f3148930bcf00bbaeae9f15606f3125684",
            "isKey": false,
            "numCitedBy": 612,
            "numCiting": 136,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computational-anatomy-and-functional-architecture-A-Schwartz",
            "title": {
                "fragments": [],
                "text": "Computational anatomy and functional architecture of striate cortex: A spatial mapping approach to perceptual coding"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60494655,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "36067c830559173fc667cdf88ebc096500ebb9b9",
            "isKey": false,
            "numCitedBy": 627,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "I Image Pyramids and Their Uses.- 1. Some Useful Properties of Pyramids.- 2. The Pyramid as a Structure for Efficient Computation.- II Architectures and Systems.- 3. Multiprocessor Pyramid Architectures for Bottom-Up Image Analysis.- 4. Visual and Conceptual Hierarchy - A Paradigm for Studies of Automated Generation of Recognition Strategies.- 5. Multiresolution Processing.- 6. The Several Steps from Icon to Symbol Using Structured Cone/ Pyramids.- III Modelling, Processing, and Segmentation.- 7. Time Series Models for Multiresolution Images.- 8. Node Linking Strategies in Pyramids for Image Segmentation.- 9. Multilevel Image Reconstruction.- 10. Sorting, Histogramming, and Other Statistical Operations on a Pyramid Machine.- IV Features and Shape Analysis.- 11. A Hierarchical Image Analysis System Based Upon Oriented Zero Crossings of Bandpassed Images.- 12. A Multiresolution Representation for Shape.- 13. Multiresolution Feature Encodings.- 14. Multiple-Size Operators and Optimal Curve Finding.- V Region Representation and Surface Interpolation.- 15. A Tutorial on Quadtree Research.- 16. Multiresolution 3-d Image Processing and Graphics.- 17. Multilevel Reconstruction of Visual Surfaces: Variational Principles and Finite-Element Representations.- VI Time-Varying Analysis.- 18. Multilevel Relaxation in Low-Level Computer Vision.- 19. Region Matching in Pyramids for Dynamic Scene Analysis.- 20. Hierarchical Estimation of Spatial Properties from Motion.- VII Applications.- 21. Multiresolution Microscopy.- 22. Two-Resolution Detection of Lung Tumors in Chest Radiographs.- Index of Contributors."
            },
            "slug": "Multiresolution-image-processing-and-analysis-Rosenfeld",
            "title": {
                "fragments": [],
                "text": "Multiresolution image processing and analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A Hierarchical Image Analysis System Based Upon Oriented Zero Crossings of Bandpassed Images and a Tutorial on Quadtree Research."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1925241"
                        ],
                        "name": "D. Pollen",
                        "slug": "D.-Pollen",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Pollen",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pollen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1992154"
                        ],
                        "name": "S. Ronner",
                        "slug": "S.-Ronner",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Ronner",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ronner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 11912279,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "818e8a5f1e8b3cc5d0cb72a60ecbef2ba4549b81",
            "isKey": false,
            "numCitedBy": 414,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Adjacent simple cells recorded and \"isolated\" simultaneously from the same microelectrode placement were usually tuned to the same orientation and spatial frequency. The responses of the members of these \"spatial frequency pairs\" to drifting sine-wave gratings were cross-correlates. Within the middle range of the spatial frequency selectivity curves, the responses of the paired cells differed in phase by approximately 90 percent. This phase relationship suggests that adjacent simple cells tuned to the same spatial frequency and orientation represent paired sine and cosine filters in terms of their processing of afferent spatial inputs and truncated sine and cosine filters in terms of the output of simple cells."
            },
            "slug": "Phase-relationships-between-adjacent-simple-cells-Pollen-Ronner",
            "title": {
                "fragments": [],
                "text": "Phase relationships between adjacent simple cells in the visual cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "This phase relationship suggests that adjacent simple cells tuned to the same spatial frequency and orientation represent paired sine and cosine filters in terms of their processing of afferent spatial inputs and truncated sines and cosines in Terms of the output of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3853990"
                        ],
                        "name": "O. Braddick",
                        "slug": "O.-Braddick",
                        "structuredName": {
                            "firstName": "Oliver",
                            "lastName": "Braddick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Braddick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144756342"
                        ],
                        "name": "J. Atkinson",
                        "slug": "J.-Atkinson",
                        "structuredName": {
                            "firstName": "Janette",
                            "lastName": "Atkinson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Atkinson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118379796,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "fd9edc929040c1f149a141af168918cad98d495a",
            "isKey": false,
            "numCitedBy": 261,
            "numCiting": 89,
            "paperAbstract": {
                "fragments": [],
                "text": "Kenneth J.W. Craik (1914–1945), while discussing how the human visual system recognized objects, wrote: \nNow in mathematics it is legitimate to seek transformations through which certain quantities (such as the physical laws of nature and the velocity of light in relativity theory) remain invariant. In fact, the action of various physical devices which “recognize” or respond identically to certain simple objects can be treated in terms of such transformations. Thus the essential part of physical “recognizing” instruments is usually a filter—whether it be a mechanical sieve, an optical filter, or a tuned electrical circuit —which “passes” only quantities of the kind it is required to identify and rejects all others. Mathematically, the situation here is that, in a perfect filter, the transformation leaves the desired quantity unaltered, but reduces all others to zero."
            },
            "slug": "Channels-in-Vision:-Basic-Aspects-Braddick-Campbell",
            "title": {
                "fragments": [],
                "text": "Channels in Vision: Basic Aspects"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "In mathematics it is legitimate to seek transformations through which certain quantities remain invariant, and the action of various physical devices which “recognize” or respond identically to certain simple objects can be treated in terms of such transformations."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33340475"
                        ],
                        "name": "A. Oppenheim",
                        "slug": "A.-Oppenheim",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Oppenheim",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Oppenheim"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "120802194"
                        ],
                        "name": "J.S. Lim",
                        "slug": "J.S.-Lim",
                        "structuredName": {
                            "firstName": "J.S.",
                            "lastName": "Lim",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J.S. Lim"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 23790114,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aa77a30b21f291e8d79f2a30854d996f4acc7442",
            "isKey": false,
            "numCitedBy": 1746,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "In the Fourier representation of signals, spectral magnitude and phase tend to play different roles and in some situations many of the important features of a signal are preserved if only the phase is retained. Furthermore, under a variety of conditions, such as when a signal is of finite length, phase information alone is sufficient to completely reconstruct a signal to within a scale factor. In this paper, we review and discuss these observations and results in a number of different contexts and applications. Specifically, the intelligibility of phase-only reconstruction for images, speech, and crystallographic structures are illustrated. Several approaches to justifying the relative importance of phase through statistical arguments are presented, along with a number of informal arguments suggesting reasons for the importance of phase. Specific conditions under which a sequence can be exactly reconstructed from phase are reviewed, both for one-dimensional and multi-dimensional sequences, and algorithms for both approximate and exact reconstruction of signals from phase information are presented. A number of applications of the observations and results in this paper are suggested."
            },
            "slug": "The-importance-of-phase-in-signals-Oppenheim-Lim",
            "title": {
                "fragments": [],
                "text": "The importance of phase in signals"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Specific conditions under which a sequence can be exactly reconstructed from phase are reviewed, both for one-dimensional and multi-dimensional sequences, and algorithms for both approximate and exact reconstruction of signals from phase information are presented."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143801618"
                        ],
                        "name": "A. Janssen",
                        "slug": "A.-Janssen",
                        "structuredName": {
                            "firstName": "Ajem",
                            "lastName": "Janssen",
                            "middleNames": [
                                "Guido"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Janssen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 43065900,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9e65c1a1af046951be7c98e10b868a9ba0207f22",
            "isKey": false,
            "numCitedBy": 140,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "It is well known that completeness properties of sets of coherent states associated with lattices in \nthe phase plane can be proved by using the Bargmann representation or by using the kq \nrepresentation which was introduced by J. Zak. In this paper both methods are considered, in \nparticular, in connection with expansions of generalized functions in what are called Gabor \nseries. The setting consists of two spaces of generalized functions (tempered distributions and \nelements of the class S*) which appear in a natural way in the context of the Bargmann \ntransform. Also, a thorough mathematical investigation of the Zak transform is given. This \npaper contains many comments and complements on existing literature; in particular, \nconnections with the theory of interpolation of entire functions over the Gaussian integers are \ngiven."
            },
            "slug": "Bargmann-transform,-Zak-transform,-and-coherent-Janssen",
            "title": {
                "fragments": [],
                "text": "Bargmann transform, Zak transform, and coherent states"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1828659"
                        ],
                        "name": "A. Watson",
                        "slug": "A.-Watson",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Watson",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Watson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 56888867,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "7a9aff38b096e675ee03abe341592ec45e4aeba6",
            "isKey": false,
            "numCitedBy": 197,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "In spite of the large number of intelligent, energetic people engaged in the study of vision, it often seems that we advance our understanding of this process at an excruciatingly slow pace. Why is this so? I believe that it is the fault of our models. We have been seduced by the simplicity of explanation available in the physical sciences, and try to describe the vast complexity of vision with models that would not do justice to a sphere rolling down an inclined plane."
            },
            "slug": "Detection-and-Recognition-of-Simple-Spatial-Forms-Watson",
            "title": {
                "fragments": [],
                "text": "Detection and Recognition of Simple Spatial Forms"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "In spite of the large number of intelligent, energetic people engaged in the study of vision, it often seems that the understanding of this process at an excruciatingly slow pace is the fault of the authors' models."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145515955"
                        ],
                        "name": "J. Morlet",
                        "slug": "J.-Morlet",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Morlet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Morlet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "97899696"
                        ],
                        "name": "G. Arens",
                        "slug": "G.-Arens",
                        "structuredName": {
                            "firstName": "Georges",
                            "lastName": "Arens",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Arens"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2311427"
                        ],
                        "name": "E. Fourgeau",
                        "slug": "E.-Fourgeau",
                        "structuredName": {
                            "firstName": "Eliane",
                            "lastName": "Fourgeau",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Fourgeau"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102858639"
                        ],
                        "name": "D. Giard",
                        "slug": "D.-Giard",
                        "structuredName": {
                            "firstName": "Dominique",
                            "lastName": "Giard",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Giard"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15327989,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "9d44a6dc48b5c202a5e77ef1375f69ec49fdfc13",
            "isKey": false,
            "numCitedBy": 1011,
            "numCiting": 66,
            "paperAbstract": {
                "fragments": [],
                "text": "From experimental studies in digital processing of seismic reflection data, geophysicists know that a seismic signal does vary in amplitude, shape, frequency and phase, versus propagation time To enhance the resolution of the seismic reflection method, we must investigate these variations in more detail. We present quantitative results of theoretical studies on propagation of plane waves for normal incidence, through perfectly elastic multilayered media. As wavelet shapes, we use zero-phase cosine wavelets modulated by a Gaussian envelope and the corresponding complex wavelets. A finite set of such wavelets, for an appropriate sampling of the frequency domain, may be taken as the basic wavelets for a Gabor expansion of any signal or trace in a two-dimensional (2-D) domain (time and frequency). We can then compute the wave propagation using complex functions and thereby obtain quantitative results including energy and phase of the propagating signals. These results appear as complex 2-D functions of time and frequency, i.e., as “instantaneous frequency spectra. ’ ’ Choosing a constant sampling rate on the logarithmic scale in the frequency domain leads to an appropriate sampling method for phase preservation of the complex signals or traces. For this purpose, we developed a Gabor expansion involving basic wavelets with a constant time duration/mean period ratio. For layered media, as found in sedimentary basins,"
            },
            "slug": "Wave-propagation-and-sampling-theory—Part-I:-signal-Morlet-Arens",
            "title": {
                "fragments": [],
                "text": "Wave propagation and sampling theory—Part I: Complex signal and scattering in multilayered media"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40018119"
                        ],
                        "name": "R. Tootell",
                        "slug": "R.-Tootell",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Tootell",
                            "middleNames": [
                                "B.",
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Tootell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47660376"
                        ],
                        "name": "M. Silverman",
                        "slug": "M.-Silverman",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Silverman",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Silverman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4602910"
                        ],
                        "name": "E. Switkes",
                        "slug": "E.-Switkes",
                        "structuredName": {
                            "firstName": "Eugene",
                            "lastName": "Switkes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Switkes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2087168416"
                        ],
                        "name": "R. D. De Valois",
                        "slug": "R.-D.-De-Valois",
                        "structuredName": {
                            "firstName": "R",
                            "lastName": "De Valois",
                            "middleNames": [
                                "L"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. D. De Valois"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13971727,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1573dd9596eb7276f94c2bbbfa731c806aaa7617",
            "isKey": false,
            "numCitedBy": 454,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "We have anatomically analyzed retinotopic organization using the 14C-labeled 2-deoxy-D-glucose method. The method has several advantages over conventional electrophysiological mapping techniques. In the striate cortex, the anatomical substrate for retinotopic organization is surprisingly well ordered, and there seems to be a systematic relationship between ocular dominance strips and cortical magnification. The 2-deoxyglucose maps in this area appear to be largely uninfluenced by known differences in long-term metabolic activity. This method should prove useful in analyzing retinotopic organization in various visual areas of the brain and in different species."
            },
            "slug": "Deoxyglucose-analysis-of-retinotopic-organization-Tootell-Silverman",
            "title": {
                "fragments": [],
                "text": "Deoxyglucose analysis of retinotopic organization in primate striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "The 14C-labeled 2-deoxy-D-glucose method has several advantages over conventional electrophysiological mapping techniques and should prove useful in analyzing retinotopic organization in various visual areas of the brain and in different species."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2646152"
                        ],
                        "name": "K. Horiuchi",
                        "slug": "K.-Horiuchi",
                        "structuredName": {
                            "firstName": "Kazuo",
                            "lastName": "Horiuchi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Horiuchi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 26501343,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "18363e9c3ea0283b65d727a1f09e9ec0a0b52755",
            "isKey": false,
            "numCitedBy": 52,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Sampling-Principle-for-Continuous-Signals-with-Horiuchi",
            "title": {
                "fragments": [],
                "text": "Sampling Principle for Continuous Signals with Time-Varying Bands"
            },
            "venue": {
                "fragments": [],
                "text": "Inf. Control."
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145515955"
                        ],
                        "name": "J. Morlet",
                        "slug": "J.-Morlet",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Morlet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Morlet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "97899696"
                        ],
                        "name": "G. Arens",
                        "slug": "G.-Arens",
                        "structuredName": {
                            "firstName": "Georges",
                            "lastName": "Arens",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Arens"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2311427"
                        ],
                        "name": "E. Fourgeau",
                        "slug": "E.-Fourgeau",
                        "structuredName": {
                            "firstName": "Eliane",
                            "lastName": "Fourgeau",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Fourgeau"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102858639"
                        ],
                        "name": "D. Giard",
                        "slug": "D.-Giard",
                        "structuredName": {
                            "firstName": "Dominique",
                            "lastName": "Giard",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Giard"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 17991241,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "c10bfdd96c42eb866f169d14d5809dad8f639018",
            "isKey": false,
            "numCitedBy": 533,
            "numCiting": 86,
            "paperAbstract": {
                "fragments": [],
                "text": "Morlet et al (1982, this issue) showed the advantages of using complex values for both waves and characteristics of the media. We simulated the theoretical tools we present here, using the Goupillaud-Kunetz algorithm. Now we present sampling methods for complex signals or traces corresponding to received waves, and sampling methods for complex characterization of multilayered or heterogeneous media. Regarding the complex signals, we present a twodimecsional(2-D) method of sampling in the time-frequency domain using a special or “extended” Gabor expansion on a set of basic wavelets adapted to phase preservation. Such a 2-D expansion permits us to handle in a proper manner instantaneous frequency spectra. We show the differences between “wavelet resolution” and “sampling grid resolution.” We also show the importance of phase preservation in high-resolution seismic. Regarding the media, we show how analytical studies of wave propagation in periodic structured layers could help when trying to characterize the physical properties of the layers and their large scale granularity as a result of complex deconvolution. Analytical studies of wave propagation in periodic structures are well known in solid state physics, and lead to the so-called “Bloch waves.” The introduction of complex waves leads to replacing the classical wave equation by a Schriidinger equation. Finally, we show that complex wave equations, Gabor expansion, and Bloch waves are three different ways of ‘introducing the tools of quantum mechanics in highresolution seismic (Gabor, 1946; Kittel, 1976, Morlet, 1975). And conversely, the Goupillaud-Kunetz algorithm and an extended Gabor expansion may be of some use in solid state physics."
            },
            "slug": "Wave-propagation-and-sampling-theory—Part-II:-and-Morlet-Arens",
            "title": {
                "fragments": [],
                "text": "Wave propagation and sampling theory—Part II: Sampling theory and complex waves"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145926556"
                        ],
                        "name": "A. Janssen",
                        "slug": "A.-Janssen",
                        "structuredName": {
                            "firstName": "Augustus",
                            "lastName": "Janssen",
                            "middleNames": [
                                "J.",
                                "E.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Janssen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 711003,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "806fe3c4979b2b7a710145c1961394c24d56ec52",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "We compare Gabor representation and the Wigner distribution on their merits for the time-frequency description of signals."
            },
            "slug": "Gabor-representation-and-Wigner-distribution-of-Janssen",
            "title": {
                "fragments": [],
                "text": "Gabor representation and Wigner distribution of signals"
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "The Gabor representation and the Wigner distribution are compared on their merits for the time-frequency description of signals."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 228358,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ddc2ea63fa69eca4aa44a4fd135543d67badcb23",
            "isKey": false,
            "numCitedBy": 3039,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies."
            },
            "slug": "Application-of-fourier-analysis-to-the-visibility-Campbell-Robson",
            "title": {
                "fragments": [],
                "text": "Application of fourier analysis to the visibility of gratings"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies and the results show clear patterns of uniformity in the response to grating noise."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4333717,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "a2f2945d56b55061dfe465799cdc1905718f2658",
            "isKey": false,
            "numCitedBy": 271,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "The following article is the lecture delivered by the author in Stockholm on 8 December 1981 when he received the Nobel Prize in Medicine or Physiology which he shared with Roger Sperry and Torsten Wiesel. The article is published here with permission from the Nobel Foundation and will also be included in the complete volume of Les Prix Nobel en 1981 as well as in the series Nobel Lectures (in English) published by Elsevier. The lecture of Dr Wiesel will appear in next week's issue."
            },
            "slug": "Exploration-of-the-primary-visual-cortex,-1955–78-Hubel",
            "title": {
                "fragments": [],
                "text": "Exploration of the primary visual cortex, 1955–78"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The following article is the lecture delivered by the author in Stockholm on 8 December 1981 when he received the Nobel Prize in Medicine or Physiology which he shared with Roger Sperry and Torsten Wiesel."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143799348"
                        ],
                        "name": "Michael J. Davis",
                        "slug": "Michael-J.-Davis",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Davis",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Davis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3903136"
                        ],
                        "name": "E. Heller",
                        "slug": "E.-Heller",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Heller",
                            "middleNames": [
                                "J"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Heller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 97138628,
            "fieldsOfStudy": [
                "Chemistry"
            ],
            "id": "959dae89c60705570c68975d0ce3ba9c746d9882",
            "isKey": false,
            "numCitedBy": 223,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "We present theory and numerical results for a new method for obtaining eigenfunctions and eigenvalues of molecular vibrational wave functions. The method combines aspects of the semiclassical nature of vibrational motion and variational, ab initio techniques. Localized complex Gaussian wave functions, whose parameters are chosen according to classical phase space criteria are employed in standard numerical basis set diagonalization routines. The Gaussians are extremely convenient as regards construction of Hamiltonian matrix elements, computation of derived properties such as Franck–Condon factors, and interpretation of results in terms of classical motion. The basis set is not tied to any zeroth order Hamiltonian and is readily adaptable to arbitrary smooth potentials of any dimension."
            },
            "slug": "Semiclassical-Gaussian-basis-set-method-for-wave-Davis-Heller",
            "title": {
                "fragments": [],
                "text": "Semiclassical Gaussian basis set method for molecular vibrational wave functions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145851466"
                        ],
                        "name": "P. M. Woodward",
                        "slug": "P.-M.-Woodward",
                        "structuredName": {
                            "firstName": "Philip",
                            "lastName": "Woodward",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. M. Woodward"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 60574186,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9e5e60ac75ea6469d612f9ea293f2e727e3caf3d",
            "isKey": false,
            "numCitedBy": 1240,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Probability-and-Information-Theory-with-to-Radar-Woodward",
            "title": {
                "fragments": [],
                "text": "Probability and Information Theory with Applications to Radar"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6098881"
                        ],
                        "name": "E. Wigner",
                        "slug": "E.-Wigner",
                        "structuredName": {
                            "firstName": "Eugene",
                            "lastName": "Wigner",
                            "middleNames": [
                                "Paul"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Wigner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120862623,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "879e8d7778c0ab1479339fe29d3cc4ded78fe4e5",
            "isKey": false,
            "numCitedBy": 5222,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The probability of a configuration is given in classical theory by the Boltzmann formula exp [— V/hT] where V is the potential energy of this configuration. For high temperatures this of course also holds in quantum theory. For lower temperatures, however, a correction term has to be introduced, which can be developed into a power series of h. The formula is developed for this correction by means of a probability function and the result discussed."
            },
            "slug": "On-the-quantum-correction-for-thermodynamic-Wigner",
            "title": {
                "fragments": [],
                "text": "On the quantum correction for thermodynamic equilibrium"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1932
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2096160"
                        ],
                        "name": "G. Rodrigue",
                        "slug": "G.-Rodrigue",
                        "structuredName": {
                            "firstName": "Garry",
                            "lastName": "Rodrigue",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Rodrigue"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 67467331,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "329ed89bd621d6906324a29860b3208fcfb6ea5b",
            "isKey": false,
            "numCitedBy": 130,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Parallel-Computations-Rodrigue",
            "title": {
                "fragments": [],
                "text": "Parallel Computations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145514385"
                        ],
                        "name": "J. R. Higgins",
                        "slug": "J.-R.-Higgins",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Higgins",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. R. Higgins"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 40261105,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a3cd5c1a987924b8cb59ef4740fedd962ca56353",
            "isKey": false,
            "numCitedBy": 203,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Preface 1. Foundations 2. Orthogonal sequences 3. Non-orthogonal sequences 4. Differential and integral operators Appendix Bibliography Subject index."
            },
            "slug": "Completeness-and-Basis-Properties-of-Sets-of-Higgins",
            "title": {
                "fragments": [],
                "text": "Completeness and Basis Properties of Sets of Special Functions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38428841"
                        ],
                        "name": "M. Fischetti",
                        "slug": "M.-Fischetti",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Fischetti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Fischetti"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30998998"
                        ],
                        "name": "C. Truxal",
                        "slug": "C.-Truxal",
                        "structuredName": {
                            "firstName": "Carol",
                            "lastName": "Truxal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Truxal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38496859,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "20d68305e6a5d7165261f3be3a3c06ab8eb4dee5",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "It is reported that simulator makers face a twofold challenge: to continue to increase the realism of the trainers while holding down costs. The newest simulators used in military training programs include cockpits for flight training; portable desktop videodiscs for practicing command, maintenance, and routine operations on land, at sea, and in the air; microcomputer-driven war games that teach tactics; and laser weapons for battle simulation. Among the technologies reviewed to improve realism and cut costs in these four areas are computer graphics, fiber optics, videodiscs, distributed processing, and very high-speed integrated circuits."
            },
            "slug": "Simulating-`the-right-stuff'-[military-simulators]-Fischetti-Truxal",
            "title": {
                "fragments": [],
                "text": "Simulating `the right stuff' [military simulators]"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Among the technologies reviewed to improve realism and cut costs in these four areas are computer graphics, fiber optics, videodiscs, distributed processing, and very high-speed integrated circuits."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Spectrum"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804190"
                        ],
                        "name": "Y. Zeevi",
                        "slug": "Y.-Zeevi",
                        "structuredName": {
                            "firstName": "Yehoshua",
                            "lastName": "Zeevi",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Zeevi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2161863"
                        ],
                        "name": "M. Porat",
                        "slug": "M.-Porat",
                        "structuredName": {
                            "firstName": "Moshe",
                            "lastName": "Porat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Porat"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 227863630,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3aab2b91327dfe44ee61e4c66f06f5038393fd25",
            "isKey": false,
            "numCitedBy": 3,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Phasogram:-image-representation-by-localized-phase-Zeevi-Porat",
            "title": {
                "fragments": [],
                "text": "Phasogram: image representation by localized phase (A)"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38428841"
                        ],
                        "name": "M. Fischetti",
                        "slug": "M.-Fischetti",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Fischetti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Fischetti"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30998998"
                        ],
                        "name": "C. Truxal",
                        "slug": "C.-Truxal",
                        "structuredName": {
                            "firstName": "Carol",
                            "lastName": "Truxal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Truxal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 107622466,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "90e8075d61e9e0aa2343fdcb0c1ff241e9826d99",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Simulating-'the-right-stuff'-Fischetti-Truxal",
            "title": {
                "fragments": [],
                "text": "Simulating 'the right stuff'"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16298171"
                        ],
                        "name": "D. Gabor",
                        "slug": "D.-Gabor",
                        "structuredName": {
                            "firstName": "Dennis",
                            "lastName": "Gabor",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gabor"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61327032,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a8ef7e8990527f01847845da9953896f35e489d5",
            "isKey": false,
            "numCitedBy": 4630,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Theory-of-communication-Gabor",
            "title": {
                "fragments": [],
                "text": "Theory of communication"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1946
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50126851"
                        ],
                        "name": "J. Goodman",
                        "slug": "J.-Goodman",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Goodman",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Goodman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060247715"
                        ],
                        "name": "A. Silvestri",
                        "slug": "A.-Silvestri",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Silvestri",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Silvestri"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 57733737,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "2acc328cbf820081c89f90dc2a4683a0c580d732",
            "isKey": false,
            "numCitedBy": 170,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Some-effects-of-Fourier-domain-phase-quantization-Goodman-Silvestri",
            "title": {
                "fragments": [],
                "text": "Some effects of Fourier-domain phase quantization"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39274396"
                        ],
                        "name": "D. Mackay",
                        "slug": "D.-Mackay",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Mackay",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mackay"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4367218,
            "fieldsOfStudy": [
                "Computer Science",
                "Medicine"
            ],
            "id": "13cdac78e65d83c1ac0ab63f182cdc4aa7f75a3c",
            "isKey": false,
            "numCitedBy": 62,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Strife-over-visual-cortical-function-Mackay",
            "title": {
                "fragments": [],
                "text": "Strife over visual cortical function"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "17141020"
                        ],
                        "name": "C. Mead",
                        "slug": "C.-Mead",
                        "structuredName": {
                            "firstName": "Carver",
                            "lastName": "Mead",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Mead"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7249370"
                        ],
                        "name": "L. Conway",
                        "slug": "L.-Conway",
                        "structuredName": {
                            "firstName": "Lynn",
                            "lastName": "Conway",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Conway"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5536005,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4b4aca407d90bcadc82474b78388a24901051985",
            "isKey": false,
            "numCitedBy": 2889,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Introduction-to-VLSI-systems-Mead-Conway",
            "title": {
                "fragments": [],
                "text": "Introduction to VLSI systems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The peneralized Gabor scheme of image Yrepresentation"
            },
            "venue": {
                "fragments": [],
                "text": "ACTA Polytechnica Scand . Appl . Phys ."
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Wave propagation and sampling theory"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Uncertainty relation for resolution in space , spatial frequency , and orientation optimized by 2 D visual cortical filters"
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the Gabor representation and its digital implementation"
            },
            "venue": {
                "fragments": [],
                "text": "Parallel computations"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Visual detection of spatial contrast"
            },
            "venue": {
                "fragments": [],
                "text": "Biol . Cybern ."
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On fractal based approach to image coding"
            },
            "venue": {
                "fragments": [],
                "text": "Signal Processing I l l : Theories and Applications"
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Some effects of Fourierdomain phase quantization"
            },
            "venue": {
                "fragments": [],
                "text": "IBM J . Res . Develop ."
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The generalized Gabor scheme of image representation in vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Some psychophysical aspects of visual processing of displayed information"
            },
            "venue": {
                "fragments": [],
                "text": "Proc . Image I 1 Conf ."
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Encoding of spatial frequency, orientation, and contrast in striate cortex (A)"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Combined frequencyposition scheme of image representation in vision"
            },
            "venue": {
                "fragments": [],
                "text": "J . Opt . Soc . Amer . ( A )"
            },
            "year": 1984
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 50,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/The-Generalized-Gabor-Scheme-of-Image-in-Biological-Porat-Zeevi/d32b33fc471844452dc6ea8e04bdf16bae9ec335?sort=total-citations"
}