{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696298"
                        ],
                        "name": "Bilan Zhu",
                        "slug": "Bilan-Zhu",
                        "structuredName": {
                            "firstName": "Bilan",
                            "lastName": "Zhu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bilan Zhu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116447343"
                        ],
                        "name": "Xiang-Dong Zhou",
                        "slug": "Xiang-Dong-Zhou",
                        "structuredName": {
                            "firstName": "Xiang-Dong",
                            "lastName": "Zhou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Xiang-Dong Zhou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145887653"
                        ],
                        "name": "M. Nakagawa",
                        "slug": "M.-Nakagawa",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Nakagawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Nakagawa"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 211,
                                "start": 208
                            }
                        ],
                        "text": "Handwritten Chinese text recognition (HCTR) is a challenging problem due to the large character set, the diversity of writing styles, the character segmentation difficulty, and the unconstrained language domain."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Ç"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "The difficulties of character segmentation originate from the variability of character size and position, character touching and overlapping."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 145
                            }
                        ],
                        "text": "In integrated segmentation-and-recognition, the candidate segmentation-recognition paths are usually evaluated by combining the character recognition scores (classifier outputs), geometric context, and linguistic context [16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 259033,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fff2a04249af72ccdd3d3f270a5c6b4d708069d5",
            "isKey": false,
            "numCitedBy": 54,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a robust context integration model for on-line handwritten Japanese text recognition. Based on string class probability approximation, the proposed method evaluates the likelihood of candidate segmentation–recognition paths by combining the scores of character recognition, unary and binary geometric features, as well as linguistic context. The path evaluation criterion can flexibly combine the scores of various contexts and is insensitive to the variability in path length, and so, the optimal segmentation path with its string class can be effectively found by Viterbi search. Moreover, the model parameters are estimated by the genetic algorithm so as to optimize the holistic string recognition performance. In experiments on horizontal text lines extracted from the TUAT Kondate database, the proposed method achieves the segmentation rate of 0.9934 that corresponds to a f-measure and the character recognition rate of 92.80%."
            },
            "slug": "A-robust-model-for-on-line-handwritten-japanese-Zhu-Zhou",
            "title": {
                "fragments": [],
                "text": "A robust model for on-line handwritten japanese text recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "A robust context integration model for on-line handwritten Japanese text recognition based on string class probability approximation that can flexibly combine the scores of various contexts and is insensitive to the variability in path length is described."
            },
            "venue": {
                "fragments": [],
                "text": "Electronic Imaging"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145507765"
                        ],
                        "name": "X. Ding",
                        "slug": "X.-Ding",
                        "structuredName": {
                            "firstName": "Xiaoqing",
                            "lastName": "Ding",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Ding"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2109528136"
                        ],
                        "name": "Hailong Liu",
                        "slug": "Hailong-Liu",
                        "structuredName": {
                            "firstName": "Hailong",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hailong Liu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Ç"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 6
                            }
                        ],
                        "text": "The difficulties of character segmentation originate from the variability of character size and position, character touching and overlapping."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 3
                            }
                        ],
                        "text": "1 shows an example of a Chinese handwritten page."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 28591616,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "92c4f4f40c82f9d8076e6d71e12383caf5f55db6",
            "isKey": false,
            "numCitedBy": 23,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "The market of handwriting recognition applications is increasing rapidly due to continuous advancement in OCR technology. This paper summarizes our recent efforts on offline handwritten Chinese script recognition using a segmentation-driven approach. We address two essential problems, namely isolated character recognition and establishment of the probabilistic segmentation model. To improve the isolated character recognition accuracy, we propose a heteroscedastic linear discriminant analysis algorithm to extract more discrimination information from original character features, and implement a minimum classification error learning scheme to optimize classifier parameters. In the segmentation stage, information from three different sources, namely geometric layout, character recognition confidence, and semantic model are integrated into a probabilistic framework to give the best script interpretation. Experimental results on postal address and bank check recognition have demonstrated the effectiveness of our proposed algorithms: A more than 80% correct recognition rate is achieved on 1,000 handwritten Chinese address items, and the recognition reliability of bank checks is largely improved after combining courtesy amount recognition result with legal amount recognition result. Some preliminary research work on Arabic script recognition is also shown."
            },
            "slug": "Segmentation-Driven-Offline-Handwritten-Chinese-and-Ding-Liu",
            "title": {
                "fragments": [],
                "text": "Segmentation-Driven Offline Handwritten Chinese and Arabic Script Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 53,
                "text": "This paper summarizes the recent efforts on offline handwritten Chinese script recognition using a segmentation-driven approach and proposes a heteroscedastic linear discriminant analysis algorithm to extract more discrimination information from original character features, and implement a minimum classification error learning scheme to optimize classifier parameters."
            },
            "venue": {
                "fragments": [],
                "text": "SACH"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2140087937"
                        ],
                        "name": "Qiu-Feng Wang",
                        "slug": "Qiu-Feng-Wang",
                        "structuredName": {
                            "firstName": "Qiu-Feng",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qiu-Feng Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145820427"
                        ],
                        "name": "Fei Yin",
                        "slug": "Fei-Yin",
                        "structuredName": {
                            "firstName": "Fei",
                            "lastName": "Yin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fei Yin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 168,
                                "start": 164
                            }
                        ],
                        "text": "…Society\nsolved by segmentation-based approaches using character models [16], preferably by explicit segmentation, also called oversegmentation, which can take advantage of the character shape and overlapping and touching characteristics to better separate the characters at their boundaries."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 156,
                                "start": 152
                            }
                        ],
                        "text": "Index Terms—Handwritten Chinese text recognition, confidence transformation, geometric models, language models, refined beam search, candidate character augmentation, maximum character accuracy training."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "The four probabilistic terms in (9) correspond to the character recognition model, unary and\nbinary class-dependent geometric model, and language\nmodel, respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 33
                            }
                        ],
                        "text": "Zhu et al. optimize the combining weights using the genetic algorithm (GA) [15], which is computationally expensive and is sensitive to some artificial parameters."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 51,
                                "start": 47
                            }
                        ],
                        "text": "The divergence of writing styles among different writers and in different geographic areas aggravates the confusion between different classes."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Ç"
                    },
                    "intents": []
                }
            ],
            "corpusId": 5126696,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "be9d3c60b2e8cb810ab2a9fe3ab42e7a752c5c6d",
            "isKey": false,
            "numCitedBy": 40,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a system for handwritten Chinese text recognition integrating language model. On a text line image, the system generates character segmentation and word segmentation candidates, and the candidate paths are evaluated by character recognition scores and language model. The optimal path, giving segmentation and recognition result, is found using a pruned dynamic programming search method. We evaluate various language models, including the character-based n-gram, word-based n-gram, and hybrid n-gram models. Experimental results on the HIT-HW database show that the language models improve the recognition performance remarkably."
            },
            "slug": "Integrating-Language-Model-in-Handwritten-Chinese-Wang-Yin",
            "title": {
                "fragments": [],
                "text": "Integrating Language Model in Handwritten Chinese Text Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "A system for handwritten Chinese text recognition integrating language model is described, which generates character segmentation and word segmentation candidates, and the candidate paths are evaluated by character recognition scores and language model."
            },
            "venue": {
                "fragments": [],
                "text": "2009 10th International Conference on Document Analysis and Recognition"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110437882"
                        ],
                        "name": "Yuanxiang Li",
                        "slug": "Yuanxiang-Li",
                        "structuredName": {
                            "firstName": "Yuanxiang",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yuanxiang Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1679749"
                        ],
                        "name": "C. Tan",
                        "slug": "C.-Tan",
                        "structuredName": {
                            "firstName": "Chew",
                            "lastName": "Tan",
                            "middleNames": [
                                "Lim"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Tan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145507765"
                        ],
                        "name": "X. Ding",
                        "slug": "X.-Ding",
                        "structuredName": {
                            "firstName": "Xiaoqing",
                            "lastName": "Ding",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Ding"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 219,
                                "start": 215
                            }
                        ],
                        "text": "Two later works on the same data set, using character classifiers and statistical language models (SLM) based on oversegmentation, reported a character-level correct rate of 78.44 [10] and 73.97 percent [11], respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16070568,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "99b3dc47591c76f77c15e76f05ea94f571fd0cf9",
            "isKey": true,
            "numCitedBy": 21,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "In the recognition of offline handwritten Chinese scripts, contextual post-processing plays a vital role in improving accuracy. In this paper, we systematically analyze the key factors that have an impact on the performance of contextual post-processing: statistical language models (LMs), candidate confidence, candidate set size, and search strategy. We then present a hybrid post-processing system, which integrates various kinds of information available. Next, we investigate seven LMs, four estimation methods of candidate confidence and different size of candidate set, and illustrate their influence on the performance of contextual post-processing in detail. Experimental results justify that the performance of the LMs are affected by training corpora size, smoothing method, and model pruning, and that lower perplexity correlates with a high accuracy. Comparing different estimation methods of candidate confidence shows that, it is vital to the contextual post-processing. We also show that allowing the correct characters to be captured in a limited number of candidates is extremely important for obtaining good post-processing performance. By adopting the hybrid post-processing, we can obtain high accuracy while paying attention to post-processing speed and memory space at the same time. It is shown that the average recognition accuracy of three Chinese scripts (about 66,000 characters in total) can reach 97.65%, which means 87% error correction rate in comparison with the 81.58% average accuracy before post-processing. In the end, we give some proposals for choosing a proper post-processing method for real script recognition tasks."
            },
            "slug": "A-hybrid-post-processing-system-for-offline-Chinese-Li-Tan",
            "title": {
                "fragments": [],
                "text": "A hybrid post-processing system for offline handwritten Chinese script recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "This paper systematically analyzes the key factors that have an impact on the performance of contextual post-processing: statistical language models, candidate confidence, candidate set size, and search strategy, and presents a hybrid post- processing system, which integrates various kinds of information available."
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Analysis and Applications"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113771410"
                        ],
                        "name": "Qiang Fu",
                        "slug": "Qiang-Fu",
                        "structuredName": {
                            "firstName": "Qiang",
                            "lastName": "Fu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qiang Fu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2148784006"
                        ],
                        "name": "X. Ding",
                        "slug": "X.-Ding",
                        "structuredName": {
                            "firstName": "X.",
                            "lastName": "Ding",
                            "middleNames": [
                                "Q."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Ding"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "93646024"
                        ],
                        "name": "Tong-Le Liu",
                        "slug": "Tong-Le-Liu",
                        "structuredName": {
                            "firstName": "Tong-Le",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tong-Le Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2117864501"
                        ],
                        "name": "Yan Jiang",
                        "slug": "Yan-Jiang",
                        "structuredName": {
                            "firstName": "Yan",
                            "lastName": "Jiang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yan Jiang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144909394"
                        ],
                        "name": "Z. Ren",
                        "slug": "Z.-Ren",
                        "structuredName": {
                            "firstName": "Zheng",
                            "lastName": "Ren",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Z. Ren"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 148,
                                "start": 145
                            }
                        ],
                        "text": "We evaluated the recognition performance on a Chinese handwriting database CASIA-HWDB, which contains nearly four million character samples of 7,356 classes and 5,091 pages of unconstrained handwritten texts."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 32080033,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e31f9c477fed935140aa6b59e8e721eefd2523a3",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a new method for segmenting and recognizing Chinese handwritten address character strings. First, a dissection algorithm is applied to over-segment string image into radical series so that the correct segmentation could be achieved by merging those radicals according to the correct merging path. Then, the method synthesizes layout analysis, isolated character classifier and bi-gram language model to find the best merging path and the best recognition result. The classifier used in this paper will give every isolated character image ten recognition candidates, each with corresponding recognition confidence. The parameter of bi-gram model is obtained from address database which contains more than one hundred thousand address items. In experiments on 946 mail images, the proposed method achieves correct rate of 87.2 percent"
            },
            "slug": "A-Novel-Segmentation-and-Recognition-Algorithm-for-Fu-Ding",
            "title": {
                "fragments": [],
                "text": "A Novel Segmentation and Recognition Algorithm for Chinese Handwritten Address Character Strings"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A dissection algorithm is applied to over-segment string image into radical series so that the correct segmentation could be achieved by merging those radicals according to the correct merging path."
            },
            "venue": {
                "fragments": [],
                "text": "18th International Conference on Pattern Recognition (ICPR'06)"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116447343"
                        ],
                        "name": "Xiang-Dong Zhou",
                        "slug": "Xiang-Dong-Zhou",
                        "structuredName": {
                            "firstName": "Xiang-Dong",
                            "lastName": "Zhou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Xiang-Dong Zhou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145887653"
                        ],
                        "name": "M. Nakagawa",
                        "slug": "M.-Nakagawa",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Nakagawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Nakagawa"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 206,
                                "start": 202
                            }
                        ],
                        "text": "Handwritten Chinese text recognition (HCTR) is a challenging problem due to the large character set, the diversity of writing styles, the character segmentation difficulty, and the unconstrained language domain."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Ç"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 137,
                                "start": 133
                            }
                        ],
                        "text": "Handwritten text recognition is particularly difficult because the characters cannot be reliably segmented prior to character recognition."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 238,
                                "start": 234
                            }
                        ],
                        "text": "The candidate character sequences can be represented in a network called a candidate lattice [17], and each candidate segmentation path in the lattice can be split into many segmentationrecognition paths by assigning character classes to the candidate characters."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1560007,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1549e0990c29da41bf890d8b995597b94af811e0",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes an online handwritten Japanese character string recognition system based on conditional random fields, which integrates the information of character recognition, linguistic context and geometric context in a principled framework, and can effectively overcome the variable length of candidate segmentation. For geometric context, we employ both unary and binary feature functions, as well as the ones relevant and irrelevant to character classes. Experimental results show that the CRF based method outperforms the method with normalized path evaluation criterion, and the geometric context benefits the performance significantly."
            },
            "slug": "Online-Handwritten-Japanese-Character-String-Using-Zhou-Liu",
            "title": {
                "fragments": [],
                "text": "Online Handwritten Japanese Character String Recognition Using Conditional Random Fields"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Experimental results show that the CRF based method outperforms the method with normalized path evaluation criterion, and the geometric context benefits the performance significantly."
            },
            "venue": {
                "fragments": [],
                "text": "2009 10th International Conference on Document Analysis and Recognition"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2157949637"
                        ],
                        "name": "Nanxi Li",
                        "slug": "Nanxi-Li",
                        "structuredName": {
                            "firstName": "Nanxi",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nanxi Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144838978"
                        ],
                        "name": "Lianwen Jin",
                        "slug": "Lianwen-Jin",
                        "structuredName": {
                            "firstName": "Lianwen",
                            "lastName": "Jin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lianwen Jin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 179,
                                "start": 175
                            }
                        ],
                        "text": "Index Terms—Handwritten Chinese text recognition, confidence transformation, geometric models, language models, refined beam search, candidate character augmentation, maximum character accuracy training."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2329845,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d025c5308ac10f7761907fe1a73b4a043254d1d0",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "A Bayesian-based probabilistic model is presented for unconstrained handwritten offline Chinese text line recognition. After pre-segmentation of a text line, plenty of invalid characters are produced which heavily interfere in the process of text line recognition. The proposed probabilistic model can incorporate isolated character recognition, character sample verification, and n-gram language model in a simple way, leading to more reliable recognition of a text line. When testing on HIT-MW database, experiments show that the proposed method can achieve character-level recognition accuracies of 63.19% without language model and 73.97% with bi-gram language model, respectively, outperforming the most recent results testing on the same dataset."
            },
            "slug": "A-Bayesian-based-probabilistic-model-for-offline-Li-Jin",
            "title": {
                "fragments": [],
                "text": "A Bayesian-based probabilistic model for unconstrained handwritten offline Chinese text line recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "A Bayesian-based probabilistic model is presented for unconstrained handwritten offline Chinese text line recognition that can incorporate isolated character recognition, character sample verification, and n-gram language model in a simple way, leading to more reliable recognition of a text line."
            },
            "venue": {
                "fragments": [],
                "text": "2010 IEEE International Conference on Systems, Man and Cybernetics"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2887371"
                        ],
                        "name": "Masashi Koga",
                        "slug": "Masashi-Koga",
                        "structuredName": {
                            "firstName": "Masashi",
                            "lastName": "Koga",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Masashi Koga"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34878566"
                        ],
                        "name": "H. Fujisawa",
                        "slug": "H.-Fujisawa",
                        "structuredName": {
                            "firstName": "Hiromichi",
                            "lastName": "Fujisawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Fujisawa"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 27,
                                "start": 24
                            }
                        ],
                        "text": "After generating candidate character patterns by combining consecutive primitive segments, each candidate pattern is classified using a classifier to assign similarity/dissimilarity scores to some character classes."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 122
                            }
                        ],
                        "text": "In isolated Chinese character recognition, most methods were evaluated on data sets of constrained writing styles though very high accuracies (say, over 99 percent on Japanese Kanji characters and over 98 percent on Chinese characters) have been reported [1]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 67,
                                "start": 64
                            }
                        ],
                        "text": "However, none has investigated these techniques comprehensively and integrated them in a high-performance system for Chinese/Japanese handwritten text recognition."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 133,
                                "start": 130
                            }
                        ],
                        "text": "We evaluated the recognition performance on a Chinese handwriting database CASIA-HWDB, which contains nearly four million character samples of 7,356 classes and 5,091 pages of unconstrained handwritten texts."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Ç"
                    },
                    "intents": []
                }
            ],
            "corpusId": 42476557,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1e22b8123da0b35a4afa8ec6730a00991dc76e02",
            "isKey": false,
            "numCitedBy": 178,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a handwritten character string recognition system for Japanese mail address reading on a very large vocabulary. The address phrases are recognized as a whole because there is no extra space between words. The lexicon contains 111,349 address phrases, which are stored in a trie structure. In recognition, the text line image is matched with the lexicon entries (phrases) to obtain reliable segmentation and retrieve valid address phrases. The paper first introduces some effective techniques for text line image preprocessing and presegmentation. In presegmentation, the text line image is separated into primitive segments by connected component analysis and touching pattern splitting based on contour shape analysis. In lexicon matching, consecutive segments are dynamically combined into candidate character patterns. An accurate character classifier is embedded in lexicon matching to select characters matched with a candidate pattern from a dynamic category set. A beam search strategy is used to control the lexicon matching so as to achieve real-time recognition. In experiments on 3,589 live mail images, the proposed method achieved correct rate of 83.68 percent while the error rate is less than 1 percent."
            },
            "slug": "Lexicon-Driven-Segmentation-and-Recognition-of-for-Liu-Koga",
            "title": {
                "fragments": [],
                "text": "Lexicon-Driven Segmentation and Recognition of Handwritten Character Strings for Japanese Address Reading"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "A handwritten character string recognition system for Japanese mail address reading on a very large vocabulary because there is no extra space between words to achieve real-time recognition."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2140087937"
                        ],
                        "name": "Qiu-Feng Wang",
                        "slug": "Qiu-Feng-Wang",
                        "structuredName": {
                            "firstName": "Qiu-Feng",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qiu-Feng Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145820427"
                        ],
                        "name": "Fei Yin",
                        "slug": "Fei-Yin",
                        "structuredName": {
                            "firstName": "Fei",
                            "lastName": "Yin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fei Yin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 83,
                                "start": 79
                            }
                        ],
                        "text": "On the other hand, many works on online Japanese/Chinese handwritten text recognition have reported higher accuracies [12], [13], [14], [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "The four probabilistic terms in (9) correspond to the character recognition model, unary and\nbinary class-dependent geometric model, and language\nmodel, respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "We describe the context models in the following, while the estimation of weights is addressed in Section 7."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 154,
                                "start": 150
                            }
                        ],
                        "text": "…the soft-max function (16):\nPsgð!jjxÞ ¼ exp½ djðxÞ þ\n1þ exp½ djðxÞ þ ; j ¼ 1; . . . ;M; ð15Þ\nPsfð!jjxÞ ¼ exp½ djðxÞ PM i¼1 exp½ diðxÞ ; j ¼ 1; . . . ;M: ð16Þ\nIn the above,M is the total number of defined classes, djðxÞ is the dissimilarity score of class !j output by the classifier, and are the…"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 148,
                                "start": 144
                            }
                        ],
                        "text": "…into multiclass probabilities according to the Dempster-Shafer (D-S) theory of evidence [50], and the probabilities can be formulated by [31]\npdsð!jjxÞ ¼ exp½ djðxÞ þ 1þ PM i¼1 exp½ diðxÞ þ ; j ¼ 1; . . . ;M: ð17Þ\nWe also introduce an outlier class dissimilarity score (assuming doðxÞ ¼ = )…"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 80,
                                "start": 76
                            }
                        ],
                        "text": "Both forms have insufficiencies: The sigmoidal form gives multiple oneversus-all two-class probabilities instead of multiclass probabilities, while the soft-max form forces the sum of posterior probabilities to one even on noncharacter (outlier) patterns."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1503680,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0d4409a4d53e6f063a4cac07af5bd6faae34e3a5",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper investigates the effects of confidence transformation (CT) of the character classifier outputs in handwritten Chinese text recognition. The classifier outputs are transformed to confidence values in three confidence types, namely, sigmoid, soft max and Dempster-Shafer theory of evidence (D-S evidence). The confidence parameters are optimized by minimizing the cross-entropy (CE) loss function (both binary and multi-class) on a validation dataset, where we add non-character samples to enhance the outlier rejection capability in text recognition. Experimental results on the CASIA-HWDB database show that confidence transformation improves the handwritten text recognition performance significantly and adding non-characters for confidence parameter estimation is beneficial. Among the confidence types, the D-S evidence performs best."
            },
            "slug": "Improving-Handwritten-Chinese-Text-Recognition-by-Wang-Yin",
            "title": {
                "fragments": [],
                "text": "Improving Handwritten Chinese Text Recognition by Confidence Transformation"
            },
            "tldr": {
                "abstractSimilarityScore": 53,
                "text": "Experimental results on the CASIA-HWDB database show that confidence transformation improves the handwritten text recognition performance significantly and adding non-characters for confidence parameter estimation is beneficial."
            },
            "venue": {
                "fragments": [],
                "text": "2011 International Conference on Document Analysis and Recognition"
            },
            "year": 2011
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2117864501"
                        ],
                        "name": "Yan Jiang",
                        "slug": "Yan-Jiang",
                        "structuredName": {
                            "firstName": "Yan",
                            "lastName": "Jiang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yan Jiang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145507765"
                        ],
                        "name": "X. Ding",
                        "slug": "X.-Ding",
                        "structuredName": {
                            "firstName": "Xiaoqing",
                            "lastName": "Ding",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Ding"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113771410"
                        ],
                        "name": "Qiang Fu",
                        "slug": "Qiang-Fu",
                        "structuredName": {
                            "firstName": "Qiang",
                            "lastName": "Fu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qiang Fu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144909394"
                        ],
                        "name": "Z. Ren",
                        "slug": "Z.-Ren",
                        "structuredName": {
                            "firstName": "Zheng",
                            "lastName": "Ren",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Z. Ren"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 122,
                                "start": 118
                            }
                        ],
                        "text": "Two later works on the same data set, using character classifiers and statistical language models (SLM) based on oversegmentation, reported a character-level correct rate of 78.44 [10] and 73.97 percent [11], respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Ç"
                    },
                    "intents": []
                }
            ],
            "corpusId": 6829429,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "104e9f854f48fd267c421ca122840170a19104b7",
            "isKey": true,
            "numCitedBy": 13,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a context driven segmentation and recognition method for handwritten Chinese characters. We follow a split-merge technique in character segmentation. In this process, a Chinese text line is first pre-segmented into a sequence of radicals, which are then merged according to a cost function combining both recognition confidence and contextual cost. Two strategies are also proposed for implementation: bi-gram based merging and lexicon driven merging. In the former one, we generate a set of merging paths which are then evaluated by Viterbi algorithm. The radicals’ best merging method is given by the path with the highest score. In the latter strategy, a lexicon is preset and compared with the radicals to determine both radicals’ merging and candidate character selection. Experiments show that contextual information plays a crucial role in Chinese character segmentation and could obviously improve the segmentation and recognition results."
            },
            "slug": "Context-Driven-Chinese-String-Segmentation-and-Jiang-Ding",
            "title": {
                "fragments": [],
                "text": "Context Driven Chinese String Segmentation and Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "Experiments show that contextual information plays a crucial role in Chinese character segmentation and could obviously improve the segmentation, recognition and recognition results."
            },
            "venue": {
                "fragments": [],
                "text": "SSPR/SPR"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145820427"
                        ],
                        "name": "Fei Yin",
                        "slug": "Fei-Yin",
                        "structuredName": {
                            "firstName": "Fei",
                            "lastName": "Yin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fei Yin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1807704"
                        ],
                        "name": "Da-Han Wang",
                        "slug": "Da-Han-Wang",
                        "structuredName": {
                            "firstName": "Da-Han",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Da-Han Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2140087937"
                        ],
                        "name": "Qiu-Feng Wang",
                        "slug": "Qiu-Feng-Wang",
                        "structuredName": {
                            "firstName": "Qiu-Feng",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qiu-Feng Wang"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 17
                            }
                        ],
                        "text": "The combining weights of the path evaluation function are optimized by supervised learning using a Maximum Character Accuracy criterion."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8356210,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7831294883c0d79a51dcecea06214e24b51e4dd2",
            "isKey": false,
            "numCitedBy": 240,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Online-and-offline-handwritten-Chinese-character-on-Liu-Yin",
            "title": {
                "fragments": [],
                "text": "Online and offline handwritten Chinese character recognition: Benchmarking on new databases"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 2013
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1753529"
                        ],
                        "name": "Ruifeng Xu",
                        "slug": "Ruifeng-Xu",
                        "structuredName": {
                            "firstName": "Ruifeng",
                            "lastName": "Xu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ruifeng Xu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143784081"
                        ],
                        "name": "D. Yeung",
                        "slug": "D.-Yeung",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Yeung",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Yeung"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1887263"
                        ],
                        "name": "D. Shi",
                        "slug": "D.-Shi",
                        "structuredName": {
                            "firstName": "Daming",
                            "lastName": "Shi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Shi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 99,
                                "start": 89
                            }
                        ],
                        "text": "Table 1 shows some statistics of character samples segmented from the test text pages of CASIA-HWDB."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 63
                            }
                        ],
                        "text": "We report the recognition rates of different techniques on the CASIA-HWDB test set, and give the processing time on all test pages (1,015 pages) consumed on a desktop computer of 2.66 GHz CPU, programming using Microsoft Visual C++."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 75
                            }
                        ],
                        "text": "We evaluated the recognition performance on a Chinese handwriting database CASIA-HWDB, which contains nearly four million character samples of 7,356 classes and 5,091 pages of unconstrained handwritten texts."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 75,
                                "start": 71
                            }
                        ],
                        "text": "We evaluated the recognition performance on a large database CASIA-HWDB [21] of unconstrained Chinese handwritten characters and texts, and demonstrated superior performance by the proposed methods."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 104,
                                "start": 100
                            }
                        ],
                        "text": "The large set of Chinese characters (tens of thousands of classes) brings difficulties to efficient and effective recognition."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 4
                            }
                        ],
                        "text": "The CASIA-HWDB database contains both isolated characters and unconstrained handwritten texts, and is divided into a training set of 816 writers and a test set of 204 writers."
                    },
                    "intents": []
                }
            ],
            "corpusId": 207113622,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "60d0ebba283d0cea5995e0f0f7932e76cc74bbea",
            "isKey": true,
            "numCitedBy": 6,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a post-processing system for improving the recognition rate of a Handwritten Chinese Character Recognition (HCCR) device. This three-stage hybrid post-processing system reduces the misclassification and rejection rates common in the single character recognition phase. The proposed system is novel in two respects: first, it reduces the misclassification rate by applying a dictionary-look-up strategy that bind the candidate characters into a word-lattice and appends the linguistic-prone characters into the candidate set; second, it identifies promising sentences by employing a distant Chinese word BI-Gram model with a maximum distance of three to select plausible words from the word-lattice. These sentences are then output as the upgraded result. Compared with one of our previous works in single Chinese character recognition, the proposed system improves absolute recognition rates by 12%."
            },
            "slug": "A-hybrid-post-processing-system-for-offline-chinese-Xu-Yeung",
            "title": {
                "fragments": [],
                "text": "A hybrid post-processing system for offline handwritten chinese character recognition based on a statistical language model"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "This three-stage hybrid post-processing system reduces the misclassification and rejection rates common in the single character recognition phase and improves absolute recognition rates by 12%."
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Pattern Recognit. Artif. Intell."
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145887653"
                        ],
                        "name": "M. Nakagawa",
                        "slug": "M.-Nakagawa",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Nakagawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Nakagawa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696298"
                        ],
                        "name": "Bilan Zhu",
                        "slug": "Bilan-Zhu",
                        "structuredName": {
                            "firstName": "Bilan",
                            "lastName": "Zhu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bilan Zhu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "21217983"
                        ],
                        "name": "M. Onuma",
                        "slug": "M.-Onuma",
                        "structuredName": {
                            "firstName": "Motoki",
                            "lastName": "Onuma",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Onuma"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 194,
                                "start": 190
                            }
                        ],
                        "text": "Handwritten Chinese text recognition (HCTR) is a challenging problem due to the large character set, the diversity of writing styles, the character segmentation difficulty, and the unconstrained language domain."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Ç"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 121
                            }
                        ],
                        "text": "Handwritten text recognition is particularly difficult because the characters cannot be reliably segmented prior to character recognition."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17304770,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "32f8df05458a60c596238d426e19f260a0ee4424",
            "isKey": false,
            "numCitedBy": 46,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a model and its effect for on-line handwritten Japanese text recognition free from line-direction constraint and writing format constraint such as character writing boxes or ruled lines. The model evaluates the likelihood composed of character segmentation, character recognition, character pattern structure and context. The likelihood of character pattern structure considers the plausible height, width and inner gaps within a character pattern that appear in Chinese characters composed of multiple radicals (subpatterns). The recognition system incorporating this model separates freely written text into text line elements, estimates the average character size of each element, hypothetically segments it into characters using geometric features, applies character recognition to segmented patterns and employs the model to search the text interpretation that maximizes likelihood as Japanese text. We show the effectiveness of the model through recognition experiments and clarify how the newly modeled factors in the likelihood affect the overall recognition rate."
            },
            "slug": "A-Model-of-On-line-Handwritten-Japanese-Text-Free-Nakagawa-Zhu",
            "title": {
                "fragments": [],
                "text": "A Model of On-line Handwritten Japanese Text Recognition Free from Line Direction and Writing Format Constraints"
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "A model and its effect for on-line handwritten Japanese text recognition free from line-direction constraint and writing format constraint such as character writing boxes or ruled lines is presented."
            },
            "venue": {
                "fragments": [],
                "text": "IEICE Trans. Inf. Syst."
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 153,
                                "start": 149
                            }
                        ],
                        "text": "…string recognition, most works aimed at the recognition of text lines or phrases in rather constrained application domains, such as legal amount recognition in bank checks [4] and address phrase recognition for postal mails [5], [6], [7], [8], where the number of character classes is very small…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2904981,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cd7ea90ec1b72e595ca4cf5d3de28ebe40ded193",
            "isKey": false,
            "numCitedBy": 57,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "The technology of handwritten Chinese character recognition (HCCR) has seen significant advances in the last two decades owing to the effectiveness of many techniques, especially those for character shape normalization and feature extraction. This chapter reviews the major methods of normalization and feature extraction and evaluates their performance experimentally. The normalization methods include linear normalization, nonlinear normalization (NLN) based on line density equalization, moment normalization (MN), bi-moment normalization (BMN), modified centroid-boundary alignment (MCBA), and their pseudo-two-dimensional (pseudo 2D) extensions. As to feature extraction, I focus on some effective variations of direction features: chaincode feature, normalization-cooperated chaincode feature (NCCF), and gradient feature. The features are compared with various resolutions of direction and zoning, and are combined with various normalization methods. In experiments, the current methods have shown superior performance on handprinted characters, but are insufficient applied to unconstrained handwriting."
            },
            "slug": "Handwritten-Chinese-Character-Recognition:-Effects-Liu",
            "title": {
                "fragments": [],
                "text": "Handwritten Chinese Character Recognition: Effects of Shape Normalization and Feature Extraction"
            },
            "tldr": {
                "abstractSimilarityScore": 88,
                "text": "The technology of handwritten Chinese character recognition (HCCR) has seen significant advances in the last two decades owing to the effectiveness of many techniques, especially those for character shape normalization and feature extraction, but are insufficient applied to unconstrained handwriting."
            },
            "venue": {
                "fragments": [],
                "text": "SACH"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1957622"
                        ],
                        "name": "H. Sako",
                        "slug": "H.-Sako",
                        "structuredName": {
                            "firstName": "Hiroshi",
                            "lastName": "Sako",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Sako"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34878566"
                        ],
                        "name": "H. Fujisawa",
                        "slug": "H.-Fujisawa",
                        "structuredName": {
                            "firstName": "Hiromichi",
                            "lastName": "Fujisawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Fujisawa"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 159,
                                "start": 155
                            }
                        ],
                        "text": "The authors are with the National Laboratory of Pattern Recognition, Institute of Automation, Chinese Academy of Sciences, 95 Zhongguancun East Road, Beijing 100190, P.R. China."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 49
                            }
                        ],
                        "text": "In this study, we investigate three key issues of integrated segmentation-and-recognition for HCTR: candidate path evaluation, path search, and parameter estimation."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "The four probabilistic terms in (9) correspond to the character recognition model, unary and\nbinary class-dependent geometric model, and language\nmodel, respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 11216140,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "005849177f9baf90e32e05b880b66d1986e16d6e",
            "isKey": false,
            "numCitedBy": 109,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "In integrated segmentation and recognition of character strings, the underlying classifier is trained to be resistant to noncharacters. We evaluate the performance of state-of-the-art pattern classifiers of this kind. First, we build a baseline numeral string recognition system with simple but effective presegmentation. The classification scores of the candidate patterns generated by presegmentation are combined to evaluate the segmentation paths and the optimal path is found using the beam search strategy. Three neural classifiers, two discriminative density models, and two support vector classifiers are evaluated. Each classifier has some variations depending on the training strategy: maximum likelihood, discriminative learning both with and without noncharacter samples. The string recognition performances are evaluated on the numeral string images of the NIST special database 19 and the zipcode images of the CEDAR CDROM-1. The results show that noncharacter training is crucial for neural classifiers and support vector classifiers, whereas, for the discriminative density models, the regularization of parameters is important. The string recognition results compare favorably to the best ones reported in the literature though we totally ignored the geometric context. The best results were obtained using a support vector classifier, but the neural classifiers and discriminative density models show better trade-off between accuracy and computational overhead."
            },
            "slug": "Effects-of-classifier-structures-and-training-on-of-Liu-Sako",
            "title": {
                "fragments": [],
                "text": "Effects of classifier structures and training regimes on integrated segmentation and recognition of handwritten numeral strings"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The results show that noncharacter training is crucial for neural classifiers and support vector classifiers, whereas, for the discriminative density models, the regularization of parameters is important."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113961526"
                        ],
                        "name": "Zhi Han",
                        "slug": "Zhi-Han",
                        "structuredName": {
                            "firstName": "Zhi",
                            "lastName": "Han",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zhi Han"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2144904390"
                        ],
                        "name": "Chang-Ping Liu",
                        "slug": "Chang-Ping-Liu",
                        "structuredName": {
                            "firstName": "Chang-Ping",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chang-Ping Liu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 143,
                                "start": 140
                            }
                        ],
                        "text": "We evaluated the recognition performance on a Chinese handwriting database CASIA-HWDB, which contains nearly four million character samples of 7,356 classes and 5,091 pages of unconstrained handwritten texts."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8583885,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3a10fe97750b0593d2b54c619bd7ea0cb9d4e798",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Character segmentation has become a crucial step for mail address recognition in the automatic post mail sorting system. In this paper, a two-stage character segmentation algorithm according to the characteristics of handwritten mail address characters is proposed. In the simple segmentation stage, the block sequence is extracted from the mail address image using the structure-based methods, including projection profile analysis, connected components analysis and stroke cross number analysis. In the precise segmentation stage, all candidate segmentation paths are created by combining the neighboring blocks and represented with a candidate segmentation graph first. Then several optimal candidate paths are selected from the graph by dynamic programming searching based on recognition confidence. Finally the best segmentation path is determined by matching these paths with the known post address database. In the experiment on more than 500 real envelop images with the this approach, the correct sorting rate of address recognition is up to 79.46% and that of address-postcode integrated recognition is up to 96.26%."
            },
            "slug": "A-two-stage-handwritten-character-segmentation-in-Han-Liu",
            "title": {
                "fragments": [],
                "text": "A two-stage handwritten character segmentation approach in mail address recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "A two-stage character segmentation algorithm according to the characteristics of handwritten mail address characters is proposed and the correct sorting rate of address recognition and that of address-postcode integrated recognition is up to 96.26%."
            },
            "venue": {
                "fragments": [],
                "text": "Eighth International Conference on Document Analysis and Recognition (ICDAR'05)"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145841729"
                        ],
                        "name": "Ruwei Dai",
                        "slug": "Ruwei-Dai",
                        "structuredName": {
                            "firstName": "Ruwei",
                            "lastName": "Dai",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ruwei Dai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47535411"
                        ],
                        "name": "Chenglin Liu",
                        "slug": "Chenglin-Liu",
                        "structuredName": {
                            "firstName": "Chenglin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chenglin Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2658590"
                        ],
                        "name": "Baihua Xiao",
                        "slug": "Baihua-Xiao",
                        "structuredName": {
                            "firstName": "Baihua",
                            "lastName": "Xiao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Baihua Xiao"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 179,
                                "start": 176
                            }
                        ],
                        "text": "general integrated segmentation-and-recognition framework with character oversegmentation, we investigate three important issues: candidate path evaluation, path search, and parameter estimation."
                    },
                    "intents": []
                }
            ],
            "corpusId": 3405358,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "df0ae788c98e6adda375587e9e17dbc12f3a83cb",
            "isKey": false,
            "numCitedBy": 43,
            "numCiting": 99,
            "paperAbstract": {
                "fragments": [],
                "text": "Chinese character recognition (CCR) is an important branch of pattern recognition. It was considered as an extremely difficult problem due to the very large number of categories, complicated structures, similarity between characters, and the variability of fonts or writing styles. Because of its unique technical challenges and great social needs, the last four decades witnessed the intensive research in this field and a rapid increase of successful applications. However, higher recognition performance is continuously needed to improve the existing applications and to exploit new applications. This paper first provides an overview of Chinese character recognition and the properties of Chinese characters. Some important methods and successful results in the history of Chinese character recognition are then summarized. As for classification methods, this article pays special attention to the syntactic-semantic approach for online Chinese character recognition, as well as the metasynthesis approach for discipline crossing. Finally, the remaining problems and the possible solutions are discussed."
            },
            "slug": "Chinese-character-recognition:-history,-status-and-Dai-Liu",
            "title": {
                "fragments": [],
                "text": "Chinese character recognition: history, status and prospects"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "An overview of Chinese character recognition and the properties of Chinese characters is provided and special attention is paid to the syntactic-semantic approach for online Chinese characters recognition, as well as the metasynthesis approach for discipline crossing."
            },
            "venue": {
                "fragments": [],
                "text": "Frontiers of Computer Science in China"
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3059035"
                        ],
                        "name": "D. Ru-wei",
                        "slug": "D.-Ru-wei",
                        "structuredName": {
                            "firstName": "Dai",
                            "lastName": "Ru-wei",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ru-wei"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2055503543"
                        ],
                        "name": "Liu Cheng-lin",
                        "slug": "Liu-Cheng-lin",
                        "structuredName": {
                            "firstName": "Liu",
                            "lastName": "Cheng-lin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Liu Cheng-lin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1444660693"
                        ],
                        "name": "Xia Bai-hua",
                        "slug": "Xia-Bai-hua",
                        "structuredName": {
                            "firstName": "Xia",
                            "lastName": "Bai-hua",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Xia Bai-hua"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 195722634,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ad9227cbb513ef880f864ec38f26a7d1259eb722",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 51,
            "paperAbstract": {
                "fragments": [],
                "text": "Chinese character recognition (CCR) is an important branch of pattern recognition. It was considered as an extremely difficult problem due to the very large number of categories, complicated structures, similarity between characters, and the variability of fonts or writing styles. Because of its unique technical challenges and great social needs, the last four decades witnessed the intensive research in this field and a rapid increase of successful applications. However, higher recognition performance is continuously needed to improve the existing applications and to exploit new applications. This paper first provides an overview of Chinese character recognition and the properties of Chinese characters. Some important methods and successful results in the history of Chinese character recognition are then summarized. As for classification methods, this article pays special attention to the syntactic-semantic approach for online Chinese character recognition, as well as the metasynthesis approach for discipline crossing. Finally, the remaining problems and the possible solutions are discussed."
            },
            "slug": "Chinese-character-recognition:-history,-status-and-Ru-wei-Cheng-lin",
            "title": {
                "fragments": [],
                "text": "Chinese character recognition: history, status and prospects"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "An overview of Chinese character recognition and the properties of Chinese characters is provided and special attention is paid to the syntactic-semantic approach for online Chinese characters recognition, as well as the metasynthesis approach for discipline crossing."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145820427"
                        ],
                        "name": "Fei Yin",
                        "slug": "Fei-Yin",
                        "structuredName": {
                            "firstName": "Fei",
                            "lastName": "Yin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fei Yin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2140087937"
                        ],
                        "name": "Qiu-Feng Wang",
                        "slug": "Qiu-Feng-Wang",
                        "structuredName": {
                            "firstName": "Qiu-Feng",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qiu-Feng Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 12
                            }
                        ],
                        "text": "Last, handwritten text recognition is more difficult than bank check recognition and mail address reading because the lexical constraint is very weak: Under grammatical and semantic constraints, the number of sentence classes is infinite."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 71,
                                "start": 67
                            }
                        ],
                        "text": "In integrated segmentation-and-recognition, the candidate segmentation-recognition paths are usually evaluated by combining the character recognition scores (classifier outputs), geometric context, and linguistic context [16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 18966419,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aae71846e4d622c6414f624b3549945580074aeb",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "The alignment of text line images with text transcript is a crucial step of handwritten document annotation. Handwritten text alignment is prone to errors due to the difficulty of character segmentation and the variability of character shape, size and position. In this paper, we propose to incorporate the geometric context of character strings to improve the alignment accuracy for offline handwritten Chinese documents. We use four statistical models to evaluate the geometric features of single characters and between-character relationships. By combining the geometric models with a character recognizer, we have achieved a large improvement of alignment accuracy in our experiments on unconstrained handwritten Chinese text lines."
            },
            "slug": "Integrating-Geometric-Context-for-Text-Alignment-of-Yin-Wang",
            "title": {
                "fragments": [],
                "text": "Integrating Geometric Context for Text Alignment of Handwritten Chinese Documents"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper uses four statistical models to evaluate the geometric features of single characters and between-character relationships and achieves a large improvement of alignment accuracy in the authors' experiments on unconstrained handwritten Chinese text lines."
            },
            "venue": {
                "fragments": [],
                "text": "2010 12th International Conference on Frontiers in Handwriting Recognition"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33468285"
                        ],
                        "name": "X.-D. Zhou",
                        "slug": "X.-D.-Zhou",
                        "structuredName": {
                            "firstName": "X.-D.",
                            "lastName": "Zhou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X.-D. Zhou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115987364"
                        ],
                        "name": "J.-L. Yu",
                        "slug": "J.-L.-Yu",
                        "structuredName": {
                            "firstName": "J.-L.",
                            "lastName": "Yu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J.-L. Yu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107892678"
                        ],
                        "name": "C.-L. Liu",
                        "slug": "C.-L.-Liu",
                        "structuredName": {
                            "firstName": "C.-L.",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C.-L. Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31323486"
                        ],
                        "name": "T. Nagasaki",
                        "slug": "T.-Nagasaki",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Nagasaki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Nagasaki"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1765131"
                        ],
                        "name": "K. Marukawa",
                        "slug": "K.-Marukawa",
                        "structuredName": {
                            "firstName": "Katsumi",
                            "lastName": "Marukawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Marukawa"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 200,
                                "start": 196
                            }
                        ],
                        "text": "Handwritten Chinese text recognition (HCTR) is a challenging problem due to the large character set, the diversity of writing styles, the character segmentation difficulty, and the unconstrained language domain."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Ç"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 131,
                                "start": 127
                            }
                        ],
                        "text": "Handwritten text recognition is particularly difficult because the characters cannot be reliably segmented prior to character recognition."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "The four probabilistic terms in (9) correspond to the character recognition model, unary and\nbinary class-dependent geometric model, and language\nmodel, respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9308853,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4744e133e6ec9e06f2c7fcdd4ea1fea7e867e954",
            "isKey": true,
            "numCitedBy": 31,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes an online handwritten Japanese character string recognition system integrating scores of geometric context, character recognition, and linguistic context. We give a string evaluation criterion for better integrating the multiple scores while overcoming the effect of string length variability. For measuring geometric context, we propose a statistical method for modeling both single- character and between-character plausibility. Our experimental results on TUAT HANDS databases show that the geometric context improves the character segmentation accuracy remarkably."
            },
            "slug": "Online-Handwritten-Japanese-Character-String-Zhou-Yu",
            "title": {
                "fragments": [],
                "text": "Online Handwritten Japanese Character String Recognition Incorporating Geometric Context"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "An online handwritten Japanese character string recognition system integrating scores of geometric context, character recognition, and linguistic context is described and a statistical method for modeling both single- character and between-character plausibility is proposed."
            },
            "venue": {
                "fragments": [],
                "text": "Ninth International Conference on Document Analysis and Recognition (ICDAR 2007)"
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40523977"
                        ],
                        "name": "Tonghua Su",
                        "slug": "Tonghua-Su",
                        "structuredName": {
                            "firstName": "Tonghua",
                            "lastName": "Su",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tonghua Su"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1821107"
                        ],
                        "name": "Tianwen Zhang",
                        "slug": "Tianwen-Zhang",
                        "structuredName": {
                            "firstName": "Tianwen",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tianwen Zhang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2438618"
                        ],
                        "name": "D. Guan",
                        "slug": "D.-Guan",
                        "structuredName": {
                            "firstName": "De-Jun",
                            "lastName": "Guan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Guan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3148810"
                        ],
                        "name": "Hujie Huang",
                        "slug": "Hujie-Huang",
                        "structuredName": {
                            "firstName": "Hujie",
                            "lastName": "Huang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hujie Huang"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 199,
                                "start": 196
                            }
                        ],
                        "text": "On a test set of 1,015 handwritten pages, the proposed approach achieved character-level accurate rate of 90.75 percent and correct rate of 91.39 percent, which are superior by far to the best results reported in the literature."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Ç"
                    },
                    "intents": []
                }
            ],
            "corpusId": 13155979,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d31798506874705f900e72203515abfaa9278409",
            "isKey": true,
            "numCitedBy": 122,
            "numCiting": 56,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Off-line-recognition-of-realistic-Chinese-using-Su-Zhang",
            "title": {
                "fragments": [],
                "text": "Off-line recognition of realistic Chinese handwriting using segmentation-free strategy"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145887653"
                        ],
                        "name": "M. Nakagawa",
                        "slug": "M.-Nakagawa",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Nakagawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Nakagawa"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 29
                            }
                        ],
                        "text": "Works on Chinese handwriting recognition of general texts have been reported only in recent years, and the reported accuracies are quite low."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5057275,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8ce09f7010b9f7b86aca9f3215b89dce7e793260",
            "isKey": false,
            "numCitedBy": 149,
            "numCiting": 61,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Evaluation-of-prototype-learning-algorithms-for-in-Liu-Nakagawa",
            "title": {
                "fragments": [],
                "text": "Evaluation of prototype learning algorithms for nearest-neighbor classifier in application to handwritten character recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1757867"
                        ],
                        "name": "Eiki Ishidera",
                        "slug": "Eiki-Ishidera",
                        "structuredName": {
                            "firstName": "Eiki",
                            "lastName": "Ishidera",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eiki Ishidera"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66769575"
                        ],
                        "name": "A. Sato",
                        "slug": "A.-Sato",
                        "structuredName": {
                            "firstName": "Atsushi",
                            "lastName": "Sato",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Sato"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 50
                            }
                        ],
                        "text": "To balance the multiple contexts in path evaluation function, we optimize the combining weights on a data set of training text lines using a Maximum Character Accuracy (MCA) criterion."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 30538209,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e81c333bb17b3a04fa608d9e05534a004c24e3b1",
            "isKey": false,
            "numCitedBy": 4,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a method for reducing the number of candidates in Kanji character recognition. Such reduction is vital to increasing the speed of such applications as Kanji address recognition. Further, it also reduces the probability of misreadings in linguistic postprocessing. First, we define a confidence value by which we can express the potential correctness of recognition candidates. Next, we define \"accumulated confidence value\" and use it as a measure to express a threshold for candidate acceptance in Kanji character recognition. The efficiency of the proposed method is evaluated in an experiment using IPTP CD-ROM2 Japanese address images. Results show that a roughly 31% reduction in the number of candidates was obtained without reducing the number of correct candidates."
            },
            "slug": "A-candidate-reduction-method-for-handwritten-Kanji-Ishidera-Sato",
            "title": {
                "fragments": [],
                "text": "A candidate reduction method for handwritten Kanji character recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "A method for reducing the number of candidates in Kanji character recognition, which is vital to increasing the speed of such applications as Kanji address recognition and reducing the probability of misreadings in linguistic postprocessing is described."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of Sixth International Conference on Document Analysis and Recognition"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110437882"
                        ],
                        "name": "Yuanxiang Li",
                        "slug": "Yuanxiang-Li",
                        "structuredName": {
                            "firstName": "Yuanxiang",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yuanxiang Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1679749"
                        ],
                        "name": "C. Tan",
                        "slug": "C.-Tan",
                        "structuredName": {
                            "firstName": "Chew",
                            "lastName": "Tan",
                            "middleNames": [
                                "Lim"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Tan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145507765"
                        ],
                        "name": "X. Ding",
                        "slug": "X.-Ding",
                        "structuredName": {
                            "firstName": "Xiaoqing",
                            "lastName": "Ding",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Ding"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107903806"
                        ],
                        "name": "Changsong Liu",
                        "slug": "Changsong-Liu",
                        "structuredName": {
                            "firstName": "Changsong",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Changsong Liu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 81,
                                "start": 77
                            }
                        ],
                        "text": "We evaluated the recognition performance on a large database CASIA-HWDB [21] of unconstrained Chinese handwritten characters and texts, and demonstrated superior performance by the proposed methods."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 11275667,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "945e4c8ab873851e31960ad393a1e18009233e56",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Contextual-post-processing-based-on-the-confusion-Li-Tan",
            "title": {
                "fragments": [],
                "text": "Contextual post-processing based on the confusion matrix in offline handwritten Chinese script recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "24826643"
                        ],
                        "name": "Zhizhen Liang",
                        "slug": "Zhizhen-Liang",
                        "structuredName": {
                            "firstName": "Zhizhen",
                            "lastName": "Liang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zhizhen Liang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1740385"
                        ],
                        "name": "P. Shi",
                        "slug": "P.-Shi",
                        "structuredName": {
                            "firstName": "Pengfei",
                            "lastName": "Shi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Shi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 137,
                                "start": 133
                            }
                        ],
                        "text": "In isolated Chinese character recognition, most methods were evaluated on data sets of constrained writing styles though very high accuracies (say, over 99 percent on Japanese Kanji characters and over 98 percent on Chinese characters) have been reported [1]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 10631114,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "462da375401ddaa5d8f28f25a35232cb7e0126e7",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-metasynthetic-approach-for-segmenting-handwritten-Liang-Shi",
            "title": {
                "fragments": [],
                "text": "A metasynthetic approach for segmenting handwritten Chinese character strings"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit. Lett."
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2035071"
                        ],
                        "name": "Hanshen Tang",
                        "slug": "Hanshen-Tang",
                        "structuredName": {
                            "firstName": "Hanshen",
                            "lastName": "Tang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hanshen Tang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39933279"
                        ],
                        "name": "E. Augustin",
                        "slug": "E.-Augustin",
                        "structuredName": {
                            "firstName": "Emmanuel",
                            "lastName": "Augustin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Augustin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713795"
                        ],
                        "name": "C. Suen",
                        "slug": "C.-Suen",
                        "structuredName": {
                            "firstName": "Ching",
                            "lastName": "Suen",
                            "middleNames": [
                                "Yee"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Suen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2953853"
                        ],
                        "name": "O. Baret",
                        "slug": "O.-Baret",
                        "structuredName": {
                            "firstName": "Olivier",
                            "lastName": "Baret",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Baret"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145541445"
                        ],
                        "name": "M. Cheriet",
                        "slug": "M.-Cheriet",
                        "structuredName": {
                            "firstName": "Mohamed",
                            "lastName": "Cheriet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Cheriet"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 92,
                                "start": 89
                            }
                        ],
                        "text": "Table 1 shows some statistics of character samples segmented from the test text pages of CASIA-HWDB."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 66,
                                "start": 63
                            }
                        ],
                        "text": "We report the recognition rates of different techniques on the CASIA-HWDB test set, and give the processing time on all test pages (1,015 pages) consumed on a desktop computer of 2.66 GHz CPU, programming using Microsoft Visual C++."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 81,
                                "start": 78
                            }
                        ],
                        "text": "We evaluated the recognition performance on a Chinese handwriting database CASIA-HWDB, which contains nearly four million character samples of 7,356 classes and 5,091 pages of unconstrained handwritten texts."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 64,
                                "start": 61
                            }
                        ],
                        "text": "We evaluated the recognition performance on a large database CASIA-HWDB [21] of unconstrained Chinese handwritten characters and texts, and demonstrated superior performance by the proposed methods."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 4
                            }
                        ],
                        "text": "The CASIA-HWDB database contains both isolated characters and unconstrained handwritten texts, and is divided into a training set of 816 writers and a test set of 204 writers."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 106,
                                "start": 103
                            }
                        ],
                        "text": "We evaluated the performance of our approach on a large database of unconstrained Chinese handwriting, CASIAHWDB [21], and on a small data set, HIT-MW [54]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 17765601,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b85b04d0127f4d586c4fec633cef5c87c91f5100",
            "isKey": true,
            "numCitedBy": 18,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents the spiral recognition methodology with its application in unconstrained handwritten Chinese legal amount recognition in a practical environment of a CheckReader/spl trade/. This paper first describes the failed application of neural network - hidden Markov model hybrid recognizer on Chinese bank check legal amount recognition, and explains the reasons for the failure: the neural network - hidden Markov model hybrid recognizer cannot handle the complexity in the training for Chinese legal amounts. Then a spiral recognition methodology is presented. This methodology enables the system to increase its recognition power (both the recognition rate and the number of recognized characters) during the training iterations. Some experiments were done to show that the spiral recognition methodology has a high performance in the recognition of unconstrained handwritten Chinese legal amounts. The recognition rate at the character level is 93.5%, and the recognition rate at the legal amount level is 60%. Combined with the recognition of courtesy amount, the overall error rate is less than 1%."
            },
            "slug": "Spiral-recognition-methodology-and-its-application-Tang-Augustin",
            "title": {
                "fragments": [],
                "text": "Spiral recognition methodology and its application for recognition of Chinese bank checks"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "A spiral recognition methodology is presented that enables the system to increase its recognition power (both the recognition rate and the number of recognized characters) during the training iterations and has a high performance in the recognition of unconstrained handwritten Chinese legal amounts."
            },
            "venue": {
                "fragments": [],
                "text": "Ninth International Workshop on Frontiers in Handwriting Recognition"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40523977"
                        ],
                        "name": "Tonghua Su",
                        "slug": "Tonghua-Su",
                        "structuredName": {
                            "firstName": "Tonghua",
                            "lastName": "Su",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tonghua Su"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1821107"
                        ],
                        "name": "Tianwen Zhang",
                        "slug": "Tianwen-Zhang",
                        "structuredName": {
                            "firstName": "Tianwen",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tianwen Zhang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2438618"
                        ],
                        "name": "D. Guan",
                        "slug": "D.-Guan",
                        "structuredName": {
                            "firstName": "De-Jun",
                            "lastName": "Guan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Guan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7194635,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "960ef34612a05771fec5eb7db01fc33a70ad4759",
            "isKey": false,
            "numCitedBy": 138,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "A Chinese handwriting database named HIT-MW is presented to facilitate the offline Chinese handwritten text recognition. Both the writers and the texts for handcopying are carefully sampled with a systematic scheme. To collect naturally written handwriting, forms are distributed by postal mail or middleman instead of face to face. The current version of HIT-MW includes 853 forms and 186,444 characters that are produced under an unconstrained condition without preprinted character boxes. The statistics show that the database has an excellent representation of the real handwriting. Many new applications concerning real handwriting recognition can be supported by the database."
            },
            "slug": "Corpus-based-HIT-MW-database-for-offline-of-Chinese-Su-Zhang",
            "title": {
                "fragments": [],
                "text": "Corpus-based HIT-MW database for offline recognition of general-purpose Chinese handwritten text"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The statistics show that the HIT-MW database has an excellent representation of the real handwriting and many new applications concerning real handwriting recognition can be supported by the database."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Document Analysis and Recognition (IJDAR)"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145820427"
                        ],
                        "name": "Fei Yin",
                        "slug": "Fei-Yin",
                        "structuredName": {
                            "firstName": "Fei",
                            "lastName": "Yin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fei Yin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1807704"
                        ],
                        "name": "Da-Han Wang",
                        "slug": "Da-Han-Wang",
                        "structuredName": {
                            "firstName": "Da-Han",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Da-Han Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2140087937"
                        ],
                        "name": "Qiu-Feng Wang",
                        "slug": "Qiu-Feng-Wang",
                        "structuredName": {
                            "firstName": "Qiu-Feng",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qiu-Feng Wang"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Ç"
                    },
                    "intents": []
                }
            ],
            "corpusId": 7189100,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4d242380d4b7a29b07afdf0df1402297e76b2af4",
            "isKey": false,
            "numCitedBy": 338,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper introduces a pair of online and offline Chinese handwriting databases, containing samples of isolated characters and handwritten texts. The samples were produced by 1,020 writers using Anoto pen on papers for obtaining both online trajectory data and offline images. Both the online samples and offline samples are divided into six datasets, three for isolated characters (DB1.0-C1.2) and three for handwritten texts (DB2.0-C2.2). The (either online or offline) datasets of isolated characters contain about 3.9 million samples of 7,356 classes (7,185 Chinese characters and 171 symbols), and the datasets of handwritten texts contain about 5,090 pages and 1.35 million character samples. Each dataset is segmented and annotated at character level, and is partitioned into standard training and test subsets. The online and offline databases can be used for the research of various handwritten document analysis tasks."
            },
            "slug": "CASIA-Online-and-Offline-Chinese-Handwriting-Liu-Yin",
            "title": {
                "fragments": [],
                "text": "CASIA Online and Offline Chinese Handwriting Databases"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "A pair of online and offline Chinese handwriting databases, containing samples of isolated characters and handwritten texts, are introduced, which can be used for the research of various handwritten document analysis tasks."
            },
            "venue": {
                "fragments": [],
                "text": "2011 International Conference on Document Analysis and Recognition"
            },
            "year": 2011
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46520089"
                        ],
                        "name": "Xiaofan Lin",
                        "slug": "Xiaofan-Lin",
                        "structuredName": {
                            "firstName": "Xiaofan",
                            "lastName": "Lin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Xiaofan Lin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145507765"
                        ],
                        "name": "X. Ding",
                        "slug": "X.-Ding",
                        "structuredName": {
                            "firstName": "Xiaoqing",
                            "lastName": "Ding",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Ding"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143630377"
                        ],
                        "name": "Ming Chen",
                        "slug": "Ming-Chen",
                        "structuredName": {
                            "firstName": "Ming",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ming Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144142354"
                        ],
                        "name": "Rui Zhang",
                        "slug": "Rui-Zhang",
                        "structuredName": {
                            "firstName": "Rui",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rui Zhang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115859002"
                        ],
                        "name": "Youshou Wu",
                        "slug": "Youshou-Wu",
                        "structuredName": {
                            "firstName": "Youshou",
                            "lastName": "Wu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Youshou Wu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 63,
                                "start": 59
                            }
                        ],
                        "text": "Two later works on the same data set, using character classifiers and statistical language models (SLM) based on oversegmentation, reported a character-level correct rate of 78.44 [10] and 73.97 percent [11], respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 26474180,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7a685fd0f339fbac7f346bc3983666ddb59943c5",
            "isKey": true,
            "numCitedBy": 82,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Adaptive-confidence-transform-based-classifier-for-Lin-Ding",
            "title": {
                "fragments": [],
                "text": "Adaptive confidence transform based classifier combination for Chinese character recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit. Lett."
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1683416"
                        ],
                        "name": "Chunheng Wang",
                        "slug": "Chunheng-Wang",
                        "structuredName": {
                            "firstName": "Chunheng",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chunheng Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1686126"
                        ],
                        "name": "Y. Hotta",
                        "slug": "Y.-Hotta",
                        "structuredName": {
                            "firstName": "Yoshinobu",
                            "lastName": "Hotta",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Hotta"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1807689"
                        ],
                        "name": "M. Suwa",
                        "slug": "M.-Suwa",
                        "structuredName": {
                            "firstName": "Misako",
                            "lastName": "Suwa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Suwa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1753831"
                        ],
                        "name": "S. Naoi",
                        "slug": "S.-Naoi",
                        "structuredName": {
                            "firstName": "Satoshi",
                            "lastName": "Naoi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Naoi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 138,
                                "start": 135
                            }
                        ],
                        "text": "We evaluated the recognition performance on a Chinese handwriting database CASIA-HWDB, which contains nearly four million character samples of 7,356 classes and 5,091 pages of unconstrained handwritten texts."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 11440490,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5401e13d507f9402f9782c567c3a30a7945960fd",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "A handwritten Chinese address recognition (HCAR) system is proposed in this paper. Handwritten Chinese address recognition is a difficult problem. Handwritten Chinese characters are characterized by large vocabulary, complicate structure, irregular distortion and touching characters etc. The proposed approach takes good advantage of Chinese address knowledge, and applies key character extraction and holistic word matching to solving the problem. Different from conventional approach, proposed approach can avoid the character segmentation error successfully. Experimental results show the proposed approach is very effective."
            },
            "slug": "Handwritten-Chinese-address-recognition-Wang-Hotta",
            "title": {
                "fragments": [],
                "text": "Handwritten Chinese address recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Different from conventional approach, proposed approach can avoid the character segmentation error successfully and Experimental results show the proposed approach is very effective."
            },
            "venue": {
                "fragments": [],
                "text": "Ninth International Workshop on Frontiers in Handwriting Recognition"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2326668"
                        ],
                        "name": "L. Tseng",
                        "slug": "L.-Tseng",
                        "structuredName": {
                            "firstName": "Lin-Yu",
                            "lastName": "Tseng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Tseng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1694167"
                        ],
                        "name": "R. Chen",
                        "slug": "R.-Chen",
                        "structuredName": {
                            "firstName": "Rung",
                            "lastName": "Chen",
                            "middleNames": [
                                "Ching"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Chen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 131,
                                "start": 127
                            }
                        ],
                        "text": "In isolated Chinese character recognition, most methods were evaluated on data sets of constrained writing styles though very high accuracies (say, over 99 percent on Japanese Kanji characters and over 98 percent on Chinese characters) have been reported [1]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 28584656,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "76b48caa1e9ca19a013de90caa7309a308ba852b",
            "isKey": false,
            "numCitedBy": 55,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Segmenting-handwritten-Chinese-characters-based-on-Tseng-Chen",
            "title": {
                "fragments": [],
                "text": "Segmenting handwritten Chinese characters based on heuristic merging of stroke bounding boxes and dynamic programming"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit. Lett."
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6752534,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b54b611455b35aaaeedc426cd7d54c462a517ccc",
            "isKey": false,
            "numCitedBy": 139,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "The gradient direction histogram feature has shown superior performance in character recognition. To alleviate the effect of stroke direction distortion caused by shape normalization and provide higher recognition accuracies, we propose a new feature extraction approach, called normalization-cooperated gradient feature (NCGF) extraction, which maps the gradient direction elements of original image to direction planes without generating the normalized image and can be combined with various normalization methods. Experiments on handwritten Japanese and Chinese character databases show that, compared to normalization-based gradient feature, the NCGF reduces the recognition error rate by factors ranging from 8.63 percent to 14.97 percent with high confidence of significance when combined with pseudo-two-dimensional normalization."
            },
            "slug": "Normalization-Cooperated-Gradient-Feature-for-Liu",
            "title": {
                "fragments": [],
                "text": "Normalization-Cooperated Gradient Feature Extraction for Handwritten Character Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A new feature extraction approach, called normalization-cooperated gradient feature (NCGF) extraction, which maps the gradient direction elements of original image to direction planes without generating the normalized image and can be combined with various normalization methods."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "82910116"
                        ],
                        "name": "H. Murase",
                        "slug": "H.-Murase",
                        "structuredName": {
                            "firstName": "Hiroshi",
                            "lastName": "Murase",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Murase"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Ç"
                    },
                    "intents": []
                }
            ],
            "corpusId": 41217942,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6e96b22bc8bb3d5af3979b0fc2dde39075ba0be7",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "An online recognition method, called the candidate lattice method, is described for free-format written Japanese character strings, which may contain characters with separated constituents or overlapping characters. The method conducts segmentation and recognition of individual character-candidates, and applies linguistic information to determine the most probable character string to achieve high recognition rates. Special hardware designed to realize a real-time recognition system is also introduced. The method, used on special hardware, attained a segmentation rate of 98.8% and an overall recognition rate of 98.7% for 105 samples.<<ETX>>"
            },
            "slug": "Online-recognition-of-free-format-Japanese-Murase",
            "title": {
                "fragments": [],
                "text": "Online recognition of free-format Japanese handwritings"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "An online recognition method, called the candidate lattice method, is described for free-format written Japanese character strings, which may contain characters with separated constituents or overlapping characters."
            },
            "venue": {
                "fragments": [],
                "text": "[1988 Proceedings] 9th International Conference on Pattern Recognition"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2887371"
                        ],
                        "name": "Masashi Koga",
                        "slug": "Masashi-Koga",
                        "structuredName": {
                            "firstName": "Masashi",
                            "lastName": "Koga",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Masashi Koga"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2624031"
                        ],
                        "name": "T. Kagehiro",
                        "slug": "T.-Kagehiro",
                        "structuredName": {
                            "firstName": "Tatsuhiko",
                            "lastName": "Kagehiro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kagehiro"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1957622"
                        ],
                        "name": "H. Sako",
                        "slug": "H.-Sako",
                        "structuredName": {
                            "firstName": "Hiroshi",
                            "lastName": "Sako",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Sako"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34878566"
                        ],
                        "name": "H. Fujisawa",
                        "slug": "H.-Fujisawa",
                        "structuredName": {
                            "firstName": "Hiromichi",
                            "lastName": "Fujisawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Fujisawa"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 18
                            }
                        ],
                        "text": "The difficulties of character segmentation originate from the variability of character size and position, character touching and overlapping."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 206843449,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c4b6eb627061160e8fb9e249e792aa846a7cd7c6",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "A method of character segmentation of Japanese handwritten characters has been developed. It is effective especially in character recognition with the over-segmentation process. The method is based on the credibility measurement of each presegmented pattern for being a true character by analyzing peripheral features such as gaps between patterns and widths and heights of patterns. A heuristic statistical method is applied to the analysis. Experimental results show that the developed method increases the accuracy of character segmentation. It is effective especially when no linguistic feedback to segmentation is available and/or the character classifier ability is not high enough. In such cases, the recognition accuracy is increased from 30% to 70% by the new segmentation method."
            },
            "slug": "Segmentation-of-Japanese-handwritten-characters-Koga-Kagehiro",
            "title": {
                "fragments": [],
                "text": "Segmentation of Japanese handwritten characters using peripheral feature analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "Experimental results show that the developed method increases the accuracy of character segmentation, especially when no linguistic feedback to segmentation is available and/or the character classifier ability is not high enough."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. Fourteenth International Conference on Pattern Recognition (Cat. No.98EX170)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145820427"
                        ],
                        "name": "Fei Yin",
                        "slug": "Fei-Yin",
                        "structuredName": {
                            "firstName": "Fei",
                            "lastName": "Yin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fei Yin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2140087937"
                        ],
                        "name": "Qiu-Feng Wang",
                        "slug": "Qiu-Feng-Wang",
                        "structuredName": {
                            "firstName": "Qiu-Feng",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qiu-Feng Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 253,
                                "start": 249
                            }
                        ],
                        "text": "In the context of handwritten text (character string1) recognition, many works have contributed to the related issues of oversegmentation, character classification, confidence transformation, language model, geometric model, path evaluation and search, and parameter estimation."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6300575,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8fc7e0cb2919d8d78a547f1a0b2d2eb4922cb1d8",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Annotating the regions, text lines and characters of document images is an important, but tedious and expensive task. A ground-truthing tool may largely alleviate the human burden in this process. This paper describes an automated recognition-based tool GTLC for finding the best alignment between the text transcript and the connected components of unconstrained handwritten document image. The alignment process is formulated as an optimization problem involving candidate character segmentation and recognition. We have validated the effectiveness of this tool and have used it for annotating a large number of handwritten Chinese documents."
            },
            "slug": "A-Tool-for-Ground-Truthing-Text-Lines-and-in-Yin-Wang",
            "title": {
                "fragments": [],
                "text": "A Tool for Ground-Truthing Text Lines and Characters in Off-Line Handwritten Chinese Documents"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An automated recognition-based tool GTLC for finding the best alignment between the text transcript and the connected components of unconstrained handwritten document image is described."
            },
            "venue": {
                "fragments": [],
                "text": "2009 10th International Conference on Document Analysis and Recognition"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719436"
                        ],
                        "name": "A. Vinciarelli",
                        "slug": "A.-Vinciarelli",
                        "structuredName": {
                            "firstName": "Alessandro",
                            "lastName": "Vinciarelli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Vinciarelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1751569"
                        ],
                        "name": "Samy Bengio",
                        "slug": "Samy-Bengio",
                        "structuredName": {
                            "firstName": "Samy",
                            "lastName": "Bengio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Samy Bengio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1720945"
                        ],
                        "name": "H. Bunke",
                        "slug": "H.-Bunke",
                        "structuredName": {
                            "firstName": "Horst",
                            "lastName": "Bunke",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Bunke"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8717387,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bc7b170fafcd44b4db939306c66a2799ae9b27b3",
            "isKey": false,
            "numCitedBy": 325,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a system for the offline recognition of large vocabulary unconstrained handwritten texts. The only assumption made about the data is that it is written in English. This allows the application of statistical language models in order to improve the performance of our system. Several experiments have been performed using both single and multiple writer data. Lexica of variable size (from 10,000 to 50,000 words) have been used. The use of language models is shown to improve the accuracy of the system (when the lexicon contains 50,000 words, the error rate is reduced by /spl sim/50 percent for single writer data and by /spl sim/25 percent for multiple writer data). Our approach is described in detail and compared with other methods presented in the literature to deal with the same problem. An experimental setup to correctly deal with unconstrained text recognition is proposed."
            },
            "slug": "Offline-recognition-of-unconstrained-handwritten-Vinciarelli-Bengio",
            "title": {
                "fragments": [],
                "text": "Offline recognition of unconstrained handwritten texts using HMMs and statistical language models"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The use of language models is shown to improve the accuracy of the system and the approach is described in detail and compared with other methods presented in the literature to deal with the same problem."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2787025"
                        ],
                        "name": "S. Senda",
                        "slug": "S.-Senda",
                        "structuredName": {
                            "firstName": "Shuji",
                            "lastName": "Senda",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Senda"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2831345"
                        ],
                        "name": "Keiji Yamada",
                        "slug": "Keiji-Yamada",
                        "structuredName": {
                            "firstName": "Keiji",
                            "lastName": "Yamada",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Keiji Yamada"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Ç"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 12
                            }
                        ],
                        "text": "The difficulties of character segmentation originate from the variability of character size and position, character touching and overlapping."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 9
                            }
                        ],
                        "text": "1 shows an example of a Chinese handwritten page."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 31694626,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "afc3706a52fbf799463324b1f2f579677b6056b1",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a maximum-likelihood approach to segmentation-based recognition of unconstrained handwriting text. The segmentation scores and recognition scores are transformed into posterior probabilities, and the likelihood function which is composed of both these probabilities and character n-gram probabilities is derived from the Bayesian theorem. The recognition result which maximizes the function can be obtained by Viterbi search. Experiments have shown that the proposed likelihood function is effective in the recognition of online Japanese text."
            },
            "slug": "A-maximum-likelihood-approach-to-segmentation-based-Senda-Yamada",
            "title": {
                "fragments": [],
                "text": "A maximum-likelihood approach to segmentation-based recognition of unconstrained handwriting text"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "A maximum-likelihood approach to segmentation-based recognition of unconstrained handwriting text is proposed, and the likelihood function which is composed of both segments scores and character n-gram probabilities is derived from the Bayesian theorem."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of Sixth International Conference on Document Analysis and Recognition"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145887653"
                        ],
                        "name": "M. Nakagawa",
                        "slug": "M.-Nakagawa",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Nakagawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Nakagawa"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 48,
                                "start": 44
                            }
                        ],
                        "text": "To balance the multiple contexts in path evaluation function, we optimize the combining weights on a data set of training text lines using a Maximum Character Accuracy (MCA) criterion."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 43064967,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "942f1cf9121d040da3a14df1b132397e23c915d3",
            "isKey": false,
            "numCitedBy": 60,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper proposes a precise candidate selection method for large character set recognition by confidence evaluation of distance-based classifiers. The proposed method is applicable to a wide variety of distance metrics and experiments on Euclidean distance and city block distance have achieved promising results. By confidence evaluation, the distribution of distances is analyzed to derive the probabilities of classes in two steps: output probability evaluation and input probability inference. Using the input probabilities as confidences, several selection rules have been tested and the rule that selects the classes with high confidence ratio to the first rank class produced best results. The experiments were implemented on the ETL9B database and the results show that the proposed method selects about one-fourth as many candidates with accuracy preserved compared to the conventional method that selects a fixed number of candidates."
            },
            "slug": "Precise-Candidate-Selection-for-Large-Character-Set-Liu-Nakagawa",
            "title": {
                "fragments": [],
                "text": "Precise Candidate Selection for Large Character Set Recognition by Confidence Evaluation"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The results show that the proposed method selects about one-fourth as many candidates with accuracy preserved compared to the conventional method that selects a fixed number of candidates."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2108266956"
                        ],
                        "name": "Mou-Yen Chen",
                        "slug": "Mou-Yen-Chen",
                        "structuredName": {
                            "firstName": "Mou-Yen",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mou-Yen Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34320269"
                        ],
                        "name": "A. Kundu",
                        "slug": "A.-Kundu",
                        "structuredName": {
                            "firstName": "Amlan",
                            "lastName": "Kundu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Kundu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696384"
                        ],
                        "name": "S. Srihari",
                        "slug": "S.-Srihari",
                        "structuredName": {
                            "firstName": "Sargur",
                            "lastName": "Srihari",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Srihari"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "The four probabilistic terms in (9) correspond to the character recognition model, unary and\nbinary class-dependent geometric model, and language\nmodel, respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 234,
                                "start": 230
                            }
                        ],
                        "text": "…Society\nsolved by segmentation-based approaches using character models [16], preferably by explicit segmentation, also called oversegmentation, which can take advantage of the character shape and overlapping and touching characteristics to better separate the characters at their boundaries."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 9393557,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "61578e86886e4e5ee5e7a9521064d387e74ee553",
            "isKey": false,
            "numCitedBy": 62,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "A complete system for the recognition of unconstrained handwritten words using a continuous density variable duration hidden Markov model (CDVDHMM) is described. A new segmentation algorithm based on mathematical morphology is used to translate the 2-D image into a 1-D sequence of sub-character symbols. This sequence of symbols is modeled by the CDVDHMM. Generally, there are two information sources associated with the written text. While the shape information of each character symbol is modeled as a mixture Gaussian distribution, the linguistic knowledge, i.e., constraint, is modeled as a Markov chain. In this context, the variable duration state is used to take care of the segmentation ambiguity among the consecutive characters. Some experimental results are described to demonstrate the success of the proposed scheme.<<ETX>>"
            },
            "slug": "Variable-duration-hidden-Markov-model-and-for-word-Chen-Kundu",
            "title": {
                "fragments": [],
                "text": "Variable duration hidden Markov model and morphological segmentation for handwritten word recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 79,
                "text": "A complete system for the recognition of unconstrained handwritten words using a continuous density variable duration hidden Markov model (CDVDHMM) is described and some experimental results are described to demonstrate the success of the proposed scheme."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "11615412"
                        ],
                        "name": "Solen Quiniou",
                        "slug": "Solen-Quiniou",
                        "structuredName": {
                            "firstName": "Solen",
                            "lastName": "Quiniou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Solen Quiniou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145541445"
                        ],
                        "name": "M. Cheriet",
                        "slug": "M.-Cheriet",
                        "structuredName": {
                            "firstName": "Mohamed",
                            "lastName": "Cheriet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Cheriet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750784"
                        ],
                        "name": "É. Anquetil",
                        "slug": "É.-Anquetil",
                        "structuredName": {
                            "firstName": "Éric",
                            "lastName": "Anquetil",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "É. Anquetil"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 9
                            }
                        ],
                        "text": "0162-8828/12/$31.00 2012 IEEE Published by the IEEE Computer Society\nsolved by segmentation-based approaches using character models [16], preferably by explicit segmentation, also called oversegmentation, which can take advantage of the character shape and overlapping and touching characteristics…"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 16434887,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "184ca5f426d1a76364aa039ecaaee1db9e56a862",
            "isKey": true,
            "numCitedBy": 5,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we investigate the use of linguistic information given by language models to deal with word recognition errors on handwritten sentences. We focus especially on errors due to out-of-vocabulary (OOV) words. First, word posterior probabilities are computed and used to detect error hypotheses on output sentences. An SVM classifier allows these errors to be categorized according to defined types. Then, a post-processing step is performed using a language model based on Part-of-Speech (POS) tags which is combined to the n-gram model previously used. Thus, error hypotheses can be further recognized and POS tags can be assigned to the OOV words. Experiments on on-line handwritten sentences show that the proposed approach allows a significant reduction of the word error rate."
            },
            "slug": "Handling-Out-of-Vocabulary-Words-and-Recognition-on-Quiniou-Cheriet",
            "title": {
                "fragments": [],
                "text": "Handling Out-of-Vocabulary Words and Recognition Errors Based on Word Linguistic Context for Handwritten Sentence Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "This paper investigates the use of linguistic information given by language models to deal with word recognition errors on handwritten sentences and proposes an approach that allows a significant reduction of the word error rate."
            },
            "venue": {
                "fragments": [],
                "text": "2009 10th International Conference on Document Analysis and Recognition"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2452389"
                        ],
                        "name": "E. McDermott",
                        "slug": "E.-McDermott",
                        "structuredName": {
                            "firstName": "Erik",
                            "lastName": "McDermott",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. McDermott"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1798550"
                        ],
                        "name": "Timothy J. Hazen",
                        "slug": "Timothy-J.-Hazen",
                        "structuredName": {
                            "firstName": "Timothy",
                            "lastName": "Hazen",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Timothy J. Hazen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9332945"
                        ],
                        "name": "Jonathan Le Roux",
                        "slug": "Jonathan-Le-Roux",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Le Roux",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jonathan Le Roux"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1726970"
                        ],
                        "name": "A. Nakamura",
                        "slug": "A.-Nakamura",
                        "structuredName": {
                            "firstName": "Atsushi",
                            "lastName": "Nakamura",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Nakamura"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1715709"
                        ],
                        "name": "S. Katagiri",
                        "slug": "S.-Katagiri",
                        "structuredName": {
                            "firstName": "Shigeru",
                            "lastName": "Katagiri",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Katagiri"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 90
                            }
                        ],
                        "text": "The existing methods either integrated incomplete contexts [9], [10], [18] or combined the contexts heuristically without optimizing the combining weights [12], [13], [19], [20]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1044834,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7bdb332ce9a601cdd1d0f12685eab6d8b8374250",
            "isKey": false,
            "numCitedBy": 623,
            "numCiting": 85,
            "paperAbstract": {
                "fragments": [],
                "text": "The minimum classification error (MCE) framework for discriminative training is a simple and general formalism for directly optimizing recognition accuracy in pattern recognition problems. The framework applies directly to the optimization of hidden Markov models (HMMs) used for speech recognition problems. However, few if any studies have reported results for the application of MCE training to large-vocabulary, continuous-speech recognition tasks. This article reports significant gains in recognition performance and model compactness as a result of discriminative training based on MCE training applied to HMMs, in the context of three challenging large-vocabulary (up to 100 k word) speech recognition tasks: the Corpus of Spontaneous Japanese lecture speech transcription task, a telephone-based name recognition task, and the MIT Jupiter telephone-based conversational weather information task. On these tasks, starting from maximum likelihood (ML) baselines, MCE training yielded relative reductions in word error ranging from 7% to 20%. Furthermore, this paper evaluates the use of different methods for optimizing the MCE criterion function, as well as the use of precomputed recognition lattices to speed up training. An overview of the MCE framework is given, with an emphasis on practical implementation issues"
            },
            "slug": "Discriminative-Training-for-Large-Vocabulary-Speech-McDermott-Hazen",
            "title": {
                "fragments": [],
                "text": "Discriminative Training for Large-Vocabulary Speech Recognition Using Minimum Classification Error"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "This article reports significant gains in recognition performance and model compactness as a result of discriminative training based on MCE training applied to HMMs, in the context of three challenging large-vocabulary speech recognition tasks."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Audio, Speech, and Language Processing"
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143604406"
                        ],
                        "name": "B. Juang",
                        "slug": "B.-Juang",
                        "structuredName": {
                            "firstName": "Biing-Hwang",
                            "lastName": "Juang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Juang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2061634414"
                        ],
                        "name": "Wu Hou",
                        "slug": "Wu-Hou",
                        "structuredName": {
                            "firstName": "Wu",
                            "lastName": "Hou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Wu Hou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9391905"
                        ],
                        "name": "Chin-Hui Lee",
                        "slug": "Chin-Hui-Lee",
                        "structuredName": {
                            "firstName": "Chin-Hui",
                            "lastName": "Lee",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chin-Hui Lee"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 50
                            }
                        ],
                        "text": "In integrated segmentation-and-recognition, the candidate segmentation-recognition paths are usually evaluated by combining the character recognition scores (classifier outputs), geometric context, and linguistic context [16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 11313392,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cdc3542552842d826a661f21e87917b976b4f7ee",
            "isKey": false,
            "numCitedBy": 729,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "A critical component in the pattern matching approach to speech recognition is the training algorithm, which aims at producing typical (reference) patterns or models for accurate pattern comparison. In this paper, we discuss the issue of speech recognizer training from a broad perspective with root in the classical Bayes decision theory. We differentiate the method of classifier design by way of distribution estimation and the discriminative method of minimizing classification error rate based on the fact that in many realistic applications, such as speech recognition, the real signal distribution form is rarely known precisely. We argue that traditional methods relying on distribution estimation are suboptimal when the assumed distribution form is not the true one, and that \"optimality\" in distribution estimation does not automatically translate into \"optimality\" in classifier design. We compare the two different methods in the context of hidden Markov modeling for speech recognition. We show the superiority of the minimum classification error (MCE) method over the distribution estimation method by providing the results of several key speech recognition experiments. In general, the MCE method provides a significant reduction of recognition error rate."
            },
            "slug": "Minimum-classification-error-rate-methods-for-Juang-Hou",
            "title": {
                "fragments": [],
                "text": "Minimum classification error rate methods for speech recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The issue of speech recognizer training from a broad perspective with root in the classical Bayes decision theory is discussed, and the superiority of the minimum classification error (MCE) method over the distribution estimation method is shown by providing the results of several key speech recognition experiments."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Speech Audio Process."
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2065980049"
                        ],
                        "name": "Markus Wüthrich",
                        "slug": "Markus-Wüthrich",
                        "structuredName": {
                            "firstName": "Markus",
                            "lastName": "Wüthrich",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Markus Wüthrich"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743758"
                        ],
                        "name": "M. Liwicki",
                        "slug": "M.-Liwicki",
                        "structuredName": {
                            "firstName": "Marcus",
                            "lastName": "Liwicki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Liwicki"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153745355"
                        ],
                        "name": "Andreas Fischer",
                        "slug": "Andreas-Fischer",
                        "structuredName": {
                            "firstName": "Andreas",
                            "lastName": "Fischer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Andreas Fischer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1693905"
                        ],
                        "name": "Emanuel Indermühle",
                        "slug": "Emanuel-Indermühle",
                        "structuredName": {
                            "firstName": "Emanuel",
                            "lastName": "Indermühle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Emanuel Indermühle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1720945"
                        ],
                        "name": "H. Bunke",
                        "slug": "H.-Bunke",
                        "structuredName": {
                            "firstName": "Horst",
                            "lastName": "Bunke",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Bunke"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2842036"
                        ],
                        "name": "G. Viehhauser",
                        "slug": "G.-Viehhauser",
                        "structuredName": {
                            "firstName": "Gabriel",
                            "lastName": "Viehhauser",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Viehhauser"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49561025"
                        ],
                        "name": "Michael Stolz",
                        "slug": "Michael-Stolz",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Stolz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael Stolz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 146,
                                "start": 142
                            }
                        ],
                        "text": "For information on obtaining reprints of this article, please send e-mail to: tpami@computer.org, and reference IEEECS Log Number TPAMI-2011-07-0476."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 104,
                                "start": 100
                            }
                        ],
                        "text": "Substituting pðCÞ ¼ Qm i¼1 pðcijhiÞ (see Section 5.3) in (8) gives\nP ðCjXsÞ ¼ Ym i¼1 pðcijxiÞp cijguci p ci 1cijgbci pðcijhiÞ P ; ð9Þ\nwhere P ¼ p1p2p3."
                    },
                    "intents": []
                }
            ],
            "corpusId": 3031750,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "32046dabd05e4b3daf48f6b3d768690770a85084",
            "isKey": true,
            "numCitedBy": 35,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "Building recognition systems for historical documents is a difficult task. Especially, when it comes to medieval scripts. The complexity is mainly affected by the poor quality and the small quantity of the data available. In this paper we apply an HMM based recognition system to medieval manuscripts from the 13th century written in Middle High German. The recognition system, which was originally developed for modern scripts, has been adapted to medieval scripts. Beside the data processing, one of the major challenges is to create a suitable language model. Because of the lack of appropriate independent text corpora for medieval languages, the language model has to be created on the base of a rather small number of manuscripts only. Due to the small size of the corpus, optimizing the language model parameters can quickly lead to the problem of overfitting. In this paper we describe a strategy to integrate all available information into the language model and to optimize the language model parameters without suffering from this problem."
            },
            "slug": "Language-Model-Integration-for-the-Recognition-of-Wüthrich-Liwicki",
            "title": {
                "fragments": [],
                "text": "Language Model Integration for the Recognition of Handwritten Medieval Documents"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This paper applies an HMM based recognition system to medieval manuscripts from the 13th century written in Middle High German and describes a strategy to integrate all available information into the language model and to optimize thelanguage model parameters without suffering from the problem of overfitting."
            },
            "venue": {
                "fragments": [],
                "text": "2009 10th International Conference on Document Analysis and Recognition"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 65
                            }
                        ],
                        "text": "Two later works on the same data set, using character classifiers and statistical language models (SLM) based on oversegmentation, reported a character-level correct rate of 78.44 [10] and 73.97 percent [11], respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 3097277,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9cda0d40d160de51b2f57af667ba2667dce4ba65",
            "isKey": false,
            "numCitedBy": 123,
            "numCiting": 55,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Classifier-combination-based-on-confidence-Liu",
            "title": {
                "fragments": [],
                "text": "Classifier combination based on confidence transformation"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1986096"
                        ],
                        "name": "Kenichiro Kigo",
                        "slug": "Kenichiro-Kigo",
                        "structuredName": {
                            "firstName": "Kenichiro",
                            "lastName": "Kigo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kenichiro Kigo"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 31,
                                "start": 27
                            }
                        ],
                        "text": "We evaluated the recognition performance on a large database CASIA-HWDB [21] of unconstrained Chinese handwritten characters and texts, and demonstrated superior performance by the proposed methods."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 40298293,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cb3bdd2a76ed706f094a42a554e22108f4d52042",
            "isKey": false,
            "numCitedBy": 4,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "The author proposes uses of linguistic and statistical knowledge in preprocessing in character recognition to achieve higher speed processing. In this approach, character prediction substitutes for rough classification which occupies a large part of the recognition time. Three character prediction methods are proposed and prediction capability is verified. This method is implemented in a recognition system to evaluate its performance. Accuracy is compared with the result of the postprocessing error correction method. As a result, it is observed that the predictive recognition method has a considerable speed advantage. For almost the same recognition accuracy, this method is 20% faster.<<ETX>>"
            },
            "slug": "Improving-speed-of-Japanese-OCR-through-linguistic-Kigo",
            "title": {
                "fragments": [],
                "text": "Improving speed of Japanese OCR through linguistic preprocessing"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "The author proposes uses of linguistic and statistical knowledge in preprocessing in character recognition to achieve higher speed processing and it is observed that the predictive recognition method has a considerable speed advantage."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34878566"
                        ],
                        "name": "H. Fujisawa",
                        "slug": "H.-Fujisawa",
                        "structuredName": {
                            "firstName": "Hiromichi",
                            "lastName": "Fujisawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Fujisawa"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 184,
                                "start": 181
                            }
                        ],
                        "text": "general integrated segmentation-and-recognition framework with character oversegmentation, we investigate three important issues: candidate path evaluation, path search, and parameter estimation."
                    },
                    "intents": []
                }
            ],
            "corpusId": 27267406,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ece520d20363a12a41269b950789a5c49b39bc9f",
            "isKey": false,
            "numCitedBy": 158,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Forty-years-of-research-in-character-and-document-Fujisawa",
            "title": {
                "fragments": [],
                "text": "Forty years of research in character and document recognition - an industrial perspective"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1410457658"
                        ],
                        "name": "M. Cheriet",
                        "slug": "M.-Cheriet",
                        "structuredName": {
                            "firstName": "Mohammed",
                            "lastName": "Cheriet",
                            "middleNames": [
                                "El-Amine"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Cheriet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3347976"
                        ],
                        "name": "N. Kharma",
                        "slug": "N.-Kharma",
                        "structuredName": {
                            "firstName": "Nawwaf",
                            "lastName": "Kharma",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Kharma"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49046935"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713795"
                        ],
                        "name": "C. Suen",
                        "slug": "C.-Suen",
                        "structuredName": {
                            "firstName": "Ching",
                            "lastName": "Suen",
                            "middleNames": [
                                "Yee"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Suen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Ç"
                    },
                    "intents": []
                }
            ],
            "corpusId": 28172707,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1e431454e2bc9bcdcc2fb74695e98b2901b1e479",
            "isKey": false,
            "numCitedBy": 334,
            "numCiting": 153,
            "paperAbstract": {
                "fragments": [],
                "text": "Figures. List of Tables. Preface. Acknowledgments. Acronyms. 1. Introduction: Character Recognition, Evolution and Development. 1.1 Generation and Recognition of Characters. 1.2 History of OCR. 1.3 Development of New Techniques. 1.4 Recent Trends and Movements. 1.5 Organization of the Remaining Chapters. References. 2. Tools for Image Pre-Processing. 2.1 Generic Form Processing System. 2.2 A Stroke Model for Complex Background Elimination. 2.2.1 Global Gray Level Thresholding. 2.2.2 Local Gray Level Thresholding. 2.2.3 Local Feature Thresholding-Stroke Based Model. 2.2.4 Choosing the Most Efficient Character Extraction Method. 2.2.5 Cleaning up Form Items Using Stroke Based Model. 2.3 A Scale-Space Approach for Visual Data Extraction. 2.3.1 Image Regularization. 2.3.2 Data Extraction. 2.3.3 Concluding Remarks. 2.4 Data Pre-Processing. 2.4.1 Smoothing and Noise Removal. 2.4.2 Skew Detection and Correction. 2.4.3 Slant Correction. 2.4.4 Character Normalization. 2.4.5 Contour Tracing/Analysis. 2.4.6 Thinning. 2.5 Chapter Summary. References 72. 3. Feature Extraction, Selection and Creation. 3.1 Feature Extraction. 3.1.1 Moments. 3.1.2 Histogram. 3.1.3 Direction Features. 3.1.4 Image Registration. 3.1.5 Hough Transform. 3.1.6 Line-Based Representation. 3.1.7 Fourier Descriptors. 3.1.8 Shape Approximation. 3.1.9 Topological Features. 3.1.10 Linear Transforms. 3.1.11 Kernels. 3.2 Feature Selection for Pattern Classification. 3.2.1 Review of Feature Selection Methods. 3.3 Feature Creation for Pattern Classification. 3.3.1 Categories of Feature Creation. 3.3.2 Review of Feature Creation Methods. 3.3.3 Future Trends. 3.4 Chapter Summary. References. 4. Pattern Classification Methods. 4.1 Overview of Classification Methods. 4.2 Statistical Methods. 4.2.1 Bayes Decision Theory. 4.2.2 Parametric Methods. 4.2.3 Non-ParametricMethods. 4.3 Artificial Neural Networks. 4.3.1 Single-Layer Neural Network. 4.3.2 Multilayer Perceptron. 4.3.3 Radial Basis Function Network. 4.3.4 Polynomial Network. 4.3.5 Unsupervised Learning. 4.3.6 Learning Vector Quantization. 4.4 Support Vector Machines. 4.4.1 Maximal Margin Classifier. 4.4.2 Soft Margin and Kernels. 4.4.3 Implementation Issues. 4.5 Structural Pattern Recognition. 4.5.1 Attributed String Matching. 4.5.2 Attributed Graph Matching. 4.6 Combining Multiple Classifiers. 4.6.1 Problem Formulation. 4.6.2 Combining Discrete Outputs. 4.6.3 Combining Continuous Outputs. 4.6.4 Dynamic Classifier Selection. 4.6.5 Ensemble Generation. 4.7 A Concrete Example. 4.8 Chapter Summary. References. 5. Word and String Recognition. 5.1 Introduction. 5.2 Character Segmentation. 5.2.1 Overview of Dissection Techniques. 5.2.2 Segmentation of Handwritten Digits. 5.3 Classification-Based String Recognition. 5.3.1 String Classification Model. 5.3.2 Classifier Design for String Recognition. 5.3.3 Search Strategies. 5.3.4 Strategies for Large Vocabulary. 5.4 HMM-Based Recognition. 5.4.1 Introduction to HMMs. 5.4.2 Theory and Implementation. 5.4.3 Application of HMMs to Text Recognition. 5.4.4 Implementation Issues. 5.4.5 Techniques for Improving HMMs' Performance. 5.4.6 Summary to HMM-Based Recognition. 5.5 Holistic Methods For Handwritten Word Recognition. 5.5.1 Introduction to Holistic Methods. 5.5.2 Overview of Holistic Methods. 5.5.3 Summary to Holistic Methods. 5.6 Chapter Summary. References. 6. Case Studies. 6.1 Automatically Generating Pattern Recognizers with Evolutionary Computation. 6.1.1 Motivation. 6.1.2 Introduction. 6.1.3 Hunters and Prey. 6.1.4 Genetic Algorithm. 6.1.5 Experiments. 6.1.6 Analysis. 6.1.7 Future Directions. 6.2 Offline Handwritten Chinese Character Recognition. 6.2.1 Related Works. 6.2.2 System Overview. 6.2.3 Character Normalization. 6.2.4 Direction Feature Extraction. 6.2.5 Classification Methods. 6.2.6 Experiments. 6.2.7 Concluding Remarks. 6.3 Segmentation and Recognition of Handwritten Dates on Canadian Bank Cheques. 6.3.1 Introduction. 6.3.2 System Architecture. 6.3.3 Date Image Segmentation. 6.3.4 Date Image Recognition. 6.3.5 Experimental Results. 6.3.6 Concluding Remarks. References."
            },
            "slug": "Character-Recognition-Systems:-A-Guide-for-Students-Cheriet-Kharma",
            "title": {
                "fragments": [],
                "text": "Character Recognition Systems: A Guide for Students and Practitioners"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "This chapter discusses the development of Character Recognition, Evolution and Development, and some of the techniques used to achieve this goal, including Bayes Decision Theory, as well as some new methods based onributed graph matching."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689269"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34878566"
                        ],
                        "name": "H. Fujisawa",
                        "slug": "H.-Fujisawa",
                        "structuredName": {
                            "firstName": "Hiromichi",
                            "lastName": "Fujisawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Fujisawa"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11393975,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1b1d097926a976114afbe2026cc13f1bcbec72e1",
            "isKey": false,
            "numCitedBy": 55,
            "numCiting": 84,
            "paperAbstract": {
                "fragments": [],
                "text": "Pattern classification methods based on learning-from-examples have been widely applied to character recognition from the 1990s and have brought forth significant improvements of recognition accuracies. This kind of methods include statistical methods, artificial neural networks, support vector machines, multiple classifier combination, etc. In this chapter, we briefly review the learning-based classification methods that have been successfully applied to character recognition, with a special section devoted to the classification of large category set. We then discuss the characteristics of these methods, and discuss the remaining problems in character recognition that can be potentially solved by machine learning methods."
            },
            "slug": "Classification-and-Learning-Methods-for-Character-Liu-Fujisawa",
            "title": {
                "fragments": [],
                "text": "Classification and Learning Methods for Character Recognition: Advances and Remaining Problems"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "This chapter briefly review the learning-based classification methods that have been successfully applied to character recognition, with a special section devoted to the classification of large category set."
            },
            "venue": {
                "fragments": [],
                "text": "Machine Learning in Document Analysis and Recognition"
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144137069"
                        ],
                        "name": "Xiaodong He",
                        "slug": "Xiaodong-He",
                        "structuredName": {
                            "firstName": "Xiaodong",
                            "lastName": "He",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Xiaodong He"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144718788"
                        ],
                        "name": "L. Deng",
                        "slug": "L.-Deng",
                        "structuredName": {
                            "firstName": "Li",
                            "lastName": "Deng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Deng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145320076"
                        ],
                        "name": "W. Chou",
                        "slug": "W.-Chou",
                        "structuredName": {
                            "firstName": "Wu",
                            "lastName": "Chou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Chou"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 96
                            }
                        ],
                        "text": "The existing methods either integrated incomplete contexts [9], [10], [18] or combined the contexts heuristically without optimizing the combining weights [12], [13], [19], [20]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 17976965,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d63cdc1d1f023c63f8aa3b64cd5e853670680c3e",
            "isKey": false,
            "numCitedBy": 191,
            "numCiting": 75,
            "paperAbstract": {
                "fragments": [],
                "text": "In this article, we studied the objective functions of MMI, MCE, and MPE/MWE for discriminative learning in sequential pattern recognition. We presented an approach that unifies the objective functions of MMI, MCE, and MPE/MWE in a common rational-function form of (25). The exact structure of the rational-function form for each discriminative criterion was derived and studied. While the rational-function form of MMI has been known in the past, we provided the theoretical proof that the similar rational-function form exists for the objective functions of MCE and MPE/MWE. Moreover, we showed that the rational function forms for objective functions of MMI, MCE, and MPE/MWE differ in the constant weighting factors CDT (s1 . . . sR) and these weighting factors depend only on the labeled sequence s1 . . . sR, and are independent of the parameter set - to be optimized. The derived rational-function form for MMI, MCE, and MPE/MWE allows the GT/EBW-based parameter optimization framework to be applied directly in discriminative learning. In the past, lack of the appropriate rational-function form was a difficulty for MCE and MPE/MWE, because without this form, the GT/EBW-based parameter optimization framework cannot be directly applied. Based on the unified rational-function form, in a tutorial style, we derived the GT/EBW-based parameter optimization formulas for both discrete HMMs and CDHMMs in discriminative learning using MMI, MCE, and MPE/MWE criteria. The unifying review provided in this article has been based upon a large number of earlier contributions that have been cited and discussed throughout the article. Here we provide a brief summary of such background work. Extension to large-scale speech recognition tasks was accomplished in the work of [59] and [60]. The dissertation of [47] further improved the MMI criterion to that of MPE/MWE. In a parallel vein, the work of [20] provided an alternative approach to that of [41], with an attempt to more rigorously provide a CDHMM model re-estimation formula that gives positive growth of the MMI objective function. A crucial error of this attempt was corrected in [2] for establishing an existence proof of such positive growth. The main goal of this article is to provide an underlying foundation for MMI, MCE, and MPE/MWE at the objective function level to facilitate the development of new parameter optimization techniques and to incorporate other pattern recognition concepts, e.g., discriminative margins [66], into the current discriminative learning paradigm."
            },
            "slug": "Discriminative-learning-in-sequential-pattern-He-Deng",
            "title": {
                "fragments": [],
                "text": "Discriminative learning in sequential pattern recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The main goal of this article is to provide an underlying foundation for MMI, MCE, and MPE/MWE at the objective function level to facilitate the development of new parameter optimization techniques and to incorporate other pattern recognition concepts, e.g., discriminative margins [66], into the current discrim inative learning paradigm."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Signal Processing Magazine"
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145809751"
                        ],
                        "name": "F. Kimura",
                        "slug": "F.-Kimura",
                        "structuredName": {
                            "firstName": "Fumitaka",
                            "lastName": "Kimura",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Kimura"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40248196"
                        ],
                        "name": "Kenji Takashina",
                        "slug": "Kenji-Takashina",
                        "structuredName": {
                            "firstName": "Kenji",
                            "lastName": "Takashina",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kenji Takashina"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1740614"
                        ],
                        "name": "S. Tsuruoka",
                        "slug": "S.-Tsuruoka",
                        "structuredName": {
                            "firstName": "Shinji",
                            "lastName": "Tsuruoka",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Tsuruoka"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2224415"
                        ],
                        "name": "Y. Miyake",
                        "slug": "Y.-Miyake",
                        "structuredName": {
                            "firstName": "Yasuji",
                            "lastName": "Miyake",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Miyake"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 284,
                                "start": 280
                            }
                        ],
                        "text": "…recognition of text lines or phrases in rather constrained application domains, such as legal amount recognition in bank checks [4] and address phrase recognition for postal mails [5], [6], [7], [8], where the number of character classes is very small or there are very strong lexical constraints."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16301822,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d5fd36264e567efcdccfddb8e63ae26fe3d480ab",
            "isKey": false,
            "numCitedBy": 519,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Issues in the quadratic discriminant functions (QDF) are discussed and two types of modified quadratic disriminant functions (MQDF1, MQDF2) which are less sensitive to the estimation error of the covariance matrices are proposed. The MQDF1 is a function which employs a kind of a (pseudo) Bayesian estimate of the covariance matrix instead of the maximum likelihood estimate ordinarily used in the QDF. The MQDF2 is a variation of the MQDF1 to save the required computation time and storage. Two discriminant functions were applied to Chinese character recognition to evaluate their effectiveness, and remarkable improvement was observed in their performance."
            },
            "slug": "Modified-Quadratic-Discriminant-Functions-and-the-Kimura-Takashina",
            "title": {
                "fragments": [],
                "text": "Modified Quadratic Discriminant Functions and the Application to Chinese Character Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "Two types of modified quadratic disriminant functions (MQDF1, MQDF2) which are less sensitive to the estimation error of the covariance matrices are proposed."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145322333"
                        ],
                        "name": "H. Ney",
                        "slug": "H.-Ney",
                        "structuredName": {
                            "firstName": "Hermann",
                            "lastName": "Ney",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Ney"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69369871"
                        ],
                        "name": "S. Ortmanns",
                        "slug": "S.-Ortmanns",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Ortmanns",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ortmanns"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 24
                            }
                        ],
                        "text": "The previous works have addressed handwritten text (character string) recognition from different viewpoints and have contributed various techniques."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 12390741,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "105d23cada689b58b83dc90bbf95c2def478b77d",
            "isKey": false,
            "numCitedBy": 49,
            "numCiting": 117,
            "paperAbstract": {
                "fragments": [],
                "text": "Initially introduced in the late 1960s and early 1970s, dynamic programming algorithms have become increasingly popular in automatic speech recognition. There are two reasons why this has occurred. First, the dynamic programming strategy can be combined with a very efficient and practical pruning strategy so that very large search spaces can be handled. Second, the dynamic programming strategy has turned out to be extremely flexible in adapting to new requirements. Examples of such requirements are the lexical tree organization of the pronunciation lexicon and the generation of a word graph instead of the single best sentence. We attempt to review the use of dynamic programming search strategies for large-vocabulary continuous speech recognition (LVCSR). The following methods are described in detail: searching using a lexical tree, language-model look-ahead and word-graph generation."
            },
            "slug": "Progress-in-dynamic-programming-search-for-LVCSR-Ney-Ortmanns",
            "title": {
                "fragments": [],
                "text": "Progress in dynamic programming search for LVCSR"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "This work attempts to review the use of dynamic programming search strategies for large-vocabulary continuous speech recognition (LVCSR) by searching using a lexical tree, language-model look-ahead and word-graph generation."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48873196"
                        ],
                        "name": "Sven C. Martin",
                        "slug": "Sven-C.-Martin",
                        "structuredName": {
                            "firstName": "Sven",
                            "lastName": "Martin",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sven C. Martin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33526309"
                        ],
                        "name": "Jörg Liermann",
                        "slug": "Jörg-Liermann",
                        "structuredName": {
                            "firstName": "Jörg",
                            "lastName": "Liermann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jörg Liermann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145322333"
                        ],
                        "name": "H. Ney",
                        "slug": "H.-Ney",
                        "structuredName": {
                            "firstName": "Hermann",
                            "lastName": "Ney",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Ney"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3106685,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2e6dd008f2837dea054cd968ae6a50325809833d",
            "isKey": false,
            "numCitedBy": 228,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Algorithms-for-bigram-and-trigram-word-clustering-Martin-Liermann",
            "title": {
                "fragments": [],
                "text": "Algorithms for bigram and trigram word clustering"
            },
            "venue": {
                "fragments": [],
                "text": "Speech Commun."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145582202"
                        ],
                        "name": "S. Tulyakov",
                        "slug": "S.-Tulyakov",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Tulyakov",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Tulyakov"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723877"
                        ],
                        "name": "V. Govindaraju",
                        "slug": "V.-Govindaraju",
                        "structuredName": {
                            "firstName": "Venu",
                            "lastName": "Govindaraju",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Govindaraju"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 153,
                                "start": 149
                            }
                        ],
                        "text": "The authors are with the National Laboratory of Pattern Recognition, Institute of Automation, Chinese Academy of Sciences, 95 Zhongguancun East Road, Beijing 100190, P.R. China."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "The four probabilistic terms in (9) correspond to the character recognition model, unary and\nbinary class-dependent geometric model, and language\nmodel, respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14049701,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ebef9531fae7f5fb920df0bae10d8ad85b84e3e5",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe the construction of a model for off-line word recognizers based on over-segmentation of the input image and recognition of segment combinations as characters in a given lexicon word. One such recognizer, the Word Model Recognizer (WMR), is used extensively. Based on the proposed model it was possible to improve the performance of WMR."
            },
            "slug": "Probabilistic-model-for-segmentation-based-word-Tulyakov-Govindaraju",
            "title": {
                "fragments": [],
                "text": "Probabilistic model for segmentation based word recognition with lexicon"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "The construction of a model for off-line word recognizers based on over-segmentation of the input image and recognition of segment combinations as characters in a given lexicon word is described."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of Sixth International Conference on Document Analysis and Recognition"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1762744"
                        ],
                        "name": "A. Stolcke",
                        "slug": "A.-Stolcke",
                        "structuredName": {
                            "firstName": "Andreas",
                            "lastName": "Stolcke",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Stolcke"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1988103,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "399da68d3b97218b6c80262df7963baa89dcc71b",
            "isKey": false,
            "numCitedBy": 4996,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "SRILM is a collection of C++ libraries, executable programs, and helper scripts designed to allow both production of and experimentation with statistical language models for speech recognition and other applications. SRILM is freely available for noncommercial purposes. The toolkit supports creation and evaluation of a variety of language model types based on N-gram statistics, as well as several related tasks, such as statistical tagging and manipulation of N-best lists and word lattices. This paper summarizes the functionality of the toolkit and discusses its design and implementation, highlighting ease of rapid prototyping, reusability, and combinability of tools."
            },
            "slug": "SRILM-an-extensible-language-modeling-toolkit-Stolcke",
            "title": {
                "fragments": [],
                "text": "SRILM - an extensible language modeling toolkit"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "The functionality of the SRILM toolkit is summarized and its design and implementation is discussed, highlighting ease of rapid prototyping, reusability, and combinability of tools."
            },
            "venue": {
                "fragments": [],
                "text": "INTERSPEECH"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144822067"
                        ],
                        "name": "J. Barnett",
                        "slug": "J.-Barnett",
                        "structuredName": {
                            "firstName": "Jeffrey",
                            "lastName": "Barnett",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Barnett"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 141,
                                "start": 137
                            }
                        ],
                        "text": "…are the sigmoidal function (15) and the soft-max function (16):\nPsgð!jjxÞ ¼ exp½ djðxÞ þ\n1þ exp½ djðxÞ þ ; j ¼ 1; . . . ;M; ð15Þ\nPsfð!jjxÞ ¼ exp½ djðxÞ PM i¼1 exp½ diðxÞ ; j ¼ 1; . . . ;M: ð16Þ\nIn the above,M is the total number of defined classes, djðxÞ is the dissimilarity score of…"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 188,
                                "start": 182
                            }
                        ],
                        "text": "Two commonly used functions for probabilistic confidence transformation are the sigmoidal function (15) and the soft-max function (16):\nPsgð!jjxÞ ¼ exp½ djðxÞ þ\n1þ exp½ djðxÞ þ ; j ¼ 1; . . . ;M; ð15Þ\nPsfð!jjxÞ ¼ exp½ djðxÞ PM i¼1 exp½ diðxÞ ; j ¼ 1; . . . ;M: ð16Þ\nIn the above,M is the total number of defined classes, djðxÞ is the dissimilarity score of class !j output by the classifier, and are the confidence parameters."
                    },
                    "intents": []
                }
            ],
            "corpusId": 5393721,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "fdb526ad276f6393b7e28fcb85f3571d55495700",
            "isKey": false,
            "numCitedBy": 442,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "Many knowledge-based expert systems employ numerical schemes to represent evidence, rate competing hypoth eses, and guide search through the domains problem space. This paper has two objectives: first, to introduce one such scheme developed by Arthur Dempster and Glen Shafer, to a wider audience; second, to present results that can reduce the compu tationtime complexity from exponential to linear allowing this scheme to be implemented in many more systems. In order to enjoy this reduction, some assumptions about the structure of the type of evidence represented and combined must be made The assumption made here is that each piece of the evidence either confirms or denies a single proposition rather than a disjunction For any domain in which the assumption is justified the savings are available."
            },
            "slug": "Computational-Methods-for-a-Mathematical-Theory-of-Barnett",
            "title": {
                "fragments": [],
                "text": "Computational Methods for a Mathematical Theory of Evidence"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This paper has two objectives: first, to introduce one such scheme developed by Arthur Dempster and Glen Shafer, to a wider audience, and to present results that can reduce the complexity of this scheme from exponential to linear."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145903504"
                        ],
                        "name": "R. Rosenfeld",
                        "slug": "R.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Rosenfeld"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 145,
                                "start": 141
                            }
                        ],
                        "text": "Online handwriting recognition has the advantage over offline recognition in that the sequences of strokes are available for better segmenting and discriminating characters."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 10959945,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c6586e7c73cc1c9e9a251947425c54c5051be626",
            "isKey": false,
            "numCitedBy": 732,
            "numCiting": 205,
            "paperAbstract": {
                "fragments": [],
                "text": "Statistical language models estimate the distribution of various natural language phenomena for the purpose of speech recognition and other language technologies. Since the first significant model was proposed in 1980, many attempts have been made to improve the state of the art. We review them, point to a few promising directions, and argue for a Bayesian approach to integration of linguistic theories with data."
            },
            "slug": "Two-decades-of-statistical-language-modeling:-where-Rosenfeld",
            "title": {
                "fragments": [],
                "text": "Two decades of statistical language modeling: where do we go from here?"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A Bayesian approach to integration of linguistic theories with data is argued for inStatistical language models estimate the distribution of various natural language phenomena for the purpose of speech recognition and other language technologies."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144212646"
                        ],
                        "name": "Cheng-Lin Liu",
                        "slug": "Cheng-Lin-Liu",
                        "structuredName": {
                            "firstName": "Cheng-Lin",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cheng-Lin Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34878566"
                        ],
                        "name": "H. Fujisawa",
                        "slug": "H.-Fujisawa",
                        "structuredName": {
                            "firstName": "Hiromichi",
                            "lastName": "Fujisawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Fujisawa"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 152,
                                "start": 148
                            }
                        ],
                        "text": "…recognition, most works aimed at the recognition of text lines or phrases in rather constrained application domains, such as legal amount recognition in bank checks [4] and address phrase recognition for postal mails [5], [6], [7], [8], where the number of character classes is very small or…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 64805944,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8e7f5d78e70e7306c437ded05771233fb537db7e",
            "isKey": false,
            "numCitedBy": 5,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Classification-and-learning-in-character-Advances-Liu-Fujisawa",
            "title": {
                "fragments": [],
                "text": "Classification and learning in character recognition: Advances and remaining problems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2008
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 28,
            "methodology": 21,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 57,
        "totalPages": 6
    },
    "page_url": "https://www.semanticscholar.org/paper/Handwritten-Chinese-Text-Recognition-by-Integrating-Wang-Yin/134820d1731bacdd19876d0eb04f27765229ca55?sort=total-citations"
}