{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145730992"
                        ],
                        "name": "V. Torre",
                        "slug": "V.-Torre",
                        "structuredName": {
                            "firstName": "Vincent",
                            "lastName": "Torre",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Torre"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1065794,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a8059c598e4f9643eb040685af0d6e7055391048",
            "isKey": false,
            "numCitedBy": 1214,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "Edge detection is the process that attempts to characterize the intensity changes in the image in terms of the physical processes that have originated them. A critical, intermediate goal of edge detection is the detection and characterization of significant intensity changes. This paper discusses this part of the edge detection problem. To characterize the types of intensity changes derivatives of different types, and possibly different scales, are needed. Thus, we consider this part of edge detection as a problem in numerical differentiation. We show that numerical differentiation of images is an ill-posed problem in the sense of Hadamard. Differentiation needs to be regularized by a regularizing filtering operation before differentiation. This shows that this part of edge detection consists of two steps, a filtering step and a differentiation step. Following this perspective, the paper discusses in detail the following theoretical aspects of edge detection. 1) The properties of different types of filters-with minimal uncertainty, with a bandpass spectrum, and with limited support-are derived. Minimal uncertainty filters optimize a tradeoff between computational efficiency and regularizing properties. 2) Relationships among several 2-D differential operators are established. In particular, we characterize the relation between the Laplacian and the second directional derivative along the gradient. Zero crossings of the Laplacian are not the only features computed in early vision. 3) Geometrical and topological properties of the zero crossings of differential operators are studied in terms of transversality and Morse theory."
            },
            "slug": "On-Edge-Detection-Torre-Poggio",
            "title": {
                "fragments": [],
                "text": "On Edge Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that numerical differentiation of images is an ill-posed problem in the sense of Hadamard, and that this part of edge detection consists of two steps, a filtering step and a differentiation step."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729041"
                        ],
                        "name": "J. Canny",
                        "slug": "J.-Canny",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Canny",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Canny"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 41,
                                "start": 38
                            }
                        ],
                        "text": "This is described in detail elsewhere [4], but for the present we will compare the theoretical performance of a first derivative of a Gaussian filter to the optimal operator."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 102,
                                "start": 99
                            }
                        ],
                        "text": "Since these integrals are very long and uninteresting, they are not given here but may be found in [4]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 119706616,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9cbd5a66c1198d5a14f13e03483b69321024444b",
            "isKey": false,
            "numCitedBy": 1030,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The problem of detecting intensity changes in images is canonical in vision. Edge detection operators are typically designed to optimally estimate first or second derivative over some (usually small) support. Other criteria such as output signal to noise ratio or bandwidth have also been been argued for. This thesis is an attempt to formulate a set of edge detection criteria that capture as directly as possible the desirable properties of an edge operator. Variational techniques are used to find a solution over the space of all linear shift invariant operators. The first criterion is that the detector have low probability of error i.e. failing to mark edges or falsely marking non-edges. The second is that the marked points should b The third criterion is that there should be low probability of more than one response to a single edge. The technique is used to find optimal operators for step edges and for extended impulse profiles (ridges or valleys in two dimensions). The extension of the one dimensional operators to two dimensions is then discussed. The result is a set of operators of varying width, length and orientation. The problem of combining these outputs into a single description is discussed, and a set of heuristics for the integration are given. (Author)"
            },
            "slug": "Finding-Edges-and-Lines-in-Images-Canny",
            "title": {
                "fragments": [],
                "text": "Finding Edges and Lines in Images"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This thesis is an attempt to formulate a set of edge detection criteria that capture as directly as possible the desirable properties of an edge operator."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2753465"
                        ],
                        "name": "H. Voorhees",
                        "slug": "H.-Voorhees",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Voorhees",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Voorhees"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6006893,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "6577a2344e4a0ea5992787352d03bf2478773239",
            "isKey": false,
            "numCitedBy": 180,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-regularized-solution-to-edge-detection-Poggio-Voorhees",
            "title": {
                "fragments": [],
                "text": "A regularized solution to edge detection"
            },
            "venue": {
                "fragments": [],
                "text": "J. Complex."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 77,
                                "start": 73
                            }
                        ],
                        "text": "This is similar to the selection criterion proposed by Marr and Hildreth [18] for choosing between different Laplacian of Gaussian channels."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 257,
                                "start": 240
                            }
                        ],
                        "text": "In fact, a one-dimensional Marr-Hildreth edge detector is almost identical with the operator we have derived because maxima in the output of a first derivative operator will correspond to zero-crossings in the Laplacian operator as used by Marr and Hildreth."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 211,
                                "start": 194
                            }
                        ],
                        "text": "The effect of the window function becomes very marked for large operator sizes and it is probably the biggest single reason why operators with large support were not practical until the work of Marr and Hildreth on the Laplacian of Gaussian."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 152,
                                "start": 148
                            }
                        ],
                        "text": "Directional operators very much like the ones we have derived were suggested by Marr [17], but were discarded in favor of the Laplacian of Gaussian [18]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 99
                            }
                        ],
                        "text": "There are also strong links with the Laplacian of Gaussian operator suggested by Marr and Hildreth [18]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": true,
            "numCitedBy": 7030,
            "numCiting": 61,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2071159872"
                        ],
                        "name": "R. J. Beattie",
                        "slug": "R.-J.-Beattie",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Beattie",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. J. Beattie"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 11,
                                "start": 8
                            }
                        ],
                        "text": "Beattie [1] describes an edge-based labeling scheme for low-level image understanding."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 13488230,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "46279543a3e21be3180cadd277ff25ff863877d0",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "This thesis describes the design and implementation of an edge detection system for use in semantically-based early visual process¬ ing. An overall vision system architecture is first selected, based on the need to clearly specify the performance of each module. The role of early processing within this system is then discussed. To specify the edge detection module, both its input and the required output are examined in detail. On the input side, the scene layout and scene-to-image transformation are__ investigated in both signal processing and information processing terms. On the output side, a particular example of constraint analysis (determining if an image edge could be the result of a reflectance boundary in the scene] is formally analysed in photometric terms. From these considerations, a set of goals of edge detection for constraint analysis are listed. Since image edges occur over a wide range of scales, the result¬ ing structure of the edge detector is multi-level, i.e. it attempts to find edges of a single scale separately before integrating all of the image edges into a single representation. This is achieved by applying the same \"single-level system\" to several differentresolution versions of the image, before attempting to construct the final edge representation. The single-level system finds and tracks step-like edges in its input, and also labels areas of extended intensity gradient and image texture. To avoid making assumptions about the nature of the under¬ lying intensity changes and to ensure that edges are localised accu¬ rately, first differencing followed by thresholding is the initial processing step. Thresholding in the presence of noise is modelled by a communication channel, and the best threshold chosen to be that which maximises the information transmitted over the channel. The edge tracker design is based on an analysis of how step-like edges digitise. Image areas of extended gradient and texture are located using a region-finding technique, and identified by examining the smoothness of intensity variations within each region. The multi-level system consists of two parts, a set of adjacent-level comparators, and a multi-level integrator. By analys¬ ing the constraints on the output of the single-level system and the relationship between the outputs of two nearby resolutions, tech¬ niques for combining the resulting two sets of edge data in an adjacent-level comparator are developed. One important goal here is to find and represent fuzzy edges. This is achieved by tracking along step edges at the lower resolution, at the same time examining corresponding areas of the higher resolution output. The role of the multi-level integrator is to combine the outputs of the adjacentlevel comparators into a single coherent representation of all the edges present in the image. The algorithms used throughout the system are described in detail, and examples of the system output for a range of images are given."
            },
            "slug": "Edge-Detection-for-Semantically-Based-Early-Visual-Beattie",
            "title": {
                "fragments": [],
                "text": "Edge Detection for Semantically Based Early Visual Processing"
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "This thesis describes the design and implementation of an edge detection system for use in semantically-based early visual processes, based on an analysis of how step-like edges digitise."
            },
            "venue": {
                "fragments": [],
                "text": "ECAI"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 55
                            }
                        ],
                        "text": "This is similar to the selection criterion proposed by Marr and Hildreth [18] for choosing between different Laplacian of Gaussian channels."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 31,
                                "start": 27
                            }
                        ],
                        "text": "In fact, a one-dimensional Marr-Hildreth edge detector is almost identical with the operator we have derived because maxima in the output of a first derivative operator will correspond to zero-crossings in the Laplacian operator as used by Marr and Hildreth."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 198,
                                "start": 194
                            }
                        ],
                        "text": "The effect of the window function becomes very marked for large operator sizes and it is probably the biggest single reason why operators with large support were not practical until the work of Marr and Hildreth on the Laplacian of Gaussian."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 89,
                                "start": 85
                            }
                        ],
                        "text": "Directional operators very much like the ones we have derived were suggested by Marr [17], but were discarded in favor of the Laplacian of Gaussian [18]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 8,
                                "start": 4
                            }
                        ],
                        "text": "The Marr-Hildreth operator does not use any form of thresholding, but an adaptive thresholding scheme can be used to advantage with our first derivative operator."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 81
                            }
                        ],
                        "text": "There are also strong links with the Laplacian of Gaussian operator suggested by Marr and Hildreth [18]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 70,
                                "start": 66
                            }
                        ],
                        "text": "One possible solution to this problem, used by Pentland [22] with Marr-Hildreth zero-crossings, is to average the edge strength of a contour over part of its length."
                    },
                    "intents": []
                }
            ],
            "corpusId": 40175393,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aa4b60b5847999c2f778e3e67ca1f2201e396abb",
            "isKey": true,
            "numCitedBy": 1004,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "An introduction is given to a theory of early visual information processing. The theory has been implemented, and examples are given of images at various stages of analysis. It is argued that the first step of consequence is to compute a primitive but rich description of the grey-level changes present in an image. The description is expressed in a vocabulary of kinds of intensity change (EDGE, SHADING-EDGE, EXTENDED-EDGE, LINE, BLOB etc.). Modifying parameters are bound to the elements in the description, specifying their POSITION, ORIENTATION, TERMINATION points, CONTRAST, SIZE and FUZZINESS. This description is obtained from the intensity array by fixed techniques, and it is called the primal sketch. For most images, the primal sketch is large and unwieldy. The second important step in visual information processing is to group its contents in a way that is appropriate for later recognition. From our ability to interpret drawings with little semantic content, one may infer the presence in our perceptual equipment of symbolic processes that can define \"place-tokens\" in an image in various ways, and can group them according to certain rules. Homomorphic techniques fail to account for many of these grouping phenomena, whose explanations require mechanisms of construction rather than mechanisms of detection. The necessary grouping of elements in the primal sketch may be achieved by a mechanism that has available the processes inferred from above, together with the ability to select items by first order discriminations acting on the elements' parameters. Only occasionally do these mechanisms use downward-flowing information about the contents of the particular image being processed. It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch. The class of computations so obtained differs slightly from the class of second order operations on the intensity array. The extraction of a form from the primal sketch using these techniques amounts to the separation of figure from ground. It is concluded that most of the separation can be carried out by using techniques that do not depend upon the particular image in question. Therefore, figure-ground separation can normally precede the description of the shape of the extracted form. Up to this point, higher-level knowledge and purpose are brought to bear on only a few of the decisions taken during the processing. This relegates the widespread use of downward-flowing information to a later stage than is found in current machine-vision programs, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "slug": "Early-processing-of-visual-information.-Marr",
            "title": {
                "fragments": [],
                "text": "Early processing of visual information."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 121,
                                "start": 117
                            }
                        ],
                        "text": "The form of nonlinear second derivative operator in (47) has also been used by Torre and Poggio [28] and by Haralick [10]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 118080448,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "ae16e7b286c2ec2a9a931acfa0b38baf9c526749",
            "isKey": false,
            "numCitedBy": 69,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "We use the facet model to accomplish step edge detection. The essence of the facet model is that any analysis made on the basis of the pixel values in some neighborhood has its final authoritative interpretation relative to the underlying grey tone intensity surface of which the neighborhood pixel values are observed noisy samples. Pixels which are part of regions have simple grey tone intensity surfaces over their areas. Pixels which have an edge in them have complex grey tone intensity surfaces over their areas. Specifically, an edge moves through a pixel if and only if there is some point in the pixel's area having a zero crossing of the second directional derivative taken in the direction of a non-zero gradient at the pixel's center. To determine whether or not a pixel should be marked as a step edge pixel, its underlying grey tone intensity surface must be estimated on the basis of the pixels in its neighborhood. For this, we use a functional form consisting of a linear combination of the tensor products of discrete orthogonal polynomials of up to degree three. The appropriate directional derivatives are easily computed from this kind of a function. Upon comparing the performance of this zero crossing of second directional derivative operator with Prewitt gradient operator and the Marrâ€\"Hildreth zero crossing of Laplacian operator, we find that it is the best performer and is followed by the Prewitt gradient operator. The Marr-Hildreth zero-crossing of Laplacian operator performs the worst."
            },
            "slug": "Zero-Crossing-Of-Second-Directional-Derivative-Edge-Haralick",
            "title": {
                "fragments": [],
                "text": "Zero Crossing Of Second Directional Derivative Edge Operator"
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3162561"
                        ],
                        "name": "J. Fram",
                        "slug": "J.-Fram",
                        "structuredName": {
                            "firstName": "Jerry",
                            "lastName": "Fram",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Fram"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2056740769"
                        ],
                        "name": "E. Deutsch",
                        "slug": "E.-Deutsch",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Deutsch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Deutsch"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 37
                            }
                        ],
                        "text": "It was evaluated in Fram and Deutsch [7] and compared very favorably with several other schemes considered in that paper."
                    },
                    "intents": []
                }
            ],
            "corpusId": 11702802,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8d2ae155fcc16ea62a9bc35ba3fa9f0adc920d83",
            "isKey": false,
            "numCitedBy": 190,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "A technique for the quantitative evaluation of edge detection schemes is presented. It is used to assess the performance of three such schemes using a specially-generated set of images containing noise. The ability of human subjects to distinguish the edges in the presence of noise is also measured and compared with that of the edge detection schemes. The edge detection schemes are used on a high-resolution satellite photograph with varying degrees of noise added in order to relate the quantitative comparison to real-life imagery."
            },
            "slug": "On-the-Quantitative-Evaluation-of-Edge-Detection-Fram-Deutsch",
            "title": {
                "fragments": [],
                "text": "On the Quantitative Evaluation of Edge Detection Schemes and their Comparison with Human Performance"
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "A technique for the quantitative evaluation of edge detection schemes is used to assess the performance of three such schemes using a specially-generated set of images containing noise to relate the quantitative comparison to real-life imagery."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "118988170"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "Dale",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120306234,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ab46fdac0a3b484cd58978ba71dc71631b49f70a",
            "isKey": false,
            "numCitedBy": 989,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm is proposed for solving the stereoscopic matching problem. The algorithm consists of five steps: (1) Each image is filtered at different orientations with bar masks of four sizes that increase with eccentricity; the equivalent filters are one or two octaves wide. (2) Zero-crossings in the filtered images, which roughly correspond to edges, are localized. Positions of the ends of lines and edges are also found. (3) For each mask orientation and size, matching takes place between pairs of zero-crossings or terminations of the same sign in the two images, for a range of disparities up to about the width of the mask’s central region. (4) Wide masks can control vergence movements, thus causing small masks to come into correspondence. (5) When a correspondence is achieved, it is stored in a dynamic buffer, called the 2½-D sketch. It is shown that this proposal provides a theoretical framework for most existing psychophysical and neurophysiological data about stereopsis. Several critical experimental predictions are also made, for instance about the size of Panum’s area under various conditions. The results of such experiments would tell us whether, for example, co-operativity is necessary for the matching process."
            },
            "slug": "A-computational-theory-of-human-stereo-vision-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "A computational theory of human stereo vision"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 121,
                                "start": 117
                            }
                        ],
                        "text": "Several modem theories of stereopsis assume that images are preprocessed by an edge detector before matching is done [19], [20]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 60545300,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "75d5b6239679642070a29859ec009874f3be9a4a",
            "isKey": false,
            "numCitedBy": 380,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "An Algorithm is proposed for solving the stereoscopic matching problem. The algorithm consists of five steps: (1) Each image is filtered with bar masks of four sizes that vary with eccentricity; the equivalent filters are about one octave wide. (2) Zero-crossings of the mask values are localized, and positions that correspond to terminations are found; (3) For each mask size, matching takes place between pairs of zero- crossings or terminations of the same sign in the two images, for a range of disparities up to about the vergence movements, thus causing small masks to come into correspondence; (5) When a correspondence is achieved, it is written into a dynamic buffer, called the 2 1/2 D sketch. It is shown that this proposal provides a theoretical framework for most existing phychophysical and neurophysiological data about stereopsis. Several critical experimental predictions are also made, for instance, about the wsize of Panum?s area under various conditions. The results of such experiments would tell us whether, for example, cooperativity is necessary for the fusion process."
            },
            "slug": "A-Theory-of-Human-Stereo-Vision-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "A Theory of Human Stereo Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This proposal provides a theoretical framework for most existing phychophysical and neurophysiological data about stereopsis, and several critical experimental predictions are made, for instance, about the wsize of Panum?s area under various conditions."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 62198913,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "c416a885cc36515740ef8dfa9220366fa2a379f8",
            "isKey": false,
            "numCitedBy": 660,
            "numCiting": 56,
            "paperAbstract": {
                "fragments": [],
                "text": "From the Publisher: \nComputer scientists designing machine vision systems, psychologists working in visual perception, visual neurophysiologists, and theoretical biologists will derive a deeper understanding of visual function - in particular the computations that the human visual system uses to analyze motion-from the important research reported in this book. \nThe organization of movement in the changing image that reaches the eye provides our visual system with a valuable source of information for analyzing the structure of our surroundings. This book examines the measurement of this movement and the use of relative movement to locate the boundaries of physical objects in the environment. It investigates the nature of the computations that are necessary to perform this analysis by any vision system, biological or artificial. \nThe author first defines the goals of these visual tasks, reveals the properties of the physical world that a vision system can rely upon to achieve such goals, and suggests general methods that can be used to carry out the tasks. From the general methods, she designs algorithms specifying a particular sequence of computations that a vision system can execute to perform these visual tasks. These algorithms are implemented on a computer system under a variety of circumstances. Combined with the traditional approaches of psychology and neurophysiology, this computational approach provides an exciting analysis of visual function, raising many new questions about the human vision system for further investigation. \nEllen Catherine Hildreth received her doctorate from MIT. She is a Research Scientist in the MIT Artificial Intelligence Laboratory and associate director of theCenter for Biological Information Processing at the Whitaker College of Health Sciences, Technology, and Management. The Measurement of Visual Motion is an ACM Distinguished Dissertation."
            },
            "slug": "Measurement-of-Visual-Motion-Hildreth",
            "title": {
                "fragments": [],
                "text": "Measurement of Visual Motion"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Combined with the traditional approaches of psychology and neurophysiology, this computational approach provides an exciting analysis of visual function, raising many new questions about the human vision system for further investigation."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 18
                            }
                        ],
                        "text": "Shape from motion [29], [13] can be used to infer the structure of three-dimensional objects from the motion of edge contours or edge points in the image plane."
                    },
                    "intents": []
                }
            ],
            "corpusId": 146278985,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "801c802366800354d971be415449c0ba41f43194",
            "isKey": false,
            "numCitedBy": 2090,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This book uses the methodology of artificial intelligence to investigate the phenomena of visual motion perception: how the visual system constructs descriptions of the environment in terms of objects, their three-dimensional shape, and their motion through space, on the basis of the changing image that reaches the eye. The author has analyzed the computations performed in the course of visual motion analysis. Workable schemes able to perform certain tasks performed by the visual system have been constructed and used as vehicles for investigating the problems faced by the visual system and its methods for solving them.Two major problems are treated: first, the correspondence problem, which concerns the identification of image elements that represent the same object at different times, thereby maintaining the perceptual identity of the object in motion or in change. The second problem is the three-dimensional interpretation of the changing image once a correspondence has been established.The author's computational approach to visual theory makes the work unique, and it should be of interest to psychologists working in visual perception and readers interested in cognitive studies in general, as well as computer scientists interested in machine vision, theoretical neurophysiologists, and philosophers of science."
            },
            "slug": "The-Interpretation-of-Visual-Motion-Ullman",
            "title": {
                "fragments": [],
                "text": "The Interpretation of Visual Motion"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46720503"
                        ],
                        "name": "M. Thurston",
                        "slug": "M.-Thurston",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Thurston",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Thurston"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 42,
                                "start": 38
                            }
                        ],
                        "text": "Interestingly, Rosenfeld and Thurston [25] proposed exactly the opposite criterion in the choice of operator for edge detection in texture."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 63,
                                "start": 59
                            }
                        ],
                        "text": "The difference of boxes was used by Rosenfeld and Thurston [25], and in conjunction with lateral inhibition by Herskovits and Binford [11]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 206618628,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c901dd790abcb04f258ea29655a8a8401c715fca",
            "isKey": false,
            "numCitedBy": 769,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Simple sets of parallel operations are described which can be used to detect texture edges, \"spots,\" and \"streaks\" in digitized pictures. It is shown that, by comparing the outputs of the operations corresponding to (e.g.,) edges of different sizes, one can construct a composite output in which edges between differently textured regions are detected, and isolated objects are also detected, but the objects composing the textures are ignored. Relationships between this class of picture processing operations and the Gestalt psychologists' laws of pictorial pattern organization are also discussed."
            },
            "slug": "Edge-and-Curve-Detection-for-Visual-Scene-Analysis-Rosenfeld-Thurston",
            "title": {
                "fragments": [],
                "text": "Edge and Curve Detection for Visual Scene Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "Simple sets of parallel operations are described which can be used to detect texture edges, \"spots,\" and \"streaks\" in digitized pictures and it is shown that a composite output is constructed in which edges between differently textured regions are detected, and isolated objects are also detected, but the objects composing the textures are ignored."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 29
                            }
                        ],
                        "text": "The Binford-Horn line finder [14] used the output of an edge"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 155,
                                "start": 151
                            }
                        ],
                        "text": "The situation may be different in the case of an edge detector designed explicitly to deal with images of polyhedra, like the Binford-Horn line-finder [14]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 58501774,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "d9afc5dac8851cf05d086c9f6fa3c330848b9b89",
            "isKey": false,
            "numCitedBy": 56,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper briefly describes the processing performed in the course of producing a line drawing from an image obtained through an image dissector camera. The edge-marking phase uses a non-linear parallel line-follower. Complicated statistical measures are not used. The line and vertex generating phases use a number of heuristics to guide the transition from edge-fragments to cleanedup line-drawing. Higher-level understanding of the blocks-world is not used. Sample line-drawings produced by the program are included. Work reported herein was conducted at the Artificial Intelligence Laboratory, a Massachusetts Institute of Technology research program supported in part by the Advanced Research Projects Agency of the Department of Defense and monitored by the Office of Naval . Research under Contract Number N00014-70-A-0362-0005. Reproduction of this document, in whole or in part, is permitted for any purpose of the United States Government."
            },
            "slug": "The-Binford-Horn-LINE-FINDER-Horn",
            "title": {
                "fragments": [],
                "text": "The Binford-Horn LINE-FINDER"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "The processing performed in the course of producing a line drawing from an image obtained through an image dissector camera uses a number of heuristics to guide the transition from edge-fragments to cleanedup line-drawing."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2052857606"
                        ],
                        "name": "K. A. Stevens",
                        "slug": "K.-A.-Stevens",
                        "structuredName": {
                            "firstName": "Kent",
                            "lastName": "Stevens",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. A. Stevens"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 150,
                                "start": 146
                            }
                        ],
                        "text": "Finally, some novel methods have been suggested for the extraction of threedimensional information from image contours, namely shape from contour [27] and shape from texture [31]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 10857410,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "d9a28454e766b01b3e9622bb926471929df5ee24",
            "isKey": false,
            "numCitedBy": 91,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The visual analysis of surface shape from texture and surface contour is treated within a computational framework. The aim of this study is to determine valid constraints that are sufficient to allow surface orientation and distance (up to a multiplicative constant) to be computed from the image of surface texture and of surface contours. The report is in three parts. Part I consists of a review of major theories of surface perception, a discussion of vision as computation and of the nature in which three-dimensional information is manifest in the image, and a study of the representation of local surface orientation. Part II reconisiders the familiar 'texture gradient'. Part III examines our preception of surface contours. It is shown that surface contours are strong sources of information about local surface shape."
            },
            "slug": "Surface-perception-from-local-analysis-of-texture-Stevens",
            "title": {
                "fragments": [],
                "text": "Surface perception from local analysis of texture and contour"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is shown that surface contours are strong sources of information about local surface shape as well as the familiar 'texture gradient' in the image."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72419159"
                        ],
                        "name": "R. Brooks",
                        "slug": "R.-Brooks",
                        "structuredName": {
                            "firstName": "Rodney",
                            "lastName": "Brooks",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Brooks"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 55,
                                "start": 52
                            }
                        ],
                        "text": "More recently the model-based vision system ACRONYM [3] used an edge detector as the front end to a sophisticated recognition program."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2011964,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b8831f3095686131a98731d6806abdc75c6baebd",
            "isKey": false,
            "numCitedBy": 809,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Symbolic-Reasoning-Among-3-D-Models-and-2-D-Images-Brooks",
            "title": {
                "fragments": [],
                "text": "Symbolic Reasoning Among 3-D Models and 2-D Images"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2121478"
                        ],
                        "name": "S. Rice",
                        "slug": "S.-Rice",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Rice",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Rice"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 122589216,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8d03cde4ca95dc901582ec2351ef0550e73eb08d",
            "isKey": false,
            "numCitedBy": 5561,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "In this section we use the representations of the noise currents given in section 2.8 to derive some statistical properties of I(t). The first six sections are concerned with the probability distribution of I(t) and of its zeros and maxima. Sections 3.7 and 3.8 are concerned with the statistical properties of the envelope of I(t). Fluctuations of integrals involving I2(t) are discussed in section 3.9. The probability distribution of a sine wave plus a noise current is given in 3.10 and in 3.11 an alternative method of deriving the results of Part III is mentioned. Prof. Uhlenbeck has pointed out that much of the material in this Part is closely connected with the theory of Markoff processes. Also S. Chandrasekhar has written a review of a class of physical problems which is related, in a general way, to the present subject.22"
            },
            "slug": "Mathematical-analysis-of-random-noise-Rice",
            "title": {
                "fragments": [],
                "text": "Mathematical analysis of random noise"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1944
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 127,
                                "start": 123
                            }
                        ],
                        "text": "Several modem theories of stereopsis assume that images are preprocessed by an edge detector before matching is done [19], [20]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 43122532,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5d206bde2f0613b54708913c2c99c44314a8d8d1",
            "isKey": false,
            "numCitedBy": 415,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Psychophysical-and-Computational-Studies-Towards-a-Mayhew-Frisby",
            "title": {
                "fragments": [],
                "text": "Psychophysical and Computational Studies Towards a Theory of Human Stereopsis"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2068663454"
                        ],
                        "name": "C. Bingham",
                        "slug": "C.-Bingham",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Bingham",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Bingham"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2068264217"
                        ],
                        "name": "M. Godfrey",
                        "slug": "M.-Godfrey",
                        "structuredName": {
                            "firstName": "Maurice",
                            "lastName": "Godfrey",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Godfrey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2016914"
                        ],
                        "name": "J. Tukey",
                        "slug": "J.-Tukey",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tukey",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tukey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1023902,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "dbf9eb47ee725e69dcb8c0245d4e97eeefa4cad3",
            "isKey": false,
            "numCitedBy": 392,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The paper discusses the impact of the fast Fourier transform on the spectrum of time series analysis. It is shown that the computationally fastest way to calculate mean lagged products is to begin by calculating all Fourier coefficients with a fast Fourier transform and then to fast-Fourier-retransform a sequence made up ofa_{k}^{2}+b_{k}^{2}(wherea_{k}+ib_{k}are the complex Fourier coefficients). Also discussed are raw and modified Fourier periodograms, bandwidth versus stability aspects, and aims and computational approaches to complex demodulation. Appendixes include a glossary, a review of complex demodulation without fast Fourier transform, and a short explanation of the fast Fourier transform."
            },
            "slug": "Modern-techniques-of-power-spectrum-estimation-Bingham-Godfrey",
            "title": {
                "fragments": [],
                "text": "Modern techniques of power spectrum estimation"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Audio and Electroacoustics"
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1390055667"
                        ],
                        "name": "Dr. M. G. Worster",
                        "slug": "Dr.-M.-G.-Worster",
                        "structuredName": {
                            "firstName": "Dr.",
                            "lastName": "Worster",
                            "middleNames": [
                                "M.",
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dr. M. G. Worster"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 142,
                                "start": 139
                            }
                        ],
                        "text": ", they share the same limits of integration as the integral being minimized, we can form a composite functional using Lagrange multipliers [6]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 4079036,
            "fieldsOfStudy": [
                "Education",
                "Physics"
            ],
            "id": "757dd5fbc67d8f2591eb2077180af74c1797fcd1",
            "isKey": false,
            "numCitedBy": 2427,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The following people have maintained these notes."
            },
            "slug": "Methods-of-Mathematical-Physics-Worster",
            "title": {
                "fragments": [],
                "text": "Methods of Mathematical Physics"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1947
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 72,
                                "start": 64
                            }
                        ],
                        "text": "This is similar to the selection criterion proposed by Marr and Hildreth [18] for choosing between different Laplacian of Gaussian channels."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 228,
                                "start": 224
                            }
                        ],
                        "text": "This simple goodness-of-fit measure is sufficient to eliminate the problems that traditionally plague directional operators, such as false responses to highly curved edges and extension of edges beyond corners; see Hildreth [12]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 32
                            }
                        ],
                        "text": "In fact, a one-dimensional Marr-Hildreth edge detector is almost identical with the operator we have derived because maxima in the output of a first derivative operator will correspond to zero-crossings in the Laplacian operator as used by Marr and Hildreth."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 211,
                                "start": 203
                            }
                        ],
                        "text": "The effect of the window function becomes very marked for large operator sizes and it is probably the biggest single reason why operators with large support were not practical until the work of Marr and Hildreth on the Laplacian of Gaussian."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 9
                            }
                        ],
                        "text": "The Marr-Hildreth operator does not use any form of thresholding, but an adaptive thresholding scheme can be used to advantage with our first derivative operator."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 90
                            }
                        ],
                        "text": "There are also strong links with the Laplacian of Gaussian operator suggested by Marr and Hildreth [18]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 224,
                                "start": 216
                            }
                        ],
                        "text": "This simple goodness-of-fit measure is sufficient to eliminate the problems that traditionally plague directional operators , such as false responses to highly curved edges and extension of edges beyond corners; see Hildreth [12]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 71
                            }
                        ],
                        "text": "One possible solution to this problem, used by Pentland [22] with Marr-Hildreth zero-crossings, is to average the edge strength of a contour over part of its length."
                    },
                    "intents": []
                }
            ],
            "corpusId": 118271750,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1d4ab6798f0492606a7dea9b3db07d0b2c7013cb",
            "isKey": true,
            "numCitedBy": 90,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Implementation-Of-A-Theory-Of-Edge-Detection-Hildreth",
            "title": {
                "fragments": [],
                "text": "Implementation Of A Theory Of Edge Detection"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 142,
                                "start": 139
                            }
                        ],
                        "text": ", they share the same limits of integration as the integral being minimized, we can form a composite functional using Lagrange multipliers [6]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 123491029,
            "fieldsOfStudy": [],
            "id": "9e0c986e906869febb0f87258edab602bc51fcaf",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Methods of Mathematical Physics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1947
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145732246"
                        ],
                        "name": "E. Polak",
                        "slug": "E.-Polak",
                        "structuredName": {
                            "firstName": "Elijah",
                            "lastName": "Polak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Polak"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 84,
                                "start": 80
                            }
                        ],
                        "text": "It is also possible to include additional constraints by using a penalty method [15]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 122931192,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "95c23bb25a03d296a7eedb7c8dffe1748bb614c6",
            "isKey": false,
            "numCitedBy": 2291,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Introduction-to-linear-and-nonlinear-programming-Polak",
            "title": {
                "fragments": [],
                "text": "Introduction to linear and nonlinear programming"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47665410"
                        ],
                        "name": "Annette Herskovits",
                        "slug": "Annette-Herskovits",
                        "structuredName": {
                            "firstName": "Annette",
                            "lastName": "Herskovits",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Annette Herskovits"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 138,
                                "start": 134
                            }
                        ],
                        "text": "The difference of boxes was used by Rosenfeld and Thurston [25], and in conjunction with lateral inhibition by Herskovits and Binford [11]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 133,
                                "start": 126
                            }
                        ],
                        "text": "The situation may be different in the case of an edge detector designed explicitly to deal with images of polyhedra, like the Binford-Horn line-finder [14]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 120481924,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "41bfa905e53cafbaef5569cee97d0aa2827a3ad2",
            "isKey": false,
            "numCitedBy": 49,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-Boundary-Detection-Herskovits-Binford",
            "title": {
                "fragments": [],
                "text": "On Boundary Detection"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144994682"
                        ],
                        "name": "A. Pentland",
                        "slug": "A.-Pentland",
                        "structuredName": {
                            "firstName": "Alex",
                            "lastName": "Pentland",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pentland"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 56
                            }
                        ],
                        "text": "One possible solution to this problem, used by Pentland [22] with Marr-Hildreth zero-crossings, is to average the edge strength of a contour over part of its length."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 118274912,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8f4b5c4e849eec13b0e3cb69efdc4b1b0b590532",
            "isKey": false,
            "numCitedBy": 32,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-visual-inference-of-shape-:-computation-from-Pentland",
            "title": {
                "fragments": [],
                "text": "The visual inference of shape : computation from local features"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707626"
                        ],
                        "name": "N. Wiener",
                        "slug": "N.-Wiener",
                        "structuredName": {
                            "firstName": "Norbert",
                            "lastName": "Wiener",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Wiener"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60881246,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "80e9826f5a4238251340b5bf8e81bed7337e7c12",
            "isKey": false,
            "numCitedBy": 3191,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Extrapolation,-Interpolation,-and-Smoothing-of-Time-Wiener",
            "title": {
                "fragments": [],
                "text": "Extrapolation, Interpolation, and Smoothing of Stationary Time Series"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1964
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50216221"
                        ],
                        "name": "P. Lafrance",
                        "slug": "P.-Lafrance",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Lafrance",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Lafrance"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 63,
                                "start": 60
                            }
                        ],
                        "text": "It is therefore necessary to window the projection function [9]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 648890,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "62b90569de2a885f4b513a37c321668aea3232d8",
            "isKey": false,
            "numCitedBy": 596,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Digital-filters-Lafrance",
            "title": {
                "fragments": [],
                "text": "Digital filters"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 178,
                                "start": 174
                            }
                        ],
                        "text": "Finally, some novel methods have been suggested for the extraction of threedimensional information from image contours, namely shape from contour [27] and shape from texture [31]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 118244498,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "f3ed2e833ac27318dd4f7d7fb9715e8fe51726b2",
            "isKey": false,
            "numCitedBy": 34,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Shape-from-Contour-Witkin",
            "title": {
                "fragments": [],
                "text": "Shape from Contour"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Authorized licensed use limited to: Peking University at 08:11 from IEEE Xplore. Restrictions apply"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE TRANSACTIONS ON PATTERN ANALYSIS AND MACHINE INTELLIGENCE"
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "ple parallel hierarchical and relaxation algorithms for segmenting textured images based on noncasual Markovian random field models"
            },
            "venue": {
                "fragments": [],
                "text": "Proc . 7 th Int . Conf . Pattern Recognition and Image Processing"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "ple parallel hierarchical and relaxation algorithms for segmenting textured images based on noncasual Markovian random field models"
            },
            "venue": {
                "fragments": [],
                "text": "Proc . 7 th Int . Conf . Pattern Recognition and Image Processing"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Object enhancement and extraction , \" in Picture Processing and Psychopictorics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 0
                            }
                        ],
                        "text": "Spacek starts with a one-dimensional formulation which maximizes the product of the three performance criteria defined in Section II, and leads to a step edge operator which differs slightly from the one we derived in Section IV."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 71,
                                "start": 67
                            }
                        ],
                        "text": "A rather different two-dimensional extension is proposed by Spacek [26] who uses one-dimensional filters aligned normal to the edge direction but without extending them along the edge direction."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The computation of visual motion,"
            },
            "venue": {
                "fragments": [],
                "text": "Ph.D. dissertation, Univ. Essex at Colchester,"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Object enhancement and extraction"
            },
            "venue": {
                "fragments": [],
                "text": "Picture Processing and Psychopictorics"
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Simple parallel hierarchical and relaxation algorithms for segmenting textured images based on noncasual Markovian random field models"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. 7th Int. Conf. Pattern Recognition and Image Processing"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "He is with the Artificial Intelligence Laboratory, M.I.T. His research interests include lowlevel vision, model-based vision, motion planning for robots, and computer algebra"
            },
            "venue": {
                "fragments": [],
                "text": "respectively, and the S.M. degree from the Massachusetts Institute of Technology"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Detecting halfedges and vertices in images"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans . Comput ."
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 96
                            }
                        ],
                        "text": "The form of nonlinear second derivative operator in (47) has also been used by Torre and Poggio [28] and by Haralick [10]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On edge detection,\" M.I.T"
            },
            "venue": {
                "fragments": [],
                "text": "Artificial Intell. Lab.,"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Hamming, Digital Filters"
            },
            "venue": {
                "fragments": [],
                "text": "Hamming, Digital Filters"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 31,
                                "start": 27
                            }
                        ],
                        "text": "It also appears in Prewitt [23] in the context of edge enhancement."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Object enhancement and extraction,\" in Picture Processing and Psychopictorics"
            },
            "venue": {
                "fragments": [],
                "text": "New York: Academic,"
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 11,
                                "start": 8
                            }
                        ],
                        "text": "Gennert [8] addresses the two-dimensional edge detector problem directly, and applies a set of directional first derivative operators at each point in the image."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Detecting half-edges and vertices in images,"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Conf. Comput. Vision and Pattern Recognition,"
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 45,
                                "start": 41
                            }
                        ],
                        "text": "Then we make use of a result due to Rice [24] that the average distance between zero-crossings of the response of a function g to Gaussian noise is"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 36
                            }
                        ],
                        "text": "Then we make use of a result due to Rice [24] that the average distance between zero-crossings of the response of a function g to Gaussian noise is ( R(O) 112 where R(i) is the autocorrelation function of g."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Rice, \"Mathematical analysis of random Noise,"
            },
            "venue": {
                "fragments": [],
                "text": "Bell Syst. Tech. J.,"
            },
            "year": 1945
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Sim - ple parallel hierarchical and relaxation algorithms for segmenting textured images based on noncasual Markovian random field models"
            },
            "venue": {
                "fragments": [],
                "text": "Proc . 7 th Int . Conf . Pattern Recognition and Image Processing"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 92
                            }
                        ],
                        "text": "A close approximation of the first derivative of Gaussian operator was suggested by Macleod [16] for step edge detection."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 0
                            }
                        ],
                        "text": "Macleod's operator is a difference of two displaced two-dimensional Gaussians."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On finding structure in pictures,\" in Picture Language Machines, S"
            },
            "venue": {
                "fragments": [],
                "text": "Kaneff, Ed. New York: Academic,"
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 180,
                                "start": 177
                            }
                        ],
                        "text": "The generalization to other types of texture is not as easy, and for good discrimination between known texture types, a better approach would involve a Markov image model as in [5]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "and E"
            },
            "venue": {
                "fragments": [],
                "text": "B. Hinkle, \"Simple parallel hierarchical and relaxation algorithms for segmenting textured images based on noncasual Markovian random field models,\" in Proc. 7th Int. Conf. Pattern Recognition and Image Processing, Canada"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On finding structure in pictures"
            },
            "venue": {
                "fragments": [],
                "text": "Picture Language Machines, S. Kaneff, Ed. New York: Academic"
            },
            "year": 1970
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 13,
            "methodology": 16
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 46,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/A-Computational-Approach-to-Edge-Detection-Canny/fcf9fc4e23b45345c2404ce7d6cb0fc9dea2c9ec?sort=total-citations"
}