{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42960047,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "fa51226e4cef3bf584e0998e6cdfa3cd11b1f28e",
            "isKey": false,
            "numCitedBy": 302,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "The human visual system can extract 3-D shape information of unfamiliar moving objects from their projected transformations. Computational studies of this capacity have established that 3-D shape can be extracted correctly from a brief presentation, provided the moving objects are rigid. The human visual system requires a longer temporal extension, but it can cope with considerable deviations from rigidity. It is shown how the 3-D structure of rigid as well as nonrigid objects can be recovered by maintaining an internal model of the viewed object and modifying it at each instant by the minimal nonrigid change that is sufficient to account for the observed transformation. The results of applying this incremental rigidity scheme to rigid and nonrigid objects in motion are described and compared with human perception."
            },
            "slug": "Maximizing-Rigidity:-The-Incremental-Recovery-of-Ullman",
            "title": {
                "fragments": [],
                "text": "Maximizing Rigidity: The Incremental Recovery of 3-D Structure from Rigid and Nonrigid Motion"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is shown how the 3-D structure of rigid as well as nonrigid objects can be recovered by maintaining an internal model of the viewed object and modifying it at each instant by the minimal nonrigidity change that is sufficient to account for the observed transformation."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2585959"
                        ],
                        "name": "A. V. van Doorn",
                        "slug": "A.-V.-van-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "van Doorn",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. V. van Doorn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 22681338,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "23441c50e7180c119bf9a37f86f280286d4f3a51",
            "isKey": false,
            "numCitedBy": 95,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown that there exist classes of useful partial solutions to what has become known as the structure from motion problem, that is, the problem of finding the three-dimensional shape as well as the movement in space of objects on the basis of their optical projections in several distinct phases of the movement. The class of solutions treated in this paper is quite different from the usual treatment in that the rigidity condition is relaxed so as to include the important class of bending deformations. For instance, we show a case in which important aspects of shape are obtained for a configuration of seven points, no four of which move in a rigid way, and which can be obtained from only two views. (This violates all requirements of the structure from motion theorem.) We discuss an algorithm that obtains the three-dimensional configuration of a polyhedral vertex up to a relief transformation (a similar transformation to the one that maps object to image space in paraxial optics), in the presence of arbitrary flections of the edges, from the projection and the instantaneous-movement parallax. Such a solution can, for instance, be used to predict side views of the vertex, as is demonstrated for a specific example. The solution can be used in an iterative fashion on triangulations to solve the case of extended curved surfaces suffering arbitrary bendings. The class of bending deformations encompasses all deformations that conserve distances along the surface (but not necessarily through space); thus stretchings are excluded. Practical examples include, e.g., deformations of flexible but nonstretchable shells. Actual numerical examples illustrate the practicability of the method."
            },
            "slug": "Depth-and-shape-from-differential-perspective-in-of-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "Depth and shape from differential perspective in the presence of bending deformations."
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "It is shown that there exist classes of useful partial solutions to what has become known as the structure from motion problem, that is, the problem of finding the three-dimensional shape as well as the movement in space of objects on the basis of their optical projections in several distinct phases of the movement."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145456169"
                        ],
                        "name": "W. Richards",
                        "slug": "W.-Richards",
                        "structuredName": {
                            "firstName": "W",
                            "lastName": "Richards",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Richards"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 43277235,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "2a0dcaeb4a98d1c9b35792ea5bf5ba012178326d",
            "isKey": false,
            "numCitedBy": 155,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Stereopsis and motion parallax are two methods for recovering three-dimensional (3D) shapes. Theoretical analyses of each method show that neither alone can recover rigid 3D shapes correctly unless other information, such as perspective and vertical disparity, is included. The solutions for recovering rigid structure from motion have a reflection ambiguity; the depth scale of the stereoscopic solution will not be known unless the fixation distance is specified in units of interpupil separation. (Hence the configuration will appear distorted.) However, the correct configuration and disposition of a rigid 3D shape can be recovered if stereopsis and motion are integrated, for then a unique solution follows from a set of linear equations. The correct interpretation requires only three points and two stereo views."
            },
            "slug": "Structure-from-stereo-and-motion.-Richards",
            "title": {
                "fragments": [],
                "text": "Structure from stereo and motion."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The correct configuration and disposition of a rigid 3D shape can be recovered if stereopsis and motion are integrated, for then a unique solution follows from a set of linear equations."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4564909"
                        ],
                        "name": "K. Fleischer",
                        "slug": "K.-Fleischer",
                        "structuredName": {
                            "firstName": "Kurt",
                            "lastName": "Fleischer",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Fleischer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3021334"
                        ],
                        "name": "A. Barr",
                        "slug": "A.-Barr",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Barr",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Barr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6622617,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "57201453c6e28d64b0e9aa7348921dd4bf512696",
            "isKey": false,
            "numCitedBy": 236,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "A simple but general approach to imposing and solving geometric constraints on parameterized models is introduced, applicable to animation as well as model construction. Constraints are expressed as energy functions, and the energy gradient followed through the model's parameter space. Intuitively, energy constraints behave like forces that pull and parametrically deform the parts of the model into place. A wide variety of geometric constraints are amenable to this formulation, and may be used to influence arbitrary model parameters. A catalogue of basic constraints is presented, and results are shown."
            },
            "slug": "Energy-constraints-on-parameterized-models-Witkin-Fleischer",
            "title": {
                "fragments": [],
                "text": "Energy constraints on parameterized models"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A simple but general approach to imposing and solving geometric constraints on parameterized models is introduced, applicable to animation as well as model construction."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3021334"
                        ],
                        "name": "A. Barr",
                        "slug": "A.-Barr",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Barr",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Barr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16162806,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "3739bc6d4be47169fc9a24a4b9a54b4ab67e21e1",
            "isKey": false,
            "numCitedBy": 946,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "New hierarchical solid modeling operations are developed, which simulate twisting, bending, tapering, or similar transformations of geometric objects. The chief result is that the normal vector of an arbitrarily deformed smooth surface can be calculated directly from the surface normal vector of the undeformed surface and a transformation matrix. Deformations are easily combined in a hierarchical structure, creating complex objects from simpler ones. The position vectors and normal vectors in the simpler objects are used to calculate the position and normal vectors in the more complex forms; each level in the deformation hierarchy requires an additional matrix multiply for the normal vector calculation. Deformations are important and highly intuitive operations which ease the control and rendering of large families of three-dimensional geometric shapes."
            },
            "slug": "Global-and-local-deformations-of-solid-primitives-Barr",
            "title": {
                "fragments": [],
                "text": "Global and local deformations of solid primitives"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "New hierarchical solid modeling operations are developed, which simulate twisting, bending, tapering, or similar transformations of geometric objects, and the chief result is that the normal vector of an arbitrarily deformed smooth surface can be calculated directly from the surfacenormal vector of the undeformed surface and a transformation matrix."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145787720"
                        ],
                        "name": "J. Webb",
                        "slug": "J.-Webb",
                        "structuredName": {
                            "firstName": "Jon",
                            "lastName": "Webb",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Webb"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705627"
                        ],
                        "name": "J. Aggarwal",
                        "slug": "J.-Aggarwal",
                        "structuredName": {
                            "firstName": "Jake",
                            "lastName": "Aggarwal",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Aggarwal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28007767,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1068293b32e18ec92cd35a73377085d839f340b9",
            "isKey": false,
            "numCitedBy": 31,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Shape-and-correspondence-Webb-Aggarwal",
            "title": {
                "fragments": [],
                "text": "Shape and correspondence"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144189092"
                        ],
                        "name": "John C. Platt",
                        "slug": "John-C.-Platt",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Platt",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John C. Platt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3021334"
                        ],
                        "name": "A. Barr",
                        "slug": "A.-Barr",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Barr",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Barr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4564909"
                        ],
                        "name": "K. Fleischer",
                        "slug": "K.-Fleischer",
                        "structuredName": {
                            "firstName": "Kurt",
                            "lastName": "Fleischer",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Fleischer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 52800005,
            "fieldsOfStudy": [
                "Materials Science"
            ],
            "id": "f3d2c717e2b04e87f6c4ea32f16d8b8e45c86a09",
            "isKey": false,
            "numCitedBy": 2146,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "The theory of elasticity describes deformable materials such as rubber, cloth, paper, and flexible metals. We employ elasticity theory to construct differential equations that model the behavior of non-rigid curves, surfaces, and solids as a function of time. Elastically deformable models are active: they respond in a natural way to applied forces, constraints, ambient media, and impenetrable obstacles. The models are fundamentally dynamic and realistic animation is created by numerically solving their underlying differential equations. Thus, the description of shape and the description of motion are unified."
            },
            "slug": "Elastically-deformable-models-Terzopoulos-Platt",
            "title": {
                "fragments": [],
                "text": "Elastically deformable models"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The description of shape and the description of motion are unified and differential equations that model the behavior of non-rigid curves, surfaces, and solids as a function of time are constructed."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118458816,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "fc4e5b1aef955321b7321aca76c8c9047a0f533d",
            "isKey": false,
            "numCitedBy": 69,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Recent-Computational-Studies-in-the-Interpretation-Ullman",
            "title": {
                "fragments": [],
                "text": "Recent Computational Studies in the Interpretation of Structure from Motion"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2038179"
                        ],
                        "name": "A. Waxman",
                        "slug": "A.-Waxman",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Waxman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Waxman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2134868"
                        ],
                        "name": "S. Sinha",
                        "slug": "S.-Sinha",
                        "structuredName": {
                            "firstName": "Sarvajit",
                            "lastName": "Sinha",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sinha"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 7719478,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "39c322d32287eb217ec75cc0546af77a57debee2",
            "isKey": false,
            "numCitedBy": 76,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "A new concept in passive ranging to moving objects is described which is based on the comparison of multiple image flows. It is well known that if a static scene is viewed by an observer undergoing a known relative translation through space, then the distance to objects in the scene can be easily obtained from the measured image velocities associated with features on the objects (i.e., motion stereo). But in general, individual objects are translating and rotating at unknown rates with respect to a moving observer whose own motion may not be accurately monitored. The net effect is a complicated image flow field in which absolute range information is lost. However, if a second image flow field is produced by a camera whose motion through space differs from that of the first camera by a known amount, the range information can be recovered by subtracting the first image flow from the second. This ``difference flow'' must then be corrected for the known relative rotation between the two cameras, resulting in a divergent relative flow from a known focus of expansion. This passive ranging process may be termed Dynamic Stereo, the known difference in camera motions playing the role of the stereo baseline. We present the basic theory of this ranging process, along with some examples for simulated scenes."
            },
            "slug": "Dynamic-Stereo:-Passive-Ranging-to-Moving-Objects-Waxman-Sinha",
            "title": {
                "fragments": [],
                "text": "Dynamic Stereo: Passive Ranging to Moving Objects from Relative Image Flows"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "A new concept in passive ranging to moving objects is described which is based on the comparison of multiple image flows, termed Dynamic Stereo, the known difference in camera motions playing the role of the stereo baseline."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47904091"
                        ],
                        "name": "Yuan-fang Wang",
                        "slug": "Yuan-fang-Wang",
                        "structuredName": {
                            "firstName": "Yuan-fang",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yuan-fang Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705627"
                        ],
                        "name": "J. Aggarwal",
                        "slug": "J.-Aggarwal",
                        "structuredName": {
                            "firstName": "Jake",
                            "lastName": "Aggarwal",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Aggarwal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27417799,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0949d041453e46a21d05a3788feaab572c179f6a",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we introduce a new algorithm for modelling 3-D objects using information gathered from both active and passive sensing mechanisms. Construction of the structural description of a 3-D object is composed of two stages: (i) The visible surface orientation and partial structure are first inferred from a set of single views, and (ii) the partial surface structures inferred from different viewpoints are integrated to complete the 3-D structural description of the object. In the first stage, an active stripe coding technique is used which projects spatially modulated patterns to encode the objects surfaces for analysis. The visible surface orientation is inferred using a constraint satisfaction process based upon the observed orientation of the projected patterns. The visible surface structure is recovered through integrating a dense orientation map. In the second stage, an iterative construction/refinement scheme is used which exploits both passive and active sensing for representing the object surfaces. The bounding volume description of the object is first constructed using multiple occluding contours which are acquired through passive sensing. The bounding volume is then refined using the partial surface structures inferred from active sensing. The final surface structure is recorded in a memory efficient data structure where the surface contours in a set of parallel planar cross sections are recorded. We expect this approach to be widely applicable in the field of robotics, geometric modeling and factory automation."
            },
            "slug": "On-modelling-3-D-objects-using-multiple-sensory-Wang-Aggarwal",
            "title": {
                "fragments": [],
                "text": "On modelling 3-D objects using multiple sensory data"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A new algorithm for modelling 3-D objects using information gathered from both active and passive sensing mechanisms is introduced and is expected to be widely applicable in the field of robotics, geometric modeling and factory automation."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. 1987 IEEE International Conference on Robotics and Automation"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 630502,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a931f49f06fdc0c5b339de9fb8e9e496ac98a300",
            "isKey": false,
            "numCitedBy": 337,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Multilevel-computational-processes-for-visual-Terzopoulos",
            "title": {
                "fragments": [],
                "text": "Multilevel computational processes for visual surface reconstruction"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 121754405,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1af25c587e3d7f664c9f14ed8494315418cae7f1",
            "isKey": false,
            "numCitedBy": 224,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "Almost nothing can be deduced about a general three-dimensional surface given only its occluding contours in an image, yet contour information is easily and effectively used by us to infer the shape of a surface. Therefore, implicit in the perceptual analysis of occluding contour must lie various assumptions about the viewed surfaces. The assumptions that seem most natural are (a) that the distinction between convex and concave segments reflects real properties of the viewed surface; and (b) that contiguous portions of contour arise from contiguous parts of the viewed surface – i. e. there are no invisible obscuring edges. It is proved that, for smooth surfaces, these assumptions are essentially equivalent to assuming that the viewed surface is a generalized cone. Methods are defined for finding the axis of such a cone, and for segmenting a surface constructed of several cones into its components, whose axes can then be found separately. These methods provide one link between an uninterpreted figure extracted from an image, and the 3-D representation theory of Marr & Nishihara (1977)."
            },
            "slug": "Analysis-of-occluding-contour-Marr",
            "title": {
                "fragments": [],
                "text": "Analysis of occluding contour"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 11715506,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "23844026bf30e29e2edf6f00dd1f167260d4db1e",
            "isKey": false,
            "numCitedBy": 901,
            "numCiting": 51,
            "paperAbstract": {
                "fragments": [],
                "text": "Inverse problems, such as the reconstruction problems that arise in early vision, tend to be mathematically ill-posed. Through regularization, they may be reformulated as well-posed variational principles whose solutions are computable. Standard regularization theory employs quadratic stabilizing functionals that impose global smoothness constraints on possible solutions. Discontinuities present serious difficulties to standard regularization, however, since their reconstruction requires a precise spatial control over the smoothing properties of stabilizers. This paper proposes a general class of controlled-continuity stabilizers which provide the necessary control over smoothness. These nonquadratic stabilizing functionals comprise multiple generalized spline kernels combined with (noncontinuous) continuity control functions. In the context of computational vision, they may be thought of as controlled-continuity constraints. These generic constraints are applicable to visual reconstruction problems that involve both continuous regions and discontinuities, for which global smoothness constraints fail."
            },
            "slug": "Regularization-of-Inverse-Visual-Problems-Involving-Terzopoulos",
            "title": {
                "fragments": [],
                "text": "Regularization of Inverse Visual Problems Involving Discontinuities"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This paper proposes a general class of controlled-continuity stabilizers which provide the necessary control over smoothness in visual reconstruction problems that involve both continuous regions and discontinuities, for which global smoothness constraints fail."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144862593"
                        ],
                        "name": "R. Nevatia",
                        "slug": "R.-Nevatia",
                        "structuredName": {
                            "firstName": "Ramakant",
                            "lastName": "Nevatia",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Nevatia"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10878162,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4dd5ad87ccf9b8493625e38514e2f37ab9ce99cb",
            "isKey": false,
            "numCitedBy": 389,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Description-and-Recognition-of-Curved-Objects-Nevatia-Binford",
            "title": {
                "fragments": [],
                "text": "Description and Recognition of Curved Objects"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72419159"
                        ],
                        "name": "R. Brooks",
                        "slug": "R.-Brooks",
                        "structuredName": {
                            "firstName": "Rodney",
                            "lastName": "Brooks",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Brooks"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2011964,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b8831f3095686131a98731d6806abdc75c6baebd",
            "isKey": false,
            "numCitedBy": 809,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Symbolic-Reasoning-Among-3-D-Models-and-2-D-Images-Brooks",
            "title": {
                "fragments": [],
                "text": "Symbolic Reasoning Among 3-D Models and 2-D Images"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144994682"
                        ],
                        "name": "A. Pentland",
                        "slug": "A.-Pentland",
                        "structuredName": {
                            "firstName": "Alex",
                            "lastName": "Pentland",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pentland"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18591318,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9724150c393af0364be3eacf027dc4ab3658e924",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "A shape representation is presented that has been shown competent to accurately describe an extensive variety of natural forms (e g., people, mountains, clouds, trees), as well as man-made forms, in a succinct and natural manner. The approach taken in this representational system is to describe scene structure at a scale that is similar to our naive perceptual notion of \"a part,\" by use of descriptions that reflect a possible formative history of the object, e.g., how the object might have been constructed from lumps of clay. For this representation to be useful it must be possible to recover such descriptions from image data; we show that the primitive elements of this representation may be recovered in an overconstrained and therefore potentially reliable manner."
            },
            "slug": "Parts:-Structured-Descriptions-of-Shape-Pentland",
            "title": {
                "fragments": [],
                "text": "Parts: Structured Descriptions of Shape"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "A shape representation is presented that has been shown competent to accurately describe an extensive variety of natural forms, as well as man-made forms, in a succinct and natural manner."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691804"
                        ],
                        "name": "D. Ballard",
                        "slug": "D.-Ballard",
                        "structuredName": {
                            "firstName": "Dana",
                            "lastName": "Ballard",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ballard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40196005"
                        ],
                        "name": "O. A. Kimball",
                        "slug": "O.-A.-Kimball",
                        "structuredName": {
                            "firstName": "O.",
                            "lastName": "Kimball",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. A. Kimball"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 12752117,
            "fieldsOfStudy": [
                "Engineering",
                "Physics"
            ],
            "id": "9e53c6e29fe888c848728fc31a7754da3c5da8b8",
            "isKey": false,
            "numCitedBy": 175,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Rigid-body-motion-from-depth-and-optical-flow-Ballard-Kimball",
            "title": {
                "fragments": [],
                "text": "Rigid body motion from depth and optical flow"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784213"
                        ],
                        "name": "R. Bajcsy",
                        "slug": "R.-Bajcsy",
                        "structuredName": {
                            "firstName": "Ruzena",
                            "lastName": "Bajcsy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bajcsy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1709131"
                        ],
                        "name": "F. Solina",
                        "slug": "F.-Solina",
                        "structuredName": {
                            "firstName": "Franc",
                            "lastName": "Solina",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Solina"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60809436,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "be7d48e11700ebcf2d2eacbec9de608e5a7a8121",
            "isKey": false,
            "numCitedBy": 190,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Categories and shape prototypes are considered for a class ob object recognition problems where rigid and detailed object models are not available or do not apply. We propose a modeling system for generic objects to recognize different objects from the same category with only one generic model. We base our design of the modeling system upon the current psychological theories of categorization and human visual perception. The representation consists of a prototype represented by parts and their configuration. Parts are modeled by superquadric volumetric primitives which can be combined via Boolean operations to form objects. Variations between objects within a category are described by changes in structure and shape deformations of prototypical parts. Recovery of deformed supequadric models from sparse 3-D points is developed and some results are shown."
            },
            "slug": "Three-dimensional-object-representation-revisited-Bajcsy-Solina",
            "title": {
                "fragments": [],
                "text": "Three dimensional object representation revisited"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A modeling system for generic objects to recognize different objects from the same category with only one generic model is proposed, based upon the current psychological theories of categorization and human visual perception."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144862593"
                        ],
                        "name": "R. Nevatia",
                        "slug": "R.-Nevatia",
                        "structuredName": {
                            "firstName": "Ramakant",
                            "lastName": "Nevatia",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Nevatia"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11319244,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b6adfcae8d0207bac17e185cf5a5b07a893935d8",
            "isKey": false,
            "numCitedBy": 143,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Depth-measurement-by-motion-stereo-Nevatia",
            "title": {
                "fragments": [],
                "text": "Depth measurement by motion stereo"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2902049"
                        ],
                        "name": "Bruce G. Baumgart",
                        "slug": "Bruce-G.-Baumgart",
                        "structuredName": {
                            "firstName": "Bruce",
                            "lastName": "Baumgart",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bruce G. Baumgart"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 58817445,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dacb05677b4a25a06c77a080f7caa0baf5b7aef6",
            "isKey": false,
            "numCitedBy": 441,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The main contribution of this thesis is the development of a three dimensional geometric modeling system for application to computer vision. In computer vision geometric models provide a goal for descriptive image analysis, an origin for verification image synthesis, and a context for spatial problem solving. Some of the design ideas presented have been implemented in two programs named GEOMED and CRE; the programs are demonstrated in situations involving camera motion relative to a static world."
            },
            "slug": "Geometric-modeling-for-computer-vision.-Baumgart",
            "title": {
                "fragments": [],
                "text": "Geometric modeling for computer vision."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "In computer vision geometric models provide a goal for descriptive image analysis, an origin for verification image synthesis, and a context for spatial problem solving."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1721434"
                        ],
                        "name": "W. Martin",
                        "slug": "W.-Martin",
                        "structuredName": {
                            "firstName": "Worthy",
                            "lastName": "Martin",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Martin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705627"
                        ],
                        "name": "J. Aggarwal",
                        "slug": "J.-Aggarwal",
                        "structuredName": {
                            "firstName": "Jake",
                            "lastName": "Aggarwal",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Aggarwal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 11773996,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "38b7a7b3a62a4b610e0c247dc0a152d0b0cab477",
            "isKey": false,
            "numCitedBy": 498,
            "numCiting": 52,
            "paperAbstract": {
                "fragments": [],
                "text": "Occluding contours from an image sequence with view-point specifications determine a bounding volume approximating the object generating the contours. The initial creation and continual refinement of the approximation requires a volumetric representation that facilitates modification yet is descriptive of surface detail. The ``volume segment'' representation presented in this paper is one such representation."
            },
            "slug": "Volumetric-Descriptions-of-Objects-from-Multiple-Martin-Aggarwal",
            "title": {
                "fragments": [],
                "text": "Volumetric Descriptions of Objects from Multiple Views"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The ``volume segment'' representation presented in this paper is a volumetric representation that facilitates modification yet is descriptive of surface detail in a bounding volume approximating the object generating the contours."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2453875"
                        ],
                        "name": "Gerald J. Agin",
                        "slug": "Gerald-J.-Agin",
                        "structuredName": {
                            "firstName": "Gerald",
                            "lastName": "Agin",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gerald J. Agin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1347440,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "11c227d1636ecc90b60e0162fdd87f625649e962",
            "isKey": false,
            "numCitedBy": 413,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "A ranging system, consisting of a laser, computer-controlled optical deflection assembly, and TV camera, obtains three-dimensional images of curved solid objects. The object is segmented into parts by grouping parallel traces obtained from the ranging system. Making use of the property of generalized translational invariance, the parts are described in terms of generalized cylinders, consisting of a space curve, or axis, and a circular cross section function on this axis."
            },
            "slug": "Computer-Description-of-Curved-Objects-Agin-Binford",
            "title": {
                "fragments": [],
                "text": "Computer Description of Curved Objects"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "A ranging system, consisting of a laser, computer-controlled optical deflection assembly, and TV camera, obtains three-dimensional images of curved solid objects, which are segmented into parts by grouping parallel traces obtained from the ranging system."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 86323799,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d83ecd7a588461dc13f579d723801a46b90144cb",
            "isKey": false,
            "numCitedBy": 132,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "For human vision to be explained by a computational theory, the first question is plain: What are the problems that the brain solves when we see? It is argued that vision is the construction of efficient symbolic descriptions from images of the world. An important aspect of vision is therefore the choice of representations for the different kinds of information in a visual scene. An overall framework is suggested for extracting shape information from images, in which the analysis proceeds through three representations: (1) the primal sketch, which makes explicit the intensity changes and local two-dimensional geometry of an image; (2) the 2 1/2-D sketch, which is a viewer-centred representation of the depth, orientation and discontinuities of the visible surfaces; and (3) the 3-D model representation, which allows an object-centred description of the three-dimensional structure and organization of a viewed shape. The critical act in formulating computational theories for processes capable of constructing these representations is the discovery of valid constraints on the way the world behaves, that provide sufficient additional information to allow recovery of the desired characteristic. Finally, once a computational theory for a process has been formulated, algorithms for implementing it may be designed, and their performance compared with that of the human visual processor."
            },
            "slug": "Visual-Information-Processing:-The-Structure-and-of-Marr",
            "title": {
                "fragments": [],
                "text": "Visual Information Processing: The Structure and Creation of Visual Representations"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "An overall framework is suggested for extracting shape information from images, in which the analysis proceeds through three representations: the primal sketch, which makes explicit the intensity changes and local two-dimensional geometry of an image, the 2 1/2-D sketch, and the 3-D model representation, which allows an object-centred description of the three-dimensional structure and organization of a viewed shape."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144901036"
                        ],
                        "name": "H. Nishihara",
                        "slug": "H.-Nishihara",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Nishihara",
                            "middleNames": [
                                "Keith"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nishihara"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 43759520,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bdf9b8f4de001f5f37bc844efbce1210d581d599",
            "isKey": false,
            "numCitedBy": 2323,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The human visual process can be studied by examining the computational problems associated with deriving useful information from retinal images. In this paper, we apply this approach to the problem of representing three-dimensional shapes for the purpose of recognition. 1. Three criteria, accessibility, scope and uniqueness, and stability and sensitivity, are presented for judging the usefulness of a representation for shape recognition. 2. Three aspects of a representation’s design are considered, (i) the representation’s coordinate system, (ii) its primitives, which are the primary units of shape information used in the representation, and (iii) the organization the representation imposes on the information in its descriptions. 3. In terms of these design issues and the criteria presented, a shape representation for recognition should: (i) use an object-centred coordinate system, (ii) include volumetric primitives of varied sizes, and (iii) have a modular organization. A representation based on a shape’s natural axes (for example the axes identified by a stick figure) follows directly from these choices. 4. The basic process for deriving a shape description in this representation must involve: (i) a means for identifying the natural axes of a shape in its image and (ii) a mechanism for transforming viewer-centred axis specifications to specifications in an object-centred coordinate system. 5. Shape recognition involves: (i) a collection of stored shape descriptions, and (ii) various indexes into the collection that allow a newly derived description to be associated with an appropriate stored description. The most important of these indexes allows shape recognition to proceed conservatively from the general to the specific based on the specificity of the information available from the image. 6. New constraints supplied by a conservative recognition process can be used to extract more information from the image. A relaxation process for carrying out this constraint analysis is described."
            },
            "slug": "Representation-and-recognition-of-the-spatial-of-Marr-Nishihara",
            "title": {
                "fragments": [],
                "text": "Representation and recognition of the spatial organization of three-dimensional shapes"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "The human visual process can be studied by examining the computational problems associated with deriving useful information from retinal images by applying the approach to the problem of representing three-dimensional shapes for the purpose of recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "120971205"
                        ],
                        "name": "M. Brady",
                        "slug": "M.-Brady",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brady",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brady"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3358140"
                        ],
                        "name": "H. Asada",
                        "slug": "H.-Asada",
                        "structuredName": {
                            "firstName": "Haruo",
                            "lastName": "Asada",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Asada"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 120786138,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4d1fab670ebf598792e849a3bb72fd065e059407",
            "isKey": false,
            "numCitedBy": 394,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "We introduce a novel representation of two-dimensional shape that we call smoothed local symmetries (SLS). Smoothed local symmetries represent both the bounding contour of a shape fragment and the region that it occupies. In this paper we develop the main features of the SLS repre sentation and describe an implemented algorithm that com putes it. The performance of the algorithm is illustrated for a set of tools. We conclude by sketching a method for deter mining the articulation of a shape into subshapes."
            },
            "slug": "Smoothed-Local-Symmetries-and-Their-Implementation-Brady-Asada",
            "title": {
                "fragments": [],
                "text": "Smoothed Local Symmetries and Their Implementation"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The main features of the SLS repre sentation are developed and an implemented algorithm that com putes it is described and illustrated for a set of tools."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144994682"
                        ],
                        "name": "A. Pentland",
                        "slug": "A.-Pentland",
                        "structuredName": {
                            "firstName": "Alex",
                            "lastName": "Pentland",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pentland"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118487941,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5bcac6339cdd4d429f8e104291ad9a37c1ce8283",
            "isKey": false,
            "numCitedBy": 270,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : We argue that most natural objects have a part structure that we can recover from image data and thus use as the basis for \"general-purpose\" recognition. We describe a \"parts\" representation that is fairly general purpose, despite having only a small number of parameters. Having this expressive power captured by a small number of parameters allows us to approach the problem of recovering an object's part structure by use of minimal length encoding. We present several examples of recovering part structure using various types of range imagery to show that the recovery procedure is robust."
            },
            "slug": "Recognition-by-Parts-Pentland",
            "title": {
                "fragments": [],
                "text": "Recognition by Parts"
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "It is argued that most natural objects have a part structure that the authors can recover from image data and thus use as the basis for \"general-purpose\" recognition and a \"parts\" representation is described that is fairly general purpose, despite having only a small number of parameters."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2073332481"
                        ],
                        "name": "Barr",
                        "slug": "Barr",
                        "structuredName": {
                            "firstName": "",
                            "lastName": "Barr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Barr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9389947,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0eafafc3bb6c0cf90f18c8c63c7b3fc492a5c56c",
            "isKey": false,
            "numCitedBy": 1018,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "A new and powerful family of parametric shapes extends the basic quadric surfaces and solids, yielding a variety of useful forms."
            },
            "slug": "Superquadrics-and-Angle-Preserving-Transformations-Barr",
            "title": {
                "fragments": [],
                "text": "Superquadrics and Angle-Preserving Transformations"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "A new and powerful family of parametric shapes is introduced that extends the basic quadric surfaces and solids, yielding a variety of useful forms."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Computer Graphics and Applications"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2389532"
                        ],
                        "name": "D. Regan",
                        "slug": "D.-Regan",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Regan",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Regan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4849212"
                        ],
                        "name": "K. Beverley",
                        "slug": "K.-Beverley",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Beverley",
                            "middleNames": [
                                "I"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Beverley"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 53192554,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "e20df2abc49e05a8804f49d2ccd19a4b86f1acb0",
            "isKey": false,
            "numCitedBy": 217,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Binocular-and-monocular-stimuli-for-motion-in-and-Regan-Beverley",
            "title": {
                "fragments": [],
                "text": "Binocular and monocular stimuli for motion in depth: Changing-disparity and changing-size feed the same motion-in-depth stage"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2465976"
                        ],
                        "name": "M. Fischler",
                        "slug": "M.-Fischler",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Fischler",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Fischler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3394928"
                        ],
                        "name": "R. Elschlager",
                        "slug": "R.-Elschlager",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Elschlager",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Elschlager"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14554383,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "719da2a0ddd38e78151e1cb2db31703ea8b2e490",
            "isKey": false,
            "numCitedBy": 1527,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "The primary problem dealt with in this paper is the following. Given some description of a visual object, find that object in an actual photograph. Part of the solution to this problem is the specification of a descriptive scheme, and a metric on which to base the decision of \"goodness\" of matching or detection."
            },
            "slug": "The-Representation-and-Matching-of-Pictorial-Fischler-Elschlager",
            "title": {
                "fragments": [],
                "text": "The Representation and Matching of Pictorial Structures"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "The primary problem dealt with in this paper is the specification of a descriptive scheme, and a metric on which to base the decision of \"goodness\" of matching or detection."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145787720"
                        ],
                        "name": "J. Webb",
                        "slug": "J.-Webb",
                        "structuredName": {
                            "firstName": "Jon",
                            "lastName": "Webb",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Webb"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705627"
                        ],
                        "name": "J. Aggarwal",
                        "slug": "J.-Aggarwal",
                        "structuredName": {
                            "firstName": "Jake",
                            "lastName": "Aggarwal",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Aggarwal"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17734852,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "1e78e906a25b864c8a4ef63c79cf75af79548bb1",
            "isKey": false,
            "numCitedBy": 74,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The human visual system's ability to extract three-dimensional structure from a two-dimensional source is the key to automatic interpretation of structure from motion."
            },
            "slug": "Visually-Interpreting-the-Motion-of-Objects-in-Webb-Aggarwal",
            "title": {
                "fragments": [],
                "text": "Visually Interpreting the Motion of Objects in Space"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The human visual system's ability to extract three-dimensional structure from a two-dimensional source is the key to automatic interpretation of structure from motion."
            },
            "venue": {
                "fragments": [],
                "text": "Computer"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691087"
                        ],
                        "name": "J. Hollerbach",
                        "slug": "J.-Hollerbach",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Hollerbach",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hollerbach"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119030960,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "778dac9d5f1a52a1d1cf7c01f9e5354e6cb2ec82",
            "isKey": false,
            "numCitedBy": 52,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Hierarchical-Shape-Description-of-Objects-by-and-of-Hollerbach",
            "title": {
                "fragments": [],
                "text": "Hierarchical Shape Description of Objects by Selection and Modification of Prototypes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59788142,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "33eb296bcf0f4592496c9bd3cce6f62ba7b162ad",
            "isKey": false,
            "numCitedBy": 61,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Matching-deformable-models-to-images:-Direct-and-Terzopoulos",
            "title": {
                "fragments": [],
                "text": "Matching deformable models to images: Direct and iterative solutions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 32,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Constraints-on-Deformable-Models:-Recovering-3D-and-Terzopoulos-Witkin/0cca1fa6cf2ac8d9e43d5d7d69f96fc178000c2a?sort=total-citations"
}