{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784213"
                        ],
                        "name": "R. Bajcsy",
                        "slug": "R.-Bajcsy",
                        "structuredName": {
                            "firstName": "Ruzena",
                            "lastName": "Bajcsy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bajcsy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 57024668,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bd30c9fafb8df0605b68ec64013e8feb39e68bb4",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The work deals with computer analysis of textured outdoor scenes involving grass, trees, water and clouds. Descriptions of texture are formalized from natural language descriptions; local descriptors are obtained from the directional and nondirectional components of the Fourier transform power spectrum. Analytic expressions are obtained for orientation, contrast, size, spacing, and in periodic cases, the locations of the choice of sizes is made by a simple higher-level program. The process of region growing is represented by a sheaf-theoretical model which formalizes the operation of pasting local structure (over a window) into global structure (over a region). Programs were implemented which form regions of similar color and similar texture with respect to the local descriptors."
            },
            "slug": "Computer-identification-of-textured-visual-scenes-Bajcsy",
            "title": {
                "fragments": [],
                "text": "Computer identification of textured visual scenes"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "The work deals with computer analysis of textured outdoor scenes involving grass, trees, water and clouds using a sheaf-theoretical model which formalizes the operation of pasting local structure into global structure over a region."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2056740769"
                        ],
                        "name": "E. Deutsch",
                        "slug": "E.-Deutsch",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Deutsch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Deutsch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16996196"
                        ],
                        "name": "N. Belknap",
                        "slug": "N.-Belknap",
                        "structuredName": {
                            "firstName": "N.",
                            "lastName": "Belknap",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Belknap"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 3083767,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "62df24c9cf4dfebb8717e28ca3d40374c1864399",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Texture-descriptors-using-neighborhood-information-Deutsch-Belknap",
            "title": {
                "fragments": [],
                "text": "Texture descriptors using neighborhood information"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Graph. Image Process."
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46878739"
                        ],
                        "name": "L. Krakauer",
                        "slug": "L.-Krakauer",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Krakauer",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Krakauer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124261676,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e3c63e00a1bc1042406ef08775b6482ccda0fa1b",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A method is presented for the visual analysis of objects by computer. It is particularly well suited for opaque objects with smoothly curved surfaces. The method extracts information about the object''s surface properties, including measures of its specularity, texture, and regularity. It also aids in determining the object''s shape. The application of this method to a simple recognition task, (the recognition of fruit) is discussed. The results on a more complex smoothly curved object, a human face, are also considered."
            },
            "slug": "COMPUTER-ANALYSIS-OF-VISUAL-PROPERTIES-OF-CURVED-Krakauer",
            "title": {
                "fragments": [],
                "text": "COMPUTER ANALYSIS OF VISUAL PROPERTIES OF CURVED OBJECTS"
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "A method is presented for the visual analysis of objects by computer that is particularly well suited for opaque objects with smoothly curved surfaces, including measures of its specularity, texture, and regularity."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3144171"
                        ],
                        "name": "K. Shanmugam",
                        "slug": "K.-Shanmugam",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Shanmugam",
                            "middleNames": [
                                "Sam"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Shanmugam"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1686153"
                        ],
                        "name": "I. Dinstein",
                        "slug": "I.-Dinstein",
                        "structuredName": {
                            "firstName": "Its'hak",
                            "lastName": "Dinstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Dinstein"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 206786900,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1fdb62555eb650662dbe2a6f3985d390861597c2",
            "isKey": false,
            "numCitedBy": 19249,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Texture is one of the important characteristics used in identifying objects or regions of interest in an image, whether the image be a photomicrograph, an aerial photograph, or a satellite image. This paper describes some easily computable textural features based on gray-tone spatial dependancies, and illustrates their application in category-identification tasks of three different kinds of image data: photomicrographs of five kinds of sandstones, 1:20 000 panchromatic aerial photographs of eight land-use categories, and Earth Resources Technology Satellite (ERTS) multispecial imagery containing seven land-use categories. We use two kinds of decision rules: one for which the decision regions are convex polyhedra (a piecewise linear decision rule), and one for which the decision regions are rectangular parallelpipeds (a min-max decision rule). In each experiment the data set was divided into two parts, a training set and a test set. Test set identification accuracy is 89 percent for the photomicrographs, 82 percent for the aerial photographic imagery, and 83 percent for the satellite imagery. These results indicate that the easily computable textural features probably have a general applicability for a wide variety of image-classification applications."
            },
            "slug": "Textural-Features-for-Image-Classification-Haralick-Shanmugam",
            "title": {
                "fragments": [],
                "text": "Textural Features for Image Classification"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "These results indicate that the easily computable textural features based on gray-tone spatial dependancies probably have a general applicability for a wide variety of image-classification applications."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Syst. Man Cybern."
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 118841991,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "37a608c85cf95a8203d88c242d7fd0d9489d31d5",
            "isKey": false,
            "numCitedBy": 612,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "A method will be described for finding the shape of a smooth opaque object from a monocular image, given a knowledge of the surface photometry, the position of the light-source and certain auxiliary information to resolve ambiguities. This method is complementary to the use of stereoscopy which relies on matching up sharp detail and will fail on smooth objects. Until now the image processing of single views has been restricted to objects which can meaningfully be considered two-dimensional or bounded by plane surfaces. It is possible to derive a first-order non-linear partial differential equation in two unknowns relating the intensity at the image points to the shape of the object. This equation can be solved by means of an equivalent set of five ordinary differential equations. A curve traced out by solving this set of equations for one set of starting values is called a characteristic strip. Starting one of these strips from each point on some initial curve will produce the whole solution surface. The initial curves can usually be constructed around so-called singular points. A number of applications of this method will be discussed including one to lunar topography and one to the scanning electron microscope. In both of these cases great simplifications occur in the equations. A note on polyhedra follows and a quantitative theory of facial make-up is touched upon. An implementation of some of these ideas on the PDP-6 computer with its attached image-dissector camera at the Artificial Intelligence Laboratory will be described, and also a nose-recognition program."
            },
            "slug": "SHAPE-FROM-SHADING:-A-METHOD-FOR-OBTAINING-THE-OF-A-Horn",
            "title": {
                "fragments": [],
                "text": "SHAPE FROM SHADING: A METHOD FOR OBTAINING THE SHAPE OF A SMOOTH OPAQUE OBJECT FROM ONE VIEW"
            },
            "tldr": {
                "abstractSimilarityScore": 95,
                "text": "A method will be described for finding the shape of a smooth opaque object from a monocular image, given a knowledge of the surface photometry, the position of the light-source and certain auxiliary information to resolve ambiguities, complementary to the use of stereoscopy."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30457331"
                        ],
                        "name": "J. Gibson",
                        "slug": "J.-Gibson",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Gibson",
                            "middleNames": [
                                "Jerome"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gibson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5823304,
            "fieldsOfStudy": [
                "History"
            ],
            "id": "0616b9b4a45baa9c4d546f2fa13631a709b08690",
            "isKey": false,
            "numCitedBy": 118,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The undersigned (“Proposer”) submits this proposal (this “Proposal”) in response to that certain Request for Proposals (as amended, the “RFP”) issued by the Indiana Finance Authority (“IFA”), an independent public corporation created under the laws of the State of Indiana, dated October 15, 2013, to develop, design, construct, finance, operate and maintain the I-69 Section 5 project (the “Project”), as more specifically described herein and in the documents provided with the RFP (the “RFP Documents”). Initially capitalized terms not otherwise defined herein shall have the meanings set forth in the RFP and the RFP Documents."
            },
            "slug": "What-is-a-form-Gibson",
            "title": {
                "fragments": [],
                "text": "What is a form?"
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "This proposal is submitted in response to that certain Request for Proposals issued by the Indiana Finance Authority to develop, design, construct, finance, operate and maintain the I-69 Section 5 project."
            },
            "venue": {
                "fragments": [],
                "text": "Psychological review"
            },
            "year": 1951
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144592244"
                        ],
                        "name": "J. Tenenbaum",
                        "slug": "J.-Tenenbaum",
                        "structuredName": {
                            "firstName": "Jay",
                            "lastName": "Tenenbaum",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tenenbaum"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 56560647,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f3805df1f1c15e31d561054964f14124380a4a7f",
            "isKey": false,
            "numCitedBy": 248,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Accommodation-in-computer-vision-Tenenbaum",
            "title": {
                "fragments": [],
                "text": "Accommodation in computer vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 7,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Texture-gradient-as-a-depth-cue-Bajcsy-Lieberman/b1b1d7da789f84cb9edb58a65c76ba749a9aaa26?sort=total-citations"
}