{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707107"
                        ],
                        "name": "J. Movshon",
                        "slug": "J.-Movshon",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Movshon",
                            "middleNames": [
                                "Anthony"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Movshon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1935795"
                        ],
                        "name": "I. Thompson",
                        "slug": "I.-Thompson",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Thompson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Thompson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5659259,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d435143b4a7b2d7c56a696504e87db39157c3449",
            "isKey": false,
            "numCitedBy": 963,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "1. We have examined the responses of simple cells in the cat's atriate cortex to visual patterns that were designed to reveal the extent to which these cells may be considered to sum light‐evoked influences linearly across their receptive fields. We used one‐dimensional luminance‐modulated bars and grating as stimuli; their orientation was always the same as the preferred orientation of the neurone under study. The stimuli were presented on an oscilloscope screen by a digital computer, which also accumulated neuronal responses and controlled a randomized sequence of stimulus presentations. 2. The majority of simple cells respond to sinusoidal gratings that are moving or whose contrast is modulated in time in a manner consistent with the hypothesis that they have linear spatial summation. Their responses to moving gratings of all spatial frequencies are modulated in synchrony with the passage of the gratings' bars across their receptive fields, and they do not produce unmodulated responses even at the highest spatial frequencies. Many of these cells respond to temporally modulated stationary gratings simply by changing their response amplitude sinusoidally as the spatial phase of the grating the grating is varied. Nonetheless, their behavior appears to indicate linear spatial summation, since we show in an Appendix that the absence of a 'null' phase in a visual neurone need not indicate non‐linear spatial summation, and further that a linear neurone lacking a 'null' phase should give responses of the form that we have observed in this type of simple cell. 3. A minority of simple cells appears to have significant non‐linearities of spatial summation. These neurones respond to moving gratings of high spatial frequency with a partially or totally unmodulated elevation of firing rate. They have no 'null' phases when tested with stationary gratings, and reveal their non‐linearity by giving responses to gratings of some spatial phases that are composed partly or wholly of even harmonics of the stimulus frequency ('on‐off' responses). 4. We compared simple receptive fields with their sensitivity to sinusoidal gratings of different spatial frequencies. Qualitatively, the most sensitive subregions of simple cells' receptive fields are roughly the same width as the individual bars of the gratings to which they are most sensitive. Quantitatively, their receptive field profiles measured with thin stationary lines, agree well with predicted profiles derived by Fourier synthesis of their spatial frequency tuning curves."
            },
            "slug": "Spatial-summation-in-the-receptive-fields-of-simple-Movshon-Thompson",
            "title": {
                "fragments": [],
                "text": "Spatial summation in the receptive fields of simple cells in the cat's striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "The responses of simple cells in the cat's atriate cortex to visual patterns that were designed to reveal the extent to which these cells may be considered to sum light‐evoked influences linearly across their receptive fields are examined."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707107"
                        ],
                        "name": "J. Movshon",
                        "slug": "J.-Movshon",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Movshon",
                            "middleNames": [
                                "Anthony"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Movshon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1935795"
                        ],
                        "name": "I. Thompson",
                        "slug": "I.-Thompson",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Thompson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Thompson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 46,
                                "start": 26
                            }
                        ],
                        "text": "2 of the preceding paper (Movshon et al. 1978a). with the less well modulated response (cell A) is represented by the open symbols and arrow; that with the more obviously modulated response (cell B) is represented by the filled symbols and arrow."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 230,
                                "start": 210
                            }
                        ],
                        "text": "Note also that the two-line interaction profiles may exhibit subsidiary 'ripples' similar to those seen in the line-weighting functions of simple cells having relatively narrow spatial frequency tuning curves (Movshon et al. 1978a)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 57,
                                "start": 37
                            }
                        ],
                        "text": "2 plots the relative modulation (see Movshon et al. 1978a) present in the responses of the two complex cells shown in Fig."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 165,
                                "start": 145
                            }
                        ],
                        "text": "4 presents data comparing the size of the most sensitive region of complex cells' receptive fields with the neurone's optimum spatial frequency (Movshon et al. 1978b)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 275,
                                "start": 255
                            }
                        ],
                        "text": "The non-linearity exhibited by cell B was similar in form to that shown by Y cells in the retina and lateral geniculate body (Enroth-Cugell & Robson, 1966; Shapley & Hochstein, 1975; Hochstein & Shapley, 1976a), and by non-linear simple cells in area 17 (Movshon et al. 1978a)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 119,
                                "start": 100
                            }
                        ],
                        "text": "COMPLEX CELLS IN CAT STRIATE CORTEX of these regions; this is the case for simple cells in area 17 (Movshon et al. 1978 a)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 296,
                                "start": 276
                            }
                        ],
                        "text": "…with spatial frequency tuning For those neurones for which we had obtained both line-weighting functions and spatial frequency tuning data, we were able to compare the two sets of information using Fourier analysis; the methods involved were detailed in the preceding paper (Movshon et al. 1978a)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 83,
                                "start": 63
                            }
                        ],
                        "text": "These were indentical to those detailed in the previous paper (Movshon et al. 1978a)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 43,
                                "start": 23
                            }
                        ],
                        "text": "In the previous paper (Movshon et al. 1978a) we demonstrated formally that a neurone that linearly sums light-evoked influences across its receptive field should COMPLEX CELLS IN CAT STRIATE CORTEX respond in a characteristic manner to stationary time-varying gratings as their spatial phase is…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 167,
                                "start": 147
                            }
                        ],
                        "text": "At neither spatial frequency was the phase dependence of the response as marked as it was for either the linear or non-linear type of simple cell (Movshon et al. 1978a)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 96
                            }
                        ],
                        "text": "The non-linearity observed in these cells was similar to that shown by non-linear simple cells (Movshon et al. 1978 a, Fig."
                    },
                    "intents": []
                }
            ],
            "corpusId": 7684023,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "83f9320a93b7c35a4d4791d4012898c9c25da8cc",
            "isKey": false,
            "numCitedBy": 670,
            "numCiting": 74,
            "paperAbstract": {
                "fragments": [],
                "text": "1. We have examined the spatial and temporal tuning properties of 238 cortical neurones, recorded using conventional techniques from acutely prepared anaesthetized cats. We determined spatial and temporal frequency tuning curves using sinusoidal grating stimuli presented to each neurone's receptive field by a digital computer on a cathode ray tube. 2. We measured tuning curves either by determining response amplitude as a function of spatial or temporal frequency, or by measuring contrast sensitivity (the inverse of the contrast of the grating that just elicited a detectable response). The two measures give very similar tuning curves in all cases. 3. We recorded from 184 neurones in area 17; of these 156 had receptive fields within 5 degrees of the area centralis. The range of preferred spatial frequency for these neurones was 0.3‐‐3 c/deg, and their spatial frequency tuning band widths varied from 0.7 to 3.2 octaves at half‐amplitude. The most common band width was roughly 1.3 octaves. Simple and complex cells in area 17 did not differ in their distributions of preferred spatial frequency, although complex cells were, on average, slightly less selective for spatial frequency than simple cells. 4. We recorded from fifty‐four neurones from area 18, and performed several experiments in which we recorded from corresponding portions of both area 17 and area 18 in the same electrode penetration. Neurones in area 18 preferred spatial frequencies that were, on average, one third as high as those preferred by area 17 neurones at the same retinal eccentricity. Thus the range of preferred spatial frequency in area eighteen cells having receptive fields within 5 deg of the area centralis was between less than 0.1 and 0.5 c/deg. The distributions of optimum spatial frequency in the two areas were practically non‐overlapping at eccentricities as high as 15 deg, the greatest eccentricity we examined. Neurones in area 18 were about as selective for spatial frequency as were neurones in area 17. 5. We determined temporal frequency tuning characteristics for some neurones from each area, using gratings that moved steadily across the screen. Neurones from area 17 all responded well to low temporal frequencies, and less well to higher frequencies (in excess of, usually, 2 or 4 Hz). In contrast, neurones recorded from area 18 sometimes had similar tuning properties, but more commonly showed a pronounced reduction in response as the temporal frequency was moved either above or below some optimum value (usually 2‐‐8 Hz). 6. We conclude from these results that areas 17 and 18 act in parallel to process different aspects of the visual information relayed from the retina via the lateral geniculate complex. Some or all of the differences between the areas may be attributable to the predominance of Y cell input to area 18 and the predominance of X cell input to area 17..."
            },
            "slug": "Spatial-and-temporal-contrast-sensitivity-of-in-17-Movshon-Thompson",
            "title": {
                "fragments": [],
                "text": "Spatial and temporal contrast sensitivity of neurones in areas 17 and 18 of the cat's visual cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is concluded that areas 17 and 18 act in parallel to process different aspects of the visual information relayed from the retina via the lateral geniculate complex."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1392809739"
                        ],
                        "name": "S. Hochstein",
                        "slug": "S.-Hochstein",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Hochstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Hochstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1994273"
                        ],
                        "name": "R. Shapley",
                        "slug": "R.-Shapley",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Shapley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Shapley"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18798412,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c39202e78bc577398f7cf8762157c1bb47087ed1",
            "isKey": false,
            "numCitedBy": 451,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The mechanism which makes Y cells different from X cells was investigated. 2. Spatial frequency contrast sensitivity functions for the fundamental and second harmonic responses of Y cells to alternating phase gratings were determined. 3. The fundamental spatial frequency response was predicted by the Fourier transform of the sensitivity profile of the Y cell. The high spatial frequency cut‐off of a Y cell's fundamental response was in this way related to the centre of the cell's receptive field. 4. The second harmonic response of a Y cell did not cut off at such a low spatial frequency as the fundamental response. This result indicated that the source of the second harmonic was a spatial subunit of the receptive field smaller in spatial extent than the centre. 5. Contrast sensitivity vs. spatial phase for a Y cell was measured under three conditions: a full grating, a grating seen through a centrally located window, a grating partially obscured by a visual shutter. The 2nd/1st harmonic sensitivity ratio went down with the window and up with the shutter. These results implied that the centre of Y cells was linear and also that the nonlinear subunits extended into the receptive field surround. 6. Spatial localization of the nonlinear subunits was determined by means of a spatial dipole stimulus. The nonlinear subunits overlapped the centre and surround of the receptive field and extended beyond both. 7. The nature of the Y cell nonlinearity was found to be rectification, as determined from measurements of the second harmonic response as a function of contrast. 8. Spatial models for the Y cell receptive field are proposed."
            },
            "slug": "Linear-and-nonlinear-spatial-subunits-in-Y-cat-Hochstein-Shapley",
            "title": {
                "fragments": [],
                "text": "Linear and nonlinear spatial subunits in Y cat retinal ganglion cells."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The nature of the Y cell nonlinearity was found to be rectification, as determined from measurements of the second harmonic response as a function of contrast."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1925241"
                        ],
                        "name": "D. Pollen",
                        "slug": "D.-Pollen",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Pollen",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pollen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1992154"
                        ],
                        "name": "S. Ronner",
                        "slug": "S.-Ronner",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Ronner",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ronner"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16084115,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "957273ad4cf63ce1b9da51ddd1192782ab9889d1",
            "isKey": false,
            "numCitedBy": 79,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Complex cells in cortical areas 17 and 18 of the cat have been studied in response to narrow slits and edges moving across the receptive field in the preferred direction and also to stationary slits of different widths. 2. Average response histograms, recorded as a narrow slit was moved across the receptive field, displayed a periodic series of peaks above a base line level. The response histogram for most area 17 and 18 cells contained five principal peaks; sometimes one or two weaker peaks were present at receptive field borders. The histogram for one cell located at the area 17–18 border showed thirteen distinct peaks. Periodic response patterns were also generated as an extended edge was moved across the receptive field. Plots of cell responses versus slit width for stationary slits of different widths also indicated periodic response pattern. 3. The accuracy of determining the preferred slit orientation was the single most important requirement for demonstrating the periodic response pattern. Significant changes in the appearance of the periodic pattern occurred even upon 5 degrees rotations away from the preferred orientation. 4. Average response histograms were also studied over a wide range of moving slit velocities. The number of peaks across corresponding spacings within the recewptive field remained constant over a range of velocities. Response amplitudes, however, were velocity dependent. Thus the response peaks remain associated with fixed positions within visual space independent of stimulus velocity, even though temporal as well as spatial factors may be involved in response selectivity and the periodic modulation. The most striking periodic response histograms were generated at the velocities which produced the greatest cell firing rates. Area 17 complex cells responded well to velocities of less than 0–5 degrees to 6–0 degrees/sec, but cells in area 18 generally required higher velocities, sometimes as high as 20 degrees‐‐30 degrees/sec, for a good response. 5. Spatial frequencies for the periodic component of the receptive field for area 17 cells in the central visual area covered a range of three octaves up to 5 cycles/degree, and area 18 cells included another octave on the low frequency side. The spatial frequency of a cell was found to be roughly inversely proportional to the receptive field width. Only a small sample of area 18 cells was studied, but these cells tended to represent low spatial frequencies and to respond selectively to high velocity stimuli..."
            },
            "slug": "Periodic-excitability-changes-across-the-receptive-Pollen-Ronner",
            "title": {
                "fragments": [],
                "text": "Periodic excitability changes across the receptive fields of complex cells in the striate and parastriate cortex of the cat."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The most striking periodic response histograms were generated at the velocities which produced the greatest cell firing rates, and these cells tended to represent low spatial frequencies and to respond selectively to high velocity stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1392809739"
                        ],
                        "name": "S. Hochstein",
                        "slug": "S.-Hochstein",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Hochstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Hochstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1994273"
                        ],
                        "name": "R. Shapley",
                        "slug": "R.-Shapley",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Shapley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Shapley"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 25039608,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1e206cfddba7f3e8ef6d24e21a186e2fbe68fc7b",
            "isKey": false,
            "numCitedBy": 528,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "The classification of cat retinal ganglion cells as X or Y on the basis of linearity or nonlinearity of spatial summation has been confirmed and extended. Recordings were taken from optic tract fibres of anaesthetized, paralysed cats. 2. When an alternating phase sine wave grating was used as a stimulus, X cells had null positions and Y cells responded at all positions of the grating. 3. These results did not depend on the temporal wave form or the temporal frequency of pattern alternation over a wide range. 4. At high spatial frequencies for the particular cell, a Y cell gave abig 'on‐off' response, or frequency doubling, at all positions of the grating, while an X cell did not. 5. The use of contrast sensitivity versus spatial phase also served to differentiate the two cell types. With an alternating sine grating stimulus X cells had a sinusoidal dependence on spatial phase, while each Y cell's sensitivity depended in a complicated manner on spatial phase. 6. Sensitivity versus spatial phase for different Fourier components of the neural response also separated the two classes of cells. Significant second harmonic distortion was present in Y cells. The second harmonic component was spatial phase insensitive, and became dominant at high spatial frequencies. 7. The maximum of the 2nd/1st harmonic ratio was taken as an index of nonlinearity. X cells always had a nonlinearity index less than 1 while in Y cells this index always exceeded 1. 8. Response to spots, diffuse light and drifting gratings were compared to the nonlinearity index as a basis for classifying cells. The nonlinearity index was most reliable because it was least dependent on retinal eccentricity."
            },
            "slug": "Quantitative-analysis-of-retinal-ganglion-cell-Hochstein-Shapley",
            "title": {
                "fragments": [],
                "text": "Quantitative analysis of retinal ganglion cell classifications."
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "The classification of cat retinal ganglion cells as X or Y on the basis of linearity or non linearity of spatial summation has been confirmed and extended and response to spots, diffuse light and drifting gratings were compared to the nonlinearity index as a basis for classifying cells."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33760699"
                        ],
                        "name": "B. Finlay",
                        "slug": "B.-Finlay",
                        "structuredName": {
                            "firstName": "Barbara",
                            "lastName": "Finlay",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Finlay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1993085645"
                        ],
                        "name": "P. Schiller",
                        "slug": "P.-Schiller",
                        "structuredName": {
                            "firstName": "P",
                            "lastName": "Schiller",
                            "middleNames": [
                                "H"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Schiller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6849044"
                        ],
                        "name": "S. Volman",
                        "slug": "S.-Volman",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Volman",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Volman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17439001,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0d27151446996bfd854a74d13d6f8d0b19768077",
            "isKey": false,
            "numCitedBy": 96,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The receptive-field properties of corticotectal cells in the monkey's striate cortex were studied using stationary and moving stimuli. These cells were identified by antidromic activation from the superior colliculus. 2. Corticotectal cells form a relatively homogeneous group. They are found primarily in layers 5 and 6. These cells can usually be classified as CX-type cells but show broader orientation tuning, larger receptive fields, higher spontaneous activity, and greater binocular activation than CX-type cells do in general. A third of the corticotectal cells were direction selective. 3. These results suggest that the cortical input to the superior colliculus is not directly responsible for the receptive-field properties of collicular cells. We propose that this input has a gating function in contributing to the control of the downflow of excitation from the superficial to the deep layers of the colliculus."
            },
            "slug": "Quantitative-studies-of-single-cell-properties-in-Finlay-Schiller",
            "title": {
                "fragments": [],
                "text": "Quantitative studies of single-cell properties in monkey striate cortex. IV. Corticotectal cells."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The results suggest that the cortical input to the superior colliculus is not directly responsible for the receptive-field properties of collicular cells, and it is proposed that this input has a gating function in contributing to the control of the downflow of excitation from the superficial to the deep layers of the Colliculus."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3459632"
                        ],
                        "name": "L. Palmer",
                        "slug": "L.-Palmer",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Palmer",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Palmer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4291951"
                        ],
                        "name": "A. Rosenquist",
                        "slug": "A.-Rosenquist",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Rosenquist",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenquist"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37194343,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "9d05ede22c076feaf49bed9741065fc6026f28aa",
            "isKey": false,
            "numCitedBy": 241,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-receptive-fields-of-single-striate-corical-Palmer-Rosenquist",
            "title": {
                "fragments": [],
                "text": "Visual receptive fields of single striate corical units projecting to the superior colliculus in the cat."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707107"
                        ],
                        "name": "J. Movshon",
                        "slug": "J.-Movshon",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Movshon",
                            "middleNames": [
                                "Anthony"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Movshon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14802103,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6fb0106b149a4f3173a13c1539f763218330b3f5",
            "isKey": false,
            "numCitedBy": 214,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The activity of single units was recorded from the striate cortex (area 17) of anaesthetized, paralysed cats. Responses to stimuli moving at different velocities were examined. 2. Peak evoked firing frequency, rather than fotal evoked spikes, is used throughout as a measure of response. The former mea‐ure gives curves of response vs. velocity that correlate well with curves of contrast sensitivity vs. velocity, wheras the latter does not. 3. Cortical receptive fields were classified according to the criteria of Hubel & Wiesel. Simple cells were found to prefer lower velocities (mean 2‐2 deg sec‐1) than complex cells (mean 18–8 deg sec‐1). The response of simple cells to stimuli moving faster than 20 deg sec‐1 is generally poor; complex cells usually discharge briskly to these speeds. 4. Cells classified as hypercomplex by the end‐inhibition criterion were further chara‐terized as type I or type II, according to the suggestion of Dreher (1972). Type I units are indistinguishable from simple cells in their velocity tuning, and type II units equally clearly resemble complex cells. These results are therefor consistent with Dreher's sbudivision. 5. Teh selectivity of cells for velocity is variable but can be quite marked. The average selectivities of simple and complex cells are not significantly different. There is an inverse correlation between preferred velocity and the sharpness of velocity selectivity for simple cells; no trend is apparent for other cell types. 6. No clear correlation is observed between the velocity preferances of units and their degree of direction selectivity, or receptive field arrangement. Simple cells with ‘sustainef’ temporal responses to flashed stimuli tend to prefer slower rates of movement than ‘transient’ ones, and to be less selective for velocity. 7. The results for different cortical cell‐types are compared with the velocity tuning of X‐ and Y‐cells in the lateral geniculate nucleus."
            },
            "slug": "The-velocity-tuning-of-single-units-in-cat-striate-Movshon",
            "title": {
                "fragments": [],
                "text": "The velocity tuning of single units in cat striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "There is an inverse correlation between preferred velocity and the sharpness of velocity selectivity for simple cells; no trend is apparent for other cell types; no clear correlation is observed between the velocity preferances of units and their degree of direction selectivity, or receptive field arrangement."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12432,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1994273"
                        ],
                        "name": "R. Shapley",
                        "slug": "R.-Shapley",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Shapley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Shapley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1392809739"
                        ],
                        "name": "S. Hochstein",
                        "slug": "S.-Hochstein",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Hochstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Hochstein"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7078731,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "2120be8cf3022e3a7b30bb10cafbd8ff0091c88e",
            "isKey": false,
            "numCitedBy": 91,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "VISUAL perception can be viewed as a transformation and a distortion of the spatial patterns which exist in the outside world. The transformation of external objects into neural images is accomplished by the summation of excitatory and inhibitory influences over the visual field of each neurone. Distortion occurs when the neural response is not simply proportional to the sum of excitation and inhibition because of nonlinear mechanisms in spatial summation. If the responses of all visual cells were distorted by such nonlinear summation, fine visual discriminations like those necessary for reading Nature would be impossible. Nonlinear mechanisms do however, seem to be important in one class of visual neurone, perhaps for signalling change or motion in the external world. We have attempted to understand the importance of the different kinds of spatial summation by studying single cells in the cat visual system."
            },
            "slug": "Visual-spatial-summation-in-two-classes-of-cells-Shapley-Hochstein",
            "title": {
                "fragments": [],
                "text": "Visual spatial summation in two classes of geniculate cells"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This work has attempted to understand the importance of the different kinds of spatial summation by studying single cells in the cat visual system, perhaps for signalling change or motion in the external world."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16283223"
                        ],
                        "name": "H. J. Wyatt",
                        "slug": "H.-J.-Wyatt",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Wyatt",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. J. Wyatt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30715060"
                        ],
                        "name": "N. Daw",
                        "slug": "N.-Daw",
                        "structuredName": {
                            "firstName": "N.",
                            "lastName": "Daw",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Daw"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44493312,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d8a5c3266a6d8549019d4824a4cb424486dac748",
            "isKey": false,
            "numCitedBy": 169,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The receptive fields of directionally sensitive ganglion cells in the rabbit retina were analyzed. Several types of experiment showed that each point within the receptive field of the cell is inhibited by a fairly wide area of points around it, lying on each side of the preferred-null axis as well as along the preferred-null axis in the preferred direction. The excitatory or responsive receptive field of these cells has an inhibitory surround: this inhibitory surround appears to be simply an extension of the inhibition that occurs within the center of the receptive field. Points toward the edge of the responsive receptive field are inhibited from an area around them which extends into the center of the receptive field and also into the inhibitory surround. Directionally sensitive retinal ganglion cells respond to moving spots better than to moving bars. This is particularly true for objects moved perpendicularly to the preferred-null axis. In some cells a spot moved perpendicularly to the preferred-null axis will give a substantial response, whereas a bar moved in the same direction will give no response at all. This phenomenon can be explained by the inhibitory area which surrounds each point within the receptive field; since this inhibitory area is asymmetrical, it is also responsible for the cell's directional sensitivity. When two bars oriented perpendicular to the preferred null axis are flashed, one after the other, the response to the second bar is nearly always reduced by the presentation of the first bar. This is true for many temporal and spatial sequences corresponding to movement in the preferred direction, as well as those corresponding to movement in the null direction. However, there are temporal and spatial sequences, corresponding to movement in the preferred direction, for which the response to the second bar is unaffected by the presentation of the first bar. The time delay for this does not vary from cell to cell--it is always approximately 20 ms for on-off directionally sensitive cells and approximately 180 ms for on directionally sensitive cells. The spatial separation does vary from cell to cell, between 0.13 degrees and 1.2 degrees in 11 on-off directionally sensitive cells. This spatial separation, which gives linear summation of the response to two bars flashed 20 ms apart in the preferred direction, is correlated with the speed of movement which gives the best response for a bar moved through the receptive field in the preferred direction."
            },
            "slug": "Directionally-sensitive-ganglion-cells-in-the-for-Wyatt-Daw",
            "title": {
                "fragments": [],
                "text": "Directionally sensitive ganglion cells in the rabbit retina: specificity for stimulus direction, size, and speed."
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "The receptive fields of directionally sensitive ganglion cells in the rabbit retina were analyzed and it was shown that each point within the receptive field of the cell is inhibited by a fairly wide area of points around it, lying on each side of the preferred-null axis as well as along the preferred -null axis in the preferred direction."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712899"
                        ],
                        "name": "W. Singer",
                        "slug": "W.-Singer",
                        "structuredName": {
                            "firstName": "Wolf",
                            "lastName": "Singer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Singer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46839935"
                        ],
                        "name": "F. Tretter",
                        "slug": "F.-Tretter",
                        "structuredName": {
                            "firstName": "Felix",
                            "lastName": "Tretter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Tretter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153937877"
                        ],
                        "name": "M. Cynader",
                        "slug": "M.-Cynader",
                        "structuredName": {
                            "firstName": "Max",
                            "lastName": "Cynader",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Cynader"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28149733,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "68d00bb6eabf92639927a7ca5fad435c39770f4f",
            "isKey": false,
            "numCitedBy": 229,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The purposes of this study were 1) to relate the receptive-field characteristics of area 17 cells to their afferent and efferent connections, and 2) to obtain quantitative data from area 17 neurons for later comparison with area 18 cells. Intra- and extracellular recordings were obtained in paralyzed preparations which were anesthetized with nitrous oxide. The connectivities of the recorded cells were determined from responses to electrical stimulation of afferent and efferent pathways. In parallel to the classification of units as simple and complex cells, the receptive fields were grouped in four classes according to the spatial arrangement of on- and off-areas; class I, fields with exclusive on- or off-areas; class II, fields with spatially separate on- and off-areas; class III, fields with mixed on-off areas; class IV, fields which could not be mapped with stationary stimuli. The results from electrical stimulation suggest two major classes of cells: cells in the first group are driven mainly or exclusively by LGN afferents. They rarely receive additional excitation from intrinsic or callosal afferents and rarely possess corticofugal axons. Cells in the second group receive either converging inputs from LGN afferents and further intrinsic afferents or only from intrinsic afferents. They frequently received additional input from callosum and from recurrent collaterals of corticofugal axons. They project subcortically more often than cells in the first group. Cells in both groups can be driven either by X- or Y-type afferents. Cells in the first group have mainly class I and class II fields or simple fields, whereas the neurons in the second group have mainly class III and class IV fields or complex fields. Thus, simple and complex cells differ in their connectivity patterns, but the discriminative parameter is neither the selective connection to the X- or the Y-system nor, in a strict sense, the synaptic distance from subcortical input. From the combined consideration of receptive-field properties and connectivity patterns it is concluded that class I and class II cells or simple cells are concerned mainly with the primary analysis of subcortical activity, whereas class III and class IV cells or complex cells perform a correlative analysis between highly convergent activity from extrinsic and intrinsic afferents."
            },
            "slug": "Organization-of-cat-striate-cortex:-a-correlation-Singer-Tretter",
            "title": {
                "fragments": [],
                "text": "Organization of cat striate cortex: a correlation of receptive-field properties with afferent and efferent connections."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "From the combined consideration of receptive-field properties and connectivity patterns it is concluded that class I and class II cells or simple cells are concerned mainly with the primary analysis of subcortical activity, whereas class III and class IV cells or complex cells perform a correlative analysis between highly convergent activity from extrinsic and intrinsic afferents."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2160697"
                        ],
                        "name": "R. C. Emerson",
                        "slug": "R.-C.-Emerson",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Emerson",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. C. Emerson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2962919"
                        ],
                        "name": "G. Gerstein",
                        "slug": "G.-Gerstein",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Gerstein",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Gerstein"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24736936,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "06d0a4cf634fce1e329f68f23976c7f9261e8628",
            "isKey": false,
            "numCitedBy": 124,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Directionally asymmetric (DA) units respond preferentially to one direction of image movement. If that preferred direction is independent of stimulus contrast then the DA unit is considered directionally selective (DS). We have analyzed receptive-field (RF) properties of striate units with these properties by presenting bar-shaped stimuli that are moved in a stepwise sequence. Short interstimulus durations for certain ranges of step size elicit DA responses similar to those from smooth movement, while still allowing identification of on- and off-components of the response. 2. We have been able to isolate three mechanisms underlying DA and DS. The simplest, superposition, explains the dependence of preferred direction on stimulus contrast found in some DA units. It relies completely on asymmetries in static RF regions to provide an advantage for one direction of image motion by means of the simultaneity of image elements leaving an apparently inhibitory region and entering an excitatory one. 3. For all DA and DS units we have encountered forward inhibition of otherwise excitatory influences that reduces the responsiveness in the antipreferred direction. The spatial specificity of inhibitory target RF regions and the nonlinearity of the effect suggest that lateral inhibition may be transmitted via sequence-detecting subunits. 4. Units that do not show superposition in the preferred direction exhibit forward facilitation of responses in a nonlinear and target-specific way which suggests that facilitation may also be transmitted via sequence-detecting subunits. 5. Each of these mechanisms depends on short-lived influences that are laterally transmitted between 0.125 and 0.5 degrees in visual space. These spatial and temporal values are appropriate for the analysis of smooth movement by the visual system. 6. Stepwise movement sequences using dark bars on a bright background demonstrate for some DA units exactly the same mechanisms as demonstrated using bright-bar sequences in other units or, in the case of DS units, in the same units. In such DS units, which do not normally exhibit strong stationary RF asymmetries, differential sensitivity of the nonlinear DS mechanisms to stimulus elements of either contrast will yield an effective preferred movement direction for complex stimuli."
            },
            "slug": "Simple-striate-neurons-in-the-cat.-II.-Mechanisms-Emerson-Gerstein",
            "title": {
                "fragments": [],
                "text": "Simple striate neurons in the cat. II. Mechanisms underlying directional asymmetry and directional selectivity."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The simplest, superposition, explains the dependence of preferred direction on stimulus contrast found in some DA units, and differential sensitivity of the nonlinear DS mechanisms to stimulus elements of either contrast will yield an effective preferred movement direction for complex stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1993085645"
                        ],
                        "name": "P. Schiller",
                        "slug": "P.-Schiller",
                        "structuredName": {
                            "firstName": "P",
                            "lastName": "Schiller",
                            "middleNames": [
                                "H"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Schiller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33760699"
                        ],
                        "name": "B. Finlay",
                        "slug": "B.-Finlay",
                        "structuredName": {
                            "firstName": "Barbara",
                            "lastName": "Finlay",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Finlay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6849044"
                        ],
                        "name": "S. Volman",
                        "slug": "S.-Volman",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Volman",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Volman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15167329,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5c214d8da3406d4c3f1de47ed6f3bc43ee92c877",
            "isKey": false,
            "numCitedBy": 344,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Quantitative analyses of orientation specificity and ocular dominance were carried out in striate cortex of the rhesus monkey. 2. Sharpness of orientation selectivity was greater for simple (S type) than for complex (CX type) cells. CX-type cells became more broadly tuned in the deeper cortical layers: S-type cells were equally well tuned throughout the cortex. 3. Sharpness of orientation selectivity for S-type cells was similar at all retinal eccentricities studied (0 degrees - 20 degrees from the fovea):in CX-type cells orientation selectivity decreased slightly with increasing eccentricity. 4. The orientation tuning of binocular cells was similar when mapped separately through each eye. 5. Orientation selectivity and direction selectivity are independent of each other, suggesting that separate neural mechanisms give rise to them. 6. More CX-type cells can be binocularly activated than S-type cells (88% versus 49%). The ocular dominance of S-type cells is similar in all cortical layers: for CX-type cells there is an increase in the number of cells in ocular-dominance category 4 in layers 5 and 6."
            },
            "slug": "Quantitative-studies-of-single-cell-properties-in-Schiller-Finlay",
            "title": {
                "fragments": [],
                "text": "Quantitative studies of single-cell properties in monkey striate cortex. II. Orientation specificity and ocular dominance."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Orientation selectivity and direction selectivity are independent of each other, suggesting that separate neural mechanisms give rise to them."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1703155"
                        ],
                        "name": "A. Goodwin",
                        "slug": "A.-Goodwin",
                        "structuredName": {
                            "firstName": "Antony",
                            "lastName": "Goodwin",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Goodwin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2088293"
                        ],
                        "name": "G. Henry",
                        "slug": "G.-Henry",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Henry",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Henry"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 168,
                                "start": 147
                            }
                        ],
                        "text": "…interactions involved in direction selectivity are inhibitory in nature (Barlow & Levick, 1965; Wyatt & Daw, 1975; Goodwin, Henry & Bishop, 1975; Goodwin & Henry, 1975; Sillito, 1975; Emerson & Gerstein, 1977 ), our evidence suggests that there are strong facilitatory interactions across the…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1567686,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e32c0a5bbc0a3bb513ac6f467b602b17276fe216",
            "isKey": false,
            "numCitedBy": 73,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Following our earlier study on direction selectivity in simple cells (5), the present findings on complex cells made it possible to compare the direction selectivity in the two types of striate cell. Common properties were found in the dimension of the smallest stimulus displacement giving a direction-selective response and in the role of inhibition in suppressing the response as the stimulus moved in the nonpreferred direction. However, the effectiveness of this inhibition varied in the two cell types since it suppressed both driven and spontaneous activity in the simple cell, but only driven firing in the complex cell. It is argued that direction selectivity must enter the response before the complex cell if the inhibition responsible for it's generation fails to influence the spontaneous activity of the cell. The consequences of this finding are considered in the terms of parallel or sequential processing of visual information in striate cortex."
            },
            "slug": "Direction-selectivity-of-complex-cells-in-a-with-Goodwin-Henry",
            "title": {
                "fragments": [],
                "text": "Direction selectivity of complex cells in a comparison with simple cells."
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "The findings on complex cells made it possible to compare the direction selectivity in the two types of striate cell and found common properties in the dimension of the smallest stimulus displacement giving a direction-selective response and in the role of inhibition."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6110079"
                        ],
                        "name": "A. Sillito",
                        "slug": "A.-Sillito",
                        "structuredName": {
                            "firstName": "Adam",
                            "lastName": "Sillito",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Sillito"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 31317699,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0b2100ebde0bc8331dc0479b52fe95c5db872720",
            "isKey": false,
            "numCitedBy": 329,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "1. These experiments have investigated the contribution made by GABA‐mediated inhibitory processes to the orientation tuning of complex cells in the cat's striate cortex. The GABA antagonist bicuculline has been ionophoretically applied to individual complex cells and the modifications produced in their orientation tuning documented. 2. In terms of the type of change produced in orientation tuning by the application of bicuculline, it seems that there are two categories of complex cells. 3. In one of these categories the orientation selectivity was eliminated during bicuculline application. The excitatory input to these cells would therefore appear to be non‐orientation specific. Their orientation selectivity is presumably generated by a GABA‐mediated inhibitory input. 4. In the other category of complex cells, although the orientation selectivity was decreased during bicuculline application, the cells retained a preference for a range of orientations that was generally centred around the original optimal orientation. It is suggested that for these cells the inhibitory input enhances the orientation tuning of an excitatory input that is already broadly orientation tuned. 5. Comparison of normal orientation tuning curves with those observed during the application of bicuculline provides a basis for estimating the orientation tuning of the GABA‐mediated inhibitory input. In all cases, it is clear that at normal resting discharge levels, orientations either side of the optimal, and not those centred on the optimal, generate the most powerful inhibitory input. 6. These results would seem to be best explained by inhibitory interconnexions between cortical columns sensitive to different orientations. This type of lateral interaction between columns may serve to enhance the contrast in the orientation domain for the cortical representation of a specific stimulus orientation. 7. Increasing the resting discharge level of a complex cell, without blocking the action of GABA appeared to increase the gain of the inhibitory mechanisms acting on the cell. The normal excitatory responses to optimal or near optimal orientations were greatly reduced, or replaced by inhibitory responses, and non‐optimal orientations produced only inhibitory responses. These inhibitory effects were blocked on the context of other observations in the literature. It is tentatively suggested that the interneurones providing the inhibitory drive to complex cells receive an input from recurrent collaterals of the recipient complex cells. Their other inputs would derive from neighbouring colums and from the afferent input to the parent column. The inputs from neighbouring columns would mediate the lateral inhibitory interactions in the orientation domain, and the recurrent collateral feed‐back the decreased responsiveness at high resting discharge levels."
            },
            "slug": "Inhibitory-mechanisms-influencing-complex-cell-and-Sillito",
            "title": {
                "fragments": [],
                "text": "Inhibitory mechanisms influencing complex cell orientation selectivity and their modification at high resting discharge levels."
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "It is suggested that for complex cells the inhibitory input enhances the orientation tuning of an excitatory input that is already broadly orientation tuned, and this type of lateral interaction between columns may serve to enhance the contrast in the orientation domain for the cortical representation of a specific stimulus orientation."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32056095"
                        ],
                        "name": "C. Gilbert",
                        "slug": "C.-Gilbert",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Gilbert",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Gilbert"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 31178862,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b83b8b4232d9c4ce8461c7acc21630e2cbf644c4",
            "isKey": false,
            "numCitedBy": 673,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Cells in area 17 of the cat visual cortex were studied with a view towards correlating receptive field properties with layering. A number of receptive field parameters were measured for all units, and nearly every unit was marked with a microlesion to determine accurately the layer in which it was found."
            },
            "slug": "Laminar-differences-in-receptive-field-properties-Gilbert",
            "title": {
                "fragments": [],
                "text": "Laminar differences in receptive field properties of cells in cat primary visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "Cells in area 17 of the cat visual cortex were studied with a view towards correlating receptive field properties with layering to determine accurately the layer in which it was found."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48526970"
                        ],
                        "name": "W. Reichardt",
                        "slug": "W.-Reichardt",
                        "structuredName": {
                            "firstName": "Werner",
                            "lastName": "Reichardt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Reichardt"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28594271,
            "fieldsOfStudy": [
                "Biology",
                "Computer Science"
            ],
            "id": "73b211cb9e09e00d94ceeb5c2ad91bebd3c855f3",
            "isKey": false,
            "numCitedBy": 240,
            "numCiting": 95,
            "paperAbstract": {
                "fragments": [],
                "text": "Visual information processing in the nervous system of flies begins with a large array of photoreceptors, which transduce a light intensity pattern, and culminates in a behavioural response that depends on that pattern. In the previous paper we have given a quantitative description of visual control of flight orientation in the fly. This description can account for fixation, tracking and some instances of spontaneous pattern preference behaviour. The phenomenological theory outlines the basic logical organization of the visual control system of the fly. It requires the neural network between the receptors and the flight muscles to perform two main computations on the visual input. One computation extracts movement information (the term r (ψ)ψ b of the phenomenological equation). The other provides position information (the term D (ψ))."
            },
            "slug": "Visual-control-of-orientation-behaviour-in-the-fly.-Poggio-Reichardt",
            "title": {
                "fragments": [],
                "text": "Visual control of orientation behaviour in the fly. Part II. Towards the underlying neural interactions."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The phenomenological theory outlines the basic logical organization of the visual control system of the fly and describes the neural network between the receptors and the flight muscles to perform two main computations on the visual input."
            },
            "venue": {
                "fragments": [],
                "text": "Quarterly reviews of biophysics"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2088293"
                        ],
                        "name": "G. Henry",
                        "slug": "G.-Henry",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Henry",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Henry"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145606123"
                        ],
                        "name": "P. O. Bishop",
                        "slug": "P.-O.-Bishop",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Bishop",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. O. Bishop"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6323916"
                        ],
                        "name": "B. Dreher",
                        "slug": "B.-Dreher",
                        "structuredName": {
                            "firstName": "Bogdan",
                            "lastName": "Dreher",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Dreher"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 29973732,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "886c49b9ba1b0a87764dc6979dde52e4ff964775",
            "isKey": false,
            "numCitedBy": 143,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Orientation,-axis-and-direction-as-stimulus-for-Henry-Bishop",
            "title": {
                "fragments": [],
                "text": "Orientation, axis and direction as stimulus parameters for striate cells."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1407756324"
                        ],
                        "name": "C. Enroth-Cugell",
                        "slug": "C.-Enroth-Cugell",
                        "structuredName": {
                            "firstName": "Christina",
                            "lastName": "Enroth-Cugell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Enroth-Cugell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 154,
                                "start": 142
                            }
                        ],
                        "text": "The non-linearity exhibited by cell B was similar in form to that shown by Y cells in the retina and lateral geniculate body (Enroth-Cugell & Robson, 1966; Shapley & Hochstein, 1975; Hochstein & Shapley, 1976a), and by non-linear simple cells in area 17 (Movshon et al. 1978a)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 3052969,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c6609ae352d9e1c99530136e41798f337496ff27",
            "isKey": false,
            "numCitedBy": 2635,
            "numCiting": 52,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "slug": "The-contrast-sensitivity-of-retinal-ganglion-cells-Enroth-Cugell-Robson",
            "title": {
                "fragments": [],
                "text": "The contrast sensitivity of retinal ganglion cells of the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30715060"
                        ],
                        "name": "N. Daw",
                        "slug": "N.-Daw",
                        "structuredName": {
                            "firstName": "N.",
                            "lastName": "Daw",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Daw"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16283223"
                        ],
                        "name": "H. J. Wyatt",
                        "slug": "H.-J.-Wyatt",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Wyatt",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. J. Wyatt"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 8343220,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "9643adba821645f50afb0845249494f9b1bf9358",
            "isKey": false,
            "numCitedBy": 133,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Kittens were reared in the dark from birth except for a period each day when they were put inside a stationary transparent cylinder, around which a drum with vertical black and white stripes on the inside, rotated in one direction. After the end of the period of exposure, we recorded a sample of single cells from their visual cortices, and analysed each cell for direction and orientation sensitivity and other properties. 2. Two kittens were placed inside the drum, rotating rightward, for 2 hr each seekday from 3 1/2 to 7 weeks of age. A greater proportion of the directionally sensitive cells in their cortices showed a preference for rightward movement. 3. Six other kittens were placed inside the drug for 1 hr each weekday from 2 to 12 weeks of age with the drum rotating leftward up to a particular changeover age, then rightward until 12 weeks. The changeover point occurred at 21, 26, 28, 33, 35 and 51 days for different kittens. A changeover earlier than 4 weeks of age led to a preponderance of cells preferring rightward movement. A changeover later than 5 weeks of age led to a preponderance of cells preferring leftward movement. Comparison of these results with others on monocular deprivation suggests that the peak of the critical period for directional deprivation may occur earlier than the peak of the critical period for monocular deprivation. 4. None of the samples of cells showed a preponderance of cells specific for vertical orientations. It is unclear whether this negative effect resulted from the presence of some horizontal contours during exposure, or some more fundamental cause."
            },
            "slug": "Kittens-reared-in-a-unidirectional-environment:-for-Daw-Wyatt",
            "title": {
                "fragments": [],
                "text": "Kittens reared in a unidirectional environment: evidence for a critical period."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Comparison of these results with others on monocular deprivation suggests that the peak of the critical period for directional deprivation may occur earlier than the rise in levels of directionally sensitive cells seen in animals reared in the dark from birth."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47020712"
                        ],
                        "name": "D. Rose",
                        "slug": "D.-Rose",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Rose",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Rose"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 294,
                                "start": 284
                            }
                        ],
                        "text": "…fail to show length summation within the receptive field and which have a much broader orientation tuning for a short bar than for a long bar might have geniculate afferents as their subunits as simple cells do not behave in this manner (Henry, Bishop & Dreher, 1974; Gilbert, 1977; Rose, 1977)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 22404052,
            "fieldsOfStudy": [
                "Physics",
                "Biology"
            ],
            "id": "c4b5da85b7677658174b354ffc21907d1c0bbde7",
            "isKey": false,
            "numCitedBy": 112,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The responses of single units in the cat's primary visual cortex to moving bars have been examined quantitatively as a function of bar length."
            },
            "slug": "Responses-of-single-units-in-cat-visual-cortex-to-a-Rose",
            "title": {
                "fragments": [],
                "text": "Responses of single units in cat visual cortex to moving bars of light as a function of bar length"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "The responses of single units in the cat's primary visual cortex to moving bars have been examined quantitatively as a function of bar length."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48526970"
                        ],
                        "name": "W. Reichardt",
                        "slug": "W.-Reichardt",
                        "structuredName": {
                            "firstName": "Werner",
                            "lastName": "Reichardt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Reichardt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45258548,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "b3e9b2b1ab38b5fa8b197aaf3d9889967aaaffc5",
            "isKey": false,
            "numCitedBy": 470,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A drum brake of the type comprising two brake shoes adapted to be spaced apart by a wheel cylinder. The distance between the ends of the shoes which cooperate with the wheel cylinder is automatically increased to compensate for the wear of the brake linings by an adjusting device which defines the rest position of the ends. The device comprises an extensible member of the screw and nut type, two annular resilient members which grippingly engage corresponding cylindrical portions of the extensible member, and a cam which rotates the resilient members one relative to the other in a first direction upon a brake application and in the opposite direction upon brake release to limit extension of the extensible member to a predetermined value."
            },
            "slug": "Visual-control-of-orientation-behaviour-in-the-fly.-Reichardt-Poggio",
            "title": {
                "fragments": [],
                "text": "Visual control of orientation behaviour in the fly. Part I. A quantitative analysis."
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "A drum brake of the type comprising two brake shoes adapted to be spaced apart by a wheel cylinder is automatically increased to compensate for the wear of the brake linings by an adjusting device which defines the rest position of the ends."
            },
            "venue": {
                "fragments": [],
                "text": "Quarterly reviews of biophysics"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3133875"
                        ],
                        "name": "C. Blakemore",
                        "slug": "C.-Blakemore",
                        "structuredName": {
                            "firstName": "Colin",
                            "lastName": "Blakemore",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Blakemore"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1967464"
                        ],
                        "name": "J. Pettigrew",
                        "slug": "J.-Pettigrew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Pettigrew",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pettigrew"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 19746685,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "4a0ea53dd9fa5c3c9a04ae8171c9618fb6e59a2a",
            "isKey": false,
            "numCitedBy": 1243,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Binocularly driven units were investigated in the cat's primary visual cortex."
            },
            "slug": "The-neural-mechanism-of-binocular-depth-Barlow-Blakemore",
            "title": {
                "fragments": [],
                "text": "The neural mechanism of binocular depth discrimination"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "Binocularly driven units were investigated in the cat's primary visual cortex in a bid to understand why cats have good night vision and why cats with poor vision have poor daytime vision."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1967
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 110,
                                "start": 89
                            }
                        ],
                        "text": "We have no compelling evidence of delayed inhibition of the kind found in rabbit retina (Barlow & Levick, 1965; Wyatt & Daw, 1975), although our data are based on a limited sample of neurones."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 107,
                                "start": 86
                            }
                        ],
                        "text": "It is of course possible to generate directional selectivity using either scheme (see Barlow & Levick, 1965), and it is interesting that Sillito (1975) found that complex cells' direction selectivity sometimes survived ionophoretic application of bicuculline."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 160,
                                "start": 138
                            }
                        ],
                        "text": "The existence of a number of discrete subunits within the receptive field of a complex cell invites comparison with the model proposed by Barlow & Levick (1965) to account for the directional movement selectivity of retinal ganglion cells in the rabbit."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 118
                            }
                        ],
                        "text": "In contrast to previous observation that the interactions involved in direction selectivity are inhibitory in nature (Barlow & Levick, 1965; Wyatt & Daw, 1975; Goodwin, Henry & Bishop, 1975; Goodwin & Henry, 1975; Sillito, 1975; Emerson & Gerstein, 1977 ), our evidence suggests that there are…"
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The mechanism of directionally selective units in the rabbit retina"
            },
            "venue": {
                "fragments": [],
                "text": "J . Physiol ."
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2088293"
                        ],
                        "name": "G. Henry",
                        "slug": "G.-Henry",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Henry",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Henry"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 7778693,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "f2b489d05da64e8b90140993e309f1dd75e8af21",
            "isKey": false,
            "numCitedBy": 214,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Receptive-field-classes-of-cells-in-the-striate-of-Henry",
            "title": {
                "fragments": [],
                "text": "Receptive field classes of cells in the striate cortex of the cat"
            },
            "venue": {
                "fragments": [],
                "text": "Brain Research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50123810"
                        ],
                        "name": "K. Toyama",
                        "slug": "K.-Toyama",
                        "structuredName": {
                            "firstName": "Keisuke",
                            "lastName": "Toyama",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Toyama"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144263085"
                        ],
                        "name": "K. Maekawa",
                        "slug": "K.-Maekawa",
                        "structuredName": {
                            "firstName": "Kyoji",
                            "lastName": "Maekawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Maekawa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50208431"
                        ],
                        "name": "T. Takeda",
                        "slug": "T.-Takeda",
                        "structuredName": {
                            "firstName": "Toshiaki",
                            "lastName": "Takeda",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Takeda"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2970810,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6295c60a9de134ec958474f3c629ad2c4b2b567b",
            "isKey": false,
            "numCitedBy": 33,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-analysis-of-neuronal-circuitry-for-two-types-of-Toyama-Maekawa",
            "title": {
                "fragments": [],
                "text": "An analysis of neuronal circuitry for two types of visual cortical neurones classified on the basis of their responses to photic stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "88899893"
                        ],
                        "name": "K. Hoffman",
                        "slug": "K.-Hoffman",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Hoffman",
                            "middleNames": [
                                "-P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Hoffman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2065204336"
                        ],
                        "name": "J. Stone",
                        "slug": "J.-Stone",
                        "structuredName": {
                            "firstName": "Jennifer",
                            "lastName": "Stone",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Stone"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 33202956,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7b07ac46c698061ac8b924b93637aab599f46fd5",
            "isKey": false,
            "numCitedBy": 272,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Conduction-velocity-of-afferents-to-cat-visual-a-Hoffman-Stone",
            "title": {
                "fragments": [],
                "text": "Conduction velocity of afferents to cat visual cortex: a correlation with cortical receptive field properties."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2088293"
                        ],
                        "name": "G. Henry",
                        "slug": "G.-Henry",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Henry",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Henry"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6323916"
                        ],
                        "name": "B. Dreher",
                        "slug": "B.-Dreher",
                        "structuredName": {
                            "firstName": "Bogdan",
                            "lastName": "Dreher",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Dreher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145606123"
                        ],
                        "name": "P. O. Bishop",
                        "slug": "P.-O.-Bishop",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Bishop",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. O. Bishop"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27515827,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "546e467e7bc548561b563f7421bc515e07c676f3",
            "isKey": false,
            "numCitedBy": 270,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Orientation-specificity-of-cells-in-cat-striate-Henry-Dreher",
            "title": {
                "fragments": [],
                "text": "Orientation specificity of cells in cat striate cortex."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1974
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 209,
                                "start": 195
                            }
                        ],
                        "text": "The non-linearity exhibited by cell B was similar in form to that shown by Y cells in the retina and lateral geniculate body (Enroth-Cugell & Robson, 1966; Shapley & Hochstein, 1975; Hochstein & Shapley, 1976a), and by non-linear simple cells in area 17 (Movshon et al. 1978a)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 135
                            }
                        ],
                        "text": "The simplest hypothesis is that the outputs of all subunits are rectified and added to provide the neurone's response (cf. Hochstein & Shapley, 1976b)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Linear and nonlinear spatial subunits in Y cat"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 181,
                                "start": 166
                            }
                        ],
                        "text": "The non-linearity exhibited by cell B was similar in form to that shown by Y cells in the retina and lateral geniculate body (Enroth-Cugell & Robson, 1966; Shapley & Hochstein, 1975; Hochstein & Shapley, 1976a), and by non-linear simple cells in area 17 (Movshon et al. 1978a)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Visual spatial summation in two"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 168,
                                "start": 147
                            }
                        ],
                        "text": "…interactions involved in direction selectivity are inhibitory in nature (Barlow & Levick, 1965; Wyatt & Daw, 1975; Goodwin, Henry & Bishop, 1975; Goodwin & Henry, 1975; Sillito, 1975; Emerson & Gerstein, 1977 ), our evidence suggests that there are strong facilitatory interactions across the…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Direction selectivity of simple cells : properties and mechanism"
            },
            "venue": {
                "fragments": [],
                "text": "J . Neurophysiol ."
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 129,
                                "start": 112
                            }
                        ],
                        "text": "We have no compelling evidence of delayed inhibition of the kind found in rabbit retina (Barlow & Levick, 1965; Wyatt & Daw, 1975), although our data are based on a limited sample of neurones."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 209,
                                "start": 192
                            }
                        ],
                        "text": "Not only is the structure of this model similar to our own, but there is also a degree of similarity in receptive field structure between cortical complex cells and rabbit ganglion cells (see Wyatt & Daw, 1975; Daw & Wyatt, 1976)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 158,
                                "start": 141
                            }
                        ],
                        "text": "In contrast to previous observation that the interactions involved in direction selectivity are inhibitory in nature (Barlow & Levick, 1965; Wyatt & Daw, 1975; Goodwin, Henry & Bishop, 1975; Goodwin & Henry, 1975; Sillito, 1975; Emerson & Gerstein, 1977 ), our evidence suggests that there are…"
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The contribution of inhibitory mechanisms to the receptive field properties of neurones in the cat ' s striate cortex"
            },
            "venue": {
                "fragments": [],
                "text": "J . Physiol"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The contribution of inhibitory mechanisms to the receptive field properties of neurones in the cat's striate cortex"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 291,
                                "start": 270
                            }
                        ],
                        "text": "Some cells behave as though they roughly add the response components produced by either eye alone (Pettigrew, Nikara & Bishop, 1968) whereas others show a tuning for binocular disparity much finer than suggested by their receptive field profiles (Pettigrew et al. 1968; Joshua & Bishop, 1970)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Receptive field disparities for central and peripheral vision and binocular interaction on single units in cat striate cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Expl Brain Re8"
            },
            "year": 1970
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 8,
            "methodology": 2,
            "result": 6
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 35,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Receptive-field-organization-of-complex-cells-in-Movshon-Thompson/d4977b31c9de761d3ec144d580c0976eca56c6e0?sort=total-citations"
}