{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105795"
                        ],
                        "name": "Michael J. Black",
                        "slug": "Michael-J.-Black",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Black",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Black"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 3
                            }
                        ],
                        "text": "In [6, 10], a robust error norm is used to reject data outliers which occur with gradient-based approaches ES(u) 5 O s[S F(1)8 O n[ Gs [(us 2 un)(2) 1 (vs 2 vn)2]G , (9) and robust regression was proposed in [6] to recover multiple motions within an image region."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 264,
                                "start": 261
                            }
                        ],
                        "text": "We have applied the framework to tion that surfaces have spatial extent and hence neigha variety of standard techniques for recovering optical flow; boring pixels in an image are likely to belong to the same these include correlation [7], area-based regression [6], surface."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 207,
                                "start": 204
                            }
                        ],
                        "text": "(13) There are numerous other r-functions that have been used in the computer vision literature, each with different The objective function for the regularization approach, motivations and strengths (see [6] for a review), but their with a gradient-based data term, becomes common property is their ability to reduce the effect of outliers."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 109
                            }
                        ],
                        "text": "The the next finer level only when it differs significantly from the current estimate at the fine level (see [6] for details)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 198,
                                "start": 191
                            }
                        ],
                        "text": "Since the motion of neighboring points on a correlation with regularization [9], and gradient-based ap- smooth rigid surface changes gradually, we can enforce an proaches with regularization [6, 10]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 118128199,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2cebe2f29bad4992abf3957e429409632e644204",
            "isKey": false,
            "numCitedBy": 210,
            "numCiting": 230,
            "paperAbstract": {
                "fragments": [],
                "text": "This thesis addresses the problem of recovering 2D image velocity, or optical flow, robustly over long image sequences. We develop a robust estimation framework for improving the reliability of motion estimates and an incremental minimization framework for recovering flow estimates over time. \nAttempts to improve the robustness of optical flow have focused on detecting and accounting for motion discontinuities in the optical flow field. We show that motion discontinuities are one example of a more general class of model violations and that by formulating the optical flow problem as one of robust estimation the problems posed by motion discontinuities can be reduced, and the violations can be detected. Additionally, robust estimation provides a powerful framework for early vision problems that generalizes the popular \"line process\" approaches. \nWe formulate a temporal continuity constraint, which reflects the fact that the motion of a surface changes gradually over time. We exploit this constraint to develop a new incremental minimization framework and show how it is related to standard recursive estimation techniques. Within this framework we implement two incremental algorithms for minimizing non-convex objective functions over time; Incremental Stochastic Minimization (ISM) and Incremental Graduated Non-Convexity (IGNC). \nWith this approach, motion estimates are always available; they are refined over time, the algorithm adapts to scene changes, and the amount of computation between frames is kept fixed. The psychophysical implications of temporal continuity are discussed and the power of the incremental minimization framework is demonstrated by extending image feature extraction over time."
            },
            "slug": "Robust-incremental-optical-flow-Black",
            "title": {
                "fragments": [],
                "text": "Robust incremental optical flow"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "This thesis addresses the problem of recovering 2D image velocity, or optical flow, robustly over long image sequences by formulating the optical flow problem as one of robust estimation the problems posed by motion discontinuities can be reduced, and the violations can be detected."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105795"
                        ],
                        "name": "Michael J. Black",
                        "slug": "Michael-J.-Black",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Black",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Black"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145981906"
                        ],
                        "name": "P. Anandan",
                        "slug": "P.-Anandan",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Anandan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Anandan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "We have explored the use of sto- Blake and Zisserman [12] developed a continuation chastic minimization techniques such as simulated anneal- method called Graduated Non-Convexity by constructing ing [9] but have found deterministic continuation methods a parameterized piecewise polynomial approximation to [10] to be more efficient and practical."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "In [6, 10], a robust error norm is used to reject data outliers which occur with gradient-based approaches ES(u) 5 O s[S F8 O n[ Gs [(us 2 un) 1 (vs 2 vn)2]G , (9) and robust regression was proposed in [6] to recover multiple motions within an image region."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Since the motion of neighboring points on a correlation with regularization [9], and gradient-based ap- smooth rigid surface changes gradually, we can enforce an proaches with regularization [6, 10]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14930294,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "65297c4e40fd9b8129fc593be1b8c8ef775c86ba",
            "isKey": false,
            "numCitedBy": 508,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors consider the problem of robustly estimating optical flow from a pair of images using a new framework based on robust estimation which addresses violations of the brightness constancy and spatial smoothness assumptions. They also show the relationship between the robust estimation framework and line-process approaches for coping with spatial discontinuities. In doing so, the notion of a line process is generalized to that of an outlier process that can account for violations in both the brightness and smoothness assumptions. A graduated non-convexity algorithm is presented for recovering optical flow and motion discontinuities. The performance of the robust formulation is demonstrated on both synthetic data and natural images.<<ETX>>"
            },
            "slug": "A-framework-for-the-robust-estimation-of-optical-Black-Anandan",
            "title": {
                "fragments": [],
                "text": "A framework for the robust estimation of optical flow"
            },
            "tldr": {
                "abstractSimilarityScore": 79,
                "text": "The authors consider the problem of robustly estimating optical flow from a pair of images using a new framework based on robust estimation which addresses violations of the brightness constancy and spatial smoothness assumptions and presents a graduated non-convexity algorithm for recovering optical flow and motion discontinuities."
            },
            "venue": {
                "fragments": [],
                "text": "1993 (4th) International Conference on Computer Vision"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1773422"
                        ],
                        "name": "J. Kearney",
                        "slug": "J.-Kearney",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Kearney",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kearney"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144816086"
                        ],
                        "name": "W. Thompson",
                        "slug": "W.-Thompson",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Thompson",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Thompson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145705840"
                        ],
                        "name": "Daniel Boley",
                        "slug": "Daniel-Boley",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Boley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Daniel Boley"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5836089,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "01417d2ec37c46e46fe77ccd54b89ef893513aaf",
            "isKey": false,
            "numCitedBy": 341,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "Multiple views of a scene can provide important information about the structure and dynamic behavior of three-dimensional objects. Many of the methods that recover this information require the determination of optical flow-the velocity, on the image, of visible points on object surfaces. An important class of techniques for estimating optical flow depend on the relationship between the gradients of image brightness. While gradient-based methods have been widely studied, little attention has been paid to accuracy and reliability of the approach. Gradient-based methods are sensitive to conditions commonly encountered in real imagery. Highly textured surfaces, large areas of constant brightness, motion boundaries, and depth discontinuities can all be troublesome for gradient-based methods. Fortunately, these problematic areas are usually localized can be identified in the image. In this paper we examine the sources of errors for gradient-based techniques that locally solve for optical flow. These methods assume that optical flow is constant in a small neighborhood. The consequence of violating in this assumption is examined. The causes of measurement errors and the determinants of the conditioning of the solution system are also considered. By understanding how errors arise, we are able to define the inherent limitations of the technique, obtain estimates of the accuracy of computed values, enhance the performance of the technique, and demonstrate the informative value of some types of error."
            },
            "slug": "Optical-Flow-Estimation:-An-Error-Analysis-of-with-Kearney-Thompson",
            "title": {
                "fragments": [],
                "text": "Optical Flow Estimation: An Error Analysis of Gradient-Based Methods with Local Optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This paper examines the sources of errors for gradient-based techniques that locally solve for optical flow that assume that optical flow is constant in a small neighborhood and the consequence of violating this assumption."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723930"
                        ],
                        "name": "A. Jepson",
                        "slug": "A.-Jepson",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Jepson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Jepson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105795"
                        ],
                        "name": "Michael J. Black",
                        "slug": "Michael-J.-Black",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Black",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Black"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 47379266,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "d237b135d9cb6c5ea76faa421fa461d3128b61e8",
            "isKey": false,
            "numCitedBy": 308,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "The computation of optical flow relies on merging information available over an image patch to form an estimate of 2-D image velocity at a point. This merging process raises many issues. These include the treatment of outliers in component velocity measurements and the modeling of multiple motions within a patch which arise from occlusion boundaries or transparency. A new approach for dealing with these issues is presented. It is based on the use of a probabilistic mixture model to explicitly represent multiple motions within a patch. A simple extension of the EM-algorithm is used to compute a maximum likelihood estimate for the various motion parameters. Preliminary experiments indicate that this approach is computationally efficient, and that it can provide robust estimates of the optical flow values in the presence of outliers and multiple motions.<<ETX>>"
            },
            "slug": "Mixture-models-for-optical-flow-computation-Jepson-Black",
            "title": {
                "fragments": [],
                "text": "Mixture models for optical flow computation"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A new approach based on the use of a probabilistic mixture model to explicitly represent multiple motions within a patch is presented, which can provide robust estimates of the optical flow values in the presence of outliers and multiple motions."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110239969"
                        ],
                        "name": "John Y. A. Wang",
                        "slug": "John-Y.-A.-Wang",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Wang",
                            "middleNames": [
                                "Y.",
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John Y. A. Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5556692,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7e33474350c94badff77eec1c48e24ba59c8cd05",
            "isKey": false,
            "numCitedBy": 341,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "Standard approaches to motion analysis assume that the optic flow is smooth; such techniques have trouble dealing with occlusion boundaries. The image sequence can be decomposed into a set of overlapping layers, where each layer's motion is described by a smooth flow field. The discontinuities in the description are then attributed to object opacities rather than to the flow itself, mirroring the structure of the scene. A set of techniques is devised for segmenting images into coherently moving regions using affine motion analysis and clustering techniques. It is possible to decompose an image into a set of layers along with information about occlusion and depth ordering. The techniques are applied to a flower garden sequence. The scene can be analyzed into four layers, and, the entire 30-frame sequence can be represented with a single image of each layer, along with associated motion parameters.<<ETX>>"
            },
            "slug": "Layered-representation-for-motion-analysis-Wang-Adelson",
            "title": {
                "fragments": [],
                "text": "Layered representation for motion analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A set of techniques is devised for segmenting images into coherently moving regions using affine motion analysis and clustering techniques and it is possible to decompose an image into a set of layers along with information about occlusion and depth ordering."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31155131"
                        ],
                        "name": "M. Shizawa",
                        "slug": "M.-Shizawa",
                        "structuredName": {
                            "firstName": "Masahiko",
                            "lastName": "Shizawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Shizawa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060200675"
                        ],
                        "name": "K. Mase",
                        "slug": "K.-Mase",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Mase",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Mase"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119644383,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "7ac3c2c32a114e9e833fd4a85d4eeb4a21141aab",
            "isKey": false,
            "numCitedBy": 57,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "The principle of superposition is applied to various motion estimation problems. It can potentially resolve the difficulty of analyzing multiple motion, transparent motion and motion boundaries by using a common mathematical structure. The authors demonstrate that, by applying the principle, the techniques of optical flow, 3D motion and structure from flow fields, direct method for 3D motion and structure recovery, motion and structure from correspondences in two frames can be extended coherently to deal with multiple motion. The theory not only produces multiple-motion versions of the existing algorithms, but also provides tools for the theoretical analysis of multiple motion. Since the approach is not at the algorithm level as are conventional segmentation paradigms, but at the level of computational theory, i.e. of constraints, theoretical results derived also contribute to psychophysical and physiological studies on the preattentive stages of biological motion vision systems. The paper emphasizes the universality of the principle.<<ETX>>"
            },
            "slug": "Principle-of-superposition:-a-common-computational-Shizawa-Mase",
            "title": {
                "fragments": [],
                "text": "Principle of superposition: a common computational framework for analysis of multiple motion"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE Workshop on Visual Motion"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1717435"
                        ],
                        "name": "B. G. Schunck",
                        "slug": "B.-G.-Schunck",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Schunck",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. G. Schunck"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 81902,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "7173228b2c4b98bcc8447768d925c91c55116de2",
            "isKey": false,
            "numCitedBy": 196,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "Image flow is the velocity field in the image plane caused by the motion of the observer, objects in the scene, or apparent motion, and can contain discontinuities due to object occlusion in the scene. An algorithm that can estimate the image flow velocity field when there are discontinuities due to occlusions is described. The constraint line clustering algorithm uses a statistical test to estimate the image flow velocity field in the presence of step discontinuities in the image irradiance or velocity field. Particular emphasis is placed on motion estimation and segmentation in situations such as random dot patterns where motion is the only cue to segmentation. Experimental results on a demanding synthetic test case and a real image are presented. A smoothing algorithm for improving the velocity field estimate is also described. The smoothing algorithm constructs a smooth estimate of the velocity field by approximating a surface between step discontinuities. It is noted that the velocity field estimate can be improved using surface reconstruction between velocity field boundaries. >"
            },
            "slug": "Image-Flow-Segmentation-and-Estimation-by-Line-Schunck",
            "title": {
                "fragments": [],
                "text": "Image Flow Segmentation and Estimation by Constraint Line Clustering"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The constraint line clustering algorithm uses a statistical test to estimate the image flow velocity field in the presence of step discontinuities in the image irradiance or velocity field, with particular emphasis on motion estimation and segmentation in situations where motion is the only cue to segmentation."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105795"
                        ],
                        "name": "Michael J. Black",
                        "slug": "Michael-J.-Black",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Black",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Black"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145981906"
                        ],
                        "name": "P. Anandan",
                        "slug": "P.-Anandan",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Anandan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Anandan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 161,
                                "start": 158
                            }
                        ],
                        "text": "Robust correlation was later used first-order smoothness constraint can then be discretized as to provide a robust data term for estimating dense flow fields [9]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 301,
                                "start": 283
                            }
                        ],
                        "text": "Problems Posed by Motion Boundaries discontinuities are the Markov random field (MRF) formulations [19] which a number of authors have applied to the As in the case of the data conservation term, the spatial coherence term above is formulated in terms of least- optical flow problem [8, 9, 32, 38, 54]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 19
                            }
                        ],
                        "text": "M. J. Black and P. Anandan, Robust dynamic motion estimation\nover time, in Proc."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 285,
                                "start": 278
                            }
                        ],
                        "text": "In particular, it shows how area-based Technique error deviation (%)regression techniques can be made robust to multiple mo-\ntions resulting from occlusion, transparency, and specular Horn and Schunck [27] 32.438 30.288 100 reflections and how piecewise-smooth flow fields can be Anandan [2] 15.848 13.468 100 Singh [51] 13.168 12.078 100recovered using a robust gradient-based algorithm."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 3
                            }
                        ],
                        "text": "P. Anandan, A computational framework and an algorithm for the 22."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 0
                            }
                        ],
                        "text": "Black and Anandan [9] formulated the regularization problem using a robust error The previous section illustrated the generality of the\nproblem posed by motion discontinuities; measurementsnorm with a redescending influence function for better outlier rejection."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 18
                            }
                        ],
                        "text": "Black and Anandan [9] formulated the regularization problem using a robust error The previous section illustrated the generality of the problem posed by motion discontinuities; measurements norm with a redescending influence function for better outlier rejection."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 19
                            }
                        ],
                        "text": "M. J. Black and P. Anandan, A model for the detection of motion\nover time, in Proc."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 202,
                                "start": 199
                            }
                        ],
                        "text": "We have explored the use of sto- Blake and Zisserman [12] developed a continuation chastic minimization techniques such as simulated anneal- method called Graduated Non-Convexity by constructing ing [9] but have found deterministic continuation methods a parameterized piecewise polynomial approximation to [10] to be more efficient and practical."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 24,
                                "start": 17
                            }
                        ],
                        "text": "J. R. Bergen, P. Anandan, K. J. Hanna, and R. Hingorani, Hierarchical 24."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 19
                            }
                        ],
                        "text": "M. J. Black and P. Anandan, A framework for the robust estimation 229–244.of optical flow, in Proc."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 19
                            }
                        ],
                        "text": "M. J. Black and P. Anandan, Constraints for the early detection of discontinuity from motion, in Proc."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 76
                            }
                        ],
                        "text": "Since the motion of neighboring points on a correlation with regularization [9], and gradient-based ap- smooth rigid surface changes gradually, we can enforce an proaches with regularization [6, 10]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15551602,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f5b4091691a32076c78a0f354994977230f95c23",
            "isKey": false,
            "numCitedBy": 287,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "A novel approach to incrementally estimating visual motion over a sequence of images is presented. The authors start by formulating constraints on image motion to account for the possibility of multiple motions. This is achieved by exploiting the notions of weak continuity and robust statistics in the formulation of a minimization problem. The resulting objective function is non-convex. Traditional stochastic relaxation techniques for minimizing such functions prove inappropriate for the task. A highly parallel incremental stochastic minimization algorithm is presented which has a number of advantages over previous approaches. The incremental nature of the scheme makes it dynamic and permits the detection of occlusion and disocclusion boundaries.<<ETX>>"
            },
            "slug": "Robust-dynamic-motion-estimation-over-time-Black-Anandan",
            "title": {
                "fragments": [],
                "text": "Robust dynamic motion estimation over time"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A highly parallel incremental stochastic minimization algorithm is presented which has a number of advantages over previous approaches and the incremental nature of the scheme makes it dynamic and permits the detection of occlusion and disocclusion boundaries."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. 1991 IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2190675"
                        ],
                        "name": "Gilad Adiv",
                        "slug": "Gilad-Adiv",
                        "structuredName": {
                            "firstName": "Gilad",
                            "lastName": "Adiv",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gilad Adiv"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 22
                            }
                        ],
                        "text": "In similar work, Adiv [1] used first-order, or membrane, model [27] a generalized Hough technique to estimate the parameters of multiple motions."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 3
                            }
                        ],
                        "text": "G. Adiv, Recovering motion parameters in scenes containing multiple image reconstruction, Bull."
                    },
                    "intents": []
                }
            ],
            "corpusId": 118682003,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "9039aeb9b935871838cfcf503634bb3f6db6226a",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : A method for extracting the motion parameters of several independently moving objects from displacments field information is described. The method is based on a generalized Hough transform technique. Some of the problems of this technique are addressed and appropriate solutions are proposed. A modified multipass Hough transform appraoch has been implemented, where i each pass windows are lkocated around objects and the transform is applied only to the displacement vectors contained in these windows. The windows are determined by the degree to which the displacement field is locally inconsistent with previously found motion transformations. Thus, the sensitivity of the Hough transform to local events is increased and the motion parameters of small objects can be detected even in a noisy displacement field. The author also use a multi-resolution scheme in both the image plane and the parameter space and thus reduce the computational cost of the technique. The method is demonstrated by experiments based on artifical images with four parameters of 2-d motion: rotation, expansion and tranlation in both axes."
            },
            "slug": "Recovering-2-D-Motion-Parameters-in-Scenes-Multiple-Adiv",
            "title": {
                "fragments": [],
                "text": "Recovering 2-D Motion Parameters in Scenes Containing Multiple Moving Objects."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2038179"
                        ],
                        "name": "A. Waxman",
                        "slug": "A.-Waxman",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Waxman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Waxman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7505678"
                        ],
                        "name": "K. Wohn",
                        "slug": "K.-Wohn",
                        "structuredName": {
                            "firstName": "Kwangyoen",
                            "lastName": "Wohn",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Wohn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119046582,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4c20b1add2454602ac41044ff0760559769867ab",
            "isKey": false,
            "numCitedBy": 189,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "In the kinematic analysis of time-varying imagery, where the goal is to recover object surface structure and space motion from image flow, an appropriate representation for the flow field consists of a set of deformation parameters that describe the rate of change of an image neighborhood. In this paper we develop methods for extracting these deformation param eters from evolving contours in an image sequence, the image contours being manifestations of surface texture seen in perspective projection. Our results follow directly from the analytic structure of the underlying image flow; no heuristics are imposed. The deformation parameters we seek are actu ally linear combinations of the Taylor series coefficients (through second derivatives) of the local image flow field. Thus, a by-product of our approach is a second-order polyno mial approximation to the image flow in the neighborhood of a contour. For curved surfaces this approximation is only locally valid, but for planar surfaces it is globally valid (i.e., it is exact). Our analysis reveals an \"aperture problem in the large\" in which insufficient contour structure leaves the set of 12 deformation parameters underdetermined. We also assess the sensitivity of our method to the simulated effects of noise in the \"normal flow\" around contours as well as the angular field of view subtended by contours. The sensitivity analysis is carried out in the context of planar surfaces executing general rigid-body motions in space. Future work will address the additional considerations relevant to curved surface patches."
            },
            "slug": "Contour-Evolution,-Neighborhood-Deformation,-and-in-Waxman-Wohn",
            "title": {
                "fragments": [],
                "text": "Contour Evolution, Neighborhood Deformation, and Global Image Flow: Planar Surfaces in Motion"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Methods for extracting deformation parameters from evolving contours in an image sequence, the image contours being manifestations of surface texture seen in perspective projection, and a second-order polyno mial approximation to the image flow in the neighborhood of a contour are developed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105795"
                        ],
                        "name": "Michael J. Black",
                        "slug": "Michael-J.-Black",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Black",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Black"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145981906"
                        ],
                        "name": "P. Anandan",
                        "slug": "P.-Anandan",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Anandan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Anandan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Problems Posed by Motion Boundaries discontinuities are the Markov random field (MRF) formulations [19] which a number of authors have applied to the As in the case of the data conservation term, the spatial coherence term above is formulated in terms of least- optical flow problem [8, 9, 32, 38, 54]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 206768565,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "e7c49a201daf302b8a7fd70729f1b08fcf4c1b90",
            "isKey": false,
            "numCitedBy": 61,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "A model is proposed for the incremental estimation of visual motion fields from image sequences. The authors' model exploits three standard constraints on image motion within an optimization framework: (1) data conservation-the intensity structure of a surface patch changes gradually over time; (2) spatial coherence-neighboring points have similar motions; and (3) temporal coherence-the image velocity of a surface patch changes gradually. The authors' formulation takes into account the possibility of multiple motions at a particular location. They present an incremental scheme for the minimization of the objective function, based on simulated annealing. All computations are parallel, local, and incremental, and occlusion and disocclusion boundaries are estimated.<<ETX>>"
            },
            "slug": "A-model-for-the-detection-of-motion-over-time-Black-Anandan",
            "title": {
                "fragments": [],
                "text": "A model for the detection of motion over time"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An incremental scheme for the minimization of the objective function is presented, based on simulated annealing, and all computations are parallel, local, and incremental, and occlusion and disocclusion boundaries are estimated."
            },
            "venue": {
                "fragments": [],
                "text": "[1990] Proceedings Third International Conference on Computer Vision"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2061418919"
                        ],
                        "name": "D. Shulman",
                        "slug": "D.-Shulman",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Shulman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Shulman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143647370"
                        ],
                        "name": "J. Hervé",
                        "slug": "J.-Hervé",
                        "structuredName": {
                            "firstName": "Jean-Yves",
                            "lastName": "Hervé",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hervé"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124177729,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0f8cc4573d210ad91c26e5a0040250bbf1c87fc0",
            "isKey": false,
            "numCitedBy": 121,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "Inverse problems in low-level vision tend to be ill-posed and smoothness assumptions (regularization) need to be made to obtain unique solutions that vary continuously as a function of the data. But the solution must not smooth over discontinuities in the image, and allowance must be made for the fact that the probability distributions of the smoothness measures are unknown. The authors apply the theory of robust statistics (M-statistics) to obtain a convex regularization that is also maximally robust against misspecification of the probability distribution of large jumps in the unknown. This theory is applied to the optical flow constraint, which is known to be noisy and inaccurate. The authors present some preliminary results showing that convex regularization theory seems to accurately preserve depth boundary information.<<ETX>>"
            },
            "slug": "Regularization-of-discontinuous-flow-fields-Shulman-Hervé",
            "title": {
                "fragments": [],
                "text": "Regularization of discontinuous flow fields"
            },
            "venue": {
                "fragments": [],
                "text": "[1989] Proceedings. Workshop on Visual Motion"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2302358"
                        ],
                        "name": "P. Burt",
                        "slug": "P.-Burt",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Burt",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Burt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2055557"
                        ],
                        "name": "R. Hingorani",
                        "slug": "R.-Hingorani",
                        "structuredName": {
                            "firstName": "Rajesh",
                            "lastName": "Hingorani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hingorani"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144406261"
                        ],
                        "name": "Shmuel Peleg",
                        "slug": "Shmuel-Peleg",
                        "structuredName": {
                            "firstName": "Shmuel",
                            "lastName": "Peleg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Shmuel Peleg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9705932,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "98098f847d3778874f66fadd6123b30aeb6dd62c",
            "isKey": false,
            "numCitedBy": 301,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "A fundamental assumption made in formulating optical-flow algorithms, that motion at any point in an image can be represented as a single pattern component undergoing a simple translation, fails for a number of situations that commonly occur in real-world images. An alternative formulation of the local motion assumption in which there may be two distinct patterns undergoing coherent (e.g. affine) motion within a given local analysis region is proposed. An algorithm for the analysis of two-component motion in which tracking and nulling mechanisms applied to three consecutive image frames separate and estimate the individual components is given. Precise results are obtained, even for components that differ only slightly in velocity as well as for a faint component in the presence of a dominant, masking component. The algorithm provides precise motion estimates for a set of elementary two-motion configurations and is robust in the presence of noise. >"
            },
            "slug": "A-Three-Frame-Algorithm-for-Estimating-Image-Motion-Bergen-Burt",
            "title": {
                "fragments": [],
                "text": "A Three-Frame Algorithm for Estimating Two-Component Image Motion"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "An algorithm for the analysis of two-component motion in which tracking and nulling mechanisms applied to three consecutive image frames separate and estimate the individual components is given and is robust in the presence of noise."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48121727"
                        ],
                        "name": "D. W. Murray",
                        "slug": "D.-W.-Murray",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Murray",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. W. Murray"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31557997"
                        ],
                        "name": "B. Buxton",
                        "slug": "B.-Buxton",
                        "structuredName": {
                            "firstName": "Bernard",
                            "lastName": "Buxton",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Buxton"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 18987058,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fa3794165cfea264cfa171ee65abf1b47bfe8d48",
            "isKey": false,
            "numCitedBy": 368,
            "numCiting": 52,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents results from computer experiments with an algorithm to perform scene disposition and motion segmentation from visual motion or optic flow. The maximum a posteriori (MAP) criterion is used to formulate what the best segmentation or interpretation of the scene should be, where the scene is assumed to be made up of some fixed number of moving planar surface patches. The Bayesian approach requires, first, specification of prior expectations for the optic flow field, which here is modeled as spatial and temporal Markov random fields; and, secondly, a way of measuring how well the segmentation predicts the measured flow field. The Markov random fields incorporate the physical constraints that objects and their images are probably spatially continuous, and that their images are likely to move quite smoothly across the image plane. To compute the flow predicted by the segmentation, a recent method for reconstructing the motion and orientation of planar surface facets is used. The search for the globally optimal segmentation is performed using simulated annealing."
            },
            "slug": "Scene-Segmentation-from-Visual-Motion-Using-Global-Murray-Buxton",
            "title": {
                "fragments": [],
                "text": "Scene Segmentation from Visual Motion Using Global Optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "To compute the flow predicted by the segmentation, a recent method for reconstructing the motion and orientation of planar surface facets is used and the search for the globally optimal segmentation is performed using simulated annealing."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "95273267"
                        ],
                        "name": "N. Cornelius",
                        "slug": "N.-Cornelius",
                        "structuredName": {
                            "firstName": "Nancy",
                            "lastName": "Cornelius",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Cornelius"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733113"
                        ],
                        "name": "T. Kanade",
                        "slug": "T.-Kanade",
                        "structuredName": {
                            "firstName": "Takeo",
                            "lastName": "Kanade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kanade"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 34022350,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c20b16187deb6f03ae81dd815ffcb4c0746d5b0d",
            "isKey": false,
            "numCitedBy": 126,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper adapts Horn and Schunck's work on optical flow to the problem of determining arbitrary motions of objects from 2-dimensional image sequences. The method allows for gradual changes in the way an object appears in the image sequence, and allows for flow discontinuities at object boundaries. We find velocity fields that give estimates of the velocities of objects in the image plane. These velocities are computed from a series of images using information about the spatial and temporal brightness gradients. A constraint on the smoothness of motion within an object's boundaries is used. The method can be applied to interpretation of both reflectance and x-ray images. Results arc shown for models of ellipsoids undergoing expansion, as well as for an x-ray image sequence of a beating heart."
            },
            "slug": "Adapting-optical-flow-to-measure-object-motion-in-Cornelius-Kanade",
            "title": {
                "fragments": [],
                "text": "Adapting optical-flow to measure object motion in reflectance and x-ray image sequences (abstract only)"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This paper finds velocity fields that give estimates of the velocities of objects in the image plane that can be applied to interpretation of both reflectance and x-ray images."
            },
            "venue": {
                "fragments": [],
                "text": "COMG"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1697964"
                        ],
                        "name": "S. Negahdaripour",
                        "slug": "S.-Negahdaripour",
                        "structuredName": {
                            "firstName": "Shahriar",
                            "lastName": "Negahdaripour",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Negahdaripour"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3011572"
                        ],
                        "name": "Chih-Ho Yu",
                        "slug": "Chih-Ho-Yu",
                        "structuredName": {
                            "firstName": "Chih-Ho",
                            "lastName": "Yu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chih-Ho Yu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44443253,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "f1399c796467e568af99bf6abbabc621a5b46ce6",
            "isKey": false,
            "numCitedBy": 131,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors propose an image motion constraint equation based on a model which allows the brightness of a scene point to vary with time, unlike the case in the brightness constancy model. Using this model, they describe a method for the computation of optical flow and investigate its performance in a variety of conditions involving brightness variations of scene points, due to illumination nonuniformity, light source motion, specular reflection, and/or interreflection. It is shown that in the application of this method, care must be taken in the estimation of image derivatives using finite difference methods to prevent biases in the solution. A simple modification is suggested to overcome the problem. A comparison is made with two other models, including the classical brightness constancy model, through results from experiments with real images.<<ETX>>"
            },
            "slug": "A-generalized-brightness-change-model-for-computing-Negahdaripour-Yu",
            "title": {
                "fragments": [],
                "text": "A generalized brightness change model for computing optical flow"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The authors propose an image motion constraint equation based on a model which allows the brightness of a scene point to vary with time, unlike the case in the brightness constancy model."
            },
            "venue": {
                "fragments": [],
                "text": "1993 (4th) International Conference on Computer Vision"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144721252"
                        ],
                        "name": "H. Nagel",
                        "slug": "H.-Nagel",
                        "structuredName": {
                            "firstName": "Hans-Hellmut",
                            "lastName": "Nagel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nagel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2677311"
                        ],
                        "name": "W. Enkelmann",
                        "slug": "W.-Enkelmann",
                        "structuredName": {
                            "firstName": "Wilfried",
                            "lastName": "Enkelmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Enkelmann"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6399274,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8454b1f86a3ad5a7b692b956fc8ef7fb4aca9377",
            "isKey": false,
            "numCitedBy": 993,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "A mapping between one frame from an image sequence and the preceding or following frame can be represented as a displacement vector field. In most situations, the mere gray value variations do not provide sufficient information in order to estimate such a displacement vector field. Supplementary constraints are necessary, for example the postulate that a displacement vector field varies smoothly as a function of the image position. Taken as a general requirement, this creates difficulties at gray value transitions which correspond to occluding contours. Nagel therefore introduced the ``oriented smoothness'' requirement which restricts variations of the displacement vector field only in directions with small or no variation of gray values. This contribution reports results of an investigation about how such an ``oriented smoothness'' constraint may be formulated and evaluated."
            },
            "slug": "An-Investigation-of-Smoothness-Constraints-for-the-Nagel-Enkelmann",
            "title": {
                "fragments": [],
                "text": "An Investigation of Smoothness Constraints for the Estimation of Displacement Vector Fields from Image Sequences"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "Results are reported of an investigation about how an ``oriented smoothness'' constraint may be formulated and evaluated about how variations of the displacement vector field only in directions with small or no variation of gray values are restricted."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144816086"
                        ],
                        "name": "W. Thompson",
                        "slug": "W.-Thompson",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Thompson",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Thompson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2814404"
                        ],
                        "name": "K. Mutch",
                        "slug": "K.-Mutch",
                        "structuredName": {
                            "firstName": "Kathleen",
                            "lastName": "Mutch",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Mutch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145680634"
                        ],
                        "name": "V. Berzins",
                        "slug": "V.-Berzins",
                        "structuredName": {
                            "firstName": "Valdis",
                            "lastName": "Berzins",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Berzins"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10262566,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "53ac115c2d8ddb81f1cfb611447e778c45c575e1",
            "isKey": false,
            "numCitedBy": 167,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "Optical flow can be used to locate dynamic occlusion boundaries in an image sequence. We derive an edge detection algorithm sensitive to changes in flow fields likely to be associated with occlusion. The algorithm is patterned after the Marr-Hildreth zero-crossing detectors currently used to locate boundaries in scalar fields. Zero-crossing detectors are extended to identify changes in direction and/or magnitude in a vector-valued flow field. As a result, the detector works for flow boundaries generated due to the relative motion of two overlapping surfaces, as well as the simpler case of motion parallax due to a sensor moving through an otherwise stationary environment. We then show how the approach can be extended to identify which side of a dynamic occlusion boundary corresponds to the occluding surface. The fundamental principal involved is that at an occlusion boundary, the image of the surface boundary moves with the image of the occluding surface. Such information is important in interpreting dynamic scenes. Results are demonstrated on optical flow fields automatically computed from real image sequences."
            },
            "slug": "Dynamic-Occlusion-Analysis-in-Optical-Flow-Fields-Thompson-Mutch",
            "title": {
                "fragments": [],
                "text": "Dynamic Occlusion Analysis in Optical Flow Fields"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "An edge detection algorithm sensitive to changes in flow fields likely to be associated with occlusion, patterned after the Marr-Hildreth zero-crossing detectors currently used to locate boundaries in scalar fields is derived."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105795"
                        ],
                        "name": "Michael J. Black",
                        "slug": "Michael-J.-Black",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Black",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Black"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145981906"
                        ],
                        "name": "P. Anandan",
                        "slug": "P.-Anandan",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Anandan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Anandan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 3
                            }
                        ],
                        "text": "In [7], we replaced the quadratic error norm used in correlation with a robust error norm."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 237,
                                "start": 234
                            }
                        ],
                        "text": "We have applied the framework to tion that surfaces have spatial extent and hence neigha variety of standard techniques for recovering optical flow; boring pixels in an image are likely to belong to the same these include correlation [7], area-based regression [6], surface."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 29231806,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "2d604881bf3cb7232f0d6cbe19198ad77112b599",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Surface discontinuities are detected in a sequence of images by exploiting physical constraints at early stages in the processing of visual motion. To achieve accurate early discontinuity detection we exploit five physical constraints on the presence of discontinuities: i) the shape of the sum of squared differences (SSD) error surface in the presence of surface discontinuities; ii) the change in the shape of the SSD surface due to relative surface motion; iii) distribution of optic flow in a neighborhood of a discontinuity; iv) spatial consistency of discontinuities; V) temporal consistency of discontinuities. The constraints are described, and experimental results on sequences of real and synthetic images are presented. The work has applications in the recovery of environmental structure from motion and in the generation of dense optic flow fields."
            },
            "slug": "Constraints-for-the-Early-Detection-of-from-Motion-Black-Anandan",
            "title": {
                "fragments": [],
                "text": "Constraints for the Early Detection of Discontinuity from Motion"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "This work exploits five physical constraints on the presence of discontinuities to achieve accurate early discontinuity detection and has applications in the recovery of environmental structure from motion and in the generation of dense optic flow fields."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145981906"
                        ],
                        "name": "P. Anandan",
                        "slug": "P.-Anandan",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Anandan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Anandan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3315356"
                        ],
                        "name": "K. Hanna",
                        "slug": "K.-Hanna",
                        "structuredName": {
                            "firstName": "Keith",
                            "lastName": "Hanna",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Hanna"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2055557"
                        ],
                        "name": "R. Hingorani",
                        "slug": "R.-Hingorani",
                        "structuredName": {
                            "firstName": "Rajesh",
                            "lastName": "Hingorani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hingorani"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6267598,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "404f3544a7db67c38ba3b8f78f02759d2326684e",
            "isKey": false,
            "numCitedBy": 1510,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a hierarchical estimation framework for the computation of diverse representations of motion information. The key features of the resulting framework (or family of algorithms) are a global model that constrains the overall structure of the motion estimated, a local model that is used in the estimation process, and a coarse-fine refinement strategy. Four specific motion models: affine flow, planar surface flow, rigid body motion, and general optical flow, are described along with their application to specific examples."
            },
            "slug": "Hierarchical-Model-Based-Motion-Estimation-Bergen-Anandan",
            "title": {
                "fragments": [],
                "text": "Hierarchical Model-Based Motion Estimation"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "This paper describes a hierarchical estimation framework for the computation of diverse representations of motion information that constrains the overall structure of the motion estimated, a local model that is used in the estimation process, and a coarse-fine refinement strategy."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1717435"
                        ],
                        "name": "B. G. Schunck",
                        "slug": "B.-G.-Schunck",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Schunck",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. G. Schunck"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1371968,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a3229dc33ecb80c59a75b906c46b586dd059b781",
            "isKey": false,
            "numCitedBy": 11344,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "Optical flow cannot be computed locally, since only one independent measurement is available from the image sequence at a point, while the flow velocity has two components. A second constraint is needed. A method for finding the optical flow pattern is presented which assumes that the apparent velocity of the brightness pattern varies smoothly almost everywhere in the image. An iterative implementation is shown which successfully computes the optical flow for a number of synthetic image sequences. The algorithm is robust in that it can handle image sequences that are quantized rather coarsely in space and time. It is also insensitive to quantization of brightness levels and additive noise. Examples are included where the assumption of smoothness is violated at singular points or along lines in the image."
            },
            "slug": "Determining-Optical-Flow-Horn-Schunck",
            "title": {
                "fragments": [],
                "text": "Determining Optical Flow"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An iterative implementation is shown which successfully computes the optical flow for a number of synthetic image sequences and is robust in that it can handle image sequences that are quantified rather coarsely in space and time."
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144721252"
                        ],
                        "name": "H. Nagel",
                        "slug": "H.-Nagel",
                        "structuredName": {
                            "firstName": "Hans-Hellmut",
                            "lastName": "Nagel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nagel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2126390,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "8cc8970c3933607ee4314f07a4193db8ccc20e90",
            "isKey": false,
            "numCitedBy": 492,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-the-Estimation-of-Optical-Flow:-Relations-and-Nagel",
            "title": {
                "fragments": [],
                "text": "On the Estimation of Optical Flow: Relations between Different Approaches and Some New Results"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "13905674"
                        ],
                        "name": "F. Glazer",
                        "slug": "F.-Glazer",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Glazer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Glazer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 116968459,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1278f1c78b3a95d4cb24145f697eb90af0e09956",
            "isKey": false,
            "numCitedBy": 41,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This thesis presents algorithms for the efficient computation of image motions using hierarchical multiresolution methods operating on image data pyramids in the processing cone architecture. Three topics are addressed: (1) fast construction of image pyramids; (2) hierarchical motion detection algorithms: correlation-based and gradient-based; and (3) multilevel relaxation algorithms. \nPyramid building is the first step in hierarchical motion detection. A family of discrete Gaussian low pass filters for building low pass pyramids is presented that provide good anti-aliasing characteristics, efficient computation, and a good hierarchical Gaussian approximation. Frequency space analysis, using Fourier Transform theory, is used to compare alternative filters. \nHierarchical correlation overcomes two disadvantages of correlation matching: large search areas which require expensive searches, and repeating features which cause incorrect matches. Coarse-to-fine control provides speed and efficiency when search spaces are large, and accuracy when repeating details can be confused. \nHierarchical gradient-based algorithms extend single level gradient-based algorithms to the computation of large disparities. They use a coarse-to-fine method in which approximate disparities are refined at each level by computing relatively small updates. This allows the gradient-based method's assumption of local linearity to apply in spite of the large total disparities. Experiments show the failure of single level methods (for large disparities) and the success of hierarchical methods. \nThe two hierarchical algorithms are shown to have comparable accuracy. Comparison of the computational costs, both arithmetic and data transfer, show that the gradient-based algorithm are, in general, less costly. \nMultilevel relaxation algorithms for the computation of optic flow are developed and experiments show the expected increased convergence rate over single level relaxation, although some experiments present a problem of divergence at coarse levels. A local mode analysis of the relaxation equations shows that convergence is at least as fast as simple smoothing, and that, with strong gradients, convergence is accelerated towards the constraint line. The local mode analysis does not account for coarse level divergence. Divergence is then shown to be due to spatial variation in the image data. Fixed up/down cycling schemes are used to overcome the divergence problem."
            },
            "slug": "Hierarchical-Motion-Detection-Glazer",
            "title": {
                "fragments": [],
                "text": "Hierarchical Motion Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 84,
                "text": "This thesis presents algorithms for the efficient computation of image motions using hierarchical multiresolution methods operating on image data pyramids in the processing cone architecture and shows that the gradient-based algorithm are, in general, less costly."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3194361"
                        ],
                        "name": "S. Geman",
                        "slug": "S.-Geman",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Geman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707642"
                        ],
                        "name": "D. Geman",
                        "slug": "D.-Geman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5837272,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "459b30a9a960080f3b313e41886b1aa0e51e882c",
            "isKey": false,
            "numCitedBy": 18711,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "We make an analogy between images and statistical mechanics systems. Pixel gray levels and the presence and orientation of edges are viewed as states of atoms or molecules in a lattice-like physical system. The assignment of an energy function in the physical system determines its Gibbs distribution. Because of the Gibbs distribution, Markov random field (MRF) equivalence, this assignment also determines an MRF image model. The energy function is a more convenient and natural mechanism for embodying picture attributes than are the local characteristics of the MRF. For a range of degradation mechanisms, including blurring, nonlinear deformations, and multiplicative or additive noise, the posterior distribution is an MRF with a structure akin to the image model. By the analogy, the posterior distribution defines another (imaginary) physical system. Gradual temperature reduction in the physical system isolates low energy states (``annealing''), or what is the same thing, the most probable states under the Gibbs distribution. The analogous operation under the posterior distribution yields the maximum a posteriori (MAP) estimate of the image given the degraded observations. The result is a highly parallel ``relaxation'' algorithm for MAP estimation. We establish convergence properties of the algorithm and we experiment with some simple pictures, for which good restorations are obtained at low signal-to-noise ratios."
            },
            "slug": "Stochastic-Relaxation,-Gibbs-Distributions,-and-the-Geman-Geman",
            "title": {
                "fragments": [],
                "text": "Stochastic Relaxation, Gibbs Distributions, and the Bayesian Restoration of Images"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The analogy between images and statistical mechanics systems is made and the analogous operation under the posterior distribution yields the maximum a posteriori (MAP) estimate of the image given the degraded observations, creating a highly parallel ``relaxation'' algorithm for MAP estimation."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105795"
                        ],
                        "name": "Michael J. Black",
                        "slug": "Michael-J.-Black",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Black",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Black"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145257017"
                        ],
                        "name": "Anand Rangarajan",
                        "slug": "Anand-Rangarajan",
                        "structuredName": {
                            "firstName": "Anand",
                            "lastName": "Rangarajan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anand Rangarajan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 34,
                                "start": 30
                            }
                        ],
                        "text": "Finally, Black and Rangarajan [11] have shown that there is a deep rela- Model violations such as these result in measurements that can be viewed in a statistical context as outliers."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 3
                            }
                        ],
                        "text": "A. Rangarajan and R. Chellappa, A continuation method for image 93, New York, June 1993, pp. 361–366. estimation using the adiabatic approximation, in Markov Random\n58."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 29,
                                "start": 0
                            }
                        ],
                        "text": "Finally, Black and Rangarajan [11] have shown that there is a deep rela- Model violations such as these result in measurements that\ncan be viewed in a statistical context as outliers."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 285,
                                "start": 281
                            }
                        ],
                        "text": "Finally, the robust estimation framework has more general applicability than the recovery of optical flow; it provides a general frame­ED ­a4 5 O R Iyxc((=I)u(a) 1 It , s) work for dealing with model violations which can be applied to a wide class of problems in early vision (see [11] for examples of robust image and surface reconstruc­ED ­a5 5 O R Iy yc((=I)Tu(a) 1 It , s)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 81
                            }
                        ],
                        "text": "Additionally, Details of the robust parametric regression and robust as shown in [11], robust r-functions are closely related regularization algorithms are provided in the following two to the traditional line-process approaches for coping with sections along with experimental results."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 29,
                                "start": 19
                            }
                        ],
                        "text": "M. J. Black and A. Rangarajan, The outlier process: Unifying line Vision, 1988, pp. 354–362.processes and robust statistics, in Proc."
                    },
                    "intents": []
                }
            ],
            "corpusId": 14739434,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "169dc111e4a5872bf931c6f3af58872038ccde13",
            "isKey": false,
            "numCitedBy": 66,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper unifies \"line-process\" approaches for regularization with discontinuities and robust estimation techniques. We generalize the notion of a \"line process\" to that of an analog \"outlier process\" and show that a problem formulated in terms of outlier processes can be viewed in terms of robust statistics. We also characterize a class of robust statistical problems for which an equivalent outlier-process formulation exists and give a straightforward method for converting a robust estimation problem into an outlier-process formulation. This outlier-processes approach provides a general framework which subsumes the traditional line-process approaches as well as a wide class of robust estimation problems. Examples in image reconstruction and optical flow are used to illustrate the approach.<<ETX>>"
            },
            "slug": "The-outlier-process:-unifying-line-processes-and-Black-Rangarajan",
            "title": {
                "fragments": [],
                "text": "The outlier process: unifying line processes and robust statistics"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "This paper unifies \"line-process\" approaches for regularization with discontinuities and robust estimation techniques and generalizes the notion of a \"line process\" to that of an analog \"outlier process\" and shows that a problem formulated in terms of outlier processes can be viewed in Terms of robust statistics."
            },
            "venue": {
                "fragments": [],
                "text": "1994 Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2489024"
                        ],
                        "name": "C. Fennema",
                        "slug": "C.-Fennema",
                        "structuredName": {
                            "firstName": "Claude",
                            "lastName": "Fennema",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Fennema"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144816086"
                        ],
                        "name": "W. Thompson",
                        "slug": "W.-Thompson",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Thompson",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Thompson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14470003,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "67301c286439a7c24368300ea13e9785bd666aed",
            "isKey": false,
            "numCitedBy": 600,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Velocity-determination-in-scenes-containing-several-Fennema-Thompson",
            "title": {
                "fragments": [],
                "text": "Velocity determination in scenes containing several moving objects"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2523492"
                        ],
                        "name": "S. Madarasmi",
                        "slug": "S.-Madarasmi",
                        "structuredName": {
                            "firstName": "Suthep",
                            "lastName": "Madarasmi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Madarasmi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48884262"
                        ],
                        "name": "D. Kersten",
                        "slug": "D.-Kersten",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Kersten",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Kersten"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1681882"
                        ],
                        "name": "T. Pong",
                        "slug": "T.-Pong",
                        "structuredName": {
                            "firstName": "Ting-Chuen",
                            "lastName": "Pong",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Pong"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44758879,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "dfe9d134012b0cf450e9e797b2315578e70f80a0",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "A multilayer, depth planes approach to image segmentation is proposed, where pixels may have arisen from a single smooth surface in the scene are represented in a common layer. Two types of output are produced at each pixel, i.e., a layer number and a vector of depth values, one value for each layer. The layer assignment performs image partitioning based on surface properties. The depth value assignment for each layer either represents the input data with the noise removed or interpolates between data values to fill-in nonvisible parts of the scene. The disjoint surfaces due to occlusion or transparency are also grouped together if they form a smooth surface.<<ETX>>"
            },
            "slug": "Multi-layer-surface-segmentation-using-energy-Madarasmi-Kersten",
            "title": {
                "fragments": [],
                "text": "Multi-layer surface segmentation using energy minimization"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A multilayer, depth planes approach to image segmentation is proposed, where pixels may have arisen from a single smooth surface in the scene are represented in a common layer."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14489533"
                        ],
                        "name": "D. Geiger",
                        "slug": "D.-Geiger",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Geiger",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geiger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804489"
                        ],
                        "name": "F. Girosi",
                        "slug": "F.-Girosi",
                        "structuredName": {
                            "firstName": "Federico",
                            "lastName": "Girosi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Girosi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46023735,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8d5a193fdbf9d34118f136935cfd07a81b3e0d77",
            "isKey": false,
            "numCitedBy": 502,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Deterministic approximations to Markov random field (MRF) models are derived. One of the models is shown to give in a natural way the graduated nonconvexity (GNC) algorithm proposed by A. Blake and A. Zisserman (1987). This model can be applied to smooth a field preserving its discontinuities. A class of more complex models is then proposed in order to deal with a variety of vision problems. All the theoretical results are obtained in the framework of statistical mechanics and mean field techniques. A parallel, iterative algorithm to solve the deterministic equations of the two models is presented, together with some experiments on synthetic and real images. >"
            },
            "slug": "Parallel-and-Deterministic-Algorithms-from-MRFs:-Geiger-Girosi",
            "title": {
                "fragments": [],
                "text": "Parallel and Deterministic Algorithms from MRFs: Surface Reconstruction"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "Deterministic approximations to Markov random field (MRF) models are derived and one of the models is shown to give in a natural way the graduated nonconvexity (GNC) algorithm proposed by A. Blake and A. Zisserman (1987)."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2065808108"
                        ],
                        "name": "Pietro Perona",
                        "slug": "Pietro-Perona",
                        "structuredName": {
                            "firstName": "Pietro",
                            "lastName": "Perona",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Pietro Perona"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143751119"
                        ],
                        "name": "Jitendra Malik",
                        "slug": "Jitendra-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jitendra Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14502908,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "496c3d75b81b336411e53da1ac632a8139655604",
            "isKey": false,
            "numCitedBy": 12585,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "A new definition of scale-space is suggested, and a class of algorithms used to realize a diffusion process is introduced. The diffusion coefficient is chosen to vary spatially in such a way as to encourage intraregion smoothing rather than interregion smoothing. It is shown that the 'no new maxima should be generated at coarse scales' property of conventional scale space is preserved. As the region boundaries in the approach remain sharp, a high-quality edge detector which successfully exploits global information is obtained. Experimental results are shown on a number of images. Parallel hardware implementations are made feasible because the algorithm involves elementary, local operations replicated over the image. >"
            },
            "slug": "Scale-Space-and-Edge-Detection-Using-Anisotropic-Perona-Malik",
            "title": {
                "fragments": [],
                "text": "Scale-Space and Edge Detection Using Anisotropic Diffusion"
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "A new definition of scale-space is suggested, and a class of algorithms used to realize a diffusion process is introduced, chosen to vary spatially in such a way as to encourage intra Region smoothing rather than interregion smoothing."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2360881"
                        ],
                        "name": "D. Heeger",
                        "slug": "D.-Heeger",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Heeger",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Heeger"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43141585,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "8c67519c225112349f6c0e6e45c98cced5f02197",
            "isKey": false,
            "numCitedBy": 670,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "A model is presented, consonant with current views regarding the neurophysiology and psychophysics of motion perception, that combines the outputs of a set of spatiotemporal motion-energy filters to extract optical flow. The output velocity is encoded as the peak in a distribution of velocity-tuned units that behave much like cells of the middle temporal area of the primate brain. The model appears to deal with the aperture problem as well as the human visual system since it extracts the correct velocity for patterns that have large differences in contrast at different spatial orientations, and it simulates psychophysical data on the coherence of sine-grating plaid patterns."
            },
            "slug": "Model-for-the-extraction-of-image-flow.-Heeger",
            "title": {
                "fragments": [],
                "text": "Model for the extraction of image flow."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The model appears to deal with the aperture problem as well as the human visual system since it extracts the correct velocity for patterns that have large differences in contrast at different spatial orientations, and it simulates psychophysical data on the coherence of sine-grating plaid patterns."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144611617"
                        ],
                        "name": "M. Irani",
                        "slug": "M.-Irani",
                        "structuredName": {
                            "firstName": "Michal",
                            "lastName": "Irani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Irani"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2080517759"
                        ],
                        "name": "Benny Rousso",
                        "slug": "Benny-Rousso",
                        "structuredName": {
                            "firstName": "Benny",
                            "lastName": "Rousso",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Benny Rousso"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144406261"
                        ],
                        "name": "Shmuel Peleg",
                        "slug": "Shmuel-Peleg",
                        "structuredName": {
                            "firstName": "Shmuel",
                            "lastName": "Peleg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Shmuel Peleg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 25090972,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e26fad5b131b4525e9d1057173a73e3b8be25743",
            "isKey": false,
            "numCitedBy": 227,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Tracking multiple moving objects in image sequences involves a combination of motion detection and segmentation. This task can become complicated as image motion may change significantly between frames, like with camera vibrations. Such vibrations make tracking in longer sequences harder, as temporal motion constancy can not be assumed."
            },
            "slug": "Detecting-and-Tracking-Multiple-Moving-Objects-Irani-Rousso",
            "title": {
                "fragments": [],
                "text": "Detecting and Tracking Multiple Moving Objects Using Temporal Integration"
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "This work tracks multiple moving objects in image sequences using a combination of motion detection and segmentation, which can become complicated as image motion may change significantly between frames, like with camera vibrations."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145730991"
                        ],
                        "name": "V. Torre",
                        "slug": "V.-Torre",
                        "structuredName": {
                            "firstName": "Vincent",
                            "lastName": "Torre",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Torre"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145624227"
                        ],
                        "name": "C. Koch",
                        "slug": "C.-Koch",
                        "structuredName": {
                            "firstName": "Christof",
                            "lastName": "Koch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Koch"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4346156,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4c6bd3b8d35c4fc14360160efc9c66727abac9df",
            "isKey": false,
            "numCitedBy": 1264,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "Descriptions of physical properties of visible surfaces, such as their distance and the presence of edges, must be recovered from the primary image data. Computational vision aims to understand how such descriptions can be obtained from inherently ambiguous and noisy data. A recent development in this field sees early vision as a set of ill-posed problems, which can be solved by the use of regularization methods. These lead to algorithms and parallel analog circuits that can solve ‘ill-posed problems’ and which are suggestive of neural equivalents in the brain."
            },
            "slug": "Computational-vision-and-regularization-theory-Poggio-Torre",
            "title": {
                "fragments": [],
                "text": "Computational vision and regularization theory"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "Descriptions of physical properties of visible surfaces, such as their distance and the presence of edges, must be recovered from the primary image data and algorithms and parallel analog circuits that can solve ‘ill-posed problems’ and which are suggestive of neural equivalents in the brain are proposed."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40588702"
                        ],
                        "name": "B. D. Lucas",
                        "slug": "B.-D.-Lucas",
                        "structuredName": {
                            "firstName": "Bruce",
                            "lastName": "Lucas",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. D. Lucas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733113"
                        ],
                        "name": "T. Kanade",
                        "slug": "T.-Kanade",
                        "structuredName": {
                            "firstName": "Takeo",
                            "lastName": "Kanade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kanade"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2121536,
            "fieldsOfStudy": [
                "Computer Science",
                "Physics"
            ],
            "id": "a06547951c97b2a32f23a6c2b5f79c8c75c9b9bd",
            "isKey": false,
            "numCitedBy": 13329,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Image registration finds a variety of applications in computer vision. Unfortunately, traditional image registration techniques tend to be costly. We present a new image registration technique that makes use of the spatial intensity gradient of the images to find a good match using a type of Newton-Raphson iteration. Our technique is taster because it examines far fewer potential matches between the images than existing techniques Furthermore, this registration technique can be generalized to handle rotation, scaling and shearing. We show how our technique can be adapted tor use in a stereo vision system."
            },
            "slug": "An-Iterative-Image-Registration-Technique-with-an-Lucas-Kanade",
            "title": {
                "fragments": [],
                "text": "An Iterative Image Registration Technique with an Application to Stereo Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This work presents a new image registration technique that makes use of the spatial intensity gradient of the images to find a good match using a type of Newton-Raphson iteration, and can be generalized to handle rotation, scaling and shearing."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2121534"
                        ],
                        "name": "J. Heel",
                        "slug": "J.-Heel",
                        "structuredName": {
                            "firstName": "Joachim",
                            "lastName": "Heel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Heel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 81,
                                "start": 72
                            }
                        ],
                        "text": "Vision 5, skaters sequence, Bonivar Shridhar for the NASA sequence, Joe Heel 1990, 77–104. for the Pepsi sequence, Bob Bolles and Harlyn Baker for the SRI tree 18."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 32383187,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "fd2ed11670c2a48afd529014f0f9a98d6ec2530a",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "A solution is presented to the problem of obtaining and improving an estimate of the 3-D structure of a scene from a sequence of images. The algorithm, which combines single-frame reconstruction techniques and multiple-frame Kalman filtering, is tested on a variety of real motion image sequences.<<ETX>>"
            },
            "slug": "Temporally-integrated-surface-reconstruction-Heel",
            "title": {
                "fragments": [],
                "text": "Temporally integrated surface reconstruction"
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "A solution is presented to the problem of obtaining and improving an estimate of the 3-D structure of a scene from a sequence of images, which combines single-frame reconstruction techniques and multiple-frame Kalman filtering."
            },
            "venue": {
                "fragments": [],
                "text": "[1990] Proceedings Third International Conference on Computer Vision"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2630782"
                        ],
                        "name": "J. Marroquín",
                        "slug": "J.-Marroquín",
                        "structuredName": {
                            "firstName": "José",
                            "lastName": "Marroquín",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Marroquín"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689724"
                        ],
                        "name": "S. Mitter",
                        "slug": "S.-Mitter",
                        "structuredName": {
                            "firstName": "Sanjoy",
                            "lastName": "Mitter",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mitter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14692859,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "97c12f5ddfdf036eb6cf935a679d1e4ba2fe535f",
            "isKey": false,
            "numCitedBy": 865,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "We formulate several problems in early vision as inverse problems. Among the solution methods we review standard regularization theory, discuss its limitations, and present new stochastic (in particular, Bayesian) techniques based on Markov Random Field models for their solution. We derive efficient algorithms and describe parallel implementations on digital parallel SIMD architectures, as well as a new class of parallel hybrid computers that mix digital with analog components."
            },
            "slug": "Probabilistic-Solution-of-Ill-Posed-Problems-in-Marroquín-Mitter",
            "title": {
                "fragments": [],
                "text": "Probabilistic Solution of Ill-Posed Problems in Computational Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This work derives efficient algorithms and describes parallel implementations on digital parallel SIMD architectures, as well as a new class of parallel hybrid computers that mix digital with analog components."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145119134"
                        ],
                        "name": "R. Varga",
                        "slug": "R.-Varga",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Varga",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Varga"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144272344"
                        ],
                        "name": "J. Gillis",
                        "slug": "J.-Gillis",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Gillis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gillis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 123318011,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e726f00657c2d82e5ff0ef011910f2d197c4b010",
            "isKey": false,
            "numCitedBy": 6010,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Matrix Properties and Concepts.- Nonnegative Matrices.- Basic Iterative Methods and Comparison Theorems.- Successive Overrelaxation Iterative Methods.- Semi-Iterative Methods.- Derivation and Solution of Elliptic Difference Equations.- Alternating-Direction Implicit Iterative Methods.- Matrix Methods for Parabolic Partial Differential Equations.- Estimation of Acceleration Parameters."
            },
            "slug": "Matrix-Iterative-Analysis-Varga-Gillis",
            "title": {
                "fragments": [],
                "text": "Matrix Iterative Analysis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144893329"
                        ],
                        "name": "F. Hampel",
                        "slug": "F.-Hampel",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Hampel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Hampel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2567806"
                        ],
                        "name": "E. Ronchetti",
                        "slug": "E.-Ronchetti",
                        "structuredName": {
                            "firstName": "Elvezio",
                            "lastName": "Ronchetti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Ronchetti"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2218687"
                        ],
                        "name": "P. Rousseeuw",
                        "slug": "P.-Rousseeuw",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Rousseeuw",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Rousseeuw"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2851548"
                        ],
                        "name": "W. Stahel",
                        "slug": "W.-Stahel",
                        "structuredName": {
                            "firstName": "Werner",
                            "lastName": "Stahel",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Stahel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 209831924,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "2d09a9dca14b4f24d82cac9d76d81967432f36fc",
            "isKey": false,
            "numCitedBy": 2366,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Introduction and Motivation. 2. One-Dimensional Estimators. 3. One-Dimensional Tests. 4. Multidimensional Estimators. 5. Estimation of Covariance Matrices and Multivariate Location. 6. Linear Models: Robust Estimation. 7. Linear Models: Robust Testing. 8. Complements and Outlook. References. Index."
            },
            "slug": "Robust-statistics:-the-approach-based-on-influence-Hampel-Ronchetti",
            "title": {
                "fragments": [],
                "text": "Robust statistics: the approach based on influence functions"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "This paper presents a meta-modelling framework for estimating the values of Covariance Matrices and Multivariate Location using one-Dimensional and Multidimensional Estimators."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2218687"
                        ],
                        "name": "P. Rousseeuw",
                        "slug": "P.-Rousseeuw",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Rousseeuw",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Rousseeuw"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152878142"
                        ],
                        "name": "A. Leroy",
                        "slug": "A.-Leroy",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Leroy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Leroy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 61563242,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "4fecc029c30800e5be60f2fbf22276c29e3c9f68",
            "isKey": false,
            "numCitedBy": 5808,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Introduction. 2. Simple Regression. 3. Multiple Regression. 4. The Special Case of One-Dimensional Location. 5. Algorithms. 6. Outlier Diagnostics. 7. Related Statistical Techniques. References. Table of Data Sets. Index."
            },
            "slug": "Robust-Regression-and-Outlier-Detection-Rousseeuw-Leroy",
            "title": {
                "fragments": [],
                "text": "Robust regression and outlier detection"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "This paper presents the results of a two-year study of the statistical treatment of outliers in the context of one-Dimensional Location and its applications to discrete-time reinforcement learning."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2256718"
                        ],
                        "name": "W. Press",
                        "slug": "W.-Press",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Press",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Press"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48590121"
                        ],
                        "name": "S. Teukolsky",
                        "slug": "S.-Teukolsky",
                        "structuredName": {
                            "firstName": "Saul",
                            "lastName": "Teukolsky",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Teukolsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2608024"
                        ],
                        "name": "W. Vetterling",
                        "slug": "W.-Vetterling",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Vetterling",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Vetterling"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35046585"
                        ],
                        "name": "B. Flannery",
                        "slug": "B.-Flannery",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Flannery",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Flannery"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 21949124,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f5686b4bcc45223a770216a161384b2542be1018",
            "isKey": false,
            "numCitedBy": 4823,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "Keywords: informatique ; numerical recipes Note: contient un CDRom Reference Record created on 2004-09-07, modified on 2016-08-08"
            },
            "slug": "Numerical-Recipes-in-FORTRAN-The-Art-of-Scientific-Press-Teukolsky",
            "title": {
                "fragments": [],
                "text": "Numerical Recipes in FORTRAN - The Art of Scientific Computing, 2nd Edition"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "This paper presents a list of recommended recipes for making CDRom decks and some examples of how these recipes can be modified to suit theommelier's needs."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 33
                            }
                        ],
                        "text": "We have explored the use of sto- Blake and Zisserman [12] developed a continuation chastic minimization techniques such as simulated anneal- method called Graduated Non-Convexity by constructing ing [9] but have found deterministic continuation methods a parameterized piecewise polynomial approximation to [10] to be more efficient and practical. the truncated quadratic."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 16
                            }
                        ],
                        "text": "A. Blake and A. Zisserman,Visual Reconstruction."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 159,
                                "start": 155
                            }
                        ],
                        "text": "ered from the computed flow field by examining where the The iterative update equations for minimizing E at step threshold tS is exceeded n 1 1 are simply [12]"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 148,
                                "start": 144
                            }
                        ],
                        "text": "The iterative update equa- To construct a convex approximation of E(u), we want all tion for minimizing E at step n 1 1 and at site s is simply [12] measurements to be treated as inliers."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 57,
                                "start": 53
                            }
                        ],
                        "text": "We have explored the use of sto- Blake and Zisserman [12] developed a continuation chastic minimization techniques such as simulated anneal- method called Graduated Non-Convexity by constructing ing [9] but have found deterministic continuation methods a parameterized piecewise polynomial approximation to [10] to be more efficient and practical."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 166,
                                "start": 158
                            }
                        ],
                        "text": "This formulation assumes that the optical flow corresponds to a single (continuously varying) a ‘‘line process’’ [19] or by using weak continuity constraints [12, 23]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Zisserman,Visual Reconstruction"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3194361"
                        ],
                        "name": "S. Geman",
                        "slug": "S.-Geman",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Geman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39239909"
                        ],
                        "name": "D. McClure",
                        "slug": "D.-McClure",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "McClure",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. McClure"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118824639,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4ad76f1ff5ba13676ec914798a98ddf1ff7bdaa1",
            "isKey": false,
            "numCitedBy": 637,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Statistical-methods-for-tomographic-image-Geman-McClure",
            "title": {
                "fragments": [],
                "text": "Statistical methods for tomographic image reconstruction"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "123962567"
                        ],
                        "name": "M. C. Seiler",
                        "slug": "M.-C.-Seiler",
                        "structuredName": {
                            "firstName": "Mary",
                            "lastName": "Seiler",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. C. Seiler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50678756"
                        ],
                        "name": "F. A. Seiler",
                        "slug": "F.-A.-Seiler",
                        "structuredName": {
                            "firstName": "Fritz",
                            "lastName": "Seiler",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. A. Seiler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62717952,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8e980fbf251ecb28ba85eb092fc66ce284bb63be",
            "isKey": false,
            "numCitedBy": 13115,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Numerical-Recipes-in-C:-The-Art-of-Scientific-Seiler-Seiler",
            "title": {
                "fragments": [],
                "text": "Numerical Recipes in C: The Art of Scientific Computing"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144055319"
                        ],
                        "name": "J. Konrad",
                        "slug": "J.-Konrad",
                        "structuredName": {
                            "firstName": "Janusz",
                            "lastName": "Konrad",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konrad"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144163839"
                        ],
                        "name": "E. Dubois",
                        "slug": "E.-Dubois",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Dubois",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Dubois"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6536871,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9535b59014250e0f570b2d2dd476949e2065e599",
            "isKey": false,
            "numCitedBy": 34,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Multigrid-Bayesian-Estimation-Of-Image-Motion-Using-Konrad-Dubois",
            "title": {
                "fragments": [],
                "text": "Multigrid Bayesian Estimation Of Image Motion Using Stochastic Relaxation"
            },
            "venue": {
                "fragments": [],
                "text": "[1988 Proceedings] Second International Conference on Computer Vision"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "18443758"
                        ],
                        "name": "B. Stuck",
                        "slug": "B.-Stuck",
                        "structuredName": {
                            "firstName": "Bart",
                            "lastName": "Stuck",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Stuck"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32951411"
                        ],
                        "name": "E. Arthurs",
                        "slug": "E.-Arthurs",
                        "structuredName": {
                            "firstName": "Ed",
                            "lastName": "Arthurs",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Arthurs"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 45053610,
            "fieldsOfStudy": [
                "History",
                "Computer Science"
            ],
            "id": "f172eaee6757ece3e7449bacb971fe8af0172c7d",
            "isKey": false,
            "numCitedBy": 582,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Computer-and-Communication-Network-Performance-Stuck-Arthurs",
            "title": {
                "fragments": [],
                "text": "A Computer and Communication Network Performance Analysis Primer (Prentice Hall, Englewood Cliffs, NJ, 1985; revised, 1987)"
            },
            "venue": {
                "fragments": [],
                "text": "Int. CMG Conference"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145162067"
                        ],
                        "name": "A. Blake",
                        "slug": "A.-Blake",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Blake",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Blake"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688869"
                        ],
                        "name": "Andrew Zisserman",
                        "slug": "Andrew-Zisserman",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Zisserman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Andrew Zisserman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 13115760,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "048e3a0904f7d964a0ade5da031a585dadc5a92f",
            "isKey": false,
            "numCitedBy": 1908,
            "numCiting": 68,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-Reconstruction-Blake-Zisserman",
            "title": {
                "fragments": [],
                "text": "Visual Reconstruction"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A framework for the robust estimation 229 – 244 . of optical flow Multigrid Bayesian estimation of image motion fields using stochastic relaxation"
            },
            "venue": {
                "fragments": [],
                "text": "Int . Conf . on Computer"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A locally adaptive window for signal analysis in optical flow fields"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Recovering motion parameters in scenes containing multiple image reconstruction"
            },
            "venue": {
                "fragments": [],
                "text": "Bull . Int . Statist . Inst . LII -"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Optical flow estimation : An error analysis of gradient - based methods with local 91 , Maui , HI , June 1991 , pp . 296 – 302 . optimization"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans . Pattern Anal . Mach . Intell ."
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A continuation method for image 93 estimation using the adiabatic approximation, in Markov Random 58 deformation and global image flow: Planar surface in motion"
            },
            "venue": {
                "fragments": [],
                "text": "Contour evolution, neighbourhood Fields: Theory and Applications"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "ization theory"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Analog hardware for Optical Flow Techniques"
            },
            "venue": {
                "fragments": [],
                "text": "Univ. of detecting discontinuities in early vision"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Robot Vision algorithm for estimating two-component image motion"
            },
            "venue": {
                "fragments": [],
                "text": "Robot Vision algorithm for estimating two-component image motion"
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Scale-space and edge detection using aniso-54 MRF-Based Motion Estimation and Segmentatropic diffusion July tion"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A locally adaptive window for signal analysis in optical flow fields"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans . Pattern Anal . Mach . Intell . matching , Int . J . Comput . Vision IEEE Trans . Pattern Anal . Mach . Intell ."
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Adapting optical flow to measure object motion in reflectance and X-ray image sequences Probabilistic solution of illposed problems in computational vision"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. ACM 36 Siggraph/Sigart Interdisciplinary Workshop on Motion: Representation and Perception"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Scene segmentation from visual line clustering"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans . Pattern Anal . Mach . Intell ."
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the estimation of optical flow: Relations between IEEE Workshop on Visual Motion"
            },
            "venue": {
                "fragments": [],
                "text": "different approaches and some new results"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Regularization of discontinuous flow fields, 40 pp. constraints for the estimation of displacement vector fields from image 81–85"
            },
            "venue": {
                "fragments": [],
                "text": "Enkelmann, An investigation of smoothness in Proc. Workshop on Visual Motion Sept. 51. A. Singh, Optical Flow Computation: A Unified Perspective"
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Scene segmentation from visual line clustering motion using global optimization"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell. IEEE Trans. Pattern Anal. Mach. Intell. PAMI"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Discontinuity Models and Multi-Layer Description Networks MIT Media Lab Vision methods for computer vision: A review"
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Comput. Vision"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proc. Int. Conf. on Computer Vision, ICCV-93"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Int. Conf. on Computer Vision, ICCV-93"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Multigrid Bayesian estimation of image motion fields using stochastic relaxation"
            },
            "venue": {
                "fragments": [],
                "text": "Int. Conf. on Computer"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 68,
                                "start": 64
                            }
                        ],
                        "text": "These approaches disable the smoothness term at intensity edges [14] or constrain it to be enConsider what happens if the flow field is discontinuous; that is, there are multiple image motions present in the forced only along the directions for which the gray-level variation is not sufficient to determine the flow vector [40]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 235,
                                "start": 207
                            }
                        ],
                        "text": "It has long been the violation of the spatial coherence assumption at motion realized that such a constraint is violated at surface boundaries and much of the recent work in motion estimation has boundaries [14, 23, 38, 40, 48, 50, 53] while ignoring violafocused on where it is violated and how to reformulate it."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Adapting optical flow to measure object motion in reflectance and X-ray image sequences, in Proc. ACM Siggraph/Sigart Interdisciplinary Workshop on Motion: Representation and Perception"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A framework for the robust"
            },
            "venue": {
                "fragments": [],
                "text": "A framework for the robust"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "BLACK AND ANANDAN"
            },
            "venue": {
                "fragments": [],
                "text": "BLACK AND ANANDAN"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "ICCV-93"
            },
            "venue": {
                "fragments": [],
                "text": "ICCV-93"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Statistical methods for tomographic"
            },
            "venue": {
                "fragments": [],
                "text": "Statistical methods for tomographic"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Statistical methods for tomographic 1 ."
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Analog hardware for Optical Flow Techniques , Technical Report RPL - TR - 9107 , Univ . of detecting discontinuities in early vision"
            },
            "venue": {
                "fragments": [],
                "text": "Robust Statistics : The Approach Based on Influence Functions"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "MRF - Based Motion Estimation and Segmenta - tropic diffusion"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans . Pattern Anal . Mach . Intell . matching , Int . J . Comput . Vision"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Robust computation of optical flow in a multi- Detection"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Int. Conf. on Computer Vision, ICCV-93"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The outlier process: Unifying line Vision, 1988, pp. 354–362. processes and robust statistics"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Computer Vision and Pattern Recognition, CVPR-94"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Computational vision and regular - to motion perception"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans . Pattern Anal . Mach . Intell ."
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Computational vision and regularto motion perception"
            },
            "venue": {
                "fragments": [],
                "text": "Biol. Cybernet"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Recovering motion parameters in scenes containing multiple image reconstruction"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Int. Conf. on Pattern Recognition, Washing- 21. F. Glazer, Hierarchical Motion Detection"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Scene segmentation from visual line clustering"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans . Pattern Anal . Mach . Intell ."
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Discontinuity Models and Multi - Layer Description Networks . Technical Report 162 , MIT Media Lab Vision methods for computer vision : A review"
            },
            "venue": {
                "fragments": [],
                "text": "Int . J . Comput . Vision"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Hierarchical model-based motion estimation, in Proc. of Second European Conference on Computer Vision, ECCV-92 (G"
            },
            "venue": {
                "fragments": [],
                "text": "Lecture Notes in Computer Science,"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A generalized brightness change model 52. G. Strang, Linear Algebra and Its Applications New for computing optical flow"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Int. Conf. on Computer Vision"
            },
            "year": 1976
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Lecture Notes 25 J. Heel, Temporally integrated surface reconstruction, in Proc"
            },
            "venue": {
                "fragments": [],
                "text": "ence on Computer Vision, ECCV-92 Int. Conf. on Comp. Vision, ICCV-90"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "David Fleet for their comments"
            },
            "venue": {
                "fragments": [],
                "text": "David Fleet for their comments"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A locally adaptive window for signal analysis in optical flow fields"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell. matching, Int. J. Comput. Vision"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "constraints for the estimation of displacement vector fields from image 81 – 85"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Pattern Anal. Mach. Intell"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Anal. Mach. Intell"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Computation of component image Trevor Darrell for providing the plant sequence, Jim Bergen for the velocity from local phase information Bonivar Shridhar for the NASA sequence"
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Comput. Vision"
            },
            "year": 1990
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 8,
            "methodology": 7
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 86,
        "totalPages": 9
    },
    "page_url": "https://www.semanticscholar.org/paper/The-Robust-Estimation-of-Multiple-Motions:-and-Flow-Black-Anandan/eee90c038f43370a29b07e46f38dfe6527143a2c?sort=total-citations"
}