{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1759801"
                        ],
                        "name": "Ermelinda Oro",
                        "slug": "Ermelinda-Oro",
                        "structuredName": {
                            "firstName": "Ermelinda",
                            "lastName": "Oro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ermelinda Oro"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1794345"
                        ],
                        "name": "M. Ruffolo",
                        "slug": "M.-Ruffolo",
                        "structuredName": {
                            "firstName": "Massimo",
                            "lastName": "Ruffolo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Ruffolo"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5900801,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "99ecff93087b010e466d47aca2eedece88929aab",
            "isKey": false,
            "numCitedBy": 87,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents PDF-TREX, an heuristic approach for table recognition and extraction from PDF documents.The heuristics starts from an initial set of basic content elements and aligns and groups them, in bottom-up way by considering only their spatial features, in order to identify tabular arrangements of information. The scope of the approach is to recognize tables contained in PDF documents as a 2-dimensional grid on a Cartesian plane and extract them as a set of cells equipped by 2-dimensional coordinates. Experiments, carried out on a dataset composed of tables contained in documents coming from different domains, shows that the approach is well performing in recognizing table cells.The approach aims at improving PDF document annotation and information extraction by providing an output that can be further processed for understanding table and document contents."
            },
            "slug": "PDF-TREX:-An-Approach-for-Recognizing-and-Tables-Oro-Ruffolo",
            "title": {
                "fragments": [],
                "text": "PDF-TREX: An Approach for Recognizing and Extracting Tables from PDF Documents"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The approach aims at improving PDF document annotation and information extraction by providing an output that can be further processed for understanding table and document contents."
            },
            "venue": {
                "fragments": [],
                "text": "2009 10th International Conference on Document Analysis and Recognition"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46398476"
                        ],
                        "name": "Y. Liu",
                        "slug": "Y.-Liu",
                        "structuredName": {
                            "firstName": "Ying",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143930195"
                        ],
                        "name": "P. Mitra",
                        "slug": "P.-Mitra",
                        "structuredName": {
                            "firstName": "Prasenjit",
                            "lastName": "Mitra",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Mitra"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145157784"
                        ],
                        "name": "C. Lee Giles",
                        "slug": "C.-Lee-Giles",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Giles",
                            "middleNames": [
                                "Lee"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Lee Giles"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 56
                            }
                        ],
                        "text": "Supervised classification models were mainly adopted by Liu et al. (2008), who designed a table detection method that leveraged heuristics to construct lines from individual characters and to select those sparse lines that occur within a table for training."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1957282,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2b05417cde0ae70e1c74a364a89e2661db5f1231",
            "isKey": false,
            "numCitedBy": 45,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "Most prior work on information extraction has focused on extracting information from text in digital documents. However, often, the most important information being reported in an article is presented in tabular form in a digital document. If the data reported in tables can be extracted and stored in a database, the data can be queried and joined with other data using database management systems. In order to prepare the data source for table search, accurately detecting the table boundary plays a crucial role for the later table structure decomposition. Table boundary detection and content extraction is a challenging problem because tabular formats are not standardized across all documents. In this paper, we propose a simple but effective preprocessing method to improve the table boundary detection performance by considering the sparse-line property of table rows. Our method easily simplifies the table boundary detection problem into the sparse line analysis problem with much less noise. We design eight line label types and apply two machine learning techniques, Conditional Random Field (CRF) and Support Vector Machines (SVM), on the table boundary detection field. The experimental results not only compare the performances between the machine learning methods and the heuristics-based method, but also demonstrate the effectiveness of the sparse line analysis in the table boundary detection."
            },
            "slug": "Identifying-table-boundaries-in-digital-documents-Liu-Mitra",
            "title": {
                "fragments": [],
                "text": "Identifying table boundaries in digital documents via sparse line detection"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper proposes a simple but effective preprocessing method to improve the table boundary detection performance by considering the sparse-line property of table rows, and designs eight line label types and applies two machine learning techniques, Conditional Random Field and Support Vector Machines, on the table Boundary detection field."
            },
            "venue": {
                "fragments": [],
                "text": "CIKM '08"
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2476953"
                        ],
                        "name": "S. Klampfl",
                        "slug": "S.-Klampfl",
                        "structuredName": {
                            "firstName": "Stefan",
                            "lastName": "Klampfl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Klampfl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144492728"
                        ],
                        "name": "Kris Jack",
                        "slug": "Kris-Jack",
                        "structuredName": {
                            "firstName": "Kris",
                            "lastName": "Jack",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kris Jack"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144361874"
                        ],
                        "name": "Roman Kern",
                        "slug": "Roman-Kern",
                        "structuredName": {
                            "firstName": "Roman",
                            "lastName": "Kern",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Roman Kern"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28078852,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fb96a4c57d32e7498bf5decd25916e5063ecfda0",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "In digital scientific articles tables are a common form of presenting information in a structured way. However, the large variability of table layouts and the lack of structural information in digital document formats pose significant challenges for information retrieval and related tasks. In this paper we present two table recognition methods based on unsupervised learning techniques and heuristics which automatically detect both the location and the structure of tables within a article stored as PDF. For both algorithms the table region detection first identifies the bounding boxes of individual tables from a set of labelled text blocks. In the second step, two different tabular structure detection methods extract a rectangular grid of table cells from the set of words contained in these table regions. We evaluate each stage of the algorithms separately and compare performance values on two data sets from different domains. We find that the table recognition performance is in line with state-of-the-art commercial systems and generalises to the non-scientific domain."
            },
            "slug": "A-Comparison-of-Two-Unsupervised-Table-Recognition-Klampfl-Jack",
            "title": {
                "fragments": [],
                "text": "A Comparison of Two Unsupervised Table Recognition Methods from Digital Scientific Articles"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Two table recognition methods based on unsupervised learning techniques and heuristics which automatically detect both the location and the structure of tables within a article stored as PDF are presented."
            },
            "venue": {
                "fragments": [],
                "text": "D Lib Mag."
            },
            "year": 2014
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2047516905"
                        ],
                        "name": "Max C. Göbel",
                        "slug": "Max-C.-Göbel",
                        "structuredName": {
                            "firstName": "Max",
                            "lastName": "Göbel",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Max C. Göbel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "18592170"
                        ],
                        "name": "Tamir Hassan",
                        "slug": "Tamir-Hassan",
                        "structuredName": {
                            "firstName": "Tamir",
                            "lastName": "Hassan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tamir Hassan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1759801"
                        ],
                        "name": "Ermelinda Oro",
                        "slug": "Ermelinda-Oro",
                        "structuredName": {
                            "firstName": "Ermelinda",
                            "lastName": "Oro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ermelinda Oro"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35203250"
                        ],
                        "name": "G. Orsi",
                        "slug": "G.-Orsi",
                        "structuredName": {
                            "firstName": "Giorgio",
                            "lastName": "Orsi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Orsi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 70
                            }
                        ],
                        "text": "A comprehensive review can be found in the final report of ICDAR 2013 Table Competition (Gobel et al. 2013), which announced the performances of recent academic and commercial systems on either table region detection or table structure analysis."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 45,
                                "start": 28
                            }
                        ],
                        "text": "The dataset11 of ICDAR 2013 Table Competition is the benchmark in which there are 67 ground-truth PDF documents of U.S. and E.U. governments."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 218,
                                "start": 201
                            }
                        ],
                        "text": "We set experiments that conduct comparison between our paradigm and the state-of-the-art Heuristics approach (Klampfl, Jack, and Kern 2014) evaluated on two datasets, i.e. ACL Anthology and ICDAR 2013 Table Competition, with standard metrics."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 120,
                                "start": 103
                            }
                        ],
                        "text": "Besides the ACL Anthology dataset, we use another benchmark corpus in addition, released by ICDAR 2013 Table Competition from a different domain to further discuss the factors of various features, learning models that may impact the performance."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 1283,
                                "start": 89
                            }
                        ],
                        "text": "A comprehensive review can be found in the final report of ICDAR 2013 Table Competition (Gobel et al. 2013), which announced the performances of recent academic and commercial systems on either table region detection or table structure analysis. Here we restrict our survey on a number of recent methods that attempt to discover table regions within PDF files. The first effort was the pdf2table3 system (Yildiz, Kaiser, and Miksch 2005), which used heuristics to detect the table region. It assumed that a table had more than one column, and a table region was formed by merging neighboring multi-lines. However, the algorithm could only handle pages with single-column layouts. The PDF-TREX system (Oro and Ruffolo 2009) considered a set of words as seeds first, and identified tables in a bottom-up manner. Specifically, words were aligned and grouped to lines based on their vertical overlap, and line segments were obtained by applying hierarchical agglomerative clustering to the words. According to the number of segments, a line was categorized into three classes: text lines, table lines, and unknown lines. Then, the table region could be found by combining contiguous table lines or unknown lines. Supervised classification models were mainly adopted by Liu et al. (2008), who designed a table detection method that leveraged heuristics to construct lines from individual characters and to select those sparse lines that occur within a table for training."
                    },
                    "intents": []
                }
            ],
            "corpusId": 206777311,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7cbc1582175b5c03b8203ec38bb25bae9d66397d",
            "isKey": true,
            "numCitedBy": 120,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Table understanding is a well studied problem in document analysis, and many academic and commercial approaches have been developed to recognize tables in several document formats, including plain text, scanned page images and born-digital, object-based formats such as PDF. Despite the abundance of these techniques, an objective comparison of their performance is still missing. The Table Competition held in the context of ICDAR 2013 is our first attempt at objectively evaluating these techniques against each other in a standardized way, across several input formats. The competition independently addresses three problems: (i) table location, (ii) table structure recognition, and (iii) these two tasks combined. We received results from seven academic systems, which we have also compared against four commercial products. This paper presents our findings."
            },
            "slug": "ICDAR-2013-Table-Competition-Göbel-Hassan",
            "title": {
                "fragments": [],
                "text": "ICDAR 2013 Table Competition"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The Table Competition held in the context of ICDAR 2013 is the first attempt at objectively evaluating these techniques against each other in a standardized way, across several input formats."
            },
            "venue": {
                "fragments": [],
                "text": "2013 12th International Conference on Document Analysis and Recognition"
            },
            "year": 2013
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145104988"
                        ],
                        "name": "M. Fan",
                        "slug": "M.-Fan",
                        "structuredName": {
                            "firstName": "Miao",
                            "lastName": "Fan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Fan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1678783"
                        ],
                        "name": "Deli Zhao",
                        "slug": "Deli-Zhao",
                        "structuredName": {
                            "firstName": "Deli",
                            "lastName": "Zhao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Deli Zhao"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116761206"
                        ],
                        "name": "Qiang Zhou",
                        "slug": "Qiang-Zhou",
                        "structuredName": {
                            "firstName": "Qiang",
                            "lastName": "Zhou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qiang Zhou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49293587"
                        ],
                        "name": "Zhiyuan Liu",
                        "slug": "Zhiyuan-Liu",
                        "structuredName": {
                            "firstName": "Zhiyuan",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zhiyuan Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1732885"
                        ],
                        "name": "T. Zheng",
                        "slug": "T.-Zheng",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Zheng",
                            "middleNames": [
                                "Fang"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Zheng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152536227"
                        ],
                        "name": "Edward Y. Chang",
                        "slug": "Edward-Y.-Chang",
                        "structuredName": {
                            "firstName": "Edward Y.",
                            "lastName": "Chang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Edward Y. Chang"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2238015,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3fbc710e6584187e143582c5be20ebcdb4ff363a",
            "isKey": false,
            "numCitedBy": 61,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "The essence of distantly supervised relation extraction is that it is an incomplete multi-label classification problem with sparse and noisy features. To tackle the sparsity and noise challenges, we propose solving the classification problem using matrix completion on factorized matrix of minimized rank. We formulate relation classification as completing the unknown labels of testing items (entity pairs) in a sparse matrix that concatenates training and testing textual features with training labels. Our algorithmic framework is based on the assumption that the rank of item-byfeature and item-by-label joint matrix is low. We apply two optimization models to recover the underlying low-rank matrix leveraging the sparsity of feature-label matrix. The matrix completion problem is then solved by the fixed point continuation (FPC) algorithm, which can find the global optimum. Experiments on two widely used datasets with different dimensions of textual features demonstrate that our low-rank matrix completion approach significantly outperforms the baseline and the state-of-the-art methods."
            },
            "slug": "Distant-Supervision-for-Relation-Extraction-with-Fan-Zhao",
            "title": {
                "fragments": [],
                "text": "Distant Supervision for Relation Extraction with Matrix Completion"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "Experiments on two widely used datasets with different dimensions of textual features demonstrate that the low-rank matrix completion approach significantly outperforms the baseline and the state-of-the-art methods."
            },
            "venue": {
                "fragments": [],
                "text": "ACL"
            },
            "year": 2014
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145104988"
                        ],
                        "name": "M. Fan",
                        "slug": "M.-Fan",
                        "structuredName": {
                            "firstName": "Miao",
                            "lastName": "Fan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Fan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116761206"
                        ],
                        "name": "Qiang Zhou",
                        "slug": "Qiang-Zhou",
                        "structuredName": {
                            "firstName": "Qiang",
                            "lastName": "Zhou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qiang Zhou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1732885"
                        ],
                        "name": "T. Zheng",
                        "slug": "T.-Zheng",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Zheng",
                            "middleNames": [
                                "Fang"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Zheng"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5641077,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "46424151c2399d401b78f6b2abf1290405e3dd7a",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "Entity linking is an indispensable operation of populating knowledge repositories for information extraction. It studies on aligning a textual entity mention to its corresponding disambiguated entry in a knowledge repository. In this paper, we propose a new paradigm named distantly supervised entity linking (DSEL), in the sense that the disambiguated entities that belong to a huge knowledge repository (Freebase) are automatically aligned to the corresponding descriptive webpages (Wiki pages). In this way, a large scale of weakly labeled data can be generated without manual annotation and fed to a classifier for linking more newly discovered entities. Compared with traditional paradigms based on solo knowledge base, DSEL benefits more via jointly leveraging the respective advantages of Freebase and Wikipedia. Specifically, the proposed paradigm facilitates bridging the disambiguated labels (Freebase) of entities and their textual descriptions (Wikipedia) for Web-scale entities. Experiments conducted on a dataset of 140,000 items and 60,000 features achieve a baseline F1-measure of 0.517. Furthermore, we analyze the feature performance and improve the F1-measure to 0.545."
            },
            "slug": "Distant-Supervision-for-Entity-Linking-Fan-Zhou",
            "title": {
                "fragments": [],
                "text": "Distant Supervision for Entity Linking"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A new paradigm named distantly supervised entity linking (DSEL) is proposed, in the sense that the disambiguated entities that belong to a huge knowledge repository (Freebase) are automatically aligned to the corresponding descriptive webpages (Wiki pages) for Web-scale entities."
            },
            "venue": {
                "fragments": [],
                "text": "PACLIC"
            },
            "year": 2015
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2632608"
                        ],
                        "name": "B. Yildiz",
                        "slug": "B.-Yildiz",
                        "structuredName": {
                            "firstName": "Burcu",
                            "lastName": "Yildiz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Yildiz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804028"
                        ],
                        "name": "K. Kaiser",
                        "slug": "K.-Kaiser",
                        "structuredName": {
                            "firstName": "Katharina",
                            "lastName": "Kaiser",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Kaiser"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1692521"
                        ],
                        "name": "S. Miksch",
                        "slug": "S.-Miksch",
                        "structuredName": {
                            "firstName": "Silvia",
                            "lastName": "Miksch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Miksch"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17242556,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5dc08add84ef4070b00c2b43dac037bcfd6df460",
            "isKey": false,
            "numCitedBy": 100,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Tables are a common structuring element in many documents, such as PDF files. To reuse such tables, appropriate methods need to be develop, which capture the structure and the content information. We have developed several heuristics which together recognize and decompose tables in PDF files and store the extracted data in a structured data format (XML) for easier reuse. Additionally, we implemented a prototype, which gives the user the ability of making adjustments on the extracted data. Our work shows that purely heuristic-based approaches can achieve good results, especially for lucid tables."
            },
            "slug": "pdf2table:-A-Method-to-Extract-Table-Information-Yildiz-Kaiser",
            "title": {
                "fragments": [],
                "text": "pdf2table: A Method to Extract Table Information from PDF Files"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This work developed several heuristics which together recognize and decompose tables in PDF files and store the extracted data in a structured data format (XML) for easier reuse and shows that purely heuristic-based approaches can achieve good results, especially for lucid tables."
            },
            "venue": {
                "fragments": [],
                "text": "IICAI"
            },
            "year": 2005
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 45,
                                "start": 28
                            }
                        ],
                        "text": "The dataset11 of ICDAR 2013 Table Competition is the benchmark in which there are 67 ground-truth PDF documents of U.S. and E.U. governments."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 218,
                                "start": 201
                            }
                        ],
                        "text": "We set experiments that conduct comparison between our paradigm and the state-of-the-art Heuristics approach (Klampfl, Jack, and Kern 2014) evaluated on two datasets, i.e. ACL Anthology and ICDAR 2013 Table Competition, with standard metrics."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 106,
                                "start": 89
                            }
                        ],
                        "text": "A comprehensive review can be found in the final report of ICDAR 2013 Table Competition (Gobel et al. 2013), which announced the performances of recent academic and commercial systems on either table region detection or table structure analysis."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 120,
                                "start": 103
                            }
                        ],
                        "text": "Besides the ACL Anthology dataset, we use another benchmark corpus in addition, released by ICDAR 2013 Table Competition from a different domain to further discuss the factors of various features, learning models that may impact the performance."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Icdar 2013 table competition. In Document Analysis and Recognition (ICDAR), 2013 12th International Conference on"
            },
            "venue": {
                "fragments": [],
                "text": "Icdar 2013 table competition. In Document Analysis and Recognition (ICDAR), 2013 12th International Conference on"
            },
            "year": 2013
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "7 https://github.com/ptnplanet/ Java-Naive-Bayes-Classifier"
            },
            "venue": {
                "fragments": [],
                "text": "7 https://github.com/ptnplanet/ Java-Naive-Bayes-Classifier"
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 1,
            "methodology": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 9,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Table-Region-Detection-on-Large-scale-PDF-Files-Fan-Kim/5d8d00709eec584a597891a0773086a457d7cd0e?sort=total-citations"
}