{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2585959"
                        ],
                        "name": "A. V. van Doorn",
                        "slug": "A.-V.-van-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "van Doorn",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. V. van Doorn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 22681338,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "23441c50e7180c119bf9a37f86f280286d4f3a51",
            "isKey": false,
            "numCitedBy": 95,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown that there exist classes of useful partial solutions to what has become known as the structure from motion problem, that is, the problem of finding the three-dimensional shape as well as the movement in space of objects on the basis of their optical projections in several distinct phases of the movement. The class of solutions treated in this paper is quite different from the usual treatment in that the rigidity condition is relaxed so as to include the important class of bending deformations. For instance, we show a case in which important aspects of shape are obtained for a configuration of seven points, no four of which move in a rigid way, and which can be obtained from only two views. (This violates all requirements of the structure from motion theorem.) We discuss an algorithm that obtains the three-dimensional configuration of a polyhedral vertex up to a relief transformation (a similar transformation to the one that maps object to image space in paraxial optics), in the presence of arbitrary flections of the edges, from the projection and the instantaneous-movement parallax. Such a solution can, for instance, be used to predict side views of the vertex, as is demonstrated for a specific example. The solution can be used in an iterative fashion on triangulations to solve the case of extended curved surfaces suffering arbitrary bendings. The class of bending deformations encompasses all deformations that conserve distances along the surface (but not necessarily through space); thus stretchings are excluded. Practical examples include, e.g., deformations of flexible but nonstretchable shells. Actual numerical examples illustrate the practicability of the method."
            },
            "slug": "Depth-and-shape-from-differential-perspective-in-of-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "Depth and shape from differential perspective in the presence of bending deformations."
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "It is shown that there exist classes of useful partial solutions to what has become known as the structure from motion problem, that is, the problem of finding the three-dimensional shape as well as the movement in space of objects on the basis of their optical projections in several distinct phases of the movement."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2058144655"
                        ],
                        "name": "B. M. Bennett",
                        "slug": "B.-M.-Bennett",
                        "structuredName": {
                            "firstName": "Bruce",
                            "lastName": "Bennett",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. M. Bennett"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2259916"
                        ],
                        "name": "Donald D. Hoffman",
                        "slug": "Donald-D.-Hoffman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Hoffman",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Donald D. Hoffman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31503862"
                        ],
                        "name": "J. Nicola",
                        "slug": "J.-Nicola",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Nicola",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Nicola"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145080259"
                        ],
                        "name": "C. Prakash",
                        "slug": "C.-Prakash",
                        "structuredName": {
                            "firstName": "Chetan",
                            "lastName": "Prakash",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Prakash"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16424029,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f9784290b4810f85acc1d2b5ef6bdda4f84ef069",
            "isKey": false,
            "numCitedBy": 89,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "We study the inference of rigid three-dimensional interpretations for the structure and motion of four or more moving points from but two orthographic views of the points. We develop an algorithm to determine whether image data are compatible with a rigid interpretation. As a corollary of this result we find that the measure of false targets (roughly, nonrigid objects that appear rigid) is zero. We find that if the two views have at least one rigid interpretation, then in fact there is a canonical one-parameter family of rigid interpretations; we show how to compute this family, and we describe precisely how the rigid interpretations vary within it. Since only two views are used, this analysis is relevant also to stereo vision."
            },
            "slug": "Structure-from-two-orthographic-views-of-rigid-Bennett-Hoffman",
            "title": {
                "fragments": [],
                "text": "Structure from two orthographic views of rigid motion."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is found that if the two views have at least one rigid interpretation, then there is a canonical one-parameter family of rigid interpretations; it is shown how to compute this family, and precisely how the rigid interpretations vary within it is described."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 146278985,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "801c802366800354d971be415449c0ba41f43194",
            "isKey": false,
            "numCitedBy": 2090,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This book uses the methodology of artificial intelligence to investigate the phenomena of visual motion perception: how the visual system constructs descriptions of the environment in terms of objects, their three-dimensional shape, and their motion through space, on the basis of the changing image that reaches the eye. The author has analyzed the computations performed in the course of visual motion analysis. Workable schemes able to perform certain tasks performed by the visual system have been constructed and used as vehicles for investigating the problems faced by the visual system and its methods for solving them.Two major problems are treated: first, the correspondence problem, which concerns the identification of image elements that represent the same object at different times, thereby maintaining the perceptual identity of the object in motion or in change. The second problem is the three-dimensional interpretation of the changing image once a correspondence has been established.The author's computational approach to visual theory makes the work unique, and it should be of interest to psychologists working in visual perception and readers interested in cognitive studies in general, as well as computer scientists interested in machine vision, theoretical neurophysiologists, and philosophers of science."
            },
            "slug": "The-Interpretation-of-Visual-Motion-Ullman",
            "title": {
                "fragments": [],
                "text": "The Interpretation of Visual Motion"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153652752"
                        ],
                        "name": "Thomas S. Huang",
                        "slug": "Thomas-S.-Huang",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Huang",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Thomas S. Huang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115641996"
                        ],
                        "name": "Chia-Hoang Lee",
                        "slug": "Chia-Hoang-Lee",
                        "structuredName": {
                            "firstName": "Chia-Hoang",
                            "lastName": "Lee",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chia-Hoang Lee"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 33768570,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "ae4276e53e4e188d3fd74c698b263a0e6824e1f4",
            "isKey": false,
            "numCitedBy": 145,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors review S. Ullman's (1979) results on deriving motion and structure from orthographic views. They present two further results: they show that two orthographic views allow an unresolvably infinite number of solutions for the motion/structure of a rigid body; and they give a linear algorithm for solving for motion/structure from four-point correspondences over the views.<<ETX>>"
            },
            "slug": "Motion-and-structure-from-orthographic-projections-Huang-Lee",
            "title": {
                "fragments": [],
                "text": "Motion and structure from orthographic projections"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "Two results are presented: two orthographic views allow an uncountably infinite number of solutions to motion/structure of a rigid body, and a linear algorithm for solving motion/Structure from four point correspondences over three views."
            },
            "venue": {
                "fragments": [],
                "text": "[1988 Proceedings] 9th International Conference on Pattern Recognition"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16862344"
                        ],
                        "name": "R. Thouless",
                        "slug": "R.-Thouless",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Thouless",
                            "middleNames": [
                                "Henry"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Thouless"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4126079,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d3b61032eb48d09b6048bd59b4b4d6d46243cf79",
            "isKey": false,
            "numCitedBy": 44,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "FECHNER'S law, that sensation intensity is proportional to the logarithm of the intensity of the stimulus divided by its absolute threshold value (E = klog(R/R0)) presupposes that there is a single sensation intensity for every stimulus strength. This is true not only of Fechner' law but also of any alternative law of the general form E=f(R). Such invariable correspondence is only found, however, under artificially simplified conditions of perception. Under other conditions, it may break down at either of two points in the total process of perceiving: external stimulus → peripheral physiological process → central physiological process → phenomenon (that is, what is experienced)."
            },
            "slug": "Phenomenal-Regression-to-the-Real-Object-Thouless",
            "title": {
                "fragments": [],
                "text": "Phenomenal Regression to the Real Object"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "FECHNER'S law, that sensation intensity is proportional to the logarithm of the intensity of the stimulus divided by its absolute threshold value (E = klog(R/R0), presupposes that there is a single sensation intensity for every stimulus strength."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1933
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30457331"
                        ],
                        "name": "J. Gibson",
                        "slug": "J.-Gibson",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Gibson",
                            "middleNames": [
                                "Jerome"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gibson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 84
                            }
                        ],
                        "text": "This idea has a venerable history, from Euclid's Optics' to Helmholtz(2) and Gibson.(3) The mathematics of the reconstruction of spatial structure from projections starts (in serious form) with Lambert's treatise on the free perspective (Freye Perspektive)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 195034367,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "62aa0f87d29e0fb660d76b66a10880042d412f11",
            "isKey": false,
            "numCitedBy": 2204,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-perception-of-the-visual-world-Gibson",
            "title": {
                "fragments": [],
                "text": "The perception of the visual world"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1950
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7977369"
                        ],
                        "name": "A. Doorn",
                        "slug": "A.-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "Doorn",
                            "middleNames": [
                                "J.",
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Doorn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 115611460,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0a37796f28f3cae92bd6179faa674f6e34b541f7",
            "isKey": false,
            "numCitedBy": 410,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Invariant-Properties-of-the-Motion-Parallax-Field-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "Invariant Properties of the Motion Parallax Field due to the Movement of Rigid Bodies Relative to an Observer"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "123962567"
                        ],
                        "name": "M. C. Seiler",
                        "slug": "M.-C.-Seiler",
                        "structuredName": {
                            "firstName": "Mary",
                            "lastName": "Seiler",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. C. Seiler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50678756"
                        ],
                        "name": "F. A. Seiler",
                        "slug": "F.-A.-Seiler",
                        "structuredName": {
                            "firstName": "Fritz",
                            "lastName": "Seiler",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. A. Seiler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62717952,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8e980fbf251ecb28ba85eb092fc66ce284bb63be",
            "isKey": false,
            "numCitedBy": 13115,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Numerical-Recipes-in-C:-The-Art-of-Scientific-Seiler-Seiler",
            "title": {
                "fragments": [],
                "text": "Numerical Recipes in C: The Art of Scientific Computing"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Eliminate affine ambiguity! Courtesy of Silvio Savarese.! Reconstruction"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Candide, a parametrized face,\" Rep. LiTH-ISY1-0866 (Linkbping University, Linkbping"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Thoules, \"Phenomenal regression to the real object,\" Parts I and II, Brit"
            },
            "venue": {
                "fragments": [],
                "text": "J. Psychol"
            },
            "year": 1931
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Helmholtz, Handbuch der physiologischen Optik"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1911
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "View - ing - distance and variance - of - movement detection , \" submitted to"
            },
            "venue": {
                "fragments": [],
                "text": "J . Opt . Soc . Am . A . 11 . A . von Hildebrand , Das Problem der Form in der bildenden Kunst"
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Zur Ermittlung eines Objektes aus zwei Perspektiven mit innerer Orientierung,\" Sitzungber"
            },
            "venue": {
                "fragments": [],
                "text": "Akad. Wiss. Wien Math. Naturwiss. Kl. Abt"
            },
            "year": 1913
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 14,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Affine-structure-from-motion.-Koenderink-Doorn/8b77030426b39ddb083e5a729f7f2bbaaae37cdb?sort=total-citations"
}