{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46432310"
                        ],
                        "name": "J. G. Augustson",
                        "slug": "J.-G.-Augustson",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Augustson",
                            "middleNames": [
                                "Gary"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. G. Augustson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1777876"
                        ],
                        "name": "J. Minker",
                        "slug": "J.-Minker",
                        "structuredName": {
                            "firstName": "Jack",
                            "lastName": "Minker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Minker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1601102,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2db3ea7a1b1871514545e829c3e1586d4d72e4e2",
            "isKey": false,
            "numCitedBy": 248,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "Several graph theoretic cluster techniques aimed at the automatic generation of thesauri for information retrieval systems are explored. Experimental cluster analysis is performed on a sample corpus of 2267 documents. A term-term similarity matrix is constructed for the 3950 unique terms used to index the documents. Various threshold values, T, are applied to the similarity matrix to provide a series of binary threshold matrices. The corresponding graph of each binary threshold matrix is used to obtain the term clusters.\nThree definitions of a cluster are analyzed: (1) the connected components of the threshold matrix; (2) the maximal complete subgraphs of the connected components of the threshold matrix; (3) clusters of the maximal complete subgraphs of the threshold matrix, as described by Gotlieb and Kumar.\nAlgorithms are described and analyzed for obtaining each cluster type. The algorithms are designed to be useful for large document and index collections. Two algorithms have been tested that find maximal complete subgraphs. An algorithm developed by Bierstone offers a significant time improvement over one suggested by Bonner.\nFor threshold levels T ≥ 0.6, basically the same clusters are developed regardless of the cluster definition used. In such situations one need only find the connected components of the graph to develop the clusters."
            },
            "slug": "An-Analysis-of-Some-Graph-Theoretical-Cluster-Augustson-Minker",
            "title": {
                "fragments": [],
                "text": "An Analysis of Some Graph Theoretical Cluster Techniques"
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "Several graph theoretic cluster techniques aimed at the automatic generation of thesauri for information retrieval systems are explored and two algorithms have been tested that find maximal complete subgraphs."
            },
            "venue": {
                "fragments": [],
                "text": "JACM"
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49279054"
                        ],
                        "name": "M. Shen",
                        "slug": "M.-Shen",
                        "structuredName": {
                            "firstName": "Mok-Kong",
                            "lastName": "Shen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Shen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10911495,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "88748143475cd527a9db91bc1c949c1d43e456e8",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "a given precision is left for the individual programmer. Programmed for the GE-225, accurate answers of tan-1 1 = ~-/4 were obtained for double precision in comparison with the known values. The semiiterative method can be programmed in a very short time for any multiple precision and is efficient in comparison with taking more terms of the Taylor's series, taking into account the divisions required for the square root process. Telescoped Taylor's series may be used if desired, but a shorter telescoped Taylor's series can be used if the semi-iterative scheme is employed. Telescoping, however, is expected to take more storage for the coefficients than a simple truncated series. Telescoping also discards the advantage of flexibility and applicability to n-tuple precision programs. A contribution to this department must be in the form of an Algorithm, a Certification, or a Remark. Contributions should be sent in duplicate to the Editor and should be written in a style patterned after recent contributions appearing in this department. An algorithm must be written in ALGOL 60 (see Communications of the ACM, January 1963) and accompanied by a statement to the Editor indicating that it has been tested and indicating which computer and programming language was used. For the convenience of the printer, contributors are requested to double space material and underline delimiters and logical values that arc to appear in boldface type. Whenever feasible, Certifications should include numerical values. Although each algorithm has been tested by its contributor , no warranty, express or implied, is made by the contributor , the Editor, or the Association for Computing Machinery as to the accuracy and functioning of the algorithm and related algorithm material, and no responsibility is assumed by the contributor, the Editor, or the Association for Computing Machinery in connection there-with. The reproduction of algorithms appearing in this department is explicitly permitted without any charge. When reproduction is for publication purposes, reference must be made to the algorithm author and to the Communications issue bearing the algorithm. comment If the array S contains a certain permutation of the N digits 1, 2,... , N before call, the procedure will replace this with the lexicographically next permutation. If initializa-tion is required set the Boolean variable I equal true, which will be changed automatically to false through the first call, otherwise set I equal false. If no further permutation can be generated, exit will be made to …"
            },
            "slug": "Algorithm-202:-generation-of-permutations-in-order-Shen",
            "title": {
                "fragments": [],
                "text": "Algorithm 202: generation of permutations in lexicographical order"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The semiiterative method can be programmed in a very short time for any multiple precision and is efficient in comparison with taking more terms of the Taylor's series, taking into account the divisions required for the square root process."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40190725"
                        ],
                        "name": "Gordon D. Mulligan",
                        "slug": "Gordon-D.-Mulligan",
                        "structuredName": {
                            "firstName": "Gordon",
                            "lastName": "Mulligan",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gordon D. Mulligan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1806664"
                        ],
                        "name": "D. Corneil",
                        "slug": "D.-Corneil",
                        "structuredName": {
                            "firstName": "Derek",
                            "lastName": "Corneil",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Corneil"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6852519,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1211ace7fbfc56016cbc42cd38034f263cdac350",
            "isKey": false,
            "numCitedBy": 75,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "Recently Augustson and Minker presented a version of the Bierstone algorithm for finding the set of cliques of a finite undirected linear graph. Their version contains two errors. In this paper the counterexamples to their version and the modified version of the Bierstone algorithm are presented."
            },
            "slug": "Corrections-to-Bierstone's-Algorithm-for-Generating-Mulligan-Corneil",
            "title": {
                "fragments": [],
                "text": "Corrections to Bierstone's Algorithm for Generating Cliques"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "The counterexamples to their and the modified version of the Bierstone algorithm for finding the set of cliques of a finite undirected linear graph are presented."
            },
            "venue": {
                "fragments": [],
                "text": "J. ACM"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107127756"
                        ],
                        "name": "J. Moon",
                        "slug": "J.-Moon",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Moon",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Moon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "88620770"
                        ],
                        "name": "L. Moser",
                        "slug": "L.-Moser",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Moser",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Moser"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9855414,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0e131712a8986087477423a2c8b690dc19330249",
            "isKey": false,
            "numCitedBy": 789,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "A clique is a maximal complete subgraph of a graph. The maximum number of cliques possible in a graph withn nodes is determined. Also, bounds are obtained for the number of different sizes of cliques possible in such a graph."
            },
            "slug": "On-cliques-in-graphs-Moon-Moser",
            "title": {
                "fragments": [],
                "text": "On cliques in graphs"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35220065"
                        ],
                        "name": "C. Bron",
                        "slug": "C.-Bron",
                        "structuredName": {
                            "firstName": "Coenraad",
                            "lastName": "Bron",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Bron"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2086559429"
                        ],
                        "name": "Jagm Kerbosch",
                        "slug": "Jagm-Kerbosch",
                        "structuredName": {
                            "firstName": "Jagm",
                            "lastName": "Kerbosch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jagm Kerbosch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2069799840"
                        ],
                        "name": "Hj Henk Schell",
                        "slug": "Hj-Henk-Schell",
                        "structuredName": {
                            "firstName": "Hj",
                            "lastName": "Schell",
                            "middleNames": [
                                "Henk"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hj Henk Schell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 56370767,
            "fieldsOfStudy": [
                "Materials Science"
            ],
            "id": "cab7dec4b0b31871c0e659fb972a88c969eed429",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "• A submitted manuscript is the version of the article upon submission and before peer-review. There can be important differences between the submitted version and the official published version of record. People interested in the research are advised to contact the author for the final version of the publication, or visit the DOI to the publisher's website. • The final author version and the galley proof are versions of the publication after peer review. • The final published version features the final layout of the paper including the volume, issue and page numbers."
            },
            "slug": "Finding-cliques-in-an-undirected-graph-Bron-Kerbosch",
            "title": {
                "fragments": [],
                "text": "Finding cliques in an undirected graph"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "The final author version and the galley proof are versions of the publication after peer review that features the final layout of the paper including the volume, issue and page numbers."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Added in proof: An improved version of BESTLEX, viz. Algorithm 323A, Generation of Permutation Sequences: Part 2, by"
            },
            "venue": {
                "fragments": [],
                "text": "Comm. ACM"
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 6,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Algorithm-457:-finding-all-cliques-of-an-undirected-Bron-Kerbosch/0e8e7455ce92703e4dd5413f68582a70be49b91b?sort=total-citations"
}