{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729041"
                        ],
                        "name": "J. Canny",
                        "slug": "J.-Canny",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Canny",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Canny"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13284142,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fcf9fc4e23b45345c2404ce7d6cb0fc9dea2c9ec",
            "isKey": false,
            "numCitedBy": 27662,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a computational approach to edge detection. The success of the approach depends on the definition of a comprehensive set of goals for the computation of edge points. These goals must be precise enough to delimit the desired behavior of the detector while making minimal assumptions about the form of the solution. We define detection and localization criteria for a class of edges, and present mathematical forms for these criteria as functionals on the operator impulse response. A third criterion is then added to ensure that the detector has only one response to a single edge. We use the criteria in numerical optimization to derive detectors for several common image features, including step edges. On specializing the analysis to step edges, we find that there is a natural uncertainty principle between detection and localization performance, which are the two main goals. With this principle we derive a single operator shape which is optimal at any scale. The optimal detector has a simple approximate implementation in which edges are marked at maxima in gradient magnitude of a Gaussian-smoothed image. We extend this simple detector using operators of several widths to cope with different signal-to-noise ratios in the image. We present a general method, called feature synthesis, for the fine-to-coarse integration of information from operators at different scales. Finally we show that step edge detector performance improves considerably as the operator point spread function is extended along the edge."
            },
            "slug": "A-Computational-Approach-to-Edge-Detection-Canny",
            "title": {
                "fragments": [],
                "text": "A Computational Approach to Edge Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "There is a natural uncertainty principle between detection and localization performance, which are the two main goals, and with this principle a single operator shape is derived which is optimal at any scale."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145730992"
                        ],
                        "name": "V. Torre",
                        "slug": "V.-Torre",
                        "structuredName": {
                            "firstName": "Vincent",
                            "lastName": "Torre",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Torre"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1065794,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a8059c598e4f9643eb040685af0d6e7055391048",
            "isKey": false,
            "numCitedBy": 1214,
            "numCiting": 59,
            "paperAbstract": {
                "fragments": [],
                "text": "Edge detection is the process that attempts to characterize the intensity changes in the image in terms of the physical processes that have originated them. A critical, intermediate goal of edge detection is the detection and characterization of significant intensity changes. This paper discusses this part of the edge detection problem. To characterize the types of intensity changes derivatives of different types, and possibly different scales, are needed. Thus, we consider this part of edge detection as a problem in numerical differentiation. We show that numerical differentiation of images is an ill-posed problem in the sense of Hadamard. Differentiation needs to be regularized by a regularizing filtering operation before differentiation. This shows that this part of edge detection consists of two steps, a filtering step and a differentiation step. Following this perspective, the paper discusses in detail the following theoretical aspects of edge detection. 1) The properties of different types of filters-with minimal uncertainty, with a bandpass spectrum, and with limited support-are derived. Minimal uncertainty filters optimize a tradeoff between computational efficiency and regularizing properties. 2) Relationships among several 2-D differential operators are established. In particular, we characterize the relation between the Laplacian and the second directional derivative along the gradient. Zero crossings of the Laplacian are not the only features computed in early vision. 3) Geometrical and topological properties of the zero crossings of differential operators are studied in terms of transversality and Morse theory."
            },
            "slug": "On-Edge-Detection-Torre-Poggio",
            "title": {
                "fragments": [],
                "text": "On Edge Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that numerical differentiation of images is an ill-posed problem in the sense of Hadamard, and that this part of edge detection consists of two steps, a filtering step and a differentiation step."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2909274"
                        ],
                        "name": "V. S. Nalwa",
                        "slug": "V.-S.-Nalwa",
                        "structuredName": {
                            "firstName": "Vishvjit",
                            "lastName": "Nalwa",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. S. Nalwa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6160978,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "8b992ac0e21236a83788623a69c6f9803075bcdb",
            "isKey": false,
            "numCitedBy": 494,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "An edge in an image corresponds to a discontinuity in the intensity surface of the underlying scene. It can be approximated by a piecewise straight curve composed of edgels, i.e., short, linear edge-elements, each characterized by a direction and a position. The approach to edgel-detection here, is to fit a series of one-dimensional surfaces to each window (kernel of the operator) and accept the surface-description which is adequate in the least squares sense and has the fewest parameters. (A one-dimensional surface is one which is constant along some direction.) The tanh is an adequate basis for the stepedge and its combinations are adequate for the roofedge and the line-edge. The proposed method of step-edgel detection is robust with respect to noise; for (step-size/¿noise) ¿ 2.5, it has subpixel position localization (¿position < ¿) and an angular localization better than 10°; further, it is designed to be insensitive to smooth shading. These results are demonstrated by some simple analysis, statistical data, and edgelimages. Also included is a comparison of performance on a real image, with a typical operator (Difference-of-Gaussians). The results indicate that the proposed operator is superior with respect to detection, localization, and resolution."
            },
            "slug": "On-Detecting-Edges-Nalwa-Binford",
            "title": {
                "fragments": [],
                "text": "On Detecting Edges"
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "The results indicate that the proposed operator is superior with respect to detection, localization, and resolution."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2065808108"
                        ],
                        "name": "Pietro Perona",
                        "slug": "Pietro-Perona",
                        "structuredName": {
                            "firstName": "Pietro",
                            "lastName": "Perona",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Pietro Perona"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143751119"
                        ],
                        "name": "Jitendra Malik",
                        "slug": "Jitendra-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jitendra Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14502908,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "496c3d75b81b336411e53da1ac632a8139655604",
            "isKey": false,
            "numCitedBy": 12585,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "A new definition of scale-space is suggested, and a class of algorithms used to realize a diffusion process is introduced. The diffusion coefficient is chosen to vary spatially in such a way as to encourage intraregion smoothing rather than interregion smoothing. It is shown that the 'no new maxima should be generated at coarse scales' property of conventional scale space is preserved. As the region boundaries in the approach remain sharp, a high-quality edge detector which successfully exploits global information is obtained. Experimental results are shown on a number of images. Parallel hardware implementations are made feasible because the algorithm involves elementary, local operations replicated over the image. >"
            },
            "slug": "Scale-Space-and-Edge-Detection-Using-Anisotropic-Perona-Malik",
            "title": {
                "fragments": [],
                "text": "Scale-Space and Edge Detection Using Anisotropic Diffusion"
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "A new definition of scale-space is suggested, and a class of algorithms used to realize a diffusion process is introduced, chosen to vary spatially in such a way as to encourage intra Region smoothing rather than interregion smoothing."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145482214"
                        ],
                        "name": "A. Korn",
                        "slug": "A.-Korn",
                        "structuredName": {
                            "firstName": "Axel",
                            "lastName": "Korn",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Korn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 27612951,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "45d353aec60b2ce725761e8847b81222633da6c9",
            "isKey": false,
            "numCitedBy": 145,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "The symbolic representation of gray-value variations is studied, with emphasis on the gradient of the image function. The goal is to relate the results of this analysis to the structure of the picture, which is determined by the physics of the image generation process. Candidates for contour points are the maximal magnitudes of the gray-value gradient for different scales in the direction of the gradient. Based on the output of such a bank of gradient filters, a procedure is proposed to select automatically a suitable scale, and with that, the size of the right convolution kernel. The application of poorly adapted filters, which make the exact localization of gray-value corners or T-, X-, and Y-junctions more difficult, is thus avoided. Possible gaps at such junctions are discussed for images of real scenes, and possibilities for the closure of some of these gaps are demonstrated when the extrema of the magnitudes of the gray-value gradients are used. >"
            },
            "slug": "Toward-a-Symbolic-Representation-of-Intensity-in-Korn",
            "title": {
                "fragments": [],
                "text": "Toward a Symbolic Representation of Intensity Changes in Images"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "The symbolic representation of gray-value variations is studied, with emphasis on the gradient of the image function, and a procedure is proposed to select automatically a suitable scale, and with that, the size of the right convolution kernel."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746242"
                        ],
                        "name": "S. Mallat",
                        "slug": "S.-Mallat",
                        "structuredName": {
                            "firstName": "Stéphane",
                            "lastName": "Mallat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mallat"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3148558"
                        ],
                        "name": "S. Zhong",
                        "slug": "S.-Zhong",
                        "structuredName": {
                            "firstName": "Sifen",
                            "lastName": "Zhong",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zhong"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5698299,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f42d06ff2160dae7412c299619c04f63395b784b",
            "isKey": false,
            "numCitedBy": 3302,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "A multiscale Canny edge detection is equivalent to finding the local maxima of a wavelet transform. The authors study the properties of multiscale edges through the wavelet theory. For pattern recognition, one often needs to discriminate different types of edges. They show that the evolution of wavelet local maxima across scales characterize the local shape of irregular structures. Numerical descriptors of edge types are derived. The completeness of a multiscale edge representation is also studied. The authors describe an algorithm that reconstructs a close approximation of 1-D and 2-D signals from their multiscale edges. For images, the reconstruction errors are below visual sensitivity. As an application, a compact image coding algorithm that selects important edges and compresses the image data by factors over 30 has been implemented. >"
            },
            "slug": "Characterization-of-Signals-from-Multiscale-Edges-Mallat-Zhong",
            "title": {
                "fragments": [],
                "text": "Characterization of Signals from Multiscale Edges"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The authors describe an algorithm that reconstructs a close approximation of 1-D and 2-D signals from their multiscale edges and shows that the evolution of wavelet local maxima across scales characterize the local shape of irregular structures."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3358665,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "3b5cff5f874b7c7056d4ac58fc976458c2ab95a7",
            "isKey": false,
            "numCitedBy": 933,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "We use the facet model to accomplish step edge detection. The essence of the facet model is that any analysis made on the basis of the pixel values in some neighborhood has its final authoritative interpretation relative to the underlying gray tone intensity surface of which the neighborhood pixel values are observed noisy samples. With regard to edge detection, we define an edge to occur in a pixel if and only if there is some point in the pixel's area having a negatively sloped zero crossing of the second directional derivative taken in the direction of a nonzero gradient at the pixel's center. Thus, to determine whether or not a pixel should be marked as a step edge pixel, its underlying gray tone intensity surface must be estimated on the basis of the pixels in its neighborhood. For this, we use a functional form consisting of a linear combination of the tensor products of discrete orthogonal polynomials of up to degree three. The appropriate directional derivatives are easily computed from this kind of a function. Upon comparing the performance of this zero crossing of second directional derivative operator with the Prewitt gradient operator and the Marr-Hildreth zero crossing of the Laplacian operator, we find that it is the best performer; next is the Prewitt gradient operator. The Marr-Hildreth zero crossing of the Laplacian operator performs the worst."
            },
            "slug": "Digital-Step-Edges-from-Zero-Crossing-of-Second-Haralick",
            "title": {
                "fragments": [],
                "text": "Digital Step Edges from Zero Crossing of Second Directional Derivatives"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "The facet model is used to accomplish step edge detection and the Marr-Hildreth zero crossing of the Laplacian operator is found that it is the best performer; next is the Prewitt gradient operator."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1575320156"
                        ],
                        "name": "T. Koller",
                        "slug": "T.-Koller",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Koller",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Koller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738140"
                        ],
                        "name": "G. Gerig",
                        "slug": "G.-Gerig",
                        "structuredName": {
                            "firstName": "Guido",
                            "lastName": "Gerig",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Gerig"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707791"
                        ],
                        "name": "G. Székely",
                        "slug": "G.-Székely",
                        "structuredName": {
                            "firstName": "Gábor",
                            "lastName": "Székely",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Székely"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2750815"
                        ],
                        "name": "Daniel Dettwiler",
                        "slug": "Daniel-Dettwiler",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Dettwiler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Daniel Dettwiler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10599014,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "6abbe8e9b07036485479f8bdb47140b1558cbeaa",
            "isKey": false,
            "numCitedBy": 385,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Presents a novel, parameter-free technique for the segmentation and local description of line structures on multiple scales, both in 2D and in 3D. The algorithm is based on a nonlinear combination of linear filters and searches for elongated, symmetric line structures, while suppressing the response to edges. The filtering process creates one sharp maximum across the line-feature profile and across the scale-space. The multi-scale response reflects local contrast and is independent of the local width. The filter is steerable in both the orientation and scale domains, leading to an efficient, parameter-free implementation. A local description is obtained that describes the contrast, the position of the center-line, the width, the polarity, and the orientation of the line. Examples of images from different application domains demonstrate the generic nature of the line segmentation scheme. The 3D filtering is applied to magnetic resonance volume data in order to segment cerebral blood vessels.<<ETX>>"
            },
            "slug": "Multiscale-detection-of-curvilinear-structures-in-Koller-Gerig",
            "title": {
                "fragments": [],
                "text": "Multiscale detection of curvilinear structures in 2-D and 3-D image data"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The algorithm is based on a nonlinear combination of linear filters and searches for elongated, symmetric line structures, while suppressing the response to edges, leading to an efficient, parameter-free implementation."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE International Conference on Computer Vision"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1402187438"
                        ],
                        "name": "P. Saint-Marc",
                        "slug": "P.-Saint-Marc",
                        "structuredName": {
                            "firstName": "Philippe",
                            "lastName": "Saint-Marc",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Saint-Marc"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115896375"
                        ],
                        "name": "Jer-Sen Chen",
                        "slug": "Jer-Sen-Chen",
                        "structuredName": {
                            "firstName": "Jer-Sen",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jer-Sen Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3463966"
                        ],
                        "name": "G. Medioni",
                        "slug": "G.-Medioni",
                        "structuredName": {
                            "firstName": "Gérard",
                            "lastName": "Medioni",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Medioni"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11541559,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "74c2c70369d408a0809a58e2dd95538dd0eb60fb",
            "isKey": false,
            "numCitedBy": 463,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors present a method to smooth a signal-whether it is an intensity image, a range image, or a contour-which preserves discontinuities and thus facilitates their detection. This is achieved by repeatedly convolving the signal with a very small averaging filter modulated by a measure of the signal discontinuity at each point. This process is related to the anisotropic diffusion reported by P. Perona and J. Malik (1987) but it has a much simpler formulation and is not subject to instability or divergence. Real examples show how this approach can be applied to the smoothing of various types of signals. The detected features do not move, and thus no tracking is needed. The last property makes it possible to derive a novel scale-space representation of a signal using a small number of scales. Finally, this process is easily implemented on parallel architectures: the running time on a 16 K connection machine is three orders of magnitude faster than on a serial machine.<<ETX>>"
            },
            "slug": "Adaptive-smoothing:-a-general-tool-for-early-vision-Saint-Marc-Chen",
            "title": {
                "fragments": [],
                "text": "Adaptive Smoothing: A General Tool for Early Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "The authors present a method to smooth a signal-whether it is an intensity image, a range image, or a contour-which preserves discontinuities and thus facilitates their detection and makes it possible to derive a novel scale-space representation of a signal using a small number of scales."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2785567"
                        ],
                        "name": "F. Bergholm",
                        "slug": "F.-Bergholm",
                        "structuredName": {
                            "firstName": "Fredrik",
                            "lastName": "Bergholm",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Bergholm"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 18352198,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "088e47975d7f785e83bf0c2210e2e26b6e1d78ed",
            "isKey": false,
            "numCitedBy": 389,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "Edge detection in a gray-scale image at a fine resolution typically yields noise and unnecessary detail, whereas edge detection at a coarse resolution distorts edge contours. We show that ``edge focusing'', i.e., a coarse-to-fine tracking in a continuous manner, combines high positional accuracy with good noise-reduction. This is of vital interest in several applications. Junctions of different kinds are in this way restored with high precision, which is a basic requirement when performing (projective) geometric analysis of an image for the purpose of restoring the three-dimensional scene. Segmentation of a scene using geometric clues like parallelism, etc., is also facilitated by the algorithm, since unnecessary detail has been filtered away. There are indications that an extension of the focusing algorithm can classify edges, to some extent, into the categories diffuse and nondiffuse (for example diffuse illumination edges). The edge focusing algorithm contains two parameters, namely the coarseness of the resolution in the blurred image from where we start the focusing procedure, and a threshold on the gradient magnitude at this coarse level. The latter parameter seems less critical for the behavior of the algorithm and is not present in the focusing part, i.e., at finer resolutions. The step length of the scale parameter in the focusing scheme has been chosen so that edge elements do not move more than one pixel per focusing step."
            },
            "slug": "Edge-Focusing-Bergholm",
            "title": {
                "fragments": [],
                "text": "Edge Focusing"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that ``edge focusing'', i.e., a coarse-to-fine tracking in a continuous manner, combines high positional accuracy with good noise-reduction, which is of vital interest in several applications."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145687022"
                        ],
                        "name": "J. Crowley",
                        "slug": "J.-Crowley",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Crowley",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Crowley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1780629"
                        ],
                        "name": "A. Parker",
                        "slug": "A.-Parker",
                        "structuredName": {
                            "firstName": "Alice",
                            "lastName": "Parker",
                            "middleNames": [
                                "Cline"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Parker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14348919,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "252347ef2f962dde7f4c6c0467014e18bdc2cd4f",
            "isKey": false,
            "numCitedBy": 349,
            "numCiting": 74,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper defines a multiple resolution representation for the two-dimensional gray-scale shapes in an image. This representation is constructed by detecting peaks and ridges in the difference of lowpass (DOLP) transform. Descriptions of shapes which are encoded in this representation may be matched efficiently despite changes in size, orientation, or position. Motivations for a multiple resolution representation are presented first, followed by the definition of the DOLP transform. Techniques are then presented for encoding a symbolic structural description of forms from the DOLP transform. This process involves detecting local peaks and ridges in each bandpass image and in the entire three-dimensional space defined by the DOLP transform. Linking adjacent peaks in different bandpass images gives a multiple resolution tree which describes shape. Peaks which are local maxima in this tree provide landmarks for aligning, manipulating, and matching shapes. Detecting and linking the ridges in each DOLP bandpass image provides a graph which links peaks within a shape in a bandpass image and describes the positions of the boundaries of the shape at multiple resolutions. Detecting and linking the ridges in the DOLP three-space describes elongated forms and links the largest peaks in the tree. The principles for determining the correspondence between symbols in pairs of such descriptions are then described. Such correspondence matching is shown to be simplified by using the correspondence at lower resolutions to constrain the possible correspondence at higher resolutions."
            },
            "slug": "A-Representation-for-Shape-Based-on-Peaks-and-in-of-Crowley-Parker",
            "title": {
                "fragments": [],
                "text": "A Representation for Shape Based on Peaks and Ridges in the Difference of Low-Pass Transform"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "A multiple resolution representation for the two-dimensional gray-scale shapes in an image is defined by detecting peaks and ridges in the difference of lowpass (DOLP) transform and the principles for determining the correspondence between symbols in pairs of such descriptions are described."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1693446"
                        ],
                        "name": "L. Florack",
                        "slug": "L.-Florack",
                        "structuredName": {
                            "firstName": "Luc",
                            "lastName": "Florack",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Florack"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699027"
                        ],
                        "name": "B. H. Romeny",
                        "slug": "B.-H.-Romeny",
                        "structuredName": {
                            "firstName": "Bart",
                            "lastName": "Romeny",
                            "middleNames": [
                                "M.",
                                "ter",
                                "Haar"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. H. Romeny"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1704117"
                        ],
                        "name": "M. Viergever",
                        "slug": "M.-Viergever",
                        "structuredName": {
                            "firstName": "Max",
                            "lastName": "Viergever",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Viergever"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 686,
                                "start": 76
                            }
                        ],
                        "text": "Early schemes, such as the Sobel operator and the Prewitt operator, focused Ion the detection of poiiits at which the gradient magnitude was high, and computed derivative approximations either directly from the pixels or using local least-squares fitting (Haralick 1984). Torre and Poggio (1980) as well as Marr and Hildreth (1980) motivated the need for a smoothing operator to precede differentiation, Canny (1986) considered the problem of determining an optimal smoothing filter of finite support constituting the “best” trade-off between detection anld localization properties, given a constraint on the probability of obtaining multiple responses to a single edge. Deriche (1987) extended this approach to filters with infinite support."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 296,
                                "start": 76
                            }
                        ],
                        "text": "Early schemes, such as the Sobel operator and the Prewitt operator, focused Ion the detection of poiiits at which the gradient magnitude was high, and computed derivative approximations either directly from the pixels or using local least-squares fitting (Haralick 1984). Torre and Poggio (1980) as well as Marr and Hildreth (1980) motivated the need for a smoothing operator to precede differentiation, Canny (1986) considered the problem of determining an optimal smoothing filter of finite support constituting the “best” trade-off between detection anld localization properties, given a constraint on the probability of obtaining multiple responses to a single edge."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 790,
                                "start": 76
                            }
                        ],
                        "text": "Early schemes, such as the Sobel operator and the Prewitt operator, focused Ion the detection of poiiits at which the gradient magnitude was high, and computed derivative approximations either directly from the pixels or using local least-squares fitting (Haralick 1984). Torre and Poggio (1980) as well as Marr and Hildreth (1980) motivated the need for a smoothing operator to precede differentiation, Canny (1986) considered the problem of determining an optimal smoothing filter of finite support constituting the “best” trade-off between detection anld localization properties, given a constraint on the probability of obtaining multiple responses to a single edge. Deriche (1987) extended this approach to filters with infinite support. Similar concepts were developed by Korn (1988). Rergholm (1987) proposed to track edges from coarse to fine scales."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2667806,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "362324d34d730581ddbc2b7ec1b322a2e73e1aaa",
            "isKey": true,
            "numCitedBy": 458,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Scale-and-the-differential-structure-of-images-Florack-Romeny",
            "title": {
                "fragments": [],
                "text": "Scale and the differential structure of images"
            },
            "venue": {
                "fragments": [],
                "text": "Image Vis. Comput."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 40175393,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aa4b60b5847999c2f778e3e67ca1f2201e396abb",
            "isKey": false,
            "numCitedBy": 1004,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "An introduction is given to a theory of early visual information processing. The theory has been implemented, and examples are given of images at various stages of analysis. It is argued that the first step of consequence is to compute a primitive but rich description of the grey-level changes present in an image. The description is expressed in a vocabulary of kinds of intensity change (EDGE, SHADING-EDGE, EXTENDED-EDGE, LINE, BLOB etc.). Modifying parameters are bound to the elements in the description, specifying their POSITION, ORIENTATION, TERMINATION points, CONTRAST, SIZE and FUZZINESS. This description is obtained from the intensity array by fixed techniques, and it is called the primal sketch. For most images, the primal sketch is large and unwieldy. The second important step in visual information processing is to group its contents in a way that is appropriate for later recognition. From our ability to interpret drawings with little semantic content, one may infer the presence in our perceptual equipment of symbolic processes that can define \"place-tokens\" in an image in various ways, and can group them according to certain rules. Homomorphic techniques fail to account for many of these grouping phenomena, whose explanations require mechanisms of construction rather than mechanisms of detection. The necessary grouping of elements in the primal sketch may be achieved by a mechanism that has available the processes inferred from above, together with the ability to select items by first order discriminations acting on the elements' parameters. Only occasionally do these mechanisms use downward-flowing information about the contents of the particular image being processed. It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch. The class of computations so obtained differs slightly from the class of second order operations on the intensity array. The extraction of a form from the primal sketch using these techniques amounts to the separation of figure from ground. It is concluded that most of the separation can be carried out by using techniques that do not depend upon the particular image in question. Therefore, figure-ground separation can normally precede the description of the shape of the extracted form. Up to this point, higher-level knowledge and purpose are brought to bear on only a few of the decisions taken during the processing. This relegates the widespread use of downward-flowing information to a later stage than is found in current machine-vision programs, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "slug": "Early-processing-of-visual-information.-Marr",
            "title": {
                "fragments": [],
                "text": "Early processing of visual information."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3205375"
                        ],
                        "name": "T. Lindeberg",
                        "slug": "T.-Lindeberg",
                        "structuredName": {
                            "firstName": "Tony",
                            "lastName": "Lindeberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Lindeberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 54157190,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "11f8a1055d33f27b495978b10295126b6afc76d8",
            "isKey": false,
            "numCitedBy": 132,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The scale problem is common to most tasks involving analysis of image data—in general situations it is hardly ever possible to know in advance at what scales interesting structures can be expected to appear. Size variations of image structures can occur for several reasons, e.g. because the world contains objects of different physical size, because surface textures contain structures at different scales, and because of perspective effects and noise in the image formation process. A proper representation of scale is essential to most visual tasks requiring stable descriptors of image structure. In certain problems, such as shape-from-texture, scale variations in an image also constitute a primary cue in its own right."
            },
            "slug": "Scale-selection-for-differential-operators-Lindeberg",
            "title": {
                "fragments": [],
                "text": "Scale selection for differential operators"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A proper representation of scale is essential to most visual tasks requiring stable descriptors of image structure, and in certain problems, such as shape-from-texture, scale variations in an image also constitute a primary cue in its own right."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3205375"
                        ],
                        "name": "T. Lindeberg",
                        "slug": "T.-Lindeberg",
                        "structuredName": {
                            "firstName": "Tony",
                            "lastName": "Lindeberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Lindeberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 5733456,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f99c8e8e4ed392fca6ff784f09fe658e9d6927f9",
            "isKey": false,
            "numCitedBy": 44,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "This article deals with the problem of estimating deformations of brightness patterns using visual front-end operations. Estimating such deformations constitutes an important subtask in several computer vision problems relating to image correspondence and shape estimation. The following subjects are treated: The problem of decomposing affine flow fields into simpler components is analysed in detail. A canonical parametrization is presented based on singular value decomposition, which naturally separates the rotationally invariant components of the flow field from the rotationally variant ones. A novel mechanism is presented for automatic selection of scale levels when estimating local affine deformations. This mechanism is expressed within a multiscale framework where disparity estimates are computed in a hierarchical coarse-to-fine manner and corrected using iterative techniques. Then, deformation estimates are selected from the scales that minimize a certain normalized residual over scales. Finally, the descriptors so obtained serve as initial data for computing refined estimates of the local deformations.<<ETX>>"
            },
            "slug": "Direct-estimation-of-affine-image-deformations-with-Lindeberg",
            "title": {
                "fragments": [],
                "text": "Direct estimation of affine image deformations using visual front-end operations with automatic scale selection"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "This article deals with the problem of estimating deformations of brightness patterns using visual front-end operations, and a novel mechanism is presented for automatic selection of scale levels when estimating local affine deformations."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE International Conference on Computer Vision"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701970"
                        ],
                        "name": "J. Gauch",
                        "slug": "J.-Gauch",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Gauch",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gauch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1736862"
                        ],
                        "name": "S. Pizer",
                        "slug": "S.-Pizer",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Pizer",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Pizer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30489371,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "865803946238abc36c0b154ee4bcc4161874a7cb",
            "isKey": false,
            "numCitedBy": 167,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "Two methods for identifying and analyzing the multiresolution behavior of ridges and valleys in grey-scale images are described. The first method uses the tools of differential geometry to focus on local image behavior. The resulting vertex curves mark the tops of ridges and bottoms of valleys in an image. The second method focuses on the global drainage patterns of rainfall on a terrain map. The resulting watershed boundaries also identify the tops of ridges and bottoms of valleys in an image. By following these two geometric representations through scale space, the authors build resolution hierarchies on ridges and valleys in the image that can be utilized for interactive image segmentation. >"
            },
            "slug": "Multiresolution-Analysis-of-Ridges-and-Valleys-in-Gauch-Pizer",
            "title": {
                "fragments": [],
                "text": "Multiresolution Analysis of Ridges and Valleys in Grey-Scale Images"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "Two methods for identifying and analyzing the multiresolution behavior of ridges and valleys in grey-scale images and focusing on the global drainage patterns of rainfall on a terrain map are described."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2143773585"
                        ],
                        "name": "Yi Lu",
                        "slug": "Yi-Lu",
                        "structuredName": {
                            "firstName": "Yi",
                            "lastName": "Lu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yi Lu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144938732"
                        ],
                        "name": "R. Jain",
                        "slug": "R.-Jain",
                        "structuredName": {
                            "firstName": "Ramesh",
                            "lastName": "Jain",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Jain"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30874627,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a66ae6fa418dd27553945f61fc4d560e50009f21",
            "isKey": false,
            "numCitedBy": 92,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "Explores the role of reasoning in early vision processing. In particular, the problem of detecting edges is addressed. The authors do not try to develop another edge detector, but rather, they study an edge detector rigorously to understand its behavior well enough to formulate a reasoning process that allow appliance of the detector judiciously to recover useful information. They present a multiscale reasoning algorithm for edge recovery: reasoning about edges in scale space (RESS). The knowledge in RESS is acquired from the theory of edge behavior in scale space and represented by a number of procedures. RESS recovers desired edge curves through a number of reasoning processes on zero crossing images at various scales. The knowledge of edge behavior in scale space enables RESS to select proper scale parameters, recover missing edges, eliminate noise or false edges, and correct the locations of edges. A brief evaluation of RESS is performed by comparing it with two well-known multistage edge detection algorithms. >"
            },
            "slug": "Reasoning-About-Edges-in-Scale-Space-Lu-Jain",
            "title": {
                "fragments": [],
                "text": "Reasoning About Edges in Scale Space"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The authors study an edge detector rigorously to understand its behavior well enough to formulate a reasoning process that allow appliance of the detector judiciously to recover useful information, and present a multiscale reasoning algorithm for edge recovery: reasoning about edges in scale space (RESS)."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144877016"
                        ],
                        "name": "M. Petrou",
                        "slug": "M.-Petrou",
                        "structuredName": {
                            "firstName": "Maria",
                            "lastName": "Petrou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Petrou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145801638"
                        ],
                        "name": "J. Kittler",
                        "slug": "J.-Kittler",
                        "structuredName": {
                            "firstName": "Josef",
                            "lastName": "Kittler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kittler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43307435,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "1faf07ebd0eb6b5d55d302d469c0469b2823a69d",
            "isKey": false,
            "numCitedBy": 212,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "It is argued that the best way to model an edge is by assuming all ideal mathematical function passed through a low-pass filter and and immersed in noise. Using techniques similar to those developed by J. Canny (1983, 1986) and L.A. Spacek (1986), optimal filters are derived for ramp edges of various slopes. The optimal nonrecursive filter for ideal step edges is then derived as a limiting case of the filters for ramp edges. Because there are no step edges in images, edge detection is improved when the ramp filter is used instead of the filters developed for step edges. For practical purposes, some convolution masks are given which can be used directly for edge detection without the need to go into the details of the subject. >"
            },
            "slug": "Optimal-Edge-Detectors-for-Ramp-Edges-Petrou-Kittler",
            "title": {
                "fragments": [],
                "text": "Optimal Edge Detectors for Ramp Edges"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "It is argued that the best way to model an edge is by assuming all ideal mathematical function passed through a low-pass filter and and immersed in noise."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11755124,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f58b22395f9585c3da65bbc948c67eed3377f701",
            "isKey": false,
            "numCitedBy": 1126,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "The extrema in a signal and its first few derivatives provide a useful general purpose qualitative description for many kinds of signals. A fundamental problem in computing such descriptions is scale: a derivative must be taken over some neighborhood, but there is seldom a principled basis for choosing its size. Scale-space filtering is a method that describes signals qualitatively, managing the ambiguity of scale in an organized and natural way. The signal is first expanded by convolution with gaussian masks over a continuum of sizes. This \"scale-space\" image is then collapsed, using its qualitative structure, into a tree providing a concise but complete qualitative description covering all scales of observation. The description is further refined by applying a stability criterion, to identify events that persist of large changes in scale."
            },
            "slug": "Scale-space-filtering:-A-new-approach-to-Witkin",
            "title": {
                "fragments": [],
                "text": "Scale-space filtering: A new approach to multi-scale description"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Scale-space filtering is a method that describes signals qualitatively, managing the ambiguity of scale in an organized and natural way."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7096897,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a26f893c224ed6e3df1f37479de0e774a4cae237",
            "isKey": false,
            "numCitedBy": 2873,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Scale-Space-Filtering-Witkin",
            "title": {
                "fragments": [],
                "text": "Scale-Space Filtering"
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46720503"
                        ],
                        "name": "M. Thurston",
                        "slug": "M.-Thurston",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Thurston",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Thurston"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 206618628,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c901dd790abcb04f258ea29655a8a8401c715fca",
            "isKey": false,
            "numCitedBy": 770,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Simple sets of parallel operations are described which can be used to detect texture edges, \"spots,\" and \"streaks\" in digitized pictures. It is shown that, by comparing the outputs of the operations corresponding to (e.g.,) edges of different sizes, one can construct a composite output in which edges between differently textured regions are detected, and isolated objects are also detected, but the objects composing the textures are ignored. Relationships between this class of picture processing operations and the Gestalt psychologists' laws of pictorial pattern organization are also discussed."
            },
            "slug": "Edge-and-Curve-Detection-for-Visual-Scene-Analysis-Rosenfeld-Thurston",
            "title": {
                "fragments": [],
                "text": "Edge and Curve Detection for Visual Scene Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "Simple sets of parallel operations are described which can be used to detect texture edges, \"spots,\" and \"streaks\" in digitized pictures and it is shown that a composite output is constructed in which edges between differently textured regions are detected, and isolated objects are also detected, but the objects composing the textures are ignored."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144273431"
                        ],
                        "name": "O. Monga",
                        "slug": "O.-Monga",
                        "structuredName": {
                            "firstName": "Olivier",
                            "lastName": "Monga",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Monga"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39505480"
                        ],
                        "name": "R. Lengagne",
                        "slug": "R.-Lengagne",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Lengagne",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Lengagne"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1702017"
                        ],
                        "name": "R. Deriche",
                        "slug": "R.-Deriche",
                        "structuredName": {
                            "firstName": "Rachid",
                            "lastName": "Deriche",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Deriche"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 29578085,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4d9deaa069b6a2d9d76bf1fad53fad2b02062c96",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Recently, we have shown that the differential properties of the surfaces represented by 3D volumic images can be recovered using their partial derivatives. For instance, the crest lines can be characterized by the first, second and third partial derivatives of the grey level function I(x, y, z). In this paper, we show that: the computation of the partial derivatives of an image can be improved using recursive filters which approximate the Gaussian filter; a multi-scale approach solves many of the instability problems arising from the computation of the partial derivatives; and we illustrate the previous point for the crest line extraction (a crest point is a zero-crossing of the derivative of the maximum curvature along the maximum curvature direction). We present experimental results of crest point extraction on real 3-D medical data.<<ETX>>"
            },
            "slug": "Extraction-of-the-zero-crossings-of-the-curvature-a-Monga-Lengagne",
            "title": {
                "fragments": [],
                "text": "Extraction of the zero-crossings of the curvature derivatives in volumic 3D medical images: a multi-scale approach"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The computation of the partial derivatives of an image can be improved using recursive filters which approximate the Gaussian filter; a multi-scale approach solves many of the instability problems arising from the computation of The previous point for the crest line extraction is illustrated."
            },
            "venue": {
                "fragments": [],
                "text": "1994 Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145286523"
                        ],
                        "name": "K. Rohr",
                        "slug": "K.-Rohr",
                        "structuredName": {
                            "firstName": "Karl",
                            "lastName": "Rohr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Rohr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41453342,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e1d9485df9add7078a314f41f56f472b84891b39",
            "isKey": false,
            "numCitedBy": 75,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Modelling-and-identification-of-characteristic-Rohr",
            "title": {
                "fragments": [],
                "text": "Modelling and identification of characteristic intensity variations"
            },
            "venue": {
                "fragments": [],
                "text": "Image Vis. Comput."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3205375"
                        ],
                        "name": "T. Lindeberg",
                        "slug": "T.-Lindeberg",
                        "structuredName": {
                            "firstName": "Tony",
                            "lastName": "Lindeberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Lindeberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 32122944,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "58e621b40a3d7a8480342894b71479b7080f5759",
            "isKey": false,
            "numCitedBy": 143,
            "numCiting": 186,
            "paperAbstract": {
                "fragments": [],
                "text": "This thesis, within the subfield of computer science known as computer vision, deals with the use of scale-space analysis in early low-level processing of visual information. The main contributions comprise the following five subjects: The formulation of a scale-space theory for discrete signals. Previously, the scale-space concept has been expressed for continuous signals only. We propose that the canonical way to construct a scale-space for discrete signals is by convolution with a kernel called the discrete analogue of the Gaussian kernel, or equivalently by solving a semi-discretized version of the diffusion equation. Both the one-dimensional and two-dimensional cases are covered. An extensive analysis of discrete smoothing kernels is carried out for one-dimensional signals and the discrete scale-space properties of the most common discretizations to the continuous theory are analysed. A representation, called the scale-space primal sketch, which gives a formal description of the hierarchical relations between structures at different levels of scale. It is aimed at making information in the scale-space representation explicit. We give a theory for its construction and an algorithm for computing it. A theory for extracting significant image structures and determining the scales of these structures from this representation in a solely bottom-up data-driven way. Examples demonstrating how such qualitative information extracted from the scale-space primal sketch can be used for guiding and simplifying other early visual processes. Applications are given to edge detection, histogram analysis and classification based on local features. Among other possible applications one can mention perceptual grouping, texture analysis, stereo matching, model matching and motion. A detailed theoretical analysis of the evolution properties of critical points and blobs in scale-space, comprising drift velocity estimates under scale-space smoothing, a classification of the possible types of generic events at bifurcation situations and estimates of how the number of local extrema in a signal can be expected to decrease as function of the scale parameter. For two-dimensional signals the generic bifurcation events are annihilations and creations of extremum-saddle point pairs. Interpreted in terms of blobs, these transitions correspond to annihilations, merges, splits and creations. Experiments on different types of real imagery demonstrate that the proposed theory gives perceptually intuitive results."
            },
            "slug": "Discrete-Scale-Space-Theory-and-the-Scale-Space-Lindeberg",
            "title": {
                "fragments": [],
                "text": "Discrete Scale-Space Theory and the Scale-Space Primal Sketch"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This thesis proposes that the canonical way to construct a scale-space for discrete signals is by convolution with a kernel called the discrete analogue of the Gaussian kernel, or equivalently by solving a semi-discretized version of the diffusion equation."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2877830"
                        ],
                        "name": "B. Morse",
                        "slug": "B.-Morse",
                        "structuredName": {
                            "firstName": "B.",
                            "lastName": "Morse",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Morse"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1736862"
                        ],
                        "name": "S. Pizer",
                        "slug": "S.-Pizer",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Pizer",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Pizer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2149301198"
                        ],
                        "name": "Alan Liu",
                        "slug": "Alan-Liu",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alan Liu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 11076840,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "12624e032b0974e6621b7e97f932dfde020d3dc5",
            "isKey": false,
            "numCitedBy": 65,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "MuItiscale-medial-analysis-of-medical-images-Morse-Pizer",
            "title": {
                "fragments": [],
                "text": "MuItiscale medial analysis of medical images"
            },
            "venue": {
                "fragments": [],
                "text": "Image Vis. Comput."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 7008018,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "dfc6c556cfec7d9a7af72e5bd8b1ddf21ef95b70",
            "isKey": false,
            "numCitedBy": 342,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Ridges-and-valleys-on-digital-images-Haralick",
            "title": {
                "fragments": [],
                "text": "Ridges and valleys on digital images"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14815630,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d352cf71946e7f4b229d30c614e504424633a62a",
            "isKey": false,
            "numCitedBy": 726,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "We characterize some properties of the zero crossings of the Laplacian of signals¿in particular images¿filtered with linear filters, as a function of the scale of the filter (extending recent work by Witkin [16]). We prove that in any dimension the only filter that does not create generic zero crossings as the scale increases is the Gaussian. This result can be generalized to apply to level crossings of any linear differential operator: it applies in particular to ridges and ravines in the image intensity. In the case of the second derivative along the gradient, there is no filter that avoids creation of zero crossings, unless the filtering is performed after the derivative is applied."
            },
            "slug": "Scaling-Theorems-for-Zero-Crossings-Yuille-Poggio",
            "title": {
                "fragments": [],
                "text": "Scaling Theorems for Zero Crossings"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is proved that in any dimension the only filter that does not create generic zero crossings as the scale increases is the Gaussian and this result can be generalized to apply to level crossings of any linear differential operator."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3205375"
                        ],
                        "name": "T. Lindeberg",
                        "slug": "T.-Lindeberg",
                        "structuredName": {
                            "firstName": "Tony",
                            "lastName": "Lindeberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Lindeberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17143661,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f306444acc81b0af1875e5633e921148cb3a8977",
            "isKey": false,
            "numCitedBy": 682,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "A basic and extensive treatment of discrete aspects of the scale-space theory is presented. A genuinely discrete scale-space theory is developed and its connection to the continuous scale-space theory is explained. Special attention is given to discretization effects, which occur when results from the continuous scale-space theory are to be implemented computationally. The 1D problem is solved completely in an axiomatic manner. For the 2D problem, the author discusses how the 2D discrete scale space should be constructed. The main results are as follows: the proper way to apply the scale-space theory to discrete signals and discrete images is by discretization of the diffusion equation, not the convolution integral; the discrete scale space obtained in this way can be described by convolution with the kernel, which is the discrete analog of the Gaussian kernel, a scale-space implementation based on the sampled Gaussian kernel might lead to undesirable effects and computational problems, especially at fine levels of scale; the 1D discrete smoothing transformations can be characterized exactly and a complete catalogue is given; all finite support 1D discrete smoothing transformations arise from repeated averaging over two adjacent elements (the limit case of such an averaging process is described); and the symmetric 1D discrete smoothing kernels are nonnegative and unimodal, in both the spatial and the frequency domain. >"
            },
            "slug": "Scale-Space-for-Discrete-Signals-Lindeberg",
            "title": {
                "fragments": [],
                "text": "Scale-Space for Discrete Signals"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "The proper way to apply the scale-space theory to discrete signals and discrete images is by discretization of the diffusion equation, not the convolution integral."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2109032502"
                        ],
                        "name": "Roland Wilson",
                        "slug": "Roland-Wilson",
                        "structuredName": {
                            "firstName": "Roland",
                            "lastName": "Wilson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Roland Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145901092"
                        ],
                        "name": "A. Bhalerao",
                        "slug": "A.-Bhalerao",
                        "structuredName": {
                            "firstName": "Abhir",
                            "lastName": "Bhalerao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bhalerao"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10587358,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4e5e885043afb382c898312345d4267c0c6ac162",
            "isKey": false,
            "numCitedBy": 43,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "Deals with the design of filter kernels having specified radial and angular frequency responses based on combined optimization and frequency sampling. This is used to generate small-radius, low-pass, and edge-detection kernels for multiresolution pyramids. The performance of the new kernels in estimating orientation is shown to be significantly better than that of other commonly used pyramid kernels. >"
            },
            "slug": "Kernel-Designs-for-Efficient-Multiresolution-Edge-Wilson-Bhalerao",
            "title": {
                "fragments": [],
                "text": "Kernel Designs for Efficient Multiresolution Edge Detection and Orientation Estimation"
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "The design of filter kernels having specified radial and angular frequency responses based on combined optimization and frequency sampling is used to generate small-radius, low-pass, and edge-detection kernels for multiresolution pyramids."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144042261"
                        ],
                        "name": "Mark Nitzberg",
                        "slug": "Mark-Nitzberg",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Nitzberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mark Nitzberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2071277858"
                        ],
                        "name": "Takahiro Shiota",
                        "slug": "Takahiro-Shiota",
                        "structuredName": {
                            "firstName": "Takahiro",
                            "lastName": "Shiota",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Takahiro Shiota"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42731589,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "0951739a68b385572e1c22d96e076748c87e5952",
            "isKey": false,
            "numCitedBy": 369,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors describe a model of nonlinear image filtering for noise reduction and edge enhancement using anisotropic diffusion. The method is designed to enhance not only edges, but corners and T junctions as well. The method roughly corresponds to a nonlinear diffusion process with backward heat flow across the strong edges. Such a process is ill posed, making the results depend strongly on how the algorithm differs from the diffusion process. Two ways of modifying the equations using simulations on a variable grid are studied. >"
            },
            "slug": "Nonlinear-Image-Filtering-with-Edge-and-Corner-Nitzberg-Shiota",
            "title": {
                "fragments": [],
                "text": "Nonlinear Image Filtering with Edge and Corner Enhancement"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "The authors describe a model of nonlinear image filtering for noise reduction and edge enhancement using anisotropic diffusion that roughly corresponds to a nonlinear diffusion process with backward heat flow across the strong edges."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152944554"
                        ],
                        "name": "J. Thirion",
                        "slug": "J.-Thirion",
                        "structuredName": {
                            "firstName": "Jean-Philippe",
                            "lastName": "Thirion",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Thirion"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1718497"
                        ],
                        "name": "A. Gourdon",
                        "slug": "A.-Gourdon",
                        "structuredName": {
                            "firstName": "Alexis",
                            "lastName": "Gourdon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Gourdon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 519898,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "116293b144747fd13df9b9bc478175b77357583e",
            "isKey": false,
            "numCitedBy": 82,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "This research report is a compilation of two articles describing new results concerning the 3D Marching Lines algorithm. The Marching Lines extracts, with sub-voxel accuracy characteristic 3D lines out of 3D images, such as the crest lines. Those feature lines can then be used to perform higher level image processing tasks, such as 3D image registration, or automatic labeling of anatomical structures, when medical images are processed. The first paper concentrates on the computation of the differential characteristics of iso-intensity surfaces and shows how to characterize crest lines points directly from the differentials of the 3D image. The second paper brings the proof of the good topological properties of the reconstructed surfaces and 3D curves obtained with the Marching Lines algorithm. New experiments on real and synthetic data are also presented, showing the high precision and stability of the extracted features lines."
            },
            "slug": "The-Marching-lines-algorithm-:-new-results-and-Thirion-Gourdon",
            "title": {
                "fragments": [],
                "text": "The Marching lines algorithm : new results and proofs"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "This research report is a compilation of two articles describing new results concerning the 3D Marching Lines algorithm, and brings the proof of the good topological properties of the reconstructed surfaces and 3D curves obtained with the Marching lines algorithm."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699027"
                        ],
                        "name": "B. H. Romeny",
                        "slug": "B.-H.-Romeny",
                        "structuredName": {
                            "firstName": "Bart",
                            "lastName": "Romeny",
                            "middleNames": [
                                "M.",
                                "ter",
                                "Haar"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. H. Romeny"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 22201297,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e62ffb7a63e063aedf046f8cf05b8aa47ddb930a",
            "isKey": false,
            "numCitedBy": 784,
            "numCiting": 246,
            "paperAbstract": {
                "fragments": [],
                "text": "Preface. Foreword. 1. Linear Scale-Space I: Basic Theory T. Lindeberg, B.M. ter Haar Romeny. 2. Linear Scale-Space II: Early Visual Operations T. Lindeberg, B.M. ter Haar Romeny. 3. Anisotropic Diffusion P. Perona, T. Shiota, J. Malik. 4. Vector-Valued Diffusion R. Whitaker, G. Gerig. 5. Bayesian Rationale for the Variational Formulation D. Mumford. 6. Variational Problems with a Free Discontinuity Set A. Leaci, S. Solimini. 7. Minimization of Energy Functional with Curve-Represented Edges N. Nordstroem. 8. Approximation, Computation, and Distortion in the Variational Formulation T. Richardson, S. Mitter. 9. Coupled Geometry-Driven Diffusion Equations for Low-Level Vision M. Proesmans, E. Pauwels, L. van Gool. 10. Morphological Approach to Multiscale Analysis: From Principles to Equations l. Alvarez, J.-M. Morel. 11. Differential Invariant Signatures and Flows in Computer Vision: a Symmetry Group Approach P. Olver, G. Sapiro, A. Tannenbaum. 12. On Optimal Control Methods in Computer Vision and Image Processing B. Kimia, A. Tannenbaum, S. Zucker. 13. Nonlinear Scale-Space L. Florack, A. Salden, B. ter Haar Romeny, J. Koenderink, M. Viergever. 14. A Differential Geometric Approach to Anisotropic Diffusion D. Eberly. 15. Numerical Analysis of Geometry-Driven Diffusion Equations W. Niessen, B.M. ter Haar Romeny, M. Viergever. Bibliography. Index."
            },
            "slug": "Geometry-Driven-Diffusion-in-Computer-Vision-Romeny",
            "title": {
                "fragments": [],
                "text": "Geometry-Driven Diffusion in Computer Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This paper presents a meta-analyses of differential Invariant Signatures and Flows in Computer Vision: a Symmetry Group approach P. Sapiro, A. Tannenbaum, and a Differential Geometric Approach to Anisotropic Diffusion."
            },
            "venue": {
                "fragments": [],
                "text": "Computational Imaging and Vision"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37905091"
                        ],
                        "name": "H. Blum",
                        "slug": "H.-Blum",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Blum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Blum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38204840"
                        ],
                        "name": "R. Nagel",
                        "slug": "R.-Nagel",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Nagel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Nagel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 205011548,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "95bcfe5a35df789554e1d9d35fc9fbf35d46fff5",
            "isKey": false,
            "numCitedBy": 780,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Shape-description-using-weighted-symmetric-axis-Blum-Nagel",
            "title": {
                "fragments": [],
                "text": "Shape description using weighted symmetric axis features"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7977369"
                        ],
                        "name": "A. Doorn",
                        "slug": "A.-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "Doorn",
                            "middleNames": [
                                "J.",
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Doorn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42555882,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "050bb36fc18c3e93497850d3b664799959c91058",
            "isKey": false,
            "numCitedBy": 243,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "A method that treats linear neighborhood operators within a unified framework that enables linear combinations, concatenations, resolution changes, or rotations of operators to be treated in a canonical manner is presented. Various families of operators with special kinds of symmetries (such as translation, rotation, magnification) are explicitly constructed in 1-D, 2-D, and 3-D. A concept of 'order' is defined, and finite orthonormal bases of functions closely connected with the operators of various orders are constructed. Linear transformations between the various representations are considered. The method is based on two fundamental assumptions: a decrease of resolution should not introduce spurious detail, and the local operators should be self-similar under changes of resolution. These assumptions merely sum up the even more general need for homogeneity isotropy, scale invariance, and separability of independent dimensions of front-end processing in the absence of a priori information. >"
            },
            "slug": "Generic-Neighborhood-Operators-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "Generic Neighborhood Operators"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A method that treats linear neighborhood operators within a unified framework that enables linear combinations, concatenations, resolution changes, or rotations of operators to be treated in a canonical manner is presented."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2643006"
                        ],
                        "name": "C. Arcelli",
                        "slug": "C.-Arcelli",
                        "structuredName": {
                            "firstName": "Carlo",
                            "lastName": "Arcelli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Arcelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729403"
                        ],
                        "name": "G. S. D. Baja",
                        "slug": "G.-S.-D.-Baja",
                        "structuredName": {
                            "firstName": "Gabriella",
                            "lastName": "Baja",
                            "middleNames": [
                                "Sanniti",
                                "di"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. S. D. Baja"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 12019590,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "4503103d4c63d703caa198d27afe0d6dd6f5641a",
            "isKey": false,
            "numCitedBy": 86,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Ridge-points-in-Euclidean-distance-maps-Arcelli-Baja",
            "title": {
                "fragments": [],
                "text": "Ridge points in Euclidean distance maps"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit. Lett."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7977369"
                        ],
                        "name": "A. Doorn",
                        "slug": "A.-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "Doorn",
                            "middleNames": [
                                "J.",
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Doorn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4339597,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "59cb78e635031fbb2a330534447cadb04960fe02",
            "isKey": false,
            "numCitedBy": 101,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Two-plus-one-dimensional-differential-geometry-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "Two-plus-one-dimensional differential geometry"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit. Lett."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2045219"
                        ],
                        "name": "C. A. Burbeck",
                        "slug": "C.-A.-Burbeck",
                        "structuredName": {
                            "firstName": "Christina",
                            "lastName": "Burbeck",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. A. Burbeck"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1736862"
                        ],
                        "name": "S. Pizer",
                        "slug": "S.-Pizer",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Pizer",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Pizer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9894702,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7540897771b4ee6848abe5def91d036059cbdac3",
            "isKey": false,
            "numCitedBy": 172,
            "numCiting": 84,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Object-representation-by-cores:-Identifying-and-Burbeck-Pizer",
            "title": {
                "fragments": [],
                "text": "Object representation by cores: Identifying and representing primitive spatial regions"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3349602"
                        ],
                        "name": "R. Ogniewicz",
                        "slug": "R.-Ogniewicz",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Ogniewicz",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Ogniewicz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2196553"
                        ],
                        "name": "O. Kübler",
                        "slug": "O.-Kübler",
                        "structuredName": {
                            "firstName": "Olaf",
                            "lastName": "Kübler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Kübler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 15905035,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8c22357afbf9f05f16c89beae6abc061bd79caa1",
            "isKey": false,
            "numCitedBy": 439,
            "numCiting": 84,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Hierarchic-Voronoi-skeletons-Ogniewicz-Kübler",
            "title": {
                "fragments": [],
                "text": "Hierarchic Voronoi skeletons"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3205375"
                        ],
                        "name": "T. Lindeberg",
                        "slug": "T.-Lindeberg",
                        "structuredName": {
                            "firstName": "Tony",
                            "lastName": "Lindeberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Lindeberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10336140,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c55dfe48a3c49a6dc366d50a60521f73aa31151a",
            "isKey": false,
            "numCitedBy": 2435,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "A basic problem when deriving information from measured data, such as images, originates from the fact that objects in the world, and hence image structures, exist as meaningful entities only over ..."
            },
            "slug": "Scale-Space-Theory-in-Computer-Vision-Lindeberg",
            "title": {
                "fragments": [],
                "text": "Scale-Space Theory in Computer Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "A basic problem when deriving information from measured data, such as images, originates from the fact that objects in the world, and hence image structures, exist as meaningful entities only over measured data."
            },
            "venue": {
                "fragments": [],
                "text": "Lecture Notes in Computer Science"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699727"
                        ],
                        "name": "W. Lorensen",
                        "slug": "W.-Lorensen",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Lorensen",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Lorensen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33205084"
                        ],
                        "name": "H. Cline",
                        "slug": "H.-Cline",
                        "structuredName": {
                            "firstName": "Harvey",
                            "lastName": "Cline",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Cline"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15545924,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d92f735b0773b4e697e7e72798eccae2f647acd6",
            "isKey": false,
            "numCitedBy": 12419,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new algorithm, called marching cubes, that creates triangle models of constant density surfaces from 3D medical data. Using a divide-and-conquer approach to generate inter-slice connectivity, we create a case table that defines triangle topology. The algorithm processes the 3D medical data in scan-line order and calculates triangle vertices using linear interpolation. We find the gradient of the original data, normalize it, and use it as a basis for shading the models. The detail in images produced from the generated surface models is the result of maintaining the inter-slice connectivity, surface data, and gradient information present in the original 3D data. Results from computed tomography (CT), magnetic resonance (MR), and single-photon emission computed tomography (SPECT) illustrate the quality and functionality of marching cubes. We also discuss improvements that decrease processing time and add solid modeling capabilities."
            },
            "slug": "Marching-cubes:-A-high-resolution-3D-surface-Lorensen-Cline",
            "title": {
                "fragments": [],
                "text": "Marching cubes: A high resolution 3D surface construction algorithm"
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "A new algorithm, called marching cubes, is presented that creates triangle models of constant density surfaces from 3D medical data using a divide-and-conquer approach to generate inter-slice connectivity and a case table that defines triangle topology."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3205375"
                        ],
                        "name": "T. Lindeberg",
                        "slug": "T.-Lindeberg",
                        "structuredName": {
                            "firstName": "Tony",
                            "lastName": "Lindeberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Lindeberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 14361759,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "75fa9982cb3f92e1b0fe67cebf23a4b862f8bd2f",
            "isKey": false,
            "numCitedBy": 1373,
            "numCiting": 160,
            "paperAbstract": {
                "fragments": [],
                "text": "An inherent property of objects in the world is that they only exist as meaningful entities over certain ranges of scale. If one aims at describing the structure of unknown real-world signals, then ..."
            },
            "slug": "Scale-Space-Theory-:-A-Basic-Tool-for-Analysing-at-Lindeberg",
            "title": {
                "fragments": [],
                "text": "Scale-Space Theory : A Basic Tool for Analysing Structures at Different Scales"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2797033"
                        ],
                        "name": "L. Roberts",
                        "slug": "L.-Roberts",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Roberts",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Roberts"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 19309211,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "ab5387cf077f5b97c7dd08845c006e5c1ec89ff5",
            "isKey": false,
            "numCitedBy": 1782,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Thesis (Ph. D.)--Massachusetts Institute of Technology, Dept. of Electrical Engineering, 1963."
            },
            "slug": "Machine-Perception-of-Three-Dimensional-Solids-Roberts",
            "title": {
                "fragments": [],
                "text": "Machine Perception of Three-Dimensional Solids"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Thesis (Ph. D.)--Massachusetts Institute of Technology, Dept. of Electrical Engineering, 1963."
            },
            "venue": {
                "fragments": [],
                "text": "Outstanding Dissertations in the Computer Sciences"
            },
            "year": 1963
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Catastrophe theory and its applications"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An extension of Marr ’ s signature based edge classification and other methods for determination of diffuseness and height of edges , as well as line width"
            },
            "venue": {
                "fragments": [],
                "text": "J . Math . Im . Vis ."
            },
            "year": 1965
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "methodology": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 45,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/Edge-Detection-and-Ridge-Detection-with-Automatic-Lindeberg/ca715e1a1e4a66a763671c2a084bfc9bc23fc3e0?sort=total-citations"
}