{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60545300,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "75d5b6239679642070a29859ec009874f3be9a4a",
            "isKey": false,
            "numCitedBy": 380,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "An Algorithm is proposed for solving the stereoscopic matching problem. The algorithm consists of five steps: (1) Each image is filtered with bar masks of four sizes that vary with eccentricity; the equivalent filters are about one octave wide. (2) Zero-crossings of the mask values are localized, and positions that correspond to terminations are found; (3) For each mask size, matching takes place between pairs of zero- crossings or terminations of the same sign in the two images, for a range of disparities up to about the vergence movements, thus causing small masks to come into correspondence; (5) When a correspondence is achieved, it is written into a dynamic buffer, called the 2 1/2 D sketch. It is shown that this proposal provides a theoretical framework for most existing phychophysical and neurophysiological data about stereopsis. Several critical experimental predictions are also made, for instance, about the wsize of Panum?s area under various conditions. The results of such experiments would tell us whether, for example, cooperativity is necessary for the fusion process."
            },
            "slug": "A-Theory-of-Human-Stereo-Vision-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "A Theory of Human Stereo Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This proposal provides a theoretical framework for most existing phychophysical and neurophysiological data about stereopsis, and several critical experimental predictions are made, for instance, about the wsize of Panum?s area under various conditions."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "71058586"
                        ],
                        "name": "R. D. Arnold",
                        "slug": "R.-D.-Arnold",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Arnold",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. D. Arnold"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 121,
                                "start": 23
                            }
                        ],
                        "text": "When AL is matched to AR, and similarly for B, the disparity gradient between them, as defined by Burt and Julesz (1980), is the difference in their disparity divided by their cyclopean separation, S."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 116858000,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1a8ef38ada836ffee1a727765b7edd722ae7bfb1",
            "isKey": false,
            "numCitedBy": 45,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The fundamental task in the stereo problem is to reconstruct surfaces in a three dimensional scene from two or more images of the scene. Traditionally, a correspondence is established between regions in the images based on cross correlation of the intensity, but stereo correspondence of features such as edges has the important advantage of segmentation at surface discontinuities, which are typical of cultural objects. Edge-based stereo also permits measurement of scene dimensions to higher accuracy than area-based stereo. \nKnowledge of the camera model permits reduction of the problem to a one-dimensional search to match corresponding epipolar lines. We have derived two particularly strong geometric constraints, one relating the angles of corresponding edges and the other relating intervals between pairs of such edges. These constraints correspond to edge and surface orientation respectively. They are used as components of an evaulation function that ranks potential matches of an epipolar line pair. We demonstrate a dynamic programming algorithm that uses this function to search efficiently through all potential matches, returning those whose evaluation function scores within a specified range of the best. The search is subject to a set of consistency rules derived from assumptions of surface continuity and geometric conditions for occlusion. The rules guarantee that the matches considered are a physically realizable set of continuous surfaces. Local context and edge continuity provide constraints between adjacent epipolar lines and are used iteratively to produce global consistency in the final correspondences. \nWe describe a stereo system based on edge matching with the above constraints and search algorithm, intended for use with scenes containing man-made objects. The system assumes as input a pair of images together with derived extended edges, and produces a correspondence map from which are calculated the positions of the edges and surfaces in the scene. Results are demonstrated on several examples of real and artificial scenes."
            },
            "slug": "Automated-stereo-perception-Arnold",
            "title": {
                "fragments": [],
                "text": "Automated stereo perception"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A stereo system based on edge matching with a set of consistency rules derived from assumptions of surface continuity and geometric conditions for occlusion intended for use with scenes containing man-made objects is described."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2120421970"
                        ],
                        "name": "H. P. Trivedi",
                        "slug": "H.-P.-Trivedi",
                        "structuredName": {
                            "firstName": "Harit",
                            "lastName": "Trivedi",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. P. Trivedi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143775367"
                        ],
                        "name": "S. A. Lloyd",
                        "slug": "S.-A.-Lloyd",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Lloyd",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. A. Lloyd"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 21726069,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "7f1d59453d108bec1bf3fbe0fca45e6a854e72fd",
            "isKey": false,
            "numCitedBy": 42,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Burt and Julesz experimentally demonstrated that, in addition to Panum's fusional area, a quantity defined by them and named disparity gradient also plays a crucial part in deciding whether the human visual system would be able to fuse the images seen by the left and right eyes. The physical meaning of this quantity remains obscure despite attempts to interpret it in terms of depth gradient. Nevertheless, it has been found to be an effective selector of matches in stereo correspondence algorithms. A proof is provided that a disparity gradient limit of less than 2 implies that the matches between the two images preserve the topology of the images. The result, which is invariant under rotations and under relative as well as overall magnifications, holds for pairs of points separated in any direction, not just along epipolar lines. This in turn can be shown to prevent correspondences being established between points which would have to be located in three dimensions on a surface invisible to one eye, assuming opaque surfaces."
            },
            "slug": "The-Role-of-Disparity-Gradient-in-Stereo-Vision-Trivedi-Lloyd",
            "title": {
                "fragments": [],
                "text": "The Role of Disparity Gradient in Stereo Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "It is demonstrated that, in addition to Panum's fusional area, a quantity defined by Burt and Julesz and named disparity gradient also plays a crucial part in deciding whether the human visual system would be able to fuse the images seen by the left and right eyes."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145874506"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18319231,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1c20229805d6f239c2374546aa8109015df9e25a",
            "isKey": false,
            "numCitedBy": 605,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "Computational models of the human stereo system can provide insight into general information processing constraints that apply to any stereo system, either artificial or biological. In 1977 Marr and Poggio proposed one such computational model, which was characterized as matching certain feature points in difference-of-Gaussian filtered images and using the information obtained by matching coarser resolution representations to restrict the search space for matching finer resolution representations. An implementation of the algorithm and its testing on a range of images was reported in 1980. Since then a number of psychophysical experiments have suggested possible refinements to the model and modifications to the algorithm. As well, recent computational experiments applying the algorithm to a variety of natural images, especially aerial photographs, have led to a number of modifications. In this paper, we present a version of the Marr-Poggio-Grimson algorithm that embodies these modifications, and we illustrate its performance on a series of natural images."
            },
            "slug": "Computational-Experiments-with-a-Feature-Based-Grimson",
            "title": {
                "fragments": [],
                "text": "Computational Experiments with a Feature Based Stereo Algorithm"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A version of the Marr-Poggio-Grimson algorithm that embodies modifications to the model, and its performance on a series of natural images is illustrated."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "118988170"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "Dale",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120306234,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ab46fdac0a3b484cd58978ba71dc71631b49f70a",
            "isKey": false,
            "numCitedBy": 989,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm is proposed for solving the stereoscopic matching problem. The algorithm consists of five steps: (1) Each image is filtered at different orientations with bar masks of four sizes that increase with eccentricity; the equivalent filters are one or two octaves wide. (2) Zero-crossings in the filtered images, which roughly correspond to edges, are localized. Positions of the ends of lines and edges are also found. (3) For each mask orientation and size, matching takes place between pairs of zero-crossings or terminations of the same sign in the two images, for a range of disparities up to about the width of the mask’s central region. (4) Wide masks can control vergence movements, thus causing small masks to come into correspondence. (5) When a correspondence is achieved, it is stored in a dynamic buffer, called the 2½-D sketch. It is shown that this proposal provides a theoretical framework for most existing psychophysical and neurophysiological data about stereopsis. Several critical experimental predictions are also made, for instance about the size of Panum’s area under various conditions. The results of such experiments would tell us whether, for example, co-operativity is necessary for the matching process."
            },
            "slug": "A-computational-theory-of-human-stereo-vision-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "A computational theory of human stereo vision"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43122532,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5d206bde2f0613b54708913c2c99c44314a8d8d1",
            "isKey": false,
            "numCitedBy": 415,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Psychophysical-and-Computational-Studies-Towards-a-Mayhew-Frisby",
            "title": {
                "fragments": [],
                "text": "Psychophysical and Computational Studies Towards a Theory of Human Stereopsis"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31846677"
                        ],
                        "name": "C. Tyler",
                        "slug": "C.-Tyler",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Tyler",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Tyler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43067429,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "b201e031a9d42c6e3966f5e33d7ef00353062569",
            "isKey": false,
            "numCitedBy": 141,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "The spatial limitations of stereoscopic vision were studied by using vertical line stimuli containing sinusoidal disparity variations such that different parts of the line appeared at different depths. Stimuli with a finer grain than about 3 cycles per degree did not elicit depth perception, even though the sinusoidal curvature was clearly visible monocularly. At low spatial frequencies of curvature, stereoacuity was limited to the same extent as the monocular sensitivity. The limiting disparity for Panum's fusional region and the upper depth limit are subject to a scaling effect in proportion to stimulus dimensions. The disparity scaling can be characterized by a fixed maximum angular difference between the parts of the stereoscopic half-images."
            },
            "slug": "Stereoscopic-Vision:-Cortical-Limitations-and-a-Tyler",
            "title": {
                "fragments": [],
                "text": "Stereoscopic Vision: Cortical Limitations and a Disparity Scaling Effect"
            },
            "tldr": {
                "abstractSimilarityScore": 85,
                "text": "The spatial limitations of stereoscopic vision were studied by using vertical line stimuli containing sinusoidal disparity variations such that different parts of the line appeared at different depths, subject to a scaling effect in proportion to stimulus dimensions."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1904180,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a0abc0270968a033efd040d59beff15aacde4efd",
            "isKey": false,
            "numCitedBy": 68,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "A computational model is described which effects the binocular combination of monocular edge information. The distinctive features of the model are: (i) it identifies edge locations in each monocular field by searching for zero crossings in nonorientated centre-surround convolution profiles; (ii) it selects amongst all possible binocular point-for-point combinations of edge locations only those which satisfy a (quasi-)collinear figural grouping rule; (iii) it presents a concept of the orientated and spatial-frequency-tuned channel as a nonlinear grouping operator. The success of the model is demonstrated both on a stereo pair of a natural scene and on a random-dot stereogram."
            },
            "slug": "The-Computation-of-Binocular-Edges-Mayhew-Frisby",
            "title": {
                "fragments": [],
                "text": "The Computation of Binocular Edges"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "A computational model is described which effects the binocular combination of monocular edge information and presents a concept of the orientated and spatial-frequency-tuned channel as a nonlinear grouping operator."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1722219"
                        ],
                        "name": "Y. Ohta",
                        "slug": "Y.-Ohta",
                        "structuredName": {
                            "firstName": "Yuichi",
                            "lastName": "Ohta",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Ohta"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733113"
                        ],
                        "name": "T. Kanade",
                        "slug": "T.-Kanade",
                        "structuredName": {
                            "firstName": "Takeo",
                            "lastName": "Kanade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kanade"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 113
                            }
                        ],
                        "text": "Hence order has been exploited explicitly to constrain the selection of matches in a number of stereo algorithms (eg Baker and Binford 1981; Arnold 1982; Ohta and Kanade 1983)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9691638,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ffacc9e5144f0efed41fd49b2a388939afff5db9",
            "isKey": false,
            "numCitedBy": 1113,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a stereo matching algorithm using the dynamic programming technique. The stereo matching problem, that is, obtaining a correspondence between right and left images, can be cast as a search problem. When a pair of stereo images is rectified, pairs of corresponding points can be searched for within the same scanlines. We call this search intra-scanline search. This intra-scanline search can be treated as the problem of finding a matching path on a two-dimensional (2D) search plane whose axes are the right and left scanlines. Vertically connected edges in the images provide consistency constraints across the 2D search planes. Inter-scanline search in a three-dimensional (3D) search space, which is a stack of the 2D search planes, is needed to utilize this constraint. Our stereo matching algorithm uses edge-delimited intervals as elements to be matched, and employs the above mentioned two searches: one is inter-scanline search for possible correspondences of connected edges in right and left images and the other is intra-scanline search for correspondences of edge-delimited intervals on each scanline pair. Dynamic programming is used for both searches which proceed simultaneously: the former supplies the consistency constraint to the latter while the latter supplies the matching score to the former. An interval-based similarity metric is used to compute the score. The algorithm has been tested with different types of images including urban aerial images, synthesized images, and block scenes, and its computational requirement has been discussed."
            },
            "slug": "Stereo-by-Intra-and-Inter-Scanline-Search-Using-Ohta-Kanade",
            "title": {
                "fragments": [],
                "text": "Stereo by Intra- and Inter-Scanline Search Using Dynamic Programming"
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "This paper presents a stereo matching algorithm using the dynamic programming technique that uses edge-delimited intervals as elements to be matched, and employs the above mentioned two searches: one is inter-scanline search for possible correspondences of connected edges in right and left images and the other is intra-scanlines search for correspondence of edge-Delimited interval on each scanline pair."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "114645697"
                        ],
                        "name": "Peter Burt",
                        "slug": "Peter-Burt",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Burt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Peter Burt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 13217049,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "cd57abf7d4d67306ba1d0bfde709147aa99aceb0",
            "isKey": false,
            "numCitedBy": 128,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "It is generally believed that there is an absolute disparity limit for binocular fusion; objects with disparities within this limit, known as Panum's fusional area, will appear fused and single, while objects with disparities outside the limit appear double. It is demonstrated, however, that the disparity gradient, rather than the disparity magnitude, dictates binocular fusion when several objects occur near one another in the visual field. The disparity gradient is defined as the difference between the disparities of neighboring objects divided by their angular separation. If this ratio exceeds a critical value (∼1) then fusion does not occur, even though the absolute disparities of the individual objects may be well within the classical Panum's area. This discovery leads to the reinterpretation of several enigmatic phenomena in stereopsis, including Panum's limiting case."
            },
            "slug": "Modifications-of-the-Classical-Notion-of-Panum's-Burt-Julesz",
            "title": {
                "fragments": [],
                "text": "Modifications of the Classical Notion of Panum's Fusional Area"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "It is demonstrated that the disparity gradient, rather than the disparity magnitude, dictates binocular fusion when several objects occur near one another in the visual field, leading to the reinterpretation of several enigmatic phenomena in stereopsis, including Panum's limiting case."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145337347"
                        ],
                        "name": "H. Baker",
                        "slug": "H.-Baker",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Baker",
                            "middleNames": [
                                "Harlyn"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 130,
                                "start": 0
                            }
                        ],
                        "text": "However, many other functions using disparity gradients could be employed. In one interesting example suggested by Prazdny (1985), the strength of the support that flows between a pair of matches is scaled in a gaussian fashion with respect to the size of the disparity gradient between them."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 11002139,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "278618251450aaeb334227ec82bacabfc1c266de",
            "isKey": false,
            "numCitedBy": 545,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The past few years have seen a growing interest in the application\" of three-dimensional image processing. With the increasing demand for 3-D spatial information for tasks of passive navigation [7,12], automatic surveillance [9], aerial cartography [10,13], and inspection in industrial automation, the importance of effective stereo analysis has been made quite clear. A particular challenge is to provide reliable and accurate depth data for input to object or terrain modelling systems (such as [5]. This paper describes an algorithm for such stereo sensing It uses an edge-based line-by-line stereo correlation scheme, and appears to be fast, robust, and parallel implementable. The processing consists of extracting edge descriptions for a stereo pair of images, linking these edges to their nearest neighbors to obtain the edge connectivity structure, correlating the edge descriptions on the basis of local edge properties, then cooperatively removmg those edge correspondences determined to be in error - those which violate the connectivity structure of the two images. A further correlation process, using a technique similar to that used for the edges, is applied to the image intensity values over intervals defined by the previous correlation The result of the processing is a full image array disparity map of the scene viewed."
            },
            "slug": "Depth-from-Edge-and-Intensity-Based-Stereo-Baker-Binford",
            "title": {
                "fragments": [],
                "text": "Depth from Edge and Intensity Based Stereo"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper describes an algorithm for stereo sensing that uses an edge-based line-by-line stereo correlation scheme, and appears to be fast, robust, and parallel implementable."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 767650,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6bb6eba248b6ef8d228dc33e6113c3e12dd48fee",
            "isKey": false,
            "numCitedBy": 1168,
            "numCiting": 82,
            "paperAbstract": {
                "fragments": [],
                "text": "The extraction of stereo-disparity information from two images depends upon establishing a correspondence between them. In this article we analyze the nature of the correspondence computation and derive a cooperative algorithm that implements it. We show that this algorithm successfully extracts information from random-dot stereograms, and its implications for the psychophysics and neurophysiology of the visual system are briefly discussed."
            },
            "slug": "Cooperative-computation-of-stereo-disparity.-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "Cooperative computation of stereo disparity."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that this algorithm successfully extracts information from random-dot stereograms, and its implications for the psychophysics and neurophysiology of the visual system are briefly discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4366096"
                        ],
                        "name": "D. Fender",
                        "slug": "D.-Fender",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Fender",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Fender"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 13151166,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "8c86ba0da1fd38119e005ddcb278c8f250aa46df",
            "isKey": false,
            "numCitedBy": 298,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "A novel phenomenon in stereopsis can be observed when viewing binocularly stabilized retinal images. This phenomenon is particularly impressive for random-dot stereoscopic images in foveal vision. If initially the left and right images are brought within Panum’s fusional area (6-min arc alignment), fusion and stereopsis are perceived; the images can then be pulled apart symmetrically by about 2 deg in the horizontal direction without loss of stereopsis or fusion. The images are actually pulled apart on the retinae, since the binocular retinal stabilization compensates for the convergence-divergence motions of the eyes; hence a supra-retinal function must be responsible for this type of fusion. If the pulling proceeds too fast, or exceeds the 2-deg limit, or if the stimulus is occluded briefly, the fusional mechanism fails and the fused image abruptly breaks apart into two separate images which have to be brought within Panum’s area again to re-establish fusion. For line stimuli, the maximum disparity without loss of fusion is much less than for random-dot patterns; it is always largest for disparity in the horizontal direction and is less in the vertical direction. These findings indicate that stereopsis and the classically conceived corresponding points greatly depend both on the class of stimulus used and on the recent history of the stimulation."
            },
            "slug": "Extension-of-Panum's-fusional-area-in-binocularly-Fender-Julesz",
            "title": {
                "fragments": [],
                "text": "Extension of Panum's fusional area in binocularly stabilized vision."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The findings indicate that stereopsis and the classically conceived corresponding points greatly depend both on the class of stimulus used and on the recent history of the stimulation."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30489560"
                        ],
                        "name": "R. Hummel",
                        "slug": "R.-Hummel",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Hummel",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hummel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18603445,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5df9cdc54c8085781c4199a95576a14cb7198b9d",
            "isKey": false,
            "numCitedBy": 1518,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Given a set of objects in a scene whose identifications are ambiguous, it is often possible to use relationships among the objects to reduce or eliminate the ambiguity. A striking example of this approach was given by Waltz [13]. This paper formulates the ambiguity-reduction process in terms of iterated parallel operations (i.e., relaxation operations) performed on an array of (object, identification) data. Several different models of the process are developed, convergence properties of these models are established, and simple examples are given."
            },
            "slug": "Scene-Labeling-by-Relaxation-Operations-Rosenfeld-Hummel",
            "title": {
                "fragments": [],
                "text": "Scene Labeling by Relaxation Operations"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper formulates the ambiguity-reduction process in terms of iterated parallel operations (i.e., relaxation operations) performed on an array of object, identification data."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Systems, Man, and Cybernetics"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145099732"
                        ],
                        "name": "S. Pollard",
                        "slug": "S.-Pollard",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Pollard",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Pollard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2657603"
                        ],
                        "name": "J. Porrill",
                        "slug": "J.-Porrill",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Porrill",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Porrill"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 21697440,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "16c4dab36eb30453a9cfe056ceb8a8d21da0930f",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "An improved air-fuel mixture intake system for use in a internal combustion engine having a light load side intake passage and a heavy load side intake passage which are joined each other in the vicinity of an intake valve of the engine. The intake system includes engine deceleration detecting means, a first on-off valve provided in a fuel supplying path of a light load side carburetor, an air supplying passage opened into the heavy load side intake passage at downstream of a heavy load side carburetor throttle valve, and a second on-off valve provided in the air supplying passage for reduction of noxious hydrocarbon formation and prevention of after-burning, with suppression of undesirable knocking."
            },
            "slug": "Disparity-Gradient,-Lipschitz-Continuity,-and-Pollard-Porrill",
            "title": {
                "fragments": [],
                "text": "Disparity Gradient, Lipschitz Continuity, and Computing Binocular Correspondences"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Scene labelling by relaxation operations"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Systems, Man, and Cybernetics"
            },
            "year": 1976
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Extensions of Panum ' s fusional area in binocularly stabilised vision"
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society ofAmerica"
            },
            "year": 1967
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Automated Stereo Perception PhD thesis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The computation of binocular edges\" Perception"
            },
            "venue": {
                "fragments": [],
                "text": "J P,"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Stereopsis\" in Physical and Biological Processing of Images eds O J Braddick"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Robotics Research, Gouviex, France (Cambridge, MA: MIT Press) in press"
            },
            "venue": {
                "fragments": [],
                "text": "Prazdny K,"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A cooperative computation of stereo-disparity\" Science"
            },
            "venue": {
                "fragments": [],
                "text": "Marr D, Poggio T,"
            },
            "year": 1976
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 3
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 23,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/PMF:-A-Stereo-Correspondence-Algorithm-Using-a-Pollard-Mayhew/11996252bec281d26e7b9c9b0eb3a834d194ad9d?sort=total-citations"
}