{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122868787,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "8c698a0e0e54ef70bdb5a41585598b84400db178",
            "isKey": false,
            "numCitedBy": 736,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "The perception of depth involves monocular and binocular depth cues. The latter seem simpler and more suitable for investigation. Particularly important is the problem of finding binocular parallax, which involves matching patterns of the left and right visual fields. Stereo pictures of familiar objects or line drawings preclude the separation of interacting cues, and thus this pattern-matching process is difficult to investigate. More insight into the process can be gained by using unfamiliar picture material devoid of all cues except binocular parallax. To this end, artificial stereo picture pairs were generated on a digital computer. When viewed monocularly, they appear completely random, but if viewed binocularly, certain correlated point domains are seen in depth. By introducing distortions in this material and testing for perception of depth, it is possible to show that pattern-matching of corresponding points of the left and right visual fields can be achieved by first combining the two fields and then searching for patterns in the fused field. By this technique, some interesting properties of this fused binocular field are revealed, and a simple analog model is derived. The interaction between the monocular and binocular fields is also describea. A number of stereo images that demonstrate these and other findings are presented."
            },
            "slug": "Binocular-depth-perception-of-computer-generated-Julesz",
            "title": {
                "fragments": [],
                "text": "Binocular depth perception of computer-generated patterns"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14801990,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6f20e254e3993538c79e0ff2b9b8f198d3359cb3",
            "isKey": false,
            "numCitedBy": 4215,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "In the central nervous system the visual pathway from retina to striate cortex provides an opportunity to observe and compare single unit responses at several distinct levels. Patterns of light stimuli most effective in influencing units at one level may no longer be the most effective at the next. From differences in responses at successive stages in the pathway one may hope to gain some understanding of the part each stage plays in visual perception. By shining small spots of light on the light-adapted cat retina Kuffler (1953) showed that ganglion cells have concentric receptive fields, with an 'on' centre and an 'off ' periphery, or vice versa. The 'on' and 'off' areas within a receptive field were found to be mutually antagonistic, and a spot restricted to the centre of the field was more effective than one covering the whole receptive field (Barlow, FitzHugh & Kuffler, 1957). In the freely moving lightadapted cat it was found that the great majority of cortical cells studied gave little or no response to light stimuli covering most of the animal's visual field, whereas small spots shone in a restricted retinal region often evoked brisk responses (Hubel, 1959). A moving spot of light often produced stronger responses than a stationary one, and sometimes a moving spot gave more activation for one direction than for the opposite. The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex. Receptive fields of the cells considered in this paper were divided into separate excitatory and inhibitory ('on' and 'off') areas. In this respect they resembled retinal ganglion-cell receptive fields. However, the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinal ganglion cells. An attempt was made to correlate responses to moving stimuli"
            },
            "slug": "Receptive-fields-of-single-neurones-in-the-cat's-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields of single neurones in the cat's striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex, which resembled retinal ganglion-cell receptive fields, but the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinalganglion cells."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 33565783,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b0b13465c36789ebd0751178c5403efd4dd390b9",
            "isKey": false,
            "numCitedBy": 357,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Receptive fields of retinal ganglion cells were studied in the light-adapted spider monkey. All fields mapped with white light had a concentric arrangement sililar to that of the cat retinal ganglion cells, with a sharply demarcated 'on' centre surrounded by an antagonistic 'off' periphery, or the reverse. The smallest receptive field centres were found near the fovea, and the size of centres tended to increase with increasing distance from the fovea. The smallest centre had a diameter of 4 minutes of arc (corresponding to about 20 microns on the retina) and was located 4 degrees from the fovea; the largest centre had a diameter of 2 degrees. Three ganglion cells out of about 100 responded in a specific way to coloured stimuli. In these cells light of short wave-length produced an 'on' response and light of long wave-length evoked inhibition followed by an 'off' response. Transition between the two types of response occurred at about 500 millimicrons, light of this wave-length evoked only feebel 'off' responses. Very weak responses were obtained to white light, presumably owing to the antagonism between light of short and long wavelengths. (Author)"
            },
            "slug": "Receptive-fields-of-optic-nerve-fibres-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields of optic nerve fibres in the spider monkey"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "Receptive fields of retinal ganglion cells were studied in the light-adapted spider monkey with very weak responses to white light, presumably owing to the antagonism between light of short and long wavelengths."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5647202"
                        ],
                        "name": "J. Lettvin",
                        "slug": "J.-Lettvin",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Lettvin",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lettvin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2701850"
                        ],
                        "name": "H. Maturana",
                        "slug": "H.-Maturana",
                        "structuredName": {
                            "firstName": "Humberto",
                            "lastName": "Maturana",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Maturana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4605464"
                        ],
                        "name": "W. McCulloch",
                        "slug": "W.-McCulloch",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "McCulloch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. McCulloch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50314979"
                        ],
                        "name": "W. Pitts",
                        "slug": "W.-Pitts",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Pitts",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pitts"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8739509,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bc4e084831b9f987826b2cf184356e347ee155f8",
            "isKey": false,
            "numCitedBy": 1756,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we analyze the activity of single fibers in the optic nerve of a frog. Our method is to find what sort of stimulus causes the largest activity in one nerve fiber and then what is the exciting aspect of that stimulus such that variations in everything else cause little change in the response. It has been known for the past 20 years that each fiber is connected not to a few rods and cones in the retina but to very many over a fair area. Our results show that for the most part within that area, it is not the light intensity itself but rather the pattern of local variation of intensity that is the exciting factor. There are four types of fibers, each type concerned with a different sort of pattern. Each type is uniformly distributed over the whole retina of the frog. Thus, there are four distinct parallel distributed channels whereby the frog's eye informs his brain about the visual image in terms of local pattern independent of average illumination. We describe the patterns and show the functional and anatomical separation of the channels. This work has been done on the frog, and our interpretation applies only to the frog."
            },
            "slug": "What-the-Frog's-Eye-Tells-the-Frog's-Brain-Lettvin-Maturana",
            "title": {
                "fragments": [],
                "text": "What the Frog's Eye Tells the Frog's Brain"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The results show that for the most part within that area of the optic nerve of a frog, it is not the light intensity itself but rather the pattern of local variation of intensity that is the exciting factor."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IRE"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31858096"
                        ],
                        "name": "J. David",
                        "slug": "J.-David",
                        "structuredName": {
                            "firstName": "Jr.",
                            "lastName": "David",
                            "middleNames": [
                                "E.E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. David"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 51647987,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "20e42471abc39d6e045f178c4d0345c327bd6e8f",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Digital simulation is a powerful tool in uncovering the basic properties of new or proposed communications principles, particularly those involving coding of visual or auditory information. Operating on digitalized speech or pictorial signals, a stored program computer can perform processing equivalent to any coding. The output signals so produced can then be made available for subjective evaluation, thereby removing the necessity for premature instrumentation to produce samples for viewing or listening. This technique owes its efficacy to 1) the availability of computers fast enough to accomplish the processing in a reasonable time scale, 2) the existence of high quality translators to implement the flow of continuous signals in and out of the computer, and 3) the creation of compiling programs which allow uninitiated investigators almost immediate access to computer facilities, and which keep programming effort low. Simulation is assuming an increasing role in communications research."
            },
            "slug": "Digital-Simulation-in-Research-on-Human-David",
            "title": {
                "fragments": [],
                "text": "Digital Simulation in Research on Human Communication"
            },
            "tldr": {
                "abstractSimilarityScore": 85,
                "text": "Digital simulation is a powerful tool in uncovering the basic properties of new or proposed communications principles, particularly those involving coding of visual or auditory information, and is assuming an increasing role in communications research."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IRE"
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58188310,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "69500fb011e0acdcf2932c9585974e2912ec9cad",
            "isKey": false,
            "numCitedBy": 49,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "A method is described for transmitting digitalized video signals to reduce channel capacity front that needed for standard PCM. This method takes advantage of the inability of the human eye to notice the exact amplitude and shape of short brightness transients. The transmitted information consists of the amplitudes and times of occurrence of the “edge” points of video signals. These selected samples are coarsely quantized if they belong to high-frequency regions, and the receiver then interpolates straight lines between the samples. The system was simulated on the IBM 704 computer. The processed pictures and obtained channel-capacity savings are presented."
            },
            "slug": "A-method-of-coding-television-signals-based-on-edge-Julesz",
            "title": {
                "fragments": [],
                "text": "A method of coding television signals based on edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "A method is described for transmitting digitalized video signals to reduce channel capacity front that needed for standard PCM by taking advantage of the inability of the human eye to notice the exact amplitude and shape of short brightness transients."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39479836"
                        ],
                        "name": "M. Wertheimer",
                        "slug": "M.-Wertheimer",
                        "structuredName": {
                            "firstName": "Max",
                            "lastName": "Wertheimer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wertheimer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 133089004,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "c9056947300e8494a8ff5c17161de1eba120f199",
            "isKey": false,
            "numCitedBy": 932,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The separation of a sample of blood into serum and clot portions is accomplished by means of a sealant consisting essentially of a silicone fluid and silica dispersed therein. The separation is accomplished by inserting a supply of the sealant into a container holding a sample of the blood. The container and device are centrifuged so that it separates into serum and clot portions and the sealant, having a specific gravity of at least 1.026, separates the two portions."
            },
            "slug": "Untersuchungen-zur-Lehre-von-der-Gestalt-Wertheimer",
            "title": {
                "fragments": [],
                "text": "Untersuchungen zur Lehre von der Gestalt"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The separation of a sample of blood into serum and clot portions is accomplished by means of a sealant consisting essentially of a silicone fluid and silica dispersed therein."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1922
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35226330"
                        ],
                        "name": "B. Green",
                        "slug": "B.-Green",
                        "structuredName": {
                            "firstName": "Bert",
                            "lastName": "Green",
                            "middleNames": [
                                "F."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Green"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32223729"
                        ],
                        "name": "A. K. Wolf",
                        "slug": "A.-K.-Wolf",
                        "structuredName": {
                            "firstName": "Alice",
                            "lastName": "Wolf",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. K. Wolf"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2061381326"
                        ],
                        "name": "B. W. White",
                        "slug": "B.-W.-White",
                        "structuredName": {
                            "firstName": "B",
                            "lastName": "White",
                            "middleNames": [
                                "W"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. W. White"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37668341,
            "fieldsOfStudy": [
                "Psychology",
                "Medicine"
            ],
            "id": "aa4989a0b2e4387804f9888916c9c05cd720d38a",
            "isKey": false,
            "numCitedBy": 34,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-detection-of-statistically-defined-patterns-in-Green-Wolf",
            "title": {
                "fragments": [],
                "text": "The detection of statistically defined patterns in a matrix of dots."
            },
            "venue": {
                "fragments": [],
                "text": "The American journal of psychology"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144283535"
                        ],
                        "name": "J. Hochberg",
                        "slug": "J.-Hochberg",
                        "structuredName": {
                            "firstName": "Julian",
                            "lastName": "Hochberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hochberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "81191692"
                        ],
                        "name": "A. Silverstein",
                        "slug": "A.-Silverstein",
                        "structuredName": {
                            "firstName": "Albert",
                            "lastName": "Silverstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Silverstein"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 7030206,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "6db320f709a1e57d13d1f96865c19d749fef6ff0",
            "isKey": false,
            "numCitedBy": 49,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-quantitative-index-of-stimulus-similarity-vs.-in-Hochberg-Silverstein",
            "title": {
                "fragments": [],
                "text": "A quantitative index of stimulus-similarity proximity vs. differences in brightness."
            },
            "venue": {
                "fragments": [],
                "text": "The American journal of psychology"
            },
            "year": 1956
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 9,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Visual-Pattern-Discrimination-Julesz/4754bfb45726057d98ad47499481e8c172233e20?sort=total-citations"
}