{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1861262"
                        ],
                        "name": "T. Caelli",
                        "slug": "T.-Caelli",
                        "structuredName": {
                            "firstName": "Terry",
                            "lastName": "Caelli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Caelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 25221011,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "08ccf401e0fdfc69508c6d92870bf97b845b217c",
            "isKey": false,
            "numCitedBy": 56,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "By defining texture as a global feature attained by integration over the image domain, we show that texture discrimination can be predicted for a special class of visual textures (composed of paired dots) as a function of such global features. We derive a psychophysical law based on these global features and show that differences in the variance of orientation, but not of dipole length, result in texture discrimination."
            },
            "slug": "Psychophysical-evidence-for-global-feature-in-Caelli-Julesz",
            "title": {
                "fragments": [],
                "text": "Psychophysical evidence for global feature processing in visual texture discrimination."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A psychophysical law is derived and it is shown that differences in the variance of orientation, but not of dipole length, result in texture discrimination."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23388527,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a76fefea8a0ea13ace7dbaf8dcc8d1122529b204",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "In 1962, Julesz observed that texture pairs with identical second-order statistics but different third- and higher-order statistics were usually not discriminable without scrutiny. Since second-order (dipole) statistics determine the autocorrelation functions and hence the power spectra, this observation also meant that in preattentive perception of texture the phase (position) spectra were ignored. In the last two decades many new classes of texture pairs with identical power spectra have been invented that were not effortlessly discriminable; however, recently (Caelli & Julesz 1978; Caelli et al. 1978; Julesz et al. 1978) several counterexamples were found. In these texture pairs with identical power spectra some local structures of 'quasi-collinearity', 'corner', 'closure' and 'granularity' yielded strong discrimination. These features can be regarded as the fundamental building blocks of form, that is, the essential nonlinearities of the preattentive perceptual system. Here, it will be shown that these counter-examples are not independent of each other, but can be described by two elementary units; bars (line segments) and their terminators. Furthermore, the preattentive texture perception system can count the number of terminators but ignores their positions."
            },
            "slug": "Spatial-nonlinearities-in-the-instantaneous-of-with-Julesz",
            "title": {
                "fragments": [],
                "text": "Spatial nonlinearities in the instantaneous perception of textures with identical power spectra."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It will be shown that these counter-examples are not independent of each other, but can be described by two elementary units; bars (line segments) and their terminators, which means the preattentive texture perception system can count the number of terminators but ignores their positions."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737968"
                        ],
                        "name": "E. Gilbert",
                        "slug": "E.-Gilbert",
                        "structuredName": {
                            "firstName": "Edgar",
                            "lastName": "Gilbert",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Gilbert"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2108020"
                        ],
                        "name": "L. Shepp",
                        "slug": "L.-Shepp",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Shepp",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Shepp"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40563444"
                        ],
                        "name": "H. Frisch",
                        "slug": "H.-Frisch",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Frisch",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Frisch"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44767187,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e8f81faa0bd0e018c06c2088223d1fdbc29224a1",
            "isKey": false,
            "numCitedBy": 400,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "In an earlier study by Julesz (1962) pairs of random textures were generated side-by-side using a Markov process with different third-order joint-probability distributions but identical first- and second-order distributions. Such texture pairs could not be discriminated from each other by the human visual system without scrutiny. Unfortunately, Markov processes are inherently one-dimensional while the general processes underlying visual texture discrimination are two-dimensional. Here three new methods are introduced that generate two-dimensional non-Markovian textures with different third-order but identical first- and second-order statistics. All three methods generate texture pairs that cannot be discriminated from each other. The lack of texture discrimination is the more astonishing since the individual elements that form the texture pair are clearly perceived as being very different. However, a counterexample was found that yields discrimination although the texture pair has approximately identical second-order statistics. This case can be explained by assuming that early feature extractors do some preprocessing. These new demonstrations give support to a model of texture discrimination in which the stimulus is first analyzed by local feature extractors that can detect only simple features such as dots and edges of given sizes and orientations. Then the outputs of these simple extractors are evaluated by a global processor that can compute only second- or first-order statistics (that is can compare at most two such outputs)."
            },
            "slug": "Inability-of-Humans-to-Discriminate-between-Visual-Julesz-Gilbert",
            "title": {
                "fragments": [],
                "text": "Inability of Humans to Discriminate between Visual Textures That Agree in Second-Order Statistics—Revisited"
            },
            "tldr": {
                "abstractSimilarityScore": 53,
                "text": "Three new methods are introduced that generate two-dimensional non-Markovian textures with different third-order but identical first- and second-order statistics that cannot be discriminated from each other."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35202510"
                        ],
                        "name": "W. Pratt",
                        "slug": "W.-Pratt",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Pratt",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pratt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33726225"
                        ],
                        "name": "O. Faugeras",
                        "slug": "O.-Faugeras",
                        "structuredName": {
                            "firstName": "Olivier",
                            "lastName": "Faugeras",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Faugeras"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1692586"
                        ],
                        "name": "A. Gagalowicz",
                        "slug": "A.-Gagalowicz",
                        "structuredName": {
                            "firstName": "André",
                            "lastName": "Gagalowicz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Gagalowicz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1728701,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "a1798256370d018c8aa6bbf04c7b5bce0a92d633",
            "isKey": false,
            "numCitedBy": 135,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Earlier experiments by Julesz et al. on visual discrimination are reviewed and extended in the context of texture analysis of natural images. Stochastic methods are developed for the generation of pairs of synthetic texture fields possessing multiple gray levels, significant spatial correlation, and joint moments or probability densities of controllable form. Results of several visual discrimination experiments with these computer generated texture fields are then presented. It is demonstrated, for the stochastic models investigated, that humans cannot effortlessly discriminate between pairs of spatially correlated texture fields with differing third-order probability densities when their lower order densities are pairwise equal. This is a further verification of Julesz's conjecture. Also, it is shown that human observers are sensitive to relatively small changes in the spatial autocorrelation function. Examples are presented of discriminable texture fields with identical means, variances, autocorrelation functions, and third-order nearest neighbor moments."
            },
            "slug": "Visual-Discrimination-of-Stochastic-Texture-Fields-Pratt-Faugeras",
            "title": {
                "fragments": [],
                "text": "Visual Discrimination of Stochastic Texture Fields"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is demonstrated, for the stochastic models investigated, that humans cannot effortlessly discriminate between pairs of spatially correlated texture fields with differing third-order probability densities when their lower order densities are pairwise equal."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Systems, Man, and Cybernetics"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1861262"
                        ],
                        "name": "T. Caelli",
                        "slug": "T.-Caelli",
                        "structuredName": {
                            "firstName": "Terry",
                            "lastName": "Caelli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Caelli"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6822529,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "28d49bc05afc9bbbfd04211fc357f2111bd2067c",
            "isKey": false,
            "numCitedBy": 86,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Recent discoveries of nonlinear perceptual analyzers in effortless texture discrimination cast serious doubt on the usefulness of Fourier image decompositions to describe suprathreshold visual-texture perception. We now explain the meaning of these results."
            },
            "slug": "On-the-Limits-of-Fourier-Decompositions-in-Visual-Julesz-Caelli",
            "title": {
                "fragments": [],
                "text": "On the Limits of Fourier Decompositions in Visual Texture Perception"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The meaning of the results of the analysis of Fourier image decompositions to describe suprathreshold visual-texture perception is explained."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 29648250,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "4754bfb45726057d98ad47499481e8c172233e20",
            "isKey": false,
            "numCitedBy": 895,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Visual discrimination experiments were conducted using unfamiliar displays generated by a digital computer. The displays contained two side-by-side fields with different statistical, topological or heuristic properties. Discrimination was defined as that spontaneous visual process which gives the immediate impression of two distinct fields. The condition for such discrimination was found to be based primarily on clusters or lines formed by proximate points of uniform brightness. A similar rule of connectivity with hue replacing brightness was obtained by using varicolored dots of equal subjective brightness. The limitations in discriminating complex line structures were also investigated."
            },
            "slug": "Visual-Pattern-Discrimination-Julesz",
            "title": {
                "fragments": [],
                "text": "Visual Pattern Discrimination"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The condition for discrimination was found to be based primarily on clusters or lines formed by proximate points of uniform brightness, and a similar rule of connectivity with hue replacing brightness was obtained by using varicolored dots of equal subjective brightness."
            },
            "venue": {
                "fragments": [],
                "text": "IRE Trans. Inf. Theory"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4908829"
                        ],
                        "name": "R. Schumer",
                        "slug": "R.-Schumer",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Schumer",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Schumer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45433010,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b5e36be2af0f7d71e01efbf4ac8cc768bbe3bdc0",
            "isKey": false,
            "numCitedBy": 147,
            "numCiting": 132,
            "paperAbstract": {
                "fragments": [],
                "text": "1.0 INTRODUCTION 1.1 Toward a Perceptual Atom Theory .. 1.2 Personalia, Books, and Major Events .. 2.0 THRESHOLD PERCEPTION . 2.1 Spatial Frequency (SF) Channels .. 2.2 Spatiotemporal Channels . 3.0 SUPRATHRESHOLD PERCEPTION \" ,', .,\"\"\"\"\"\"\"\" .,\"'\"\"\"' , .. 3,1 Contrast and Pattern Perception .. 3,1.} Bars versus Gratings and Shifts in Attention .. 3,1.2 Globality versus Low SF Channels .. 3,},3 The Problem of Phase . 3.2 Texture Discrimination: Beyond Autocorrelation . 3.3 Cross-Correlation Channels in Depth and Movement ."
            },
            "slug": "Early-visual-perception.-Julesz-Schumer",
            "title": {
                "fragments": [],
                "text": "Early visual perception."
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "A Towards a Perceptual Atom Theory of Perception and Texture Discrimination: Beyond Autocorrelation and Cross-Correlation Channels in Depth and Movement."
            },
            "venue": {
                "fragments": [],
                "text": "Annual review of psychology"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143863790"
                        ],
                        "name": "J. Beck",
                        "slug": "J.-Beck",
                        "structuredName": {
                            "firstName": "Jacob",
                            "lastName": "Beck",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Beck"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1730955,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "4d1dacea0aeab69be01b7a898353802eea7690a0",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "The grouping of curves was investigated by measuring the time taken to count the disparate figures in a display and by ratings When line curvature was the only differentiating property, the grouping of the disparate figures was poor. Grouping of disparate figures corresponded to the judged similarities of the background and disparate figures when the similarity judgments varied with stimulus differences measured in terms of discriminability but not when similarity judgments varied with stimulus differences measured in terms of the sameness of the transformation which applied to the background figures produced the disparate figures. The results are interpreted as supporting the hypothesis that similarity grouping is based on the response of the visual system to extra-foveal stimulus differences in a patterned visual field when attention is not concentrated or focused."
            },
            "slug": "Similarity-Grouping-of-Curves-Beck",
            "title": {
                "fragments": [],
                "text": "Similarity Grouping of Curves"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The results are interpreted as supporting the hypothesis that similarity grouping is based on the response of the visual system to extra-foveal stimulus differences in a patterned visual field when attention is not concentrated or focused."
            },
            "venue": {
                "fragments": [],
                "text": "Perceptual and motor skills"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1932236"
                        ],
                        "name": "N. Graham",
                        "slug": "N.-Graham",
                        "structuredName": {
                            "firstName": "N.",
                            "lastName": "Graham",
                            "middleNames": [
                                "V.",
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Graham"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4734126"
                        ],
                        "name": "J. Nachmias",
                        "slug": "J.-Nachmias",
                        "structuredName": {
                            "firstName": "Jacob",
                            "lastName": "Nachmias",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Nachmias"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7449780,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "ff6b05a0fc9f9730a8de08e584fe55ddea242a80",
            "isKey": false,
            "numCitedBy": 432,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Detection-of-grating-patterns-containing-two-a-of-Graham-Nachmias",
            "title": {
                "fragments": [],
                "text": "Detection of grating patterns containing two spatial frequencies: a comparison of single-channel and multiple-channels models."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2137198"
                        ],
                        "name": "R. Shepard",
                        "slug": "R.-Shepard",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Shepard",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Shepard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "41135805"
                        ],
                        "name": "J. Metzler",
                        "slug": "J.-Metzler",
                        "structuredName": {
                            "firstName": "Jacqueline",
                            "lastName": "Metzler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Metzler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16357397,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "5add6f4067e415a6dc76c025da3d49a6524a87c0",
            "isKey": false,
            "numCitedBy": 5294,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The time required to recognize that two perspective drawings portray objects of the same three-dimensional shape is found to be (i) a linearly increasing function of the angular difference in the portrayed orientations of the two objects and (ii) no shorter for differences corresponding simply to a rigid rotation of one of the two-dimensional drawings in its own picture plane than for differences corresponding to a rotation of the three-dimensional object in depth."
            },
            "slug": "Mental-Rotation-of-Three-Dimensional-Objects-Shepard-Metzler",
            "title": {
                "fragments": [],
                "text": "Mental Rotation of Three-Dimensional Objects"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "The time required to recognize that two perspective drawings portray objects of the same three-dimensional shape is found to be a linearly increasing function of the angular difference in the portrayed orientations of the two objects."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7136759,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c5f5311fa1f34159ab3a0a1d58da51cd0340a640",
            "isKey": false,
            "numCitedBy": 6319,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light. Most cells can be categorized as simple, complex, or hypercomplex, with response properties very similar to those previously described in the cat. On the average, however, receptive fields are smaller, and there is a greater sensitivity to changes in stimulus orientation. A small proportion of the cells are colour coded."
            },
            "slug": "Receptive-fields-and-functional-architecture-of-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields and functional architecture of monkey striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light, with response properties very similar to those previously described in the cat."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14801990,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6f20e254e3993538c79e0ff2b9b8f198d3359cb3",
            "isKey": false,
            "numCitedBy": 4211,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "In the central nervous system the visual pathway from retina to striate cortex provides an opportunity to observe and compare single unit responses at several distinct levels. Patterns of light stimuli most effective in influencing units at one level may no longer be the most effective at the next. From differences in responses at successive stages in the pathway one may hope to gain some understanding of the part each stage plays in visual perception. By shining small spots of light on the light-adapted cat retina Kuffler (1953) showed that ganglion cells have concentric receptive fields, with an 'on' centre and an 'off ' periphery, or vice versa. The 'on' and 'off' areas within a receptive field were found to be mutually antagonistic, and a spot restricted to the centre of the field was more effective than one covering the whole receptive field (Barlow, FitzHugh & Kuffler, 1957). In the freely moving lightadapted cat it was found that the great majority of cortical cells studied gave little or no response to light stimuli covering most of the animal's visual field, whereas small spots shone in a restricted retinal region often evoked brisk responses (Hubel, 1959). A moving spot of light often produced stronger responses than a stationary one, and sometimes a moving spot gave more activation for one direction than for the opposite. The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex. Receptive fields of the cells considered in this paper were divided into separate excitatory and inhibitory ('on' and 'off') areas. In this respect they resembled retinal ganglion-cell receptive fields. However, the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinal ganglion cells. An attempt was made to correlate responses to moving stimuli"
            },
            "slug": "Receptive-fields-of-single-neurones-in-the-cat's-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields of single neurones in the cat's striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex, which resembled retinal ganglion-cell receptive fields, but the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinalganglion cells."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16755901,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "eedeeb1d26d84a3e54f10ce8d85ed04039288a8f",
            "isKey": false,
            "numCitedBy": 189,
            "numCiting": 71,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-efficiency-of-detecting-changes-of-density-in-Barlow",
            "title": {
                "fragments": [],
                "text": "The efficiency of detecting changes of density in random dot patterns"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3777818"
                        ],
                        "name": "L. Cermak",
                        "slug": "L.-Cermak",
                        "structuredName": {
                            "firstName": "Laird",
                            "lastName": "Cermak",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Cermak"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2435816"
                        ],
                        "name": "F. Craik",
                        "slug": "F.-Craik",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Craik",
                            "middleNames": [
                                "I.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Craik"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143110505,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "2e06b264f2f50304220dfadbd25377594d3e327e",
            "isKey": false,
            "numCitedBy": 733,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Preface. Part 1: Theoretical and Empirical Developments 1. Larry L. Jacoby and Fergus I. M. Craik Effects of Elaboration of Processing at Encoding and Retrieval: Trace Distinctiveness and Recovery of Initial Context 2. William F. Battig The Flexibility of Human Memory 3. Douglas L. Nelson Remembering Pictures and Words: Appearance, Significance, and Name 4. Robert S. Lockhart Remembering Events: Discussion of Papers by Jacoby and Craik, Battig, and Nelson Part 2: Extensions and Applications 5. Michael W. Eysenck Depth, Elaboration, and Distinctiveness 6. Laird S. Cermak Amnesic Patients' Level of Processing 7. Harry P. Bahrick Broader Methods and Narrower Theories for Memory Research: Comments on the Papers by Eysenck and Cermak Part 3: Language Processes 8. Charles A. Perfetti Levels of Langauge and Levels of Process 9. Janet L. Lachman and Roy Lachman Comprehension and Cognition: A State of the Art Inquiry 10 . Walter Kintsch Levels of Processing Language Material: Discussion of the Papers by Lachman and Lachman and Perfetti Part 4: Developmental Issues 11. Ann L. Brown Theories of Memory and the Problems of Development: Activity, Growth, and Knowledge 12. Mary J. Naus and Frank G. Halasz Developmental Perspectives on Cognitive Processing and Semantic Memory Structure 13. John William Hagen Development and Models of Memory: Comments of the Papers by Brown and Naus and Halasz Part 5: Perceiving, Acting and Knowing 14. Anne Treisman The Psychological Reality of Levels of Processing 15. J.D. Bransford, J.J. Franks, C.D. Morris, and B.S. Stein Some General Constraints on Learning and Memory Research 16. Alan Baddeley Levels of Processing and Levels of Explanation: Discussion of the Papers by Treisman and Bransford, Franks, Morris and Stein Part 6: Theoretical Alternatives 17. Paul A. Kolers A Pattern-Analyzing Basis of Recognition 18. John R. Anderson and Lynne M. Reder An Elaborative Processing Explanation of Depth Processing 19. Endel Tulving Relation Between Encoding Specificity and Levels of Processing 20. James J. Jenkins Four Points to Remember: A Tetrahedral Model of Memory Experiments 21. Fergus I.M. Craik Levels of Processing: Overview and Closing Comments. Author Index. Subject Index."
            },
            "slug": "Levels-of-Processing-in-Human-Memory-Cermak-Craik",
            "title": {
                "fragments": [],
                "text": "Levels of Processing in Human Memory"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6270661"
                        ],
                        "name": "S. W. Kuffler",
                        "slug": "S.-W.-Kuffler",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Kuffler",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. W. Kuffler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18591943,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b446e3fb01026b4e5ad978812540f172405fff6f",
            "isKey": false,
            "numCitedBy": 2575,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "THE DISCHARGES carried in the optic nerve fibers contain all the information which the central nervous system receives from the retina. A correct interpretation of discharge patterns therefore constitutes an important step in the analysis of visual events. Further, investigations of nervous activity arising in the eye reveal many aspects of the functional organization of the neural elements within the retina itself. Following studies of discharges in the optic nerve of the eel’s eye by Adrian and Matthews (2,3), Hartline and his colleagues described the discharge pattern in the eye of the Limulus in a series of important and lucid papers (for a summary see 20). In the Limulus the relationship between the stimulus to the primary receptor cell and the nerve discharges proved relatively simple, apparently because the connection between sense cell and nerve fiber was a direct one. Thus, when stimulation is confined to one receptor the discharge in a single Limulus nerve fiber will provide a good indication of excitatory events which take place as a result of photochemical processes. Discharges last for the duration of illumination and their frequency is a measure of stimulus strength. Lately, however, it was shown by Hartline et al. (22) that inhibitory interactions may be revealed when several receptors are excited. On the whole, the Limulus preparation shows many features which are similar to other simple sense organs, for instance, stretch receptors. In the latter, however, instead of photochemical events, stretch-deformation acts as the adequate stimulus on sensory terminals and is translated into a characteristic discharge pattern. The discharge from the cold-blooded vertebrate retina (mainly frogs) proved much more complex. Hartline found three main types when recording from single optic nerve fibers: (i) “on” discharges, similar to those in the Limulus, firing for the duration of the light stimulus, (ii) “off” discharges appearing when a light stimulus was withdrawn, and (iii) ‘con-off” discharges, a combination of the former two, with activity confined mainly to onset and cessation of illumination. The mammalian discharge patterns were studied in a number of species by Granit and his co-workers in the course of their extensive work on the physiology of the visual system (summaries in 13, 15). On the whole, they did not observe any fundamental differences between frog and mammalian discharge types (see later)."
            },
            "slug": "Discharge-patterns-and-functional-organization-of-Kuffler",
            "title": {
                "fragments": [],
                "text": "Discharge patterns and functional organization of mammalian retina."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The Limulus preparation shows many features which are similar to other simple sense organs, for instance, stretch receptors, however, instead of photochemical events, stretch-deformation acts as the adequate stimulus on sensory terminals and is translated into a characteristic discharge pattern."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144420921"
                        ],
                        "name": "M. Rosenblatt",
                        "slug": "M.-Rosenblatt",
                        "structuredName": {
                            "firstName": "Murray",
                            "lastName": "Rosenblatt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Rosenblatt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2480110"
                        ],
                        "name": "D. Slepian",
                        "slug": "D.-Slepian",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Slepian",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Slepian"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121742398,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d54aebf5c76109786bd3e43dfd78df2c9d5747e4",
            "isKey": false,
            "numCitedBy": 33,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Nth-Order-Markov-Chains-with-Every-N-Variables-Rosenblatt-Slepian",
            "title": {
                "fragments": [],
                "text": "Nth Order Markov Chains with Every N Variables Independent"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 33862721,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "436234a4dc9b8a35f5c1407b66b306fc3b452c0e",
            "isKey": false,
            "numCitedBy": 645,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Experiments-in-the-visual-perception-of-texture.-Julesz",
            "title": {
                "fragments": [],
                "text": "Experiments in the visual perception of texture."
            },
            "venue": {
                "fragments": [],
                "text": "Scientific American"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 3240988,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5d977ee72fd0aaf8c2ac2808c9dd522cdef8b4b7",
            "isKey": false,
            "numCitedBy": 839,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Summation-and-inhibition-in-the-frog's-retina-Barlow",
            "title": {
                "fragments": [],
                "text": "Summation and inhibition in the frog's retina"
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1953
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 18,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Textons,-the-elements-of-texture-perception,-and-Julesz/8999355e47248bc60f5768fc2168fd28295b5f27?sort=total-citations"
}