{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1758550"
                        ],
                        "name": "R. Manmatha",
                        "slug": "R.-Manmatha",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Manmatha",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Manmatha"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "103948542"
                        ],
                        "name": "N. Srimal",
                        "slug": "N.-Srimal",
                        "structuredName": {
                            "firstName": "Nitin",
                            "lastName": "Srimal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Srimal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 20611223,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "03a32b8d899f3f41103445b81a93bb834125a480",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Indexing large archives of historical manuscripts, like the papers of George Washington, is required to allow rapid perusal by scholars and researchers who wish to consult the original manuscripts. Presently, such large archives are indexed manually. Since optical character recognition (OCR) works poorly with handwriting, a scheme based on matching word images called word spotting has been suggested previously for indexing such documents. The important steps in this scheme are segmentation of a document page into words and creation of lists containing instances of the same word by word image matching. \n \nWe have developed a novel methodology for segmenting handwritten document images by analyzing the extent of \"blobs\" in a scale space representationof the image. We believe this is the first application of scale space to this problem. The algorithm has been applied to around 30 grey level images randomly picked from Different sections of the George Washington corpus of 6,400 handwritten document images. An accuracy of 77-96 percent was observed with an average accuracy of around 87 percent. The algorithm works well in the presence of noise, shine through and other artifacts which may arise due aging and degradation of the page over a couple of centuries or through the man made processes of photocopying and scanning."
            },
            "slug": "Scale-Space-Technique-for-Word-Segmentation-in-Manmatha-Srimal",
            "title": {
                "fragments": [],
                "text": "Scale Space Technique for Word Segmentation in Handwritten Documents"
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "A novel methodology for segmenting handwritten document images by analyzing the extent of \"blobs\" in a scale space representation of the image is developed, believed to be the first application of scale space to this problem."
            },
            "venue": {
                "fragments": [],
                "text": "Scale-Space"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1758550"
                        ],
                        "name": "R. Manmatha",
                        "slug": "R.-Manmatha",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Manmatha",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Manmatha"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144456145"
                        ],
                        "name": "W. Bruce Croft",
                        "slug": "W.-Bruce-Croft",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Croft",
                            "middleNames": [
                                "Bruce"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Bruce Croft"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 42,
                                "start": 39
                            }
                        ],
                        "text": "The word spotting idea was proposed by [5]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 3
                            }
                        ],
                        "text": "In [5], pruning of word pairs based on the area and aspect ratio of their bounding boxes was performed."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 48,
                                "start": 45
                            }
                        ],
                        "text": "For such collections, the Word spotting idea [5] provides an alternative approach to index generation: first, each page in the document collection is segmented into words, and the different instances of a word are clustered together using image matching."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 14094231,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "898a68692007dad4a43b3ad38073f3363b707568",
            "isKey": false,
            "numCitedBy": 39,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "There are many historical manuscripts written in a single hand which it would be useful to index. Examples include the early Presidential papers at the Library of Congress and the collected works of W. B. DuBois at the library of the University of Massachusetts. The standard technique for indexing documents is to scan them in, convert them to machine readable form (ASCII) using Optical Character Recognition (OCR) and then index them using a text retrieval engine. However, OCR does not work well on handwriting. Here, an alternative scheme is proposed for indexing such texts. Each page of the document is segmented into words. The images of the words are then matched against each other to create equivalence classes (each equivalence classes contains multiple instances of the same word). The user then provides ASCII equivalents for say the top 2000 equivalence classes. The current paper deals with the matching aspects of this process. Due to variations in even a single person’s handwriting, it is expected that the matching will be the most diff icult step in the whole process. Two different techniques for matching words are discussed. The first method, based on Euclidean distance mapping, matches words assuming that the transformation between the words may be modelled by a translation (shift). The second method, based on an algorithm developed by Scott and Longuet-Higgins, matches words assuming that the transformation between the words may be modelled by an affine transform. Experiments are shown demonstrating the feasibility of the approach for indexing handwriting."
            },
            "slug": "Word-Spotting:-Indexing-Handwritten-Archives-Manmatha-Croft",
            "title": {
                "fragments": [],
                "text": "Word Spotting: Indexing Handwritten Archives"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Experiments are shown demonstrating the feasibility of the approach for indexing handwriting, based on an algorithm developed by Scott and Longuet-Higgins and based on Euclidean distance mapping."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1758550"
                        ],
                        "name": "R. Manmatha",
                        "slug": "R.-Manmatha",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Manmatha",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Manmatha"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "103948542"
                        ],
                        "name": "N. Srimal",
                        "slug": "N.-Srimal",
                        "structuredName": {
                            "firstName": "Nitin",
                            "lastName": "Srimal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Srimal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 17
                            }
                        ],
                        "text": "Previous work by [6] has dealt with the problem of segmenting such images of historical documents."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 92,
                                "start": 89
                            }
                        ],
                        "text": "Each page in the two test sets was segmented into words using the algorithm described in [6]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 16554591,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "52a55cc457c6ebe2e1d6bde34ccb06c552bcddde",
            "isKey": false,
            "numCitedBy": 40,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Indexing large archives of historical manuscripts is required to allow rapid perusal by scholars and researchers who wish to consult the original manuscripts. However, automatic conversion of handwritten manuscripts to digital form allowing eecient storage and retrieval of the original documents is a challenging problem. Word spotting is a scheme to index such data. The important steps in this scheme are segmentation of a document page into words and creation of lists containing instances of the same word by word image matching. We have developed a novel methodology for segmenting handwritten document images by analyzing the extent of \\blobs\" in a scale space representation of the image. The algorithm was been applied to around 30 grey level images randomly picked from diierent sections of the George Washington corpus of 6,400 handwritten document images. An accuracy of 77 ? 96 percent was observed with an average accuracy of around 87 percent. The algorithm works well in the presence of noise, shine through and other artifacts which may arise due aging and degradation of the page over a couple of centuries or through the man made processes of photocopying and scanning. end ital-ics mode"
            },
            "slug": "Scale-Space-Technique-for-Word-Segmentation-in-Manmatha-Srimal",
            "title": {
                "fragments": [],
                "text": "Scale Space Technique for Word Segmentation in Handwritten Manuscripts"
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "A novel methodology for segmenting handwritten document images by analyzing the extent of \"blobs\" in a scale space representation of the image is developed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2603631"
                        ],
                        "name": "C. Tomai",
                        "slug": "C.-Tomai",
                        "structuredName": {
                            "firstName": "Catalin",
                            "lastName": "Tomai",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Tomai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2119453473"
                        ],
                        "name": "Bin Zhang",
                        "slug": "Bin-Zhang",
                        "structuredName": {
                            "firstName": "Bin",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bin Zhang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117208225"
                        ],
                        "name": "Venu Govindaraju",
                        "slug": "Venu-Govindaraju",
                        "structuredName": {
                            "firstName": "Venu",
                            "lastName": "Govindaraju",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Venu Govindaraju"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 3
                            }
                        ],
                        "text": "In [10] the problem of spotting word images in historical documents using a perfect transcript (obtained manually) is addressed."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14677442,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "73843182aabc5f45efef4f49f9481ce45aba4558",
            "isKey": false,
            "numCitedBy": 84,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "There is a large number of scanned historical documents that need to be indexed for archival and retrieval purposes. A visual word spotting scheme that would serve these purposes is a challenging task even when the transcription of the document image is available. We propose a framework for mapping each word in the transcript to the associated word image in the document. Coarse word mapping based on document constraints is used for lexicon reduction. Then, word mappings are refined using word recognition results by a dynamic programming algorithm that finds the best match while satisfying the constraints."
            },
            "slug": "Transcript-mapping-for-historic-handwritten-images-Tomai-Zhang",
            "title": {
                "fragments": [],
                "text": "Transcript mapping for historic handwritten document images"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A framework for mapping each word in the transcript to the associated word image in the document and a dynamic programming algorithm that finds the best match while satisfying the constraints is proposed."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings Eighth International Workshop on Frontiers in Handwriting Recognition"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2062921"
                        ],
                        "name": "A. Kolcz",
                        "slug": "A.-Kolcz",
                        "structuredName": {
                            "firstName": "Aleksander",
                            "lastName": "Kolcz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Kolcz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3280194"
                        ],
                        "name": "J. Alspector",
                        "slug": "J.-Alspector",
                        "structuredName": {
                            "firstName": "Joshua",
                            "lastName": "Alspector",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Alspector"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3042261"
                        ],
                        "name": "M. Augusteijn",
                        "slug": "M.-Augusteijn",
                        "structuredName": {
                            "firstName": "Marijke",
                            "lastName": "Augusteijn",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Augusteijn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 38,
                                "start": 35
                            }
                        ],
                        "text": "The matching algorithm proposed in [4] is also problematic, since it aligns each feature using a separate dynamic time warp and combines the results heuristically."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 9,
                                "start": 6
                            }
                        ],
                        "text": "Since [4] do not perform segmentation, the word templates are hand generated."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[4] examine the problem of spotting occurrences of a known template word in each line of several pages."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[4] provide results for 4 hand-picked individual words on the Archives of the Indies - this data set seems to have been scanned from the originals and is probably of good quality."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1215832,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9134892d751748a6ffe9e4ce1a818c222267250d",
            "isKey": true,
            "numCitedBy": 113,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract:The problem of word spotting in handwritten archives is approached by matching global shape features. A set of visual templates is used to define the keyword class of interest, and initiate a search for words exhibiting high shape similarity to the model set. Major problems of segmenting cursive script into individual words are avoided by applying line-oriented processing to the document pages. The use of profile-oriented features facilitates the application of dynamic programming techniques to pattern matching, and allows us to achieve high levels of recognition performance. Results of experiments with old Spanish manuscripts show a high recognition rate of the proposed approach."
            },
            "slug": "A-Line-Oriented-Approach-to-Word-Spotting-in-Kolcz-Alspector",
            "title": {
                "fragments": [],
                "text": "A Line-Oriented Approach to Word Spotting in Handwritten Documents"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "The problem of word spotting in handwritten archives is approached by matching global shape features by using a set of visual templates to define the keyword class of interest, and initiate a search for words exhibiting high shape similarity to the model set."
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Analysis & Applications"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34780875"
                        ],
                        "name": "Chien-Huei Chen",
                        "slug": "Chien-Huei-Chen",
                        "structuredName": {
                            "firstName": "Chien-Huei",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chien-Huei Chen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37695322,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3a9020a97694348cf403b7534a03347c9c852f2e",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Most conventional document understanding systems use lexicons only in a postprocessing step to verify or correct character recognition results. The authors present a new approach to word recognition that uses a lexicon to \"drive\" the recognition process. Lexicon words are encoded in trie data structures, and recognition of a word image is done by searching a lexicon trie for a path whose node characters yield the best match to the word image. This approach has two important advantages. First, it is segmentation-free; there is no need to presegment the text image into isolated characters. Second, it performs recognition by verifying character hypotheses, as opposed to the classification method used in most conventional optical character recognition (OCR) systems. Hence, the recognition process is more efficient and the results are more accurate. They demonstrated the feasibility and the advantage of this approach with a lexicon size of more than 50000 words, on severely degraded images."
            },
            "slug": "Lexicon-driven-word-recognition-Chen",
            "title": {
                "fragments": [],
                "text": "Lexicon-driven word recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "A new approach to word recognition that uses a lexicon to \"drive\" the recognition process and performs recognition by verifying character hypotheses, as opposed to the classification method used in most conventional optical character recognition systems."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2779846"
                        ],
                        "name": "H. Sakoe",
                        "slug": "H.-Sakoe",
                        "structuredName": {
                            "firstName": "Hiroaki",
                            "lastName": "Sakoe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Sakoe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35805230"
                        ],
                        "name": "S. Chiba",
                        "slug": "S.-Chiba",
                        "structuredName": {
                            "firstName": "Seibi",
                            "lastName": "Chiba",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Chiba"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17900407,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "18f355d7ef4aa9f82bf5c00f84e46714efa5fd77",
            "isKey": false,
            "numCitedBy": 5370,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper reports on an optimum dynamic progxamming (DP) based time-normalization algorithm for spoken word recognition. First, a general principle of time-normalization is given using time-warping function. Then, two time-normalized distance definitions, called symmetric and asymmetric forms, are derived from the principle. These two forms are compared with each other through theoretical discussions and experimental studies. The symmetric form algorithm superiority is established. A new technique, called slope constraint, is successfully introduced, in which the warping function slope is restricted so as to improve discrimination between words in different categories. The effective slope constraint characteristic is qualitatively analyzed, and the optimum slope constraint condition is determined through experiments. The optimized algorithm is then extensively subjected to experimental comparison with various DP-algorithms, previously applied to spoken word recognition by different research groups. The experiment shows that the present algorithm gives no more than about two-thirds errors, even compared to the best conventional algorithm."
            },
            "slug": "Dynamic-programming-algorithm-optimization-for-word-Sakoe-Chiba",
            "title": {
                "fragments": [],
                "text": "Dynamic programming algorithm optimization for spoken word recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "This paper reports on an optimum dynamic progxamming (DP) based time-normalization algorithm for spoken word recognition, in which the warping function slope is restricted so as to improve discrimination between words in different categories."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701931"
                        ],
                        "name": "G. Scott",
                        "slug": "G.-Scott",
                        "structuredName": {
                            "firstName": "Guy",
                            "lastName": "Scott",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Scott"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "92269846"
                        ],
                        "name": "H. C. Longuet-Higgins",
                        "slug": "H.-C.-Longuet-Higgins",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Longuet-Higgins",
                            "middleNames": [
                                "Christopher"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. C. Longuet-Higgins"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13011932,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "281a3859b8ead503067f52e653dff28ed534d6d2",
            "isKey": false,
            "numCitedBy": 491,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we describe an algorithm that operates on the distances between features in the two related images and delivers a set of correspondences between them. The algorithm maximizes the inner product of two matrices, one of which is the desired ‘pairing matrix ’ and the other a ‘proximity matrix ’ with elements exp (– r2ij/2σ2), where rij is the distance between two features, one in each image, and σ is an adjustable scale parameter. The output of the algorithm may be compared with the movements that people perceive when viewing two images in quick succession, and it is found that an increase in σ affects the computed correspondences in much the same way as an increase in interstimulus interval alters the perceived displacements. Provided that σ is not too small the algorithm will recover the feature mappings that result from image translation, expansion or shear deformation – transformations of common occurrence in image sequences – even when the displacements of individual features depart slightly from the general trend."
            },
            "slug": "An-algorithm-for-associating-the-features-of-two-Scott-Longuet-Higgins",
            "title": {
                "fragments": [],
                "text": "An algorithm for associating the features of two images"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "An algorithm that operates on the distances between features in the two related images and delivers a set of correspondences between them and will recover the feature mappings that result from image translation, expansion or shear deformation even when the displacements of individual features depart slightly from the general trend."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B: Biological Sciences"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1861837498"
                        ],
                        "name": "G. G. Stokes",
                        "slug": "G.-G.-Stokes",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Stokes",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. G. Stokes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 3
                            }
                        ],
                        "text": "SC [1]: Shape context matching (see section 1."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 221060727,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "90006064cafcb0a9ad8a30cffeb56efe7e14129b",
            "isKey": false,
            "numCitedBy": 673066,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "however (for it was the literal soul of the life of the Redeemer, John xv. io), is the peculiar token of fellowship with the Redeemer. That love to God (what is meant here is not God’s love to men) is described in such a case as a perfect love (love that has been perfected), involves no difficulty, for the simple reason that the proposition is purely hypothetical. We must, of course, also take the &dquo;keeping&dquo; in all its stringency. John knows right well that the case supposed here ncver becomes full reality. &dquo; Hereb)’,&dquo; i.e. from the actual realization of love to God. &dquo; TIli7i 7e)e are ill Hinz &dquo;"
            },
            "slug": "\"J.\"-Stokes",
            "title": {
                "fragments": [],
                "text": "\"J.\""
            },
            "venue": {
                "fragments": [],
                "text": "The New Yale Book of Quotations"
            },
            "year": 2021
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1693256"
                        ],
                        "name": "D. Sankoff",
                        "slug": "D.-Sankoff",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Sankoff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Sankoff"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "10398168"
                        ],
                        "name": "J. Kruskal",
                        "slug": "J.-Kruskal",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Kruskal",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kruskal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1403841706"
                        ],
                        "name": "Time Warps Eds",
                        "slug": "Time-Warps-Eds",
                        "structuredName": {
                            "firstName": "Time",
                            "lastName": "Eds",
                            "middleNames": [
                                "Warps"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Time Warps Eds"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52535398"
                        ],
                        "name": "String Edits",
                        "slug": "String-Edits",
                        "structuredName": {
                            "firstName": "String",
                            "lastName": "Edits",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "String Edits"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 56729381,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "24ff739a7ade6b79ad92440b0f5f2a9a5fb838af",
            "isKey": false,
            "numCitedBy": 1351,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A mudflap assembly for use with a dump vehicle having dual tires at the rear end thereof and including a pair of flexible flap sections one of which is supported by a rigid member adjacent the dual tires and the other is located above and to the rear of the rigid member and is secured at its upper end to the dump body. The rigid member is pivotally connected to the dump body and is combined with a cable which assures that the attached flap section maintains substantially the same position when the dump body is in the lowered-carry-position or raised-dump-position."
            },
            "slug": "Macromolecules:-the-theory-and-practice-of-sequence-Sankoff-Kruskal",
            "title": {
                "fragments": [],
                "text": "Macromolecules: the theory and practice of sequence comparison"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A mudflap assembly for use with a dump vehicle having dual tires at the rear end thereof and including a pair of flexible flap sections that assures that the attached flap section maintains substantially the same position when the dump body is in the lowered-carry-position or raised-dump-position."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2886380"
                        ],
                        "name": "S. Sturrock",
                        "slug": "S.-Sturrock",
                        "structuredName": {
                            "firstName": "Shane",
                            "lastName": "Sturrock",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sturrock"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 72,
                                "start": 69
                            }
                        ],
                        "text": "A more detailed discussion of continuity constraints can be found in [8]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 0
                            }
                        ],
                        "text": "Dynamic Time Warping solves this discrepancy between intuition and calculated matching distance by recovering optimal alignments between sample points in the two time series."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 25
                            }
                        ],
                        "text": "DTW Dynamic Time Warping [8] is used to compute a distance(2) between two time series."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 83
                            }
                        ],
                        "text": "In this work, we present a word matching algorithm that compares word images using Dynamic Time Warping (DTW)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 48,
                                "start": 28
                            }
                        ],
                        "text": "Then, we shortly review the Dynamic Time Warping algorithm before going on to explaining its application in our matching technique."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 0
                            }
                        ],
                        "text": "Dynamic Time Warping [8] is used to compute a distance2 between two time series."
                    },
                    "intents": []
                }
            ],
            "corpusId": 86397843,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "abcab02ebe45bdfc4b8e5e272ebb3f7471a2cdec",
            "isKey": true,
            "numCitedBy": 772,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Time-Warps,-String-Edits,-and-Macromolecules-–-The-Sturrock",
            "title": {
                "fragments": [],
                "text": "Time Warps, String Edits, and Macromolecules – The Theory and Practice of Sequence Comparison . David Sankoff and Joseph Kruskal. ISBN 1-57586-217-4. Price £13.95 (US$22·95)."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 18
                            }
                        ],
                        "text": "Previous research [3] indicates that good matching performance can be achieved by a technique that skews, resizes and aligns two candidate word images with respect to each other and then compares them pixel-by-pixel."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 3
                            }
                        ],
                        "text": "In [3], the previously described techniques were extended and refined."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 43,
                                "start": 40
                            }
                        ],
                        "text": "A: 15 images in test set 1, analyzed in [3]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 43,
                                "start": 40
                            }
                        ],
                        "text": "C: 32 images in test set 2, analyzed in [3]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[3] used an evaluation technique that considers each template image as a candidate."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 3
                            }
                        ],
                        "text": "XOR[3]: The images are aligned to compensate for shear and scale changes, and then a difference image is computed."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 3
                            }
                        ],
                        "text": "SLH[3]: recovers an affine warping transform (using the Scott & Longuet-Higgins algorithm [9]) between sample points taken from the outline of the template and candidate image."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 3
                            }
                        ],
                        "text": "SSD[3]: translates template and candidate image relative to each other to find the minimum cost (= matching cost) based on the sum of squared differences."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 79
                            }
                        ],
                        "text": "For reasons of comparability we used the exact same segmentation results as in [3]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 7
                            }
                        ],
                        "text": "In the XOR image, difference pixels in larger regions are weighted more heavily, because they are likely to result from structural differences between the template and the candidate image, not from noise."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 18,
                                "start": 15
                            }
                        ],
                        "text": "The authors of [3] extended the pruning based on area and aspect ratio of word bounding boxes."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "SSD[3]: translates template and candidate image relative to each other to find the minimum cost ( matching cost) based on the sum of squared differences."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Indexing George Washington’s Handwritten Manuscripts"
            },
            "venue": {
                "fragments": [],
                "text": "Technical Report MM- 34,"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1861222864"
                        ],
                        "name": "Miss A.O. Penney",
                        "slug": "Miss-A.O.-Penney",
                        "structuredName": {
                            "firstName": "Miss",
                            "lastName": "Penney",
                            "middleNames": [
                                "A.O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Miss A.O. Penney"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 3
                            }
                        ],
                        "text": "In [10] the problem of spotting word images in historical documents using a perfect transcript (obtained manually) is addressed."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 221039574,
            "fieldsOfStudy": [],
            "id": "45fd483402290ad4cae059a4e20cd586c019c3da",
            "isKey": false,
            "numCitedBy": 151917,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "(b)-Penney",
            "title": {
                "fragments": [],
                "text": "(b)"
            },
            "venue": {
                "fragments": [],
                "text": "The New Yale Book of Quotations"
            },
            "year": 2021
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An Algorithm for Associating the Features of Two Patterns"
            },
            "venue": {
                "fragments": [],
                "text": "Proc . of the Royal Society of London B"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Rijsbergen:Information Retrieval"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Information Retrieval. Butterworth"
            },
            "venue": {
                "fragments": [],
                "text": "Information Retrieval. Butterworth"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Our experiments show that this algorithm performs better and is faster than competing matching techniques."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 146,
                                "start": 143
                            }
                        ],
                        "text": "Success in offline handwriting recognition, where only an image of the produced writing is available, has been limited to domains with small vocabularies, such as automatic\nThis work was supported in part by the Center for Intelligent Information Retrieval and in part by the National Science…"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 121,
                                "start": 118
                            }
                        ],
                        "text": "Previous research [3] indicates that good matching performance can be achieved by a technique that skews, resizes and aligns two candidate word images with respect to each other and then compares them pixel-by-pixel."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Word Spotting: Indexing Handwritten Archives. In: Intelligent Multi-media Information Retrieval Collection"
            },
            "venue": {
                "fragments": [],
                "text": "Word Spotting: Indexing Handwritten Archives. In: Intelligent Multi-media Information Retrieval Collection"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 42,
                                "start": 39
                            }
                        ],
                        "text": "We use the Sakoe-Chiba band constraint [7] to ensure this path stays close to the diagonal of the matrix which contains the D(i, j) (see Figure 3(b))."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Dynamic Programming Optimization for Spoken Word Recognition"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. on Acoustics, Speech and Signal Processing"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An Algorithm for Associating the Features of Two Patterns"
            },
            "venue": {
                "fragments": [],
                "text": "Proc . of the Royal Society of London B"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 3
                            }
                        ],
                        "text": "In [5], pruning of word pairs based on the area and aspect ratio of their bounding boxes was performed."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 44
                            }
                        ],
                        "text": "For such collections, the Word spottingidea [5] provides an alternative approach to index generation: first, each page in the document collection is segmented into words, and the different instances of a word are clustered together using image matching."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Croft:Word Spotting: Indexing Handwritten Archives"
            },
            "venue": {
                "fragments": [],
                "text": "Intelligent Multi-media Information Retrieval Collection,"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 90
                            }
                        ],
                        "text": "SLH[3]: recovers an affine warping transform (using the Scott & Longuet-Higgins algorithm [9]) between sample points taken from the outline of the template and candidate image."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 229,
                                "start": 226
                            }
                        ],
                        "text": "Table 2: Average precision scores on all data sets (results for test set A and B have been corrected, XOR: matching using difference images, SSD: sum of squared differences technique, SLH: technique by Scott & Longuet-Higgins [9], SC: shape context matching [1], EDM: Euclidean distance mapping, DTW: dynamic time warping matching)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Longuet-Higgins: An Algorithm for Associating the Features of Two Patterns"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. of the Royal Society of London"
            },
            "year": 1991
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 8,
            "methodology": 9
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 21,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/Word-image-matching-using-dynamic-time-warping-Rath-Manmatha/e20e64661424bee772c7f002d45c1ac79578fb03?sort=total-citations"
}