{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1721860"
                        ],
                        "name": "M. Wainwright",
                        "slug": "M.-Wainwright",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Wainwright",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wainwright"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35132120"
                        ],
                        "name": "T. Jaakkola",
                        "slug": "T.-Jaakkola",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Jaakkola",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Jaakkola"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701607"
                        ],
                        "name": "A. Willsky",
                        "slug": "A.-Willsky",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Willsky",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Willsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15245893,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "01e560a3e0eae9f80a1f6c033e429768f3d1109c",
            "isKey": false,
            "numCitedBy": 141,
            "numCiting": 66,
            "paperAbstract": {
                "fragments": [],
                "text": "Finding the maximum a posteriori (MAP) assignment of a discrete-state distribution specified by a graphical model requires solving an integer program. The max-product algorithm, also known as the max-plus or min-sum algorithm, is an iterative method for (approximately) solving such a problem on graphs with cycles. We provide a novel perspective on the algorithm, which is based on the idea of reparameterizing the distribution in terms of so-called pseudo-max-marginals on nodes and edges of the graph. This viewpoint provides conceptual insight into the max-product algorithm in application to graphs with cycles. First, we prove the existence of max-product fixed points for positive distributions on arbitrary graphs. Next, we show that the approximate max-marginals computed by max-product are guaranteed to be consistent, in a suitable sense to be defined, over every tree of the graph. We then turn to characterizing the nature of the approximation to the MAP assignment computed by max-product. We generalize previous work by showing that for any graph, the max-product assignment satisfies a particular optimality condition with respect to any subgraph containing at most one cycle per connected component. We use this optimality condition to derive upper bounds on the difference between the log probability of the true MAP assignment, and the log probability of a max-product assignment. Finally, we consider extensions of the max-product algorithm that operate over higher-order cliques, and show how our reparameterization analysis extends in a natural manner."
            },
            "slug": "Tree-consistency-and-bounds-on-the-performance-of-Wainwright-Jaakkola",
            "title": {
                "fragments": [],
                "text": "Tree consistency and bounds on the performance of the max-product algorithm and its generalizations"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "A novel perspective on the max-product algorithm is provided, based on the idea of reparameterizing the distribution in terms of so-called pseudo-max-marginals on nodes and edges of the graph, to provide conceptual insight into the algorithm in application to graphs with cycles."
            },
            "venue": {
                "fragments": [],
                "text": "Stat. Comput."
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1721860"
                        ],
                        "name": "M. Wainwright",
                        "slug": "M.-Wainwright",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Wainwright",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wainwright"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35132120"
                        ],
                        "name": "T. Jaakkola",
                        "slug": "T.-Jaakkola",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Jaakkola",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Jaakkola"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701607"
                        ],
                        "name": "A. Willsky",
                        "slug": "A.-Willsky",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Willsky",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Willsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 4
                            }
                        ],
                        "text": "Our first approach is based on the convexity of the upper bounds, and the associated theory of Lagrangian duality."
                    },
                    "intents": []
                }
            ],
            "corpusId": 5749684,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "f178383deb578992b2a62844a08a6451cbad16ed",
            "isKey": false,
            "numCitedBy": 453,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "We introduce a new class of upper bounds on the log partition function of a Markov random field (MRF). This quantity plays an important role in various contexts, including approximating marginal distributions, parameter estimation, combinatorial enumeration, statistical decision theory, and large-deviations bounds. Our derivation is based on concepts from convex duality and information geometry: in particular, it exploits mixtures of distributions in the exponential domain, and the Legendre mapping between exponential and mean parameters. In the special case of convex combinations of tree-structured distributions, we obtain a family of variational problems, similar to the Bethe variational problem, but distinguished by the following desirable properties: i) they are convex, and have a unique global optimum; and ii) the optimum gives an upper bound on the log partition function. This optimum is defined by stationary conditions very similar to those defining fixed points of the sum-product algorithm, or more generally, any local optimum of the Bethe variational problem. As with sum-product fixed points, the elements of the optimizing argument can be used as approximations to the marginals of the original model. The analysis extends naturally to convex combinations of hypertree-structured distributions, thereby establishing links to Kikuchi approximations and variants."
            },
            "slug": "A-new-class-of-upper-bounds-on-the-log-partition-Wainwright-Jaakkola",
            "title": {
                "fragments": [],
                "text": "A new class of upper bounds on the log partition function"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "A new class of upper bounds on the log partition function of a Markov random field (MRF) is introduced, based on concepts from convex duality and information geometry, and the Legendre mapping between exponential and mean parameters is exploited."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Information Theory"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30400079"
                        ],
                        "name": "Yair Weiss",
                        "slug": "Yair-Weiss",
                        "structuredName": {
                            "firstName": "Yair",
                            "lastName": "Weiss",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yair Weiss"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768236"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Freeman",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6945869,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3f583eca0700a808c6a802ae8e79835f111b22ce",
            "isKey": false,
            "numCitedBy": 626,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "Graphical models, such as Bayesian networks and Markov random fields (MRFs), represent statistical dependencies of variables by a graph. The max-product \"belief propagation\" algorithm is a local-message-passing algorithm on this graph that is known to converge to a unique fixed point when the graph is a tree. Furthermore, when the graph is a tree, the assignment based on the fixed point yields the most probable values of the unobserved variables given the observed ones. Good empirical performance has been obtained by running the max-product algorithm (or the equivalent min-sum algorithm) on graphs with loops, for applications including the decoding of \"turbo\" codes. Except for two simple graphs (cycle codes and single-loop graphs) there has been little theoretical understanding of the max-product algorithm on graphs with loops. Here we prove a result on the fixed points of max-product on a graph with arbitrary topology and with arbitrary probability distributions (discrete- or continuous-valued nodes). We show that the assignment based on a fixed point is a \"neighborhood maximum\" of the posterior probability: the posterior probability of the max-product assignment is guaranteed to be greater than all other assignments in a particular large region around that assignment. The region includes all assignments that differ from the max-product assignment in any subset of nodes that form no more than a single loop in the graph. In some graphs, this neighborhood is exponentially large. We illustrate the analysis with examples."
            },
            "slug": "On-the-optimality-of-solutions-of-the-max-product-Weiss-Freeman",
            "title": {
                "fragments": [],
                "text": "On the optimality of solutions of the max-product belief-propagation algorithm in arbitrary graphs"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that the assignment based on a fixed point of max-product is a \"neighborhood maximum\" of the posterior probabilities: the posterior probability of the max- product assignment is guaranteed to be greater than all other assignments in a particular large region around that assignment."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1721860"
                        ],
                        "name": "M. Wainwright",
                        "slug": "M.-Wainwright",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Wainwright",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wainwright"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 305,
                                "start": 297
                            }
                        ],
                        "text": "Interestingly, this constraint set is equivalent to the constraint set in the Bethe variational formulation of the sum-product algorithm [39]; in fact, the LP relaxation itself can be obtained by taking a suitable limit of the “convexified” Bethe variational problem analyzed in our previous work [35, 34]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 78
                            }
                        ],
                        "text": "In addition, the work described here is linked in spirit to our previous work [35, 34], in which we showed how to upper bound the log partition function using a “convexified form” of the Bethe free energy."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1735253,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "38c47af4d89c318e40004258f1a7523a2f306ad9",
            "isKey": false,
            "numCitedBy": 80,
            "numCiting": 165,
            "paperAbstract": {
                "fragments": [],
                "text": "Stochastic processes de ned on graphs arise in a tremendous variety of elds, including statistical physics, signal processing, computer vision, arti cial intelligence, and information theory. The formalism of graphical models provides a useful language with which to formulate fundamental problems common to all of these elds, including estimation, model tting, and sampling. For graphs without cycles, known as trees, all of these problems are relatively well-understood, and can be solved eÆciently with algorithms whose complexity scales in a tractable manner with problem size. In contrast, these same problems present considerable challenges in general graphs with cycles. The focus of this thesis is the development and analysis of methods, both exact and approximate, for problems on graphs with cycles. Our contributions are in developing and analyzing techniques for estimation, as well as methods for computing upper and lower bounds on quantities of interest (e.g., marginal probabilities; partition functions). In order to do so, we make use of exponential representations of distributions, as well as insight from the associated information geometry and Legendre duality. Our results demonstrate the power of exponential representations for graphical models, as well as the utility of studying collections of modi ed problems de ned on trees embedded within the original graph with cycles. The speci c contributions of this thesis include the following. We develop a method for performing exact estimation of Gaussian processes on graphs with cycles by solving a sequence of modi ed problems on embedded spanning trees. We present the tree-based reparameterization framework for approximate estimation of discrete processes. This framework leads to a number of theoretical results on belief propagation and related algorithms, including characterizations of their xed points and the associated approximation error. Next we extend the notion of reparameterization to a much broader class of methods for approximate inference, including Kikuchi methods, and present results on their xed points and accuracy. Finally, we develop and analyze a novel class of upper bounds on the log partition function based on convex combinations of distributions in the exponential domain. In the special case of combining tree-structured distributions, the associated dual function gives an interesting perspective on the Bethe free energy. Thesis Supervisors: Alan S. Willsky and Tommi S. Jaakkola Title: Professors of Electrical Engineering and Computer Science"
            },
            "slug": "Stochastic-processes-on-graphs-with-cycles:-and-Wainwright",
            "title": {
                "fragments": [],
                "text": "Stochastic processes on graphs with cycles: geometric and variational approaches"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A method for performing exact estimation of Gaussian processes on graphs with cycles by solving a sequence of modi ed problems on embedded spanning trees, and a tree-based reparameterization framework for approximate estimation of discrete processes are presented."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1721860"
                        ],
                        "name": "M. Wainwright",
                        "slug": "M.-Wainwright",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Wainwright",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wainwright"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35132120"
                        ],
                        "name": "T. Jaakkola",
                        "slug": "T.-Jaakkola",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Jaakkola",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Jaakkola"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701607"
                        ],
                        "name": "A. Willsky",
                        "slug": "A.-Willsky",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Willsky",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Willsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 492441,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f26da30b639ac79f3b74b00b00bea6e527a4bf7c",
            "isKey": false,
            "numCitedBy": 268,
            "numCiting": 74,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a tree-based reparameterization (TRP) framework that provides a new conceptual view of a large class of algorithms for computing approximate marginals in graphs with cycles. This class includes the belief propagation (BP) or sum-product algorithm as well as variations and extensions of BP. Algorithms in this class can be formulated as a sequence of reparameterization updates, each of which entails refactorizing a portion of the distribution corresponding to an acyclic subgraph (i.e., a tree, or more generally, a hypertree). The ultimate goal is to obtain an alternative but equivalent factorization using functions that represent (exact or approximate) marginal distributions on cliques of the graph. Our framework highlights an important property of the sum-product algorithm and the larger class of reparameterization algorithms: the original distribution on the graph with cycles is not changed. The perspective of tree-based updates gives rise to a simple and intuitive characterization of the fixed points in terms of tree consistency. We develop interpretations of these results in terms of information geometry. The invariance of the distribution, in conjunction with the fixed-point characterization, enables us to derive an exact expression for the difference between the true marginals on an arbitrary graph with cycles, and the approximations provided by belief propagation. More broadly, our analysis applies to any algorithm that minimizes the Bethe free energy. We also develop bounds on the approximation error, which illuminate the conditions that govern their accuracy. Finally, we show how the reparameterization perspective extends naturally to generalizations of BP (e.g., Kikuchi (1951) approximations and variants) via the notion of hypertree reparameterization."
            },
            "slug": "Tree-based-reparameterization-framework-for-of-and-Wainwright-Jaakkola",
            "title": {
                "fragments": [],
                "text": "Tree-based reparameterization framework for analysis of sum-product and related algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "A tree-based reparameterization (TRP) framework is presented that provides a new conceptual view of a large class of algorithms for computing approximate marginals in graphs with cycles, which includes the belief propagation or sum-product algorithm as well as variations and extensions of BP."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3198578"
                        ],
                        "name": "J. Yedidia",
                        "slug": "J.-Yedidia",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Yedidia",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Yedidia"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768236"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Freeman",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30400079"
                        ],
                        "name": "Yair Weiss",
                        "slug": "Yair-Weiss",
                        "structuredName": {
                            "firstName": "Yair",
                            "lastName": "Weiss",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yair Weiss"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": " min-sum algorithm is very closely connected to a particular linear programming relaxation of the MAP integer program. This variational characterization has links to the recent work of Yedidia et al. [47], who showed that the sumproduct algorithm has a variational interpretation involving the so-called Bethe free energy. In addition, the work described here is linked in spirit to our previous work [41"
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "omarginal vector. An additional interesting connection is that this polytope LOCAL(G) is equivalent to the constraint set involved in the Bethe variational principle which, as shown by Yedidia et al. [47], underlies the sum-product algorithm. In addition, it is possible to recover this LP relaxation as the “zero-temperature” limit of an optimization problem based on a convexiﬁed Bethe approximation, a"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "ribed here do not yield MAP conﬁgurations, it is natural to consider strengthening the relaxation by forming clusters of random variables, as in the Kikuchi approximations described by Yedidia et al. [47]. In the context of this paper, this avenue amounts to taking convex combinations of hypertrees, which (roughly speaking) correspond to trees deﬁned on clusters of nodes. Such convex combinations of h"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "er constraint set formed by tree-based consistency conditions. Interestingly, this constraint set is equivalent to the constraint set in the Bethe variational formulation of the sum-product algorithm [47]; in fact, the LP relaxation itself can be obtained by taking a suitable limit of the “convexiﬁed” Bethe variational problem analyzed in our previous work [41], [44]. Second, we developed a family of "
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 121439686,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "05a281df21f4cb2b01e7751c50a4cba3ae0b992f",
            "isKey": true,
            "numCitedBy": 1568,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "\"Inference\" problems arise in statistical physics, computer vision, error-correcting coding theory, and AI. We explain the principles behind the belief propagation (BP) algorithm, which is an efficient way to solve inference problems based on passing local messages. We develop a unified approach, with examples, notation, and graphical models borrowed from the relevant disciplines.We explain the close connection between the BP algorithm and the Bethe approximation of statistical physics. In particular, we show that BP can only converge to a fixed point that is also a stationary point of the Bethe approximation to the free energy. This result helps explaining the successes of the BP algorithm and enables connections to be made with variational approaches to approximate inference.The connection of BP with the Bethe approximation also suggests a way to construct new message-passing algorithms based on improvements to Bethe's approximation introduced Kikuchi and others. The new generalized belief propagation (GBP) algorithms are significantly more accurate than ordinary BP for some problems. We illustrate how to construct GBP algorithms with a detailed example."
            },
            "slug": "Understanding-belief-propagation-and-its-Yedidia-Freeman",
            "title": {
                "fragments": [],
                "text": "Understanding belief propagation and its generalizations"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is shown that BP can only converge to a fixed point that is also a stationary point of the Bethe approximation to the free energy, which enables connections to be made with variational approaches to approximate inference."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38838239"
                        ],
                        "name": "J. Feldman",
                        "slug": "J.-Feldman",
                        "structuredName": {
                            "firstName": "Jon",
                            "lastName": "Feldman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Feldman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1721860"
                        ],
                        "name": "M. Wainwright",
                        "slug": "M.-Wainwright",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Wainwright",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wainwright"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743286"
                        ],
                        "name": "D. Karger",
                        "slug": "D.-Karger",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Karger",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Karger"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "quite rapidly, to a provably MAP-optimal data association. In other colloborative work, we have also applied these methods to decoding turbo-like and low density parity check (LDPC) codes [19], [18], [20], and provided ﬁnite-length performance guarantees for particular codes and channels. In the context of decoding, the fractional vertices of the polytope LOCAL(G) have a very concrete interpretation a"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "s X x t, t∈N(f)\\{s} τ(x N(f)) = τ s(x) (62) for all s∈N(f), and for all factor nodes f. When the factor graph deﬁnes an LDPC code, this procedure generates the LP relaxation studied in Feldman et al. [20]. More generally, this LP relaxation can be applied to factor graph distributions other than those associated with LDPC codes. B. Proof of Lemma 2 By deﬁnition, we have Φ∞(θ(T)) := max x∈Xnhθ(T),φ(x)i"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "s described here. B. Notes and related developments We brieﬂy summarize some developments related to the ideas described in this paper. In a parallel collaboration with Feldman and Karger [19], [18], [20], we have studied the tree-relaxed linear program (LP) and related message-passing algorithms as decoding methods for turbo-like and low-density parity check (LDPC) codes, and provided ﬁnite-length pe"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "n parallel and followup work to this paper, we have obtained more precise performance guarantees for our techniques when applied to particular classes of problems (e.g., binary linear coding problems [20]; binary quadratic programs [33]). We discuss these results in more detail in the sequel. In this section, we begin with a comparison of reweighted max-product to the standard max-product. In particul"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 3120399,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d3f2ff0a5e52c5b24c3ed956b0e5d4e358377f45",
            "isKey": false,
            "numCitedBy": 502,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "A new method is given for performing approximate maximum-likelihood (ML) decoding of an arbitrary binary linear code based on observations received from any discrete memoryless symmetric channel. The decoding algorithm is based on a linear programming (LP) relaxation that is defined by a factor graph or parity-check representation of the code. The resulting \"LP decoder\" generalizes our previous work on turbo-like codes. A precise combinatorial characterization of when the LP decoder succeeds is provided, based on pseudocodewords associated with the factor graph. Our definition of a pseudocodeword unifies other such notions known for iterative algorithms, including \"stopping sets,\" \"irreducible closed walks,\" \"trellis cycles,\" \"deviation sets,\" and \"graph covers.\" The fractional distance d/sub frac/ of a code is introduced, which is a lower bound on the classical distance. It is shown that the efficient LP decoder will correct up to /spl lceil/d/sub frac//2/spl rceil/-1 errors and that there are codes with d/sub frac/=/spl Omega/(n/sup 1-/spl epsi//). An efficient algorithm to compute the fractional distance is presented. Experimental evidence shows a similar performance on low-density parity-check (LDPC) codes between LP decoding and the min-sum and sum-product algorithms. Methods for tightening the LP relaxation to improve performance are also provided."
            },
            "slug": "Using-linear-programming-to-Decode-Binary-linear-Feldman-Wainwright",
            "title": {
                "fragments": [],
                "text": "Using linear programming to Decode Binary linear codes"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The definition of a pseudocodeword unifies other such notions known for iterative algorithms, including \"stopping sets,\" \"irreducible closed walks,\" \"trellis cycles,\" \"deviation sets,\" and \"graph covers,\" which is a lower bound on the classical distance."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Information Theory"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144653004"
                        ],
                        "name": "V. Kolmogorov",
                        "slug": "V.-Kolmogorov",
                        "structuredName": {
                            "firstName": "Vladimir",
                            "lastName": "Kolmogorov",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Kolmogorov"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": " the logarithmic domain, so that messages are updated according to λlogMnew ts + (1 −λ)logMold ts , where M ts new is calculated in equation (50). Moreover, we note that in follow-up work, Kolmogorov [31] has developed a modiﬁed form of treebased updates for which certain convergence properties are guaranteed. Finally, the following theorem addresses the nature of the ﬁxed points, and in particular pr"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "20 based updates could fail to converge, but instead oscillate (even with small damping parameters). These empirical observations are consistent with subsequent observations and results by Kolmogorov [31], who developed a modiﬁed form of tree-based updates for which certain convergence properties are guaranteed. (In particular, in contrast to the tree-based schedule given in Appendix C, they are guara"
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "ted to the tree-reweighted sum-product algorithm considered in our previous work [44]; see also Minka [36] for a reweighted version of the expectation propagation algorithm. In other work, Kolmogorov [31], [32] has studied the tree-reweighted max-product message-passing algorithms presented here, and proposed a sequential form of tree-updates for which certain convergence guarantees can be established"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8616813,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e0bcc580a1e9e32b3329363bab43331ed9c5a7d4",
            "isKey": true,
            "numCitedBy": 1302,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "Algorithms for discrete energy minimization are of fundamental importance in computer vision. In this paper, we focus on the recent technique proposed by Wainwright et al. (Nov. 2005)- tree-reweighted max-product message passing (TRW). It was inspired by the problem of maximizing a lower bound on the energy. However, the algorithm is not guaranteed to increase this bound - it may actually go down. In addition, TRW does not always converge. We develop a modification of this algorithm which we call sequential tree-reweighted message passing. Its main property is that the bound is guaranteed not to decrease. We also give a weak tree agreement condition which characterizes local maxima of the bound with respect to TRW algorithms. We prove that our algorithm has a limit point that achieves weak tree agreement. Finally, we show that, our algorithm requires half as much memory as traditional message passing approaches. Experimental results demonstrate that on certain synthetic and real problems, our algorithm outperforms both the ordinary belief propagation and tree-reweighted algorithm in (M. J. Wainwright, et al., Nov. 2005). In addition, on stereo problems with Potts interactions, we obtain a lower energy than graph cuts"
            },
            "slug": "Convergent-Tree-Reweighted-Message-Passing-for-Kolmogorov",
            "title": {
                "fragments": [],
                "text": "Convergent Tree-Reweighted Message Passing for Energy Minimization"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "This paper develops a modification of the recent technique proposed by Wainwright et al. (Nov. 2005), called sequential tree-reweighted message passing, which outperforms both the ordinary belief propagation and tree- reweighted algorithm in both synthetic and real problems."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1692786"
                        ],
                        "name": "H. Sherali",
                        "slug": "H.-Sherali",
                        "structuredName": {
                            "firstName": "Hanif",
                            "lastName": "Sherali",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Sherali"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3201651"
                        ],
                        "name": "Warren P. Adams",
                        "slug": "Warren-P.-Adams",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "Adams",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Warren P. Adams"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11969019,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "b84315788e08e5a81617ec197cbe340e37914196",
            "isKey": false,
            "numCitedBy": 699,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper a reformulation technique is presented that takes a given linear zero-one programming problem, converts it into a zero-one polynomial programming problem, and then relinearizes it into an extended linear program. It is shown that the strength of the resulting reformulation depends on the degree of the terms used to produce the polynomial program at the intermediate step of this method. In fact, as this degree varies from one up to the number of variables in the problem, a hierarchy of sharper representations is obtained with the final relaxation representing the convex hull of feasible solutions. The reformulation technique readily extends to produce a similar hierarchy of linear relaxations for zero-one polynomial programming problems. A characterization of the convex hull in the original variable space is also available through a projection process. The structure of this convex hull characterization (or its other relaxations) can be exploited to generate strong or facetial valid inequalities through appropriate surrogates in a computational framework. The surrogation process can also be used to study various classes of facets for different combinatorial optimization problems. Some examples are given to illustrate this point. 1. Introduction. This paper describes a technique for generating a hierarchy of polyhedral representations for linear and polynomial zero-one programming problems."
            },
            "slug": "A-Hierarchy-of-Relaxations-Between-the-Continuous-Sherali-Adams",
            "title": {
                "fragments": [],
                "text": "A Hierarchy of Relaxations Between the Continuous and Convex Hull Representations for Zero-One Programming Problems"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "It is shown that the strength of the resulting reformulation depends on the degree of the terms used to produce the polynomial program at the intermediate step of this method, and a hierarchy of sharper representations is obtained with the final relaxation representing the convex hull of feasible solutions."
            },
            "venue": {
                "fragments": [],
                "text": "SIAM J. Discret. Math."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38838239"
                        ],
                        "name": "J. Feldman",
                        "slug": "J.-Feldman",
                        "structuredName": {
                            "firstName": "Jon",
                            "lastName": "Feldman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Feldman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743286"
                        ],
                        "name": "D. Karger",
                        "slug": "D.-Karger",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Karger",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Karger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1721860"
                        ],
                        "name": "M. Wainwright",
                        "slug": "M.-Wainwright",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Wainwright",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wainwright"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9039845,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4b5ed2df68ed8ad6c56d16d13e04f120b416244c",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "In recent work (Feldman and Karger [8]), we introduced a new a pproach to decoding turbo-like codes based on linear programming (LP). We gave a precise characterization of the noise patterns that cause decoding error under the binar y symmetric and additive white Gaussian noise channels. We used this characterization to p rove that the word error rate is bounded by an inverse polynomial in the code length. Furth ermore, for any turbo-like code, our algorithm has the ML certificateproperty: whenever it outputs a code word, it is guaranteed to be the maximum-likelihood (ML) code word. In this paper we extend these results and give an iterative de coder whose output is equivalent to that of the LP decoder. We also extend the ML cer tifi ate property to the more efficient iterativetree reweighted max-product message-passing algorithm developed by Wainwright, Jaakkola, and Willsky [13]: we show that whenev er this algorithm converges to a code word, it must be the ML code word. Finally, we demonstrate experimentally that the noise patt erns that cause decoding error in the LP decoder also cause decoding error in the stand ard iterative sum-product and max-product (min-sum) message-passing algorithms. Conse quently, the deterministically constructible interleaver used by the LP decoder to achieve its bounds on error rate is useful in practice not only for the LP decoder, but for these s tandard iterative decoders as"
            },
            "slug": "Linear-Programming-Based-Decoding-of-Turbo-Like-and-Feldman-Karger",
            "title": {
                "fragments": [],
                "text": "Linear Programming-Based Decoding of Turbo-Like Codes and its Relation to Iterative Approaches"
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "This paper gives an iterative de coder whose output is equivalent to that of the LP decoder, and extends the ML certificateproperty to the more efficient iterativetree reweighted max-product message-passing algorithm developed by Wainwright, Jaakkola, and Willsky."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1708061"
                        ],
                        "name": "E. Boros",
                        "slug": "E.-Boros",
                        "structuredName": {
                            "firstName": "Endre",
                            "lastName": "Boros",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Boros"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804430"
                        ],
                        "name": "Y. Crama",
                        "slug": "Y.-Crama",
                        "structuredName": {
                            "firstName": "Yves",
                            "lastName": "Crama",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Crama"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1692448"
                        ],
                        "name": "P. Hammer",
                        "slug": "P.-Hammer",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Hammer",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Hammer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "e approximation, as discussed in our previous work [44]. For binary variables, the linear program (27) can be shown to be equivalent to a relaxation that has been studied in previous work [e.g., 27], [11]. The derivation given here illuminates the critical role of graphical structure in controlling the tightness of such a relaxation. In particular, an immediate consequence of our development is the fo"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 123061451,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "3290796e95b2f9097f3c0e8b3d984080ca04b1b1",
            "isKey": false,
            "numCitedBy": 45,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Upper-bounds-for-quadratic-0-1-maximization-Boros-Crama",
            "title": {
                "fragments": [],
                "text": "Upper-bounds for quadratic 0-1 maximization"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1783429"
                        ],
                        "name": "W. Wiegerinck",
                        "slug": "W.-Wiegerinck",
                        "structuredName": {
                            "firstName": "Wim",
                            "lastName": "Wiegerinck",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Wiegerinck"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1790356"
                        ],
                        "name": "T. Heskes",
                        "slug": "T.-Heskes",
                        "structuredName": {
                            "firstName": "Tom",
                            "lastName": "Heskes",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Heskes"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "lish connections between the ordinary max-product algorithm for LDPC codes, and a particular polytope equivalent to the one deﬁning our LP relaxation. In other independent work, Wiegerinck and Heskes [46] have proposed a “fractional” form of the sum-product algorithm that is closely related to the tree-reweighted sum-product algorithm considered in our previous work [44]; see also Minka [36] for a rew"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 79234,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e266e47cd43fd43a5af932e0f7c52a5679da840b",
            "isKey": false,
            "numCitedBy": 100,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "We consider loopy belief propagation for approximate inference in probabilistic graphical models. A limitation of the standard algorithm is that clique marginals are computed as if there were no loops in the graph. To overcome this limitation, we introduce fractional belief propagation. Fractional belief propagation is formulated in terms of a family of approximate free energies, which includes the Bethe free energy and the naive mean-field free as special cases. Using the linear response correction of the clique marginals, the scale parameters can be tuned. Simulation results illustrate the potential merits of the approach."
            },
            "slug": "Fractional-Belief-Propagation-Wiegerinck-Heskes",
            "title": {
                "fragments": [],
                "text": "Fractional Belief Propagation"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Fractional belief propagation is formulated in terms of a family of approximate free energies, which includes the Bethe free energy and the naive mean-field free as special cases, and using the linear response correction of the clique marginals, the scale parameters can be tuned."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144362425"
                        ],
                        "name": "S. Amari",
                        "slug": "S.-Amari",
                        "structuredName": {
                            "firstName": "Shun‐ichi",
                            "lastName": "Amari",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Amari"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "More precisely, atree is a cycle-free subgraphT = (V (T ), E(T )); it is spanningif it reaches every vertex (i.e., V (T ) = V )."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 7
                            }
                        ],
                        "text": "The vectorθ must belong to the constraint set\nE := {θ ∈ Rd×|T(G)| ∣∣ θ(T ) ∈ E(T ) ∀ T ∈ T(G)}."
                    },
                    "intents": []
                }
            ],
            "corpusId": 15815548,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "ff1090327dfa0fe97b5109e2311982036fca3a61",
            "isKey": false,
            "numCitedBy": 393,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "An exponential family or mixture family of probability distributions has a natural hierarchical structure. This paper gives an \"orthogonal\" decomposition of such a system based on information geometry. A typical example is the decomposition of stochastic dependency among a number of random variables. In general, they have a complex structure of dependencies. Pairwise dependency is easily represented by correlation, but it is more difficult to measure effects of pure triplewise or higher order interactions (dependencies) among these variables. Stochastic dependency is decomposed quantitatively into an \"orthogonal\" sum of pairwise, triplewise, and further higher order dependencies. This gives a new invariant decomposition of joint entropy. This problem is important for extracting intrinsic interactions in firing patterns of an ensemble of neurons and for estimating its functional connections. The orthogonal decomposition is given in a wide class of hierarchical structures including both exponential and mixture families. As an example, we decompose the dependency in a higher order Markov chain into a sum of those in various lower order Markov chains."
            },
            "slug": "Information-geometry-on-hierarchy-of-probability-Amari",
            "title": {
                "fragments": [],
                "text": "Information geometry on hierarchy of probability distributions"
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "The orthogonal decomposition of an exponential family or mixture family of probability distributions has a natural hierarchical structure is given and is important for extracting intrinsic interactions in firing patterns of an ensemble of neurons and for estimating its functional connections."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1692448"
                        ],
                        "name": "P. Hammer",
                        "slug": "P.-Hammer",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Hammer",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Hammer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144250254"
                        ],
                        "name": "P. Hansen",
                        "slug": "P.-Hansen",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Hansen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Hansen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1744574"
                        ],
                        "name": "B. Simeone",
                        "slug": "B.-Simeone",
                        "structuredName": {
                            "firstName": "Bruno",
                            "lastName": "Simeone",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Simeone"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23630537,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "7c6da6017d0325a37787d78f5015700c45eaa765",
            "isKey": false,
            "numCitedBy": 333,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "The paper is concerned with the ‘primal’ problem of maximizing a given quadratic pseudo-boolean function. Four equivalent problems are discussed—the primal, the ‘complementation’, the ‘discrete Rhys LP’ and the ‘weighted stability problem of a SAM graph’. Each of them has a relaxation—the ‘roof dual’, the ‘quadratic complementation,’ the ‘continuous Rhys LP’ and the ‘fractional weighted stability problem of a SAM graph’. The main result is that the four gaps associated with the four relaxations are equal. Furthermore, a solution to any of these problems leads at once to solutions of the other three equivalent ones. The four relaxations can be solved in polynomial time by transforming them to a bipartite maximum flow problem. The optimal solutions of the ‘roof-dual’ define ‘best’ linear majorantsp(x) off, having the following persistency property: if theith coefficient inp is positive (negative) thenxi=1 (0) in every optimum of the primal problem. Several characterizations are given for the case where these persistency results cannot be used to fix any variable of the primal. On the other hand, a class of gap-free functions (properly including the supermodular ones) is exhibited."
            },
            "slug": "Roof-duality,-complementation-and-persistency-in-Hammer-Hansen",
            "title": {
                "fragments": [],
                "text": "Roof duality, complementation and persistency in quadratic 0–1 optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The main result is that the four gaps associated with the four relaxations are equal, and a class of gap-free functions (properly including the supermodular ones) is exhibited."
            },
            "venue": {
                "fragments": [],
                "text": "Math. Program."
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2718299"
                        ],
                        "name": "N. Wiberg",
                        "slug": "N.-Wiberg",
                        "structuredName": {
                            "firstName": "Niclas",
                            "lastName": "Wiberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Wiberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "arantees for particular codes and channels. In the context of decoding, the fractional vertices of the polytope LOCAL(G) have a very concrete interpretation as pseudocodewords [e.g., 22], [25], [29], [45]. More broadly, it remains to further explore and analyze the range of problems for which the iterative algorithms and LP relaxations described here are suitable. VI. DISCUSSION In this paper, we demo"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 115168171,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "eb44d50bce92b4ce2c0ea53bd8ede95f628ee3cb",
            "isKey": false,
            "numCitedBy": 1007,
            "numCiting": 52,
            "paperAbstract": {
                "fragments": [],
                "text": "Iterative decoding techniques have become a viable alternative for constructing high performance coding systems. In particular, the recent success of turbo codes indicates that performance close to the Shannon limit may be achieved. In this thesis, it is showed that many iterative decoding algorithms are special cases of two generic algorithms, the min-sum and sum-product algorithms, which also include non-iterative algorithms such as Viterbi decoding. The min-sum and sum-product algorithms are developed and presented as generalized trellis algorithms, where the time axis of the trellis is replaced by an arbitrary graph, the “Tanner graph”. With cycle-free Tanner graphs, the resulting decoding algorithms (e.g., Viterbi decoding) are maximum-likelihood but suffer from an exponentially increasing complexity. Iterative decoding occurs when the Tanner graph has cycles (e.g., turbo codes); the resulting algorithms are in general suboptimal, but significant complexity reductions are possible compared to the cycle-free case. Several performance estimates for iterative decoding are developed, including a generalization of the union bound used with Viterbi decoding and a characterization of errors that are uncorrectable after infinitely many decoding iterations."
            },
            "slug": "Codes-and-Decoding-on-General-Graphs-Wiberg",
            "title": {
                "fragments": [],
                "text": "Codes and Decoding on General Graphs"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is showed that many iterative decoding algorithms are special cases of two generic algorithms, the min-sum and sum-product algorithms, which also include non-iterative algorithms such as Viterbi decoding."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723150"
                        ],
                        "name": "R. McEliece",
                        "slug": "R.-McEliece",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "McEliece",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. McEliece"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145852650"
                        ],
                        "name": "D. Mackay",
                        "slug": "D.-Mackay",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mackay",
                            "middleNames": [
                                "J.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mackay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2157745208"
                        ],
                        "name": "Jung-Fu Cheng",
                        "slug": "Jung-Fu-Cheng",
                        "structuredName": {
                            "firstName": "Jung-Fu",
                            "lastName": "Cheng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jung-Fu Cheng"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14553992,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "26d953005dd08a863c157b528bbabdf5671d18b6",
            "isKey": false,
            "numCitedBy": 1004,
            "numCiting": 63,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe the close connection between the now celebrated iterative turbo decoding algorithm of Berrou et al. (1993) and an algorithm that has been well known in the artificial intelligence community for a decade, but which is relatively unknown to information theorists: Pearl's (1982) belief propagation algorithm. We see that if Pearl's algorithm is applied to the \"belief network\" of a parallel concatenation of two or more codes, the turbo decoding algorithm immediately results. Unfortunately, however, this belief diagram has loops, and Pearl only proved that his algorithm works when there are no loops, so an explanation of the experimental performance of turbo decoding is still lacking. However, we also show that Pearl's algorithm can be used to routinely derive previously known iterative, but suboptimal, decoding algorithms for a number of other error-control systems, including Gallager's (1962) low-density parity-check codes, serially concatenated codes, and product codes. Thus, belief propagation provides a very attractive general methodology for devising low-complexity iterative decoding algorithms for hybrid coded systems."
            },
            "slug": "Turbo-Decoding-as-an-Instance-of-Pearl's-\"Belief-McEliece-Mackay",
            "title": {
                "fragments": [],
                "text": "Turbo Decoding as an Instance of Pearl's \"Belief Propagation\" Algorithm"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is shown that Pearl's algorithm can be used to routinely derive previously known iterative, but suboptimal, decoding algorithms for a number of other error-control systems, including Gallager's low-density parity-check codes, serially concatenated codes, and product codes."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE J. Sel. Areas Commun."
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7715701"
                        ],
                        "name": "R. Koetter",
                        "slug": "R.-Koetter",
                        "structuredName": {
                            "firstName": "Ralf",
                            "lastName": "Koetter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Koetter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2566577"
                        ],
                        "name": "P. Vontobel",
                        "slug": "P.-Vontobel",
                        "structuredName": {
                            "firstName": "Pascal",
                            "lastName": "Vontobel",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Vontobel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 5,
                                "start": 1
                            }
                        ],
                        "text": "Consequently, when the bound is tight, obtaining a MAP configuration for a graphical model with cycles — in general, avery difficult problem — is reduced to the easy task of examining the optima of a collection of tree-structured distributions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16913204,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4b52c1eeb0c86bb33b25ffcdf1987c38d25b4c1a",
            "isKey": false,
            "numCitedBy": 206,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Codewords in finite covers of a Tanner graph G are characterized. Since iterative, locally operating decoding algorithms cannot distinguish the underlying graph G from any covering graph, these codewords, dubbed pseudo-codewords are directly responible for sub-optimal behavior of iterative decoding algorithms. We give a simple characterization of pseudocodewords from finite covers and show that, for the additive, white Gaussian noise channel, their impact is captured in a finite set of “minimal” pseudocodewords. We also show that any (j, k)-regular graph possesses asymptotically vanishing relative minimal pseudo-weight. This stands in sharp contrast to the observation that for j > 2 the minimum Hamming distance of a (j, k)-regular low-density parity-check code typically grows linearly with the length of the code."
            },
            "slug": "Graph-covers-and-iterative-decoding-of-nite-length-Koetter-Vontobel",
            "title": {
                "fragments": [],
                "text": "Graph-covers and iterative decoding of nite length codes"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A simple characterization of pseudocodewords from finite covers is given and it is shown that, for the additive, white Gaussian noise channel, their impact is captured in a finite set of “minimal” pseudo-codewords."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34608005"
                        ],
                        "name": "Lei Chen",
                        "slug": "Lei-Chen",
                        "structuredName": {
                            "firstName": "Lei",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lei Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1721860"
                        ],
                        "name": "M. Wainwright",
                        "slug": "M.-Wainwright",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Wainwright",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wainwright"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145724968"
                        ],
                        "name": "M. Çetin",
                        "slug": "M.-Çetin",
                        "structuredName": {
                            "firstName": "Müjdat",
                            "lastName": "Çetin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Çetin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701607"
                        ],
                        "name": "A. Willsky",
                        "slug": "A.-Willsky",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Willsky",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Willsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 161,
                                "start": 157
                            }
                        ],
                        "text": "For instance, as documented in other work, we have applied these techniques successfully to data association problems involving multiple targets and sensors [13], and as a decoding method for turbo-like and LDPC codes [18, 19]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 157,
                                "start": 153
                            }
                        ],
                        "text": "For instance, we have applied the tree-reweighted max-product algorithm to a distributed data association problem involving multiple targets and sensors [13]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 7214407,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0a549f01256d51b589db087a51c8c5f17683f156",
            "isKey": false,
            "numCitedBy": 44,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "Data association is a fundamental problem in multitarget-multisensor tracking. It entails selecting the most probable association between sensor measurements and target tracks from a very large set of possibilities. With N sensors and n targets in the detection range of each sensor, even with perfect detection there are (n!)N different configurations which renders infeasible a solution by direct computation even in modestly-sized applications. We describe an iterative method for solving the optimal data association problem in a distributed fashion; the work exploits the framework of graphical models, which are a powerful tool for encoding the statistical dependencies of a set of random variables and are widely used in many applications (e.g., computer vision, error-correcting codes). Our basic idea is to treat the measurement assignment for each sensor as a random variable, which is in turn represented as a node in an underlying graph. Neighboring nodes are coupled by the targets visible to both sensors. Thus we transform the data association problem to that of computing the maximum a posteriori (MAP) configuration in a graphical model to which efficient techniques (e.g., the max-product/min-sum algorithm) can be applied. We use a tree-reweighted version of the usual max-product algorithm that either outputs the MAP data association, or acknowledges failure. For acyclic graphs, this message-passing algorithm can solve the data association problem directly and recursively with complexity O((n!)2N). On graphs with cycles, the algorithm may require more iterations to converge, and need not output an unambiguous assignment. However, for the data association problems considered here, the coupling matrices involved in computations are inherently of low rank, and experiments show that the algorithm converges very fast and finds the MAP configurations in this case."
            },
            "slug": "Multitarget-multisensor-data-association-using-the-Chen-Wainwright",
            "title": {
                "fragments": [],
                "text": "Multitarget-multisensor data association using the tree-reweighted max-product algorithm"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An iterative method for solving the optimal data association problem in a distributed fashion using a tree-reweighted version of the usual max-product algorithm that either outputs the maximum a posteriori (MAP) data association, or acknowledges failure."
            },
            "venue": {
                "fragments": [],
                "text": "SPIE Defense + Commercial Sensing"
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152559960"
                        ],
                        "name": "G. Horn",
                        "slug": "G.-Horn",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Horn",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Horn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117460567,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1591aa610748459dadf3b36f1c9bf82d4c8f5309",
            "isKey": false,
            "numCitedBy": 32,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "In the last six years, we have witnessed an explosion of interest in the coding theory community, in iterative decoding and graphical models, due primarily to the invention of turbo codes. While the structural properties of turbo codes and low density parity check codes have now been put on a firm theoretical footing, what is still lacking is a satisfactory theoretical explanation as to why iterative decoding algorithms perform as well as they do. In this thesis we make a first step by discussing the behavior of various iterative decoders for the graphs of tail-biting codes and cycle codes. By increasing our understanding of the behavior of the iterative min-sum (MSA) and sum-product (SPA) algorithms on graphs with cycles, we can design codes which achieve better performance.\n\nMuch of this thesis is devoted to the analysis of the performance of the MSA and SPA on the graphs for tail-biting codes and cycle codes. We give sufficient conditions for the MSA to converge to the maximum likelihood codeword after a finite number of iterations. We also use the familiar union bound argument to characterize the performance of the MSA after many iterations. For a cycle code, we show that the performance of the MSA decoder is asymptotically as good as maximum likelihood. For tail-biting codes this will depend on our choice of trellis."
            },
            "slug": "Iterative-decoding-and-pseudo-codewords-Horn",
            "title": {
                "fragments": [],
                "text": "Iterative decoding and pseudo-codewords"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This thesis gives sufficient conditions for the MSA to converge to the maximum likelihood codeword after a finite number of iterations, and uses the familiar union bound argument to characterize the performance of theMSA after many iterations."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3231485"
                        ],
                        "name": "S. Aji",
                        "slug": "S.-Aji",
                        "structuredName": {
                            "firstName": "Srinivas",
                            "lastName": "Aji",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Aji"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723150"
                        ],
                        "name": "R. McEliece",
                        "slug": "R.-McEliece",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "McEliece",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. McEliece"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "ative method for solving a particular linear program. We begin with some background on the notion of max-marginals, and their utility in computing exact MAP estimates of tree-structured distributions [2], [14], [15], [43]. We then deﬁne an analogous notion of pseudo-maxmarginals for graphs with cycles, which play a central role in the message-passing algorithms that we develop subsequently. A. Max-ma"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 11355291,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0e8933300a20f3d799dc9f19e352967f41d8efcc",
            "isKey": false,
            "numCitedBy": 773,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "We discuss a general message passing algorithm, which we call the generalized distributive law (GDL). The GDL is a synthesis of the work of many authors in information theory, digital communications, signal processing, statistics, and artificial intelligence. It includes as special cases the Baum-Welch algorithm, the fast Fourier transform (FFT) on any finite Abelian group, the Gallager-Tanner-Wiberg decoding algorithm, Viterbi's algorithm, the BCJR algorithm, Pearl's \"belief propagation\" algorithm, the Shafer-Shenoy probability propagation algorithm, and the turbo decoding algorithm. Although this algorithm is guaranteed to give exact answers only in certain cases (the \"junction tree\" condition), unfortunately not including the cases of GTW with cycles or turbo decoding, there is much experimental evidence, and a few theorems, suggesting that it often works approximately even when it is not supposed to."
            },
            "slug": "The-generalized-distributive-law-Aji-McEliece",
            "title": {
                "fragments": [],
                "text": "The generalized distributive law"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Although this algorithm is guaranteed to give exact answers only in certain cases (the \"junction tree\" condition), unfortunately not including the cases of GTW with cycles or turbo decoding, there is much experimental evidence, and a few theorems, suggesting that it often works approximately even when it is not supposed to."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145500689"
                        ],
                        "name": "A. Viterbi",
                        "slug": "A.-Viterbi",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Viterbi",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Viterbi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 150,
                                "start": 146
                            }
                        ],
                        "text": "…(wainwrig@eecs.berkeley.edu) is with the Department of Electrical Engineering and Computer Science and the Department of Statistics, UC Berkeley, CA. T. S. Jaakkola (tommi@csail.mit.edu) and A. S. Willsky (willsky@mit.edu) are with the Department of Electrical Engineering and Computer Science,…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 165,
                                "start": 156
                            }
                        ],
                        "text": "It\nM. J. Wainwright (wainwrig@eecs.berkeley.edu) is with the Department of Electrical Engineering and Computer Science and the Department of Statistics, UC Berkeley, CA. T. S. Jaakkola (tommi@csail.mit.edu) and A. S. Willsky (willsky@mit.edu) are with the Department of Electrical Engineering and Computer Science, MIT, Cambridge, MA."
                    },
                    "intents": []
                }
            ],
            "corpusId": 15843983,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "145c0b53514b02bdc3dadfb2e1cea124f2abd99b",
            "isKey": false,
            "numCitedBy": 5209,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "The probability of error in decoding an optimal convolutional code transmitted over a memoryless channel is bounded from above and below as a function of the constraint length of the code. For all but pathological channels the bounds are asymptotically (exponentially) tight for rates above R_{0} , the computational cutoff rate of sequential decoding. As a function of constraint length the performance of optimal convolutional codes is shown to be superior to that of block codes of the same length, the relative improvement increasing with rate. The upper bound is obtained for a specific probabilistic nonsequential decoding algorithm which is shown to be asymptotically optimum for rates above R_{0} and whose performance bears certain similarities to that of sequential decoding algorithms."
            },
            "slug": "Error-bounds-for-convolutional-codes-and-an-optimum-Viterbi",
            "title": {
                "fragments": [],
                "text": "Error bounds for convolutional codes and an asymptotically optimum decoding algorithm"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The upper bound is obtained for a specific probabilistic nonsequential decoding algorithm which is shown to be asymptotically optimum for rates above R_{0} and whose performance bears certain similarities to that of sequential decoding algorithms."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1731977"
                        ],
                        "name": "B. Bollobás",
                        "slug": "B.-Bollobás",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Bollobás",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Bollobás"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 120529008,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "5b2d23a567b117ffe32dad3907a473e328127ff2",
            "isKey": false,
            "numCitedBy": 2485,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This text is an in-depth account of graph theory. It reflects the current state of the subject and emphasizes connections with other branches of pure mathematics. Recognizing that graph theory is one of several courses competing for the attention of a student, the book contains descriptive passages designed to convey the flavour of the subject and to arouse interest. In addition to a modern treatment of the classical areas of graph theory such as colouring, matching, extremal theory, and algebraic graph theory, the book presents an account of newer topics, including: Szemer'edi's Regularity Lemma and its use; Shelah's extension of the Hales-Jewett Theorem; the precise nature of the phase transition in a random graph process; the connection between electrical networks and random walks on graphs; and the Tutte polynomial and its cousins in knot theory."
            },
            "slug": "Modern-Graph-Theory-Bollobás",
            "title": {
                "fragments": [],
                "text": "Modern Graph Theory"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This book presents an account of newer topics, including Szemer'edi's Regularity Lemma and its use; Shelah's extension of the Hales-Jewett Theorem; the precise nature of the phase transition in a random graph process; the connection between electrical networks and random walks on graphs; and the Tutte polynomial and its cousins in knot theory."
            },
            "venue": {
                "fragments": [],
                "text": "Graduate Texts in Mathematics"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3072213"
                        ],
                        "name": "J. Besag",
                        "slug": "J.-Besag",
                        "structuredName": {
                            "firstName": "Julian",
                            "lastName": "Besag",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Besag"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "INTRODUCTION Integer programming problems arise in various ﬁelds, including communication theory, error-correcting coding, image processing, statistical physics and machine learning [e.g., 35], [39], [8]. Many such problems can be formulated in terms of Markov random ﬁelds [e.g., 8], [14], in which the cost function corresponds to a graph-structured probability distribution, and the goal is to ﬁnd th"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15128952,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "47865b56fee61d9c9ff477f7c79f090cc6663d3a",
            "isKey": false,
            "numCitedBy": 4635,
            "numCiting": 79,
            "paperAbstract": {
                "fragments": [],
                "text": "may 7th, 1986, Professor A. F. M. Smith in the Chair] SUMMARY A continuous two-dimensional region is partitioned into a fine rectangular array of sites or \"pixels\", each pixel having a particular \"colour\" belonging to a prescribed finite set. The true colouring of the region is unknown but, associated with each pixel, there is a possibly multivariate record which conveys imperfect information about its colour according to a known statistical model. The aim is to reconstruct the true scene, with the additional knowledge that pixels close together tend to have the same or similar colours. In this paper, it is assumed that the local characteristics of the true scene can be represented by a nondegenerate Markov random field. Such information can be combined with the records by Bayes' theorem and the true scene can be estimated according to standard criteria. However, the computational burden is enormous and the reconstruction may reflect undesirable largescale properties of the random field. Thus, a simple, iterative method of reconstruction is proposed, which does not depend on these large-scale characteristics. The method is illustrated by computer simulations in which the original scene is not directly related to the assumed random field. Some complications, including parameter estimation, are discussed. Potential applications are mentioned briefly."
            },
            "slug": "On-the-Statistical-Analysis-of-Dirty-Pictures-Besag",
            "title": {
                "fragments": [],
                "text": "On the Statistical Analysis of Dirty Pictures"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52626911"
                        ],
                        "name": "T. Minka",
                        "slug": "T.-Minka",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Minka",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Minka"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "nd Heskes [46] have proposed a “fractional” form of the sum-product algorithm that is closely related to the tree-reweighted sum-product algorithm considered in our previous work [44]; see also Minka [36] for a reweighted version of the expectation propagation algorithm. In other work, Kolmogorov [31], [32] has studied the tree-reweighted max-product message-passing algorithms presented here, and prop"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8114569,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "85fa166aff2aba59247d2c315153b3403e883b78",
            "isKey": false,
            "numCitedBy": 67,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "This note describes power EP, an extension of Expectation Propagation (EP) that makes the computations more tractable. In this way, power EP is applicable to a wide variety of models, much more than EP. Instead of minimizing KL-divergence at each step, power EP minimizes α-divergence. This minimization turns out to be equivalent to minimizing KL-divergence with the exact distribution raised to a power. By choosing this power to cancel exponents, the problem may be substantially simplified. The resulting approximation is not the same as regular EP, but in practice is still very good, and allows tackling problems which are intractable under regular EP."
            },
            "slug": "Power-EP-Minka",
            "title": {
                "fragments": [],
                "text": "Power EP"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "This note describes power EP, an extension of Expectation Propagation that makes the computations more tractable and allows tackling problems which are intractable under regular EP."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1706352"
                        ],
                        "name": "N. Biggs",
                        "slug": "N.-Biggs",
                        "structuredName": {
                            "firstName": "Norman",
                            "lastName": "Biggs",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Biggs"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "his section provides the background and some preliminary developments necessary for subsequent sections. We begin with a brief overview of some graphtheoretic basics; we refer the reader to the books [9], [10] for additional background on graph theory. We then describe the formalism of Markov random ﬁelds; more details can be found in various sources [e.g., 12], [14], [34]. We conclude by formulating"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 222371957,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "389409b9389b0c5b3ec6806b0419fe2bac6e33f5",
            "isKey": false,
            "numCitedBy": 917,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Introduction to algebraic graph theory Part I. Linear Algebra in Graphic Thoery: 2. The spectrum of a graph 3. Regular graphs and line graphs 4. Cycles and cuts 5. Spanning trees and associated structures 6. The tree-number 7. Determinant expansions 8. Vertex-partitions and the spectrum Part II. Colouring Problems: 9. The chromatic polynomial 10. Subgraph expansions 11. The multiplicative expansion 12. The induced subgraph expansion 13. The Tutte polynomial 14. Chromatic polynomials and spanning trees Part III. Symmetry and Regularity: 15. Automorphisms of graphs 16. Vertex-transitive graphs 17. Symmetric graphs 18. Symmetric graphs of degree three 19. The covering graph construction 20. Distance-transitive graphs 21. Feasibility of intersection arrays 22. Imprimitivity 23. Minimal regular graphs with given girth References Index."
            },
            "slug": "Algebraic-Graph-Theory-Biggs",
            "title": {
                "fragments": [],
                "text": "Algebraic Graph Theory"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3231485"
                        ],
                        "name": "S. Aji",
                        "slug": "S.-Aji",
                        "structuredName": {
                            "firstName": "Srinivas",
                            "lastName": "Aji",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Aji"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152559960"
                        ],
                        "name": "G. Horn",
                        "slug": "G.-Horn",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Horn",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Horn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723150"
                        ],
                        "name": "R. McEliece",
                        "slug": "R.-McEliece",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "McEliece",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. McEliece"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2542234"
                        ],
                        "name": "M. Xu",
                        "slug": "M.-Xu",
                        "structuredName": {
                            "firstName": "Meina",
                            "lastName": "Xu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Xu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 44231703,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a42cf66a05ec415db1a606025e987d12e6f8b496",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "By invoking a form of the Perron-Frobenius theorem for the \"min-sum\" semi-ring, we obtain a union bound on the performance of iterative decoding of tail-biting codes. This bound shows that for the Gaussian channel, iterative decoding will be optimum, at least for high SNRs, if and only if the minimum \"pseudo-distance\" of the code is larger than the ordinary minimum distance."
            },
            "slug": "Iterative-min-sum-decoding-of-tail-biting-codes-Aji-Horn",
            "title": {
                "fragments": [],
                "text": "Iterative min-sum decoding of tail-biting codes"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This bound shows that for the Gaussian channel, iterative decoding will be optimum, at least for high SNRs, if and only if the minimum \"pseudo-distance\" of the code is larger than the ordinary minimum distance."
            },
            "venue": {
                "fragments": [],
                "text": "1998 Information Theory Workshop (Cat. No.98EX131)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144018201"
                        ],
                        "name": "G. Forney",
                        "slug": "G.-Forney",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Forney",
                            "middleNames": [
                                "David"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Forney"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7715701"
                        ],
                        "name": "R. Koetter",
                        "slug": "R.-Koetter",
                        "structuredName": {
                            "firstName": "Ralf",
                            "lastName": "Koetter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Koetter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1889982"
                        ],
                        "name": "F. Kschischang",
                        "slug": "F.-Kschischang",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Kschischang",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Kschischang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2171418135"
                        ],
                        "name": "Alexander Reznik",
                        "slug": "Alexander-Reznik",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Reznik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alexander Reznik"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118154721,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5ae961bbc96f4ce0a6017fc6d8e8cb4a3347a4aa",
            "isKey": false,
            "numCitedBy": 135,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "The behavior of an iterative decoding algorithm for a code defined on a graph with cycles and a given decoding schedule is characterized by a cycle-free computation tree. The pseudocodewords of such a tree are the words that satisfy all tree constraintsj pseudocodewords govern decoding performance. Wiberg [12] determined the effective weight of pseudocodewords for binary codewords on an AWGN channel. This paper extends Wiberg’s formula for AWGN channels to nonbinary codes, develops similar results for BSC and BEC channels, and gives upper and lower bounds on the effective weight. The 16-state tail-biting trellis of the Golay code [2] is used for exampIes. Although in this case no pseudocodeword is found with effective weight less than the minimum Hamming weight of the Golay code on an AWGN channel, it is shown by example that the minimum effective pseudocodeword weight can be less than the minimum codeword weight."
            },
            "slug": "On-the-Effective-Weights-of-Pseudocodewords-for-on-Forney-Koetter",
            "title": {
                "fragments": [],
                "text": "On the Effective Weights of Pseudocodewords for Codes Defined on Graphs with Cycles"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This paper extends Wiberg’s formula for AWGN channels to nonbinary codes, develops similar results for BSC and BEC channels, and gives upper and lower bounds on the effective weight."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749650"
                        ],
                        "name": "B. Frey",
                        "slug": "B.-Frey",
                        "structuredName": {
                            "firstName": "Brendan",
                            "lastName": "Frey",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Frey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7715701"
                        ],
                        "name": "R. Koetter",
                        "slug": "R.-Koetter",
                        "structuredName": {
                            "firstName": "Ralf",
                            "lastName": "Koetter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Koetter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688009"
                        ],
                        "name": "A. Vardy",
                        "slug": "A.-Vardy",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Vardy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Vardy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "rformance guarantees for particular codes and channels. In the context of decoding, the fractional vertices of the polytope LOCAL(G) have a very concrete interpretation as pseudocodewords [e.g., 22], [25], [29], [45]. More broadly, it remains to further explore and analyze the range of problems for which the iterative algorithms and LP relaxations described here are suitable. VI. DISCUSSION In this pa"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2629101,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ebb8bf7807d28685945bac3158aad8e649933031",
            "isKey": false,
            "numCitedBy": 83,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "By tracing the flow of computations in the iterative decoders for low-density parity-check codes, we formulate a signal-space view for a finite number of iterations in a finite-length code. On a Gaussian channel, maximum a posteriori (MAP) codeword decoding (or \"maximum-likelihood decoding\") decodes to the codeword signal that is closest to the channel output in Euclidean distance. In contrast, we show that iterative decoding decodes to the \"pseudosignal\" that has highest correlation with the channel output. The set of pseudosignals corresponds to \"pseudocodewords\", only a vanishingly small number of which correspond to codewords. We show that some pseudocodewords cause decoding errors, but that there are also pseudocodewords that frequently correct the deleterious effects of other pseudocodewords."
            },
            "slug": "Signal-space-characterization-of-iterative-decoding-Frey-Koetter",
            "title": {
                "fragments": [],
                "text": "Signal-space characterization of iterative decoding"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "By tracing the flow of computations in the iterative decoders for low-density parity-check codes, this work forms a signal-space view for a finite number of iterations in a finite-length code and shows that some pseudocodewords cause decoding errors, but that there are also pseudocODewords that frequently correct the deleterious effects of other pseudocods."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145884132"
                        ],
                        "name": "J. Edmonds",
                        "slug": "J.-Edmonds",
                        "structuredName": {
                            "firstName": "Jack",
                            "lastName": "Edmonds",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Edmonds"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "a spanning tree Tchosen randomly under ρ. We let ρ e = {ρ e |e∈E}represent a vector of these edge appearance probabilities. Any such vector ρ e must belong to the so-calledspanning tree polytope [7], [17], which we denote by T(G). See Figure 1 for an illustration of the edge appearance probabilities. Although we allow for the support supp(ρ) to be a strict subset of the set of all spanning trees, we r"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5599224,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "492ff2e9cab852a8fc46225f2e764007f8e5cb72",
            "isKey": false,
            "numCitedBy": 764,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Linear-algebra rank is the solution to an especially tractable optimization problem. This tractability is viewed abstractly, and extended to certain more general optimization problems which are linear programs relative to certain derived polyhedra."
            },
            "slug": "Matroids-and-the-greedy-algorithm-Edmonds",
            "title": {
                "fragments": [],
                "text": "Matroids and the greedy algorithm"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "Linear-algebra rank is the solution to an especially tractable optimization problem which are linear programs relative to certain derived polyhedra."
            },
            "venue": {
                "fragments": [],
                "text": "Math. Program."
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144845491"
                        ],
                        "name": "A. Dawid",
                        "slug": "A.-Dawid",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Dawid",
                            "middleNames": [
                                "Philip"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Dawid"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "(x ∗ s,x). 5Here κ is a positive constant that depends on both the edge, and the variable over which the maximization takes place. 12 By construction, the conﬁguration x∗ so deﬁned is MAPoptimal; see [15], [43] for further details. A particularly simple condition under which the local optimality conditions (38) hold is when for each s ∈ V, the max-marginalν shas a unique optimum x∗. In this case, the "
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "t )∈E(T . Proof: Necessity of the edge consistency is clear. The sufﬁciency can be established by an inductive argument in which successive nodes are stripped from the tree by local maximization; see [15], [43] for further details. The max-marginal representation (36) allows the global problem of MAP estimation to be solved by performing a set of local maximization operations. In particular, suppose t"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 61247712,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b9abff70b0acf9c6bb74d85f3141d76bef2039a5",
            "isKey": false,
            "numCitedBy": 288,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "A probabilistic expert system provides a graphical representation of a joint probability distribution which can be used to simplify and localize calculations. Jensenet al. (1990) introduced a ‘flow-propagation’ algorithm for calculating marginal and conditional distributions in such a system. This paper analyses that algorithm in detail, and shows how it can be modified to perform other tasks, including maximization of the joint density and simultaneous ‘fast retraction’ of evidence entered on several variables."
            },
            "slug": "Applications-of-a-general-propagation-algorithm-for-Dawid",
            "title": {
                "fragments": [],
                "text": "Applications of a general propagation algorithm for probabilistic expert systems"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This paper analyses a ‘flow-propagation’ algorithm for calculating marginal and conditional distributions in a probabilistic expert system in detail, and shows how it can be modified to perform other tasks, including maximization of the joint density and simultaneous 'fast retraction' of evidence entered on several variables."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713217"
                        ],
                        "name": "D. Bertsimas",
                        "slug": "D.-Bertsimas",
                        "structuredName": {
                            "firstName": "Dimitris",
                            "lastName": "Bertsimas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Bertsimas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144224173"
                        ],
                        "name": "J. Tsitsiklis",
                        "slug": "J.-Tsitsiklis",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsitsiklis",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tsitsiklis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "We begin by re-formulating the exact MAP estimation problem on a graph with cycles as a linear program (LP) over the so-called marginal polytope."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 60706246,
            "fieldsOfStudy": [
                "Biology",
                "Medicine"
            ],
            "id": "c8557a70ecdeec83f70954c5f169393c7f04fc9e",
            "isKey": false,
            "numCitedBy": 2692,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "p. 27, l. −11, replace “Schwartz” by “Schwarz” p. 69, l. −13: “ai∗x = bi” should be “ai∗x = bi∗” p. 126, l. 16, replace “inequality constraints” by “linear inequality constraints” p. 153, l. −8, replace aix 6= bi by aix 6= bi p. 163, Example 4.9, first line: replace “from” with “form” p. 165, l. 11, replace p′Ax ≥ 0 by p′Ax ≥ 0 p. 175, l. 1, replace “To this see” by “To see this” p. 203, l. 12: replace x ≥ 0 by x ≥ 0, xn+1 ≥ 0 p. 216, l. −6: replace “≤ c}” by “≤ c′}” p. 216, l. −3: replace c′ by (c1)′ p. 216, l. −2: replace c′ by (c2)′ p. 216, l. −1: right-hand side should be λ(c1)′ + (1− λ)(c2)′ p. 220, l. −12: replace “added to the pivot row” by “added to the zeroth row”"
            },
            "slug": "Introduction-to-linear-optimization-Bertsimas-Tsitsiklis",
            "title": {
                "fragments": [],
                "text": "Introduction to linear optimization"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102835246"
                        ],
                        "name": "J. Hiriart-Urruty",
                        "slug": "J.-Hiriart-Urruty",
                        "structuredName": {
                            "firstName": "Jean-Baptiste",
                            "lastName": "Hiriart-Urruty",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hiriart-Urruty"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8773884"
                        ],
                        "name": "C. Lemaréchal",
                        "slug": "C.-Lemaréchal",
                        "structuredName": {
                            "firstName": "Claude",
                            "lastName": "Lemaréchal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Lemaréchal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118755909,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "065c019bb27e23ed10492ca61b186eb9375dd5de",
            "isKey": false,
            "numCitedBy": 2940,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "IX. Inner Construction of the Subdifferential.- X. Conjugacy in Convex Analysis.- XI. Approximate Subdifferentials of Convex Functions.- XII. Abstract Duality for Practitioners.- XIII. Methods of ?-Descent.- XIV. Dynamic Construction of Approximate Subdifferentials: Dual Form of Bundle Methods.- XV. Acceleration of the Cutting-Plane Algorithm: Primal Forms of Bundle Methods.- Bibliographical Comments.- References."
            },
            "slug": "Convex-analysis-and-minimization-algorithms-Hiriart-Urruty-Lemaréchal",
            "title": {
                "fragments": [],
                "text": "Convex analysis and minimization algorithms"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398249180"
                        ],
                        "name": "John Odentrantz",
                        "slug": "John-Odentrantz",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Odentrantz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John Odentrantz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 205458983,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "86639d68fccf9509d050ada1113adc5287507e8a",
            "isKey": false,
            "numCitedBy": 1567,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "Preface * 1 Probability Review * 2 Discrete Time Markov Models * 3 Recurrence and Ergodicity * 4 Long Run Behavior * 5 Lyapunov Functions and Martingales * 6 Eigenvalues and Nonhomogeneous Markov Chains * 7 Gibbs Fields and Monte Carlo Simulation * 8 Continuous-Time Markov Models 9 Poisson Calculus and Queues * Appendix * Bibliography * Author Index * Subject Index"
            },
            "slug": "Markov-Chains:-Gibbs-Fields,-Monte-Carlo-and-Queues-Odentrantz",
            "title": {
                "fragments": [],
                "text": "Markov Chains: Gibbs Fields, Monte Carlo Simulation, and Queues"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This book describes the development of Markov models for discrete-time Carlo simulation and some of the models used in this study had problems with regard to consistency and Ergodicity."
            },
            "venue": {
                "fragments": [],
                "text": "Technometrics"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1694621"
                        ],
                        "name": "Michael I. Jordan",
                        "slug": "Michael-I.-Jordan",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Jordan",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael I. Jordan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 138,
                                "start": 134
                            }
                        ],
                        "text": "In Section III, we introduce the basic form of the upper bounds on the log probability of the MAP assignment, and then develop necessary and sufficient conditions for these bounds to be tight."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6286159,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e16a25faf7428e1fc5ed0a10b8196c0499c7fd0d",
            "isKey": false,
            "numCitedBy": 3412,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "Statistical applications in fields such as bioinformatics, information retrieval, speech processing, image processing and communications often involve large-scale models in which thousands or millions of random variables are linked in complex ways. Graphical models provide a general methodology for approaching these problems, and indeed many of the models developed by researchers in these applied fields are instances of the general graphical model formalism. We review some of the basic ideas underlying graphical models, including the algorithmic ideas that allow graphical models to be deployed in large-scale data analysis problems. We also present examples of graphical models in bioinformatics, error-control coding and language processing."
            },
            "slug": "Graphical-Models-Jordan",
            "title": {
                "fragments": [],
                "text": "Graphical Models"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Some of the basic ideas underlying graphical models are reviewed, including the algorithmic ideas that allow graphical models to be deployed in large-scale data analysis problems and examples of graphical models in bioinformatics, error-control coding and language processing are presented."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689196"
                        ],
                        "name": "A. Schrijver",
                        "slug": "A.-Schrijver",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Schrijver",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Schrijver"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 6
                            }
                        ],
                        "text": ", 7], [38], and (approximate) dynamic programming methods using message-passing in the max-product algebra."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 6
                            }
                        ],
                        "text": ", 7], [38] of taking convex combinations of all possible solutions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 209100259,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "f9e591692d6aab0e1cf0c1ea4948597195657edf",
            "isKey": false,
            "numCitedBy": 3419,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Reading a book is also kind of better solution when you have no enough money or time to get your own adventure. This is one of the reasons we show the combinatorial optimization polyhedra and efficiency as your friend in spending the time. For more representative collections, this book not only offers it's strategically book resource. It can be a good friend, really good friend with much knowledge."
            },
            "slug": "Combinatorial-optimization.-Polyhedra-and-Schrijver",
            "title": {
                "fragments": [],
                "text": "Combinatorial optimization. Polyhedra and efficiency."
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This book shows the combinatorial optimization polyhedra and efficiency as your friend in spending the time in reading a book."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145980949"
                        ],
                        "name": "S. Verdú",
                        "slug": "S.-Verdú",
                        "structuredName": {
                            "firstName": "Sergio",
                            "lastName": "Verdú",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Verdú"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "e. I. INTRODUCTION Integer programming problems arise in various ﬁelds, including communication theory, error-correcting coding, image processing, statistical physics and machine learning [e.g., 35], [39], [8]. Many such problems can be formulated in terms of Markov random ﬁelds [e.g., 8], [14], in which the cost function corresponds to a graph-structured probability distribution, and the goal is to ﬁ"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 61280537,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "809cf1d0ad81408745ddd8655d8525280a42d5fe",
            "isKey": false,
            "numCitedBy": 4298,
            "numCiting": 95,
            "paperAbstract": {
                "fragments": [],
                "text": "From the Publisher: \nThe development of multiuser detection techniques is one of the most important recent advances in communications technology. This self-contained and comprehensive book sets out the basic details of multiuser detection, starting with simple examples and progressing to state-of-the-art applications. The only prerequisites assumed are undergraduate-level probability, linear algebra, and digital communications. The book contains over 240 exercises and will be a suitable textbook for electrical engineering students. It will also be an ideal self-study guide for practicing engineers, as well as a valuable reference volume for researchers in communications, information theory, and signal processing."
            },
            "slug": "Multiuser-Detection-Verdú",
            "title": {
                "fragments": [],
                "text": "Multiuser Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This self-contained and comprehensive book sets out the basic details of multiuser detection, starting with simple examples and progressing to state-of-the-art applications."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66269502"
                        ],
                        "name": "R. Baxter",
                        "slug": "R.-Baxter",
                        "structuredName": {
                            "firstName": "Rodney",
                            "lastName": "Baxter",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Baxter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 117867044,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "5e6a4eda0a3d0d3a8c2864fd3afee4e67026bd40",
            "isKey": false,
            "numCitedBy": 5490,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "exactly solved models in statistical mechanics exactly solved models in statistical mechanics rodney j baxter exactly solved models in statistical mechanics exactly solved models in statistical mechanics flae exactly solved models in statistical mechanics dover books exactly solved models in statistical mechanics dover books exactly solved models in statistical mechanics dover books hatsutori in size 15 gvg7bzbookyo.qhigh literature cited r. j. baxter, exactly solved models in exactly solvable models in statistical mechanics exactly solved models in statistical mechanics dover books okazaki in size 24 vk19j3book.buncivy exactly solved models of statistical mechanics valerio nishizawa in size 11 b4zntdbookntey fukuda in size 13 33oloxbooknhuy yamada in size 19 x6g84ybook.zolay in honour of r j baxter’s 75th birthday arxiv:1608.04899v2 statistical mechanics, threedimensionality and np beautiful models: 70 years of exactly solved quantum many exactly solved models in statistical mechanics (dover solved lattice models: 1944 2010 university of melbourne exactly solved models and beyond: a special issue in the statistical mechanics of the classical two-dimensional faculty of science, p. j. saf ́arik university in ko?sice? a one-dimensional statistical mechanics model with exact statistical mechanics department of physics and astronomy statistical mechanics principles and selected applications graph theory and statistical physics yaroslavvb chapter 4 methods of statistical mechanics ijs thermodynamics and an introduction to thermostatistics potts models and related problems in statistical mechanics methods of quantum field theory in statistical physics statistical mechanics: theory and molecular simulation exactly solvable su(n) mixed spin ladders springer statistical field theory : an introduction to exactly"
            },
            "slug": "Exactly-solved-models-in-statistical-mechanics-Baxter",
            "title": {
                "fragments": [],
                "text": "Exactly solved models in statistical mechanics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144018201"
                        ],
                        "name": "G. Forney",
                        "slug": "G.-Forney",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Forney",
                            "middleNames": [
                                "David"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Forney"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1889982"
                        ],
                        "name": "F. Kschischang",
                        "slug": "F.-Kschischang",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Kschischang",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Kschischang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37898699"
                        ],
                        "name": "B. Marcus",
                        "slug": "B.-Marcus",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Marcus",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Marcus"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145257061"
                        ],
                        "name": "S. Tuncel",
                        "slug": "S.-Tuncel",
                        "structuredName": {
                            "firstName": "Selim",
                            "lastName": "Tuncel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Tuncel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119639874,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e2dbaa4dfcffcb2671b946cf583766a02fa709a8",
            "isKey": false,
            "numCitedBy": 35,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "The sum-product and min-sum algorithms are used to decode codes defined by trellises. In this paper, we discuss the behavior of these and related algorithms on tail-biting (TB) trellises."
            },
            "slug": "Iterative-Decoding-of-Tail-Biting-Trellises-and-Forney-Kschischang",
            "title": {
                "fragments": [],
                "text": "Iterative Decoding of Tail-Biting Trellises and Connections with Symbolic Dynamics"
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "The sum-product and min-sum algorithms are used to decode codes defined by trellises and the behavior of these and related algorithms on tail-biting (TB) trellis is discussed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 70,
                                "start": 67
                            }
                        ],
                        "text": "Many such prob lems can be formulated in terms of graphical models [3], in which the cost function correspond s to a graph-structured probability distribution, and the goal is to find the maximum a posteriori (MAP) configuration."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 136,
                                "start": 133
                            }
                        ],
                        "text": "The foundation of our development is the factorization of an y tree-structured distribution p(x; (T )) in terms of its max-marginals [3]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 95
                            }
                        ],
                        "text": "Our choice of notation is motivated by the fact, which follow s from the junction tree theorem [3], thatTREE(T ) = MARG(T ) for any treeT ."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 18
                            }
                        ],
                        "text": "An important fact [3] is that any tree-structured distribution can be factorized in terms of its max-marginals as follows: p(x; (T )) / Y s2V Ts(xs) Y (s;t)2E(T ) Tst(xs; xt) Ts(xs)Tt(xt) (7)"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 24,
                                "start": 17
                            }
                        ],
                        "text": "It is sufficient [3, 10] to impose, for each edge (s; t), the local edgewise consistencyonditionmax x0t2Xt Tst(xs; x0t) = Ts(xs) (10)"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Spiege  lhalter"
            },
            "venue": {
                "fragments": [],
                "text": "Probablistic Networks and Expert Systems  . Statistics for Engineering and Information Science. Spri  nger-Verlag,"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 92
                            }
                        ],
                        "text": "On the other hand, if τ / ∈ LOCAL(G;T ), then by the (strong) separating hyperplane theorem [26], there must exist some vector γ and constant β such that (i) 〈γ, μ〉 ≤ β for all μ ∈ LOCAL(G;T ); and (ii) 〈γ, τ〉 > β."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 67,
                                "start": 63
                            }
                        ],
                        "text": "Remarks: (a) Lemma 1 identifies Φ∞(θ̄) as the support function [26] of the set MARG(G)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 90,
                                "start": 86
                            }
                        ],
                        "text": "The key property of Φ∞ is its convexity, which allows us to apply Jensen’s inequality [26]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 51,
                                "start": 47
                            }
                        ],
                        "text": "Hence, by a standard result in convex analysis [26], the conjugate dual is the indicator function of LOCAL(G;T ), as specified in equation (30)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Convex analysis and minimization algorithms, volume 1"
            },
            "venue": {
                "fragments": [],
                "text": "Springer-Verlag, New York,"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 16
                            }
                        ],
                        "text": "In related work [10], we have proved the existence of fixed poi nts for the ordinary max-product algorithm for positive compatibility functions on an arbit rary graph."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 110
                            }
                        ],
                        "text": "Despite these features, the messages can still be updated in a synchronous manner, as in ordinary m x-product [7, 10]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 57,
                                "start": 53
                            }
                        ],
                        "text": "It should be noted that as shown in our related work [10], the sta ndard max-product algorithm can also break down when the Uniqueness Condition is not satis fied."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 77,
                                "start": 70
                            }
                        ],
                        "text": "The message update equation (11), while similar to both the s tandard [7, 10] and attenuated [8] max-product updates, differs in some important way s."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 129,
                                "start": 125
                            }
                        ],
                        "text": "As noted earlier, it is also possible to perform reparameterization updates on trees, analogous to those described elsewhere [10] for standard max-product."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 24,
                                "start": 17
                            }
                        ],
                        "text": "It is sufficient [3, 10] to impose, for each edge (s, t), the local edgewise consistencyondition"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 102,
                                "start": 98
                            }
                        ],
                        "text": "One interpretation of the standard max-product algorithm f or trees, as shown in our related work [10], is as computing this alternative factorization o f the distribution."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Tree consisten cy and bounds on the max-product algorithm and its generalizations"
            },
            "venue": {
                "fragments": [],
                "text": "LIDS Tech. report,"
            },
            "year": 2002
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 18
                            }
                        ],
                        "text": "An important fact [3] is that any tree-structured distribution can be factorized in terms of its max-marginals as follows:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 94
                            }
                        ],
                        "text": "Our choice of notation is motivated by the fact, which follows from the junction tree theorem [3], that TREE(T ) = MARG(T ) for any tree T ."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 24,
                                "start": 17
                            }
                        ],
                        "text": "It is sufficient [3, 10] to impose, for each edge (s, t), the local edgewise consistency condition"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 66
                            }
                        ],
                        "text": "Many such problems can be formulated in terms of graphical models [3], in which the cost function corresponds to a graph-structured probability distribution, and the goal is to find the maximum a posteriori (MAP) configuration."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 136,
                                "start": 133
                            }
                        ],
                        "text": "The foundation of our development is the factorization of any tree-structured distribution p(x; θ(T )) in terms of its max-marginals [3]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Probablistic Networks and Expert Systems. Statistics for Engineering and Information"
            },
            "venue": {
                "fragments": [],
                "text": "Science. Springer-Verlag,"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 75,
                                "start": 71
                            }
                        ],
                        "text": "For the attractive case, the TRW algorithm is theoretically guaranteed [33] to always find an optimal MAP configuration."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 68,
                                "start": 64
                            }
                        ],
                        "text": ", binary linear coding problems [20]; binary quadratic programs [33])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 89,
                                "start": 85
                            }
                        ],
                        "text": "More specifically, in follow-up work to the current paper, Kolmogorov and Wainwright [33] have established theoretical guarantees on the performance of tree-reweighted message-passing for problems with binary variables and pairwise couplings."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 110
                            }
                        ],
                        "text": "However, for problems that involve only binary variables and pairwise interactions, Kolmogorov and Wainwright [33] have strengthened Theorem 2 to show that a message-passing fixed point always specifies an optimal dual solution."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 49,
                                "start": 45
                            }
                        ],
                        "text": "In follow-up work, Kolmogorov and Wainwright [33] provided stronger optimality properties of tree-reweighted message-passing when applied to problems with binary variables and pairwise interactions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 21
                            }
                        ],
                        "text": "An additional result [33] is that for any pairwise binary problem (regardless of nature of the pairwise couplings), any variable s that is uniquely specified by a TRW fixed point (i."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 45,
                                "start": 41
                            }
                        ],
                        "text": "In this case, the theoretical guarantees [33] described above allow us to conclude that the treereweighted method yields correct information about (at least part of the) optimum, without any need to compute the exact MAP optimum by brute force."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On optimality prope rti s of tree-reweighted message-passing"
            },
            "venue": {
                "fragments": [],
                "text": "U certainty in Artificial Intelligence, July"
            },
            "year": 2005
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 210,
                                "start": 206
                            }
                        ],
                        "text": "In this appendix, we briefly describe how any factor graph description of a distribution over a discrete (multinomial) random vector can be equivalently described in terms of a pairwise Markov random field [23], to which the pairwise LP relaxation based on LOCAL(G) specified by equations (9a), (9b) and (10) can be applied."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 209,
                                "start": 205
                            }
                        ],
                        "text": "In principle, there is no loss of generality in restricting to pairwise interactions, since any factor graph over discrete variables can be converted to this form by introducing auxiliary random variables [23]; see Appendix A for the details of this procedure."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 170,
                                "start": 166
                            }
                        ],
                        "text": "An interesting property of the iterativ e methods developed here is that when applied to a treestructured graph, they all reduce to the ordinary maxproduct algorithm [23], [43]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 108,
                                "start": 104
                            }
                        ],
                        "text": "First, it is worthwhile noting that the message update equation (50) is closely related to the standard [23], [43] max-product updates, which correspond to taking ρst = 1 for every edge."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 116,
                                "start": 112
                            }
                        ],
                        "text": "Despite these features, the messages can still be updated in an asynchronous manner, as in ordinary max-product [23], [43]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the optimality of solution  s of the max-product belief propagation algorithm in arbitrary  g aphs"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Info. Theory  , 47:736–744,"
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 29
                            }
                        ],
                        "text": "By the junction tree theorem [14], we have MARG(T ) = LOCAL(T ) in the tree case, so that equation (52) follows."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 161,
                                "start": 146
                            }
                        ],
                        "text": "We begin with some background on the notion of max-marginals, and their utility in computing exact MAP estimates of tree-structured distributions [2, 14, 15, 36]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 176,
                                "start": 168
                            }
                        ],
                        "text": "This factorization, which is entirely analogous to the more familiar one in terms of (sum)-marginals, is a special case of the more general junction tree decomposition [15, 14]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 17
                            }
                        ],
                        "text": "It is well-known [14] that any tree-structured distribution p(x; θ(T )) can be factorized in terms of its max-marginals as follows:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Probablistic Networks and Expert Systems"
            },
            "venue": {
                "fragments": [],
                "text": "Statistics for Engineering and Information Science. Springer-Verlag,"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 51,
                                "start": 33
                            }
                        ],
                        "text": "In a parallel collaboration with Feldman and Karger [19], [18], [20], we have studied the tree-relaxed linear program (LP) and\nrelated message-passing algorithms as decoding methods for turbo-like and low-density parity check (LDPC) codes, and provided finite-length performance guarantees for particular codes and channels."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 48
                            }
                        ],
                        "text": "Acknowledgments: We thank Jon Feldman and David Karger for helpful discussions."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 133,
                                "start": 129
                            }
                        ],
                        "text": "In other colloborative work, we have also applied these methods to decoding turbo-like and low density parity check (LDPC) codes [19], [18], [20], and provided finite-length performance guarantees for particular codes and channels."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 29,
                                "start": 23
                            }
                        ],
                        "text": "[18] J. Feldman, D. R. Karger, and M. J. Wainwright."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 51,
                                "start": 45
                            }
                        ],
                        "text": "[20] J. Feldman, M. J. Wainwright, and D. R. Karger."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 56,
                                "start": 52
                            }
                        ],
                        "text": "In a parallel collaboration with Feldman and Karger [19], [18], [20], we have studied the tree-relaxed linear program (LP) and related message-passing algorithms as decoding methods for turbo-like and low-density parity check (LDPC) codes, and provided finite-length performance guarantees for particular codes and channels."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 51,
                                "start": 45
                            }
                        ],
                        "text": "[19] J. Feldman, M. J. Wainwright, and D. R. Karger."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Linear programming-based decoding of turbo-like codes and its rel  ation to iterative approaches"
            },
            "venue": {
                "fragments": [],
                "text": " Proc. Allerton Conf. Comm., Control and Computing  , October"
            },
            "year": 2002
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 21
                            }
                        ],
                        "text": "In independent work, Koetter and Vontobel [30] used the notion of a graph cover to establish connections between the ordinary max-product algorithm for LDPC codes, and a particular polytope equivalent to the one defining our LP relaxation."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 27,
                                "start": 20
                            }
                        ],
                        "text": "[25] B. J. Frey, R. Koetter, and A. Vardy."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 122
                            }
                        ],
                        "text": "The tree-reweighted updates are related but distinct from the attenuated max-product updates proposed by Frey and Koetter [23]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 15,
                                "start": 8
                            }
                        ],
                        "text": "[30] R. Koetter and P. O. Vontobel."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 23
                            }
                        ],
                        "text": "[24] B. J. Frey and R. Koetter."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 26
                            }
                        ],
                        "text": "[22] G.D. Forney, Jr., R. Koetter, F. R. Kschischang, and A. Reznick."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 159,
                                "start": 155
                            }
                        ],
                        "text": "A feature common to both algorithms is the re-weighting of messages; however, unlike the tree-reweighted update (48), the attenuated max-product update in [23] of the message from t to s does not involve the message in the reverse direction (i."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 133
                            }
                        ],
                        "text": "Moreover, we note that these the tree-reweighted updates are related but distinct from the attenuated maxproduct updates proposed by Frey and Koetter [24]."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Exact inference using the attenuated max-product algorithm"
            },
            "venue": {
                "fragments": [],
                "text": "Advanced mean field methods: Theory and Practice. MIT Press,"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 21
                            }
                        ],
                        "text": "In independent work, Koetter and Vontobel [30] used the notion of a graph cover to establish connections between the ordinary max-product algorithm for LDPC codes, and a particular polytope equivalent to the one defining our LP relaxation."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 27,
                                "start": 20
                            }
                        ],
                        "text": "[25] B. J. Frey, R. Koetter, and A. Vardy."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 15,
                                "start": 8
                            }
                        ],
                        "text": "[30] R. Koetter and P. O. Vontobel."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 159,
                                "start": 155
                            }
                        ],
                        "text": "A feature common to both algorithms is the re-weighting of messages; however, unlike the tree-reweighted update (50), the attenuated max-product update in [24] of the message fromt to s does not involve the message in the reverse direction (i."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 23
                            }
                        ],
                        "text": "[24] B. J. Frey and R. Koetter."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 26
                            }
                        ],
                        "text": "[22] G.D. Forney, Jr., R. Koetter, F. R. Kschischang, and A. Reznick."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 154,
                                "start": 150
                            }
                        ],
                        "text": "Moreover, we note that these the tree-reweighted updates are related but distinct from the attenuated maxproduct updates proposed by Frey and Koetter [24]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Exact inference using the atte nuated max-product algorithm"
            },
            "venue": {
                "fragments": [],
                "text": "InAdvanced mean field methods: Theory and Practice. MIT Press,"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 21
                            }
                        ],
                        "text": "In independent work, Koetter and Vontobel [30] used the notion of a graph cover to establish connections between the ordinary max-product algorithm for LDPC codes, and a particular polytope equivalent to the one defining our LP relaxation."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 27,
                                "start": 20
                            }
                        ],
                        "text": "[25] B. J. Frey, R. Koetter, and A. Vardy."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 81,
                                "start": 78
                            }
                        ],
                        "text": ", 7, 10] and the attenuated max-prod uct updates proposed by Frey and Koetter [8], differs in certain key ways."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 15,
                                "start": 8
                            }
                        ],
                        "text": "[30] R. Koetter and P. O. Vontobel."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 23
                            }
                        ],
                        "text": "[24] B. J. Frey and R. Koetter."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 26
                            }
                        ],
                        "text": "[22] G.D. Forney, Jr., R. Koetter, F. R. Kschischang, and A. Reznick."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 93
                            }
                        ],
                        "text": "The message update equation (11), while similar to both the s tandard [7, 10] and attenuated [8] max-product updates, differs in some important way s."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 133
                            }
                        ],
                        "text": "Moreover, we note that these the tree-reweighted updates are related but distinct from the attenuated maxproduct updates proposed by Frey and Koetter [24]."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Exact inference using the atten  uated max-product algorithm. In  Advanced mean field methods: Theory and Practice"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 21
                            }
                        ],
                        "text": "In independent work, Koetter and Vontobel [30] used the notion of a graph cover to establish connections between the ordinary max-product algorithm for LDPC codes, and a particular polytope equivalent to the one defining our LP relaxation."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 27,
                                "start": 20
                            }
                        ],
                        "text": "[25] B. J. Frey, R. Koetter, and A. Vardy."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 15,
                                "start": 8
                            }
                        ],
                        "text": "[30] R. Koetter and P. O. Vontobel."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 76
                            }
                        ],
                        "text": ", 7, 10] and the attenuated maxproduct updates proposed by Frey and Koetter [8], differs in certain key ways."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 23
                            }
                        ],
                        "text": "[24] B. J. Frey and R. Koetter."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 26
                            }
                        ],
                        "text": "[22] G.D. Forney, Jr., R. Koetter, F. R. Kschischang, and A. Reznick."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 93
                            }
                        ],
                        "text": "The message update equation (11), while similar to both the s tandard [7, 10] and attenuated [8] max-product updates, differs in some important way s."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 133
                            }
                        ],
                        "text": "Moreover, we note that these the tree-reweighted updates are related but distinct from the attenuated maxproduct updates proposed by Frey and Koetter [24]."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Exact inference using the attenuated maxproduct algorithm. InAdvanced mean field methods: Theory and Practice"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[47], who showed that the sumproduct algorithm has a variational interpretation involv ing the so-called Bethe free energy."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[47], underlies the sum-product algorithm."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 142,
                                "start": 138
                            }
                        ],
                        "text": "Interestingly, thi s constraint set is equivalent to the constraint set in the Bethe variational formulation of the sum-product algorithm [47]; in fact, the LP relaxation itself can be obtained by taking a suitable limit of the “convexified” Bethe variational problem analyzed in our previous work [41], [44]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Understandin g belief propagation and its generalizations"
            },
            "venue": {
                "fragments": [],
                "text": "Technical Report TR2  001- 22, Mitsubishi Electric Research Labs, January"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398951619"
                        ],
                        "name": "O. Barndorff-Nielsen",
                        "slug": "O.-Barndorff-Nielsen",
                        "structuredName": {
                            "firstName": "Ole",
                            "lastName": "Barndorff-Nielsen",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Barndorff-Nielsen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "More precisely, atree is a cycle-free subgraphT = (V (T ), E(T )); it is spanningif it reaches every vertex (i.e., V (T ) = V )."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 116833160,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a51f480b9e3190c0e849a91d14a4527c72ecdc1b",
            "isKey": false,
            "numCitedBy": 313,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Information-And-Exponential-Families-Barndorff-Nielsen",
            "title": {
                "fragments": [],
                "text": "Information And Exponential Families"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49026551"
                        ],
                        "name": "D. Greig",
                        "slug": "D.-Greig",
                        "structuredName": {
                            "firstName": "Darryl",
                            "lastName": "Greig",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Greig"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "146294528"
                        ],
                        "name": "B. Porteous",
                        "slug": "B.-Porteous",
                        "structuredName": {
                            "firstName": "Baroness",
                            "lastName": "Porteous",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Porteous"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1887111"
                        ],
                        "name": "A. Seheult",
                        "slug": "A.-Seheult",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Seheult",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Seheult"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "d pairwise couplings. First, it can be shown that TRW message-passing always succeeds for any submodular binary problem, of which the example given in Figure 5 is a special case. Although it is known [26] that such problems can be solved in polynomial time via reduction to a max-ﬂow problem, it is nonetheless interesting that tree19 reweighted message-passing is also successful for this class of probl"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 115691220,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a717b20e99b76cb228b47694140ed3dce082b530",
            "isKey": false,
            "numCitedBy": 1257,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Exact-Maximum-A-Posteriori-Estimation-for-Binary-Greig-Porteous",
            "title": {
                "fragments": [],
                "text": "Exact Maximum A Posteriori Estimation for Binary Images"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3267844"
                        ],
                        "name": "K. Schittkowski",
                        "slug": "K.-Schittkowski",
                        "structuredName": {
                            "firstName": "Klaus",
                            "lastName": "Schittkowski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Schittkowski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2907488"
                        ],
                        "name": "Christian Zillober",
                        "slug": "Christian-Zillober",
                        "structuredName": {
                            "firstName": "Christian",
                            "lastName": "Zillober",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christian Zillober"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 110,
                                "start": 107
                            }
                        ],
                        "text": "For cycle-free graphs (also known as trees), the MAP problem can be solved by a form of non-serial dynamic programming known as the max-product or min-sum algorithm [e.g., 2], [14], [15]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 44060508,
            "fieldsOfStudy": [],
            "id": "d4143c46910f249bedbdc37caf88e4c292124c08",
            "isKey": false,
            "numCitedBy": 6359,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "NONLINEAR-PROGRAMMING-Schittkowski-Zillober",
            "title": {
                "fragments": [],
                "text": "NONLINEAR PROGRAMMING"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66418228"
                        ],
                        "name": "丸山 徹",
                        "slug": "丸山-徹",
                        "structuredName": {
                            "firstName": "丸山",
                            "lastName": "徹",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "丸山 徹"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 12
                            }
                        ],
                        "text": "Associated withφ is a real-valued vector θ = { θα | α ∈ I }, known as the exponential parameter vector."
                    },
                    "intents": []
                }
            ],
            "corpusId": 117573922,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "b272701e77ddb860741a193ac1701ca382853680",
            "isKey": false,
            "numCitedBy": 7930,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Convex-Analysisの二,三の進展について-丸山",
            "title": {
                "fragments": [],
                "text": "Convex Analysisの二,三の進展について"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Signal-space chara  cterization of iterative decoding"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Info. Theory  , 47:766–781,"
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Iterative decoding of tailbiting trellises and connections with symbolic dynamics. In Codes, systems and graphical models, pages 239–264"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 182,
                                "start": 175
                            }
                        ],
                        "text": "A potentially valuable link is that between the tree relaxation described here and a recently proposed flow-based LP relaxation for turbo decoding, as discussed in other work [5 , 6]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Decoding turbo-like codes in polynomial time w  ith provably good error-correcting performing via linear programming"
            },
            "venue": {
                "fragments": [],
                "text": "In  Symp. Found. Comp. Science"
            },
            "year": 2002
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 26
                            }
                        ],
                        "text": "[46] W. Wiegerinck and T. Heskes."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 49
                            }
                        ],
                        "text": "In other independent work, Wiegerinck and Heskes [46] have proposed a “fractional” form of the sum-product algorithm that is closely related to the tree-reweighted sum-product algorithm considered in our previous work [44]; see also Minka [36] for a reweighted version of the expectation propagation algorithm."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Fractional belief propaga  tion"
            },
            "venue": {
                "fragments": [],
                "text": "NIPS, volume 12, pages 438–445,"
            },
            "year": 2002
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Geometry of cuts and metric embeddings"
            },
            "venue": {
                "fragments": [],
                "text": "Geometry of cuts and metric embeddings"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 182,
                                "start": 176
                            }
                        ],
                        "text": "A potentially valuable link is that between the tree relaxation described here and a recently pr oposed flow-based LP relaxation for turbo decoding, as discussed in other work [5, 6]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Decoding turbo-like codes in po  lyn mial time with provably good error-correcting performing via linear programming"
            },
            "venue": {
                "fragments": [],
                "text": "In  Symp. Found. Comp. Science"
            },
            "year": 2002
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Karger . Using linear programming to decode binary linear codes"
            },
            "venue": {
                "fragments": [],
                "text": "Proc . Allerton Conf . Communication , Control and Computing , October"
            },
            "year": 2002
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 150,
                                "start": 147
                            }
                        ],
                        "text": "We begin with some background on the notion of max-marginals , and their utility in computing exact MAP estimates of tree-structured distributions [2], [14], [15 ], [43]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The generalized distributiv  e law"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Info. Theory  , 46:325–343, March"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Decoding turbo-like codes in polynomial time with provably good error-correcting performing via linear programming"
            },
            "venue": {
                "fragments": [],
                "text": "Symp. Found. Comp. Science (FOCS)"
            },
            "year": 2002
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 131,
                                "start": 128
                            }
                        ],
                        "text": "It can be shown [9] that the vectorμe of these edge appearance probabilities must belong to the so -calledspanning tree polytope[2]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 129,
                                "start": 126
                            }
                        ],
                        "text": "The optimum of a linear program, such as that of equation (14) , is always attained at an extreme point of the constraint set [2]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Tsitsikilis.  Introduction to linear optimization"
            },
            "venue": {
                "fragments": [],
                "text": "Athena Scientific,"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Iterative decoding of tail-biting trellises and connectio ns with symbolic dynamics. InCodes, systems and graphical models"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 75,
                                "start": 71
                            }
                        ],
                        "text": "In particular, we prove that this dual is another LP, one which has a natural interpretation as a relaxation of the LP for exact\n2 MAP estimation."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On optimality properties of tree-reweighted message-passing"
            },
            "venue": {
                "fragments": [],
                "text": "In Uncertainty in Artificial Intelligence"
            },
            "year": 2005
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Exact inference using the attenuated max-product algorithm. In Advanced mean field methods: Theory and Practice"
            },
            "venue": {
                "fragments": [],
                "text": "Exact inference using the attenuated max-product algorithm. In Advanced mean field methods: Theory and Practice"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Tree consistency and bounds on the max-product algorithm and its generalizations"
            },
            "venue": {
                "fragments": [],
                "text": "LIDS Tech. report, MIT"
            },
            "year": 2002
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Exact inference using the attenuated max - product algorithm"
            },
            "venue": {
                "fragments": [],
                "text": "Ad - vanced mean field methods : Theory and Practice"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 198,
                                "start": 195
                            }
                        ],
                        "text": "For the LP of equation (12), this constraint set is the marginal polyto peMARG(G), which for a general graph with cycles, is defined by a number of inequalities that is exponential in graph size [4]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Laurent.Geometry of cuts and metric embeddings"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 132,
                                "start": 128
                            }
                        ],
                        "text": "In Section III, we introduce the basic form of the upper bounds on the log probability of the MAP assignment, and then develop necessary and sufficient conditions for these bounds to be tight."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Probabilistic Networks and Expert Systems. Statistics for Engineering and Information Science"
            },
            "venue": {
                "fragments": [],
                "text": "Probabilistic Networks and Expert Systems. Statistics for Engineering and Information Science"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Probablistic Networks and Expert Systems. Statistics for Engineering and Information Science"
            },
            "venue": {
                "fragments": [],
                "text": "Probablistic Networks and Expert Systems. Statistics for Engineering and Information Science"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 32
                            }
                        ],
                        "text": ", binary linear coding problems [20]; binary quadratic programs [33])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 68,
                                "start": 64
                            }
                        ],
                        "text": "In a parallel collaboration with Feldman and Karger [19], [18], [20], we have studied the tree-relaxed linear program (LP) and related message-passing algorithms as decoding methods for turbo-like and low-density parity check (LDPC) codes, and provided finite-length performance guarantees for particular codes and channels."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 145,
                                "start": 141
                            }
                        ],
                        "text": "In other colloborative work, we have also applied these methods to decoding turbo-like and low density parity check (LDPC) codes [19], [18], [20], and provided finite-length performance guarantees for particular codes and channels."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Using lin  ear programming to decode binary linear codes"
            },
            "venue": {
                "fragments": [],
                "text": " IEEE Transactions on Information Theory  , 51:954–972, March"
            },
            "year": 2005
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Tree consistency and bounds on the max-product algorithm and its generalizations. Appeared as LIDS Tech. report, P-2554 MIT"
            },
            "venue": {
                "fragments": [],
                "text": "Tree consistency and bounds on the max-product algorithm and its generalizations. Appeared as LIDS Tech. report, P-2554 MIT"
            },
            "year": 2002
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the effective weights of pseudocodewords for codes define d on graphs with cycles. InCodes, systems and graphical models"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Treeconsistency and bounds on the maxproduct algorithm and its generalizations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2002
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 32,
            "methodology": 24,
            "result": 2
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 77,
        "totalPages": 8
    },
    "page_url": "https://www.semanticscholar.org/paper/MAP-estimation-via-agreement-on-(hyper)trees:-and-Wainwright-Jaakkola/fcb336a46bb846f0c145085bdc3e44b995937fdb?sort=total-citations"
}