{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16808249"
                        ],
                        "name": "J. S. Koford",
                        "slug": "J.-S.-Koford",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Koford",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. S. Koford"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34938846"
                        ],
                        "name": "G. Groner",
                        "slug": "G.-Groner",
                        "structuredName": {
                            "firstName": "Gabriel",
                            "lastName": "Groner",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Groner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34553442,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "e77c386ad1dc1bdc3e17345f6fbd6dcd93736229",
            "isKey": false,
            "numCitedBy": 116,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper develops a relationship between two traditional statistical methods of pattern classifier design, and an adaption technique involving minimization of the mean-square error in the output of a linear threshold device. It is shown that the two-category classifier derived by least-mean-square-error adaption using an equal number of sample patterns from each category is equivalent to the optimal statistical classifier if the patterns are multivariate Gaussian random variables having the same covariance matrix for both pattern categories. It is also shown that the classifier is always equivalent to the classifier derived by R. A. Fisher. A simple modification of the least-mean-square-error adaption procedure enables the adaptive structure to converge to a nearly-optimal classifier, even though the numbers of sample patterns are not equal for the two categories. The use of minimization of mean-square error as a technique for designing classifiers has the added advantage that it leads to the optimal classifier for patterns even when the covariance matrix is singular."
            },
            "slug": "The-use-of-an-adaptive-threshold-element-to-design-Koford-Groner",
            "title": {
                "fragments": [],
                "text": "The use of an adaptive threshold element to design a linear optimal pattern classifier"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It is shown that the two-category classifier derived by least-mean-square-error adaption using an equal number of sample patterns from each category is equivalent to the optimal statistical classifier if the patterns are multivariate Gaussian random variables having the same covariance matrix for both pattern categories."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35106875"
                        ],
                        "name": "R. Duda",
                        "slug": "R.-Duda",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Duda",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Duda"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "150122018"
                        ],
                        "name": "H. Fossum",
                        "slug": "H.-Fossum",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Fossum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Fossum"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9623590,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "aa9f847b10c5a1fb5b85c0096e2d765927ef72c1",
            "isKey": false,
            "numCitedBy": 156,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes iterative procedures for determining linear and piecewise linear discriminant functions for multicategory pattern classifiers. While classifiers with the same structure have often been proposed, it is less well known that their parameters can be efficiently determined by simple adjustment procedures. For linear discriminant functions, convergence proofs are given for procedures that are guaranteed to yield error-free solutions on design samples, provided only that such solutions exist. While no similar results are known for piecewise linear discriminant functions, simple procedures are given that have been effective in various experiments. The results of experiments with artificially generated multimodal data and with hand-printed alphanumeric characters are given to show that this approach compares favorably with other classification methods."
            },
            "slug": "Pattern-Classification-by-Iteratively-Determined-Duda-Fossum",
            "title": {
                "fragments": [],
                "text": "Pattern Classification by Iteratively Determined Linear and Piecewise Linear Discriminant Functions"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "This paper describes iterative procedures for determining linear and piecewise linear discriminant functions for multicategory pattern classifiers and shows that this approach compares favorably with other classification methods."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Electron. Comput."
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2793874"
                        ],
                        "name": "W. Highleyman",
                        "slug": "W.-Highleyman",
                        "structuredName": {
                            "firstName": "Wilbur",
                            "lastName": "Highleyman",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Highleyman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 51642793,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "474166c1754092367f0cb09e31bf12de929b2f19",
            "isKey": false,
            "numCitedBy": 159,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Many pattern recognition machines may be considered to consist of two principal parts, a receptor and a categorizer. The receptor makes certain measurements on the unknown pattern to be recognized; the categorizer determines from these measurements the particular allowable pattern class to which the unknown pattern belongs. This paper is concerned with the study of a particular class of categorizers, the linear decision function. The optimum linear decision function is the best linear approximation to the optimum decision function in the following sense: 1) \"Optimum\" is taken to mean minimum loss (which includes minimum error systems). 2) \"Linear\" is taken to mean that each pair of pattern classes is separated by one and only one hyperplane in the measurement space. This class of categorizers is of practical interest for two reasons: 1) It can be empirically designed without making any assumptions whatsoever about either the distribution of the receptor measurements or the a priori probabilities of occurrence of the pattern classes, providing an appropriate pattern source is available. 2) Its implementation is quite simple and inexpensive. Various properties of linear decision functions are discussed. One such property is that a linear decision function is guaranteed to perform at least as well as a minimum distance categorizer. Procedures are then developed for the estimation (or design) of the optimum linear decision function based upon an appropriate sampling from the pattern classes to be categorized."
            },
            "slug": "Linear-Decision-Functions,-with-Application-to-Highleyman",
            "title": {
                "fragments": [],
                "text": "Linear Decision Functions, with Application to Pattern Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This paper is concerned with the study of a particular class of categorizers, the linear decision function, which can be empirically designed without making any assumptions whatsoever about either the distribution of the receptor measurements or the a priori probabilities of occurrence of the pattern classes, providing an appropriate pattern source is available."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IRE"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1752732"
                        ],
                        "name": "T. Cover",
                        "slug": "T.-Cover",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Cover",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Cover"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18251470,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "445ad69010658097fc317f7b83f1198179eebae8",
            "isKey": false,
            "numCitedBy": 1840,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper develops the separating capacities of families of nonlinear decision surfaces by a direct application of a theorem in classical combinatorial geometry. It is shown that a family of surfaces having d degrees of freedom has a natural separating capacity of 2d pattern vectors, thus extending and unifying results of Winder and others on the pattern-separating capacity of hyperplanes. Applying these ideas to the vertices of a binary n-cube yields bounds on the number of spherically, quadratically, and, in general, nonlinearly separable Boolean functions of n variables. It is shown that the set of all surfaces which separate a dichotomy of an infinite, random, separable set of pattern vectors can be characterized, on the average, by a subset of only 2d extreme pattern vectors. In addition, the problem of generalizing the classifications on a labeled set of pattern points to the classification of a new point is defined, and it is found that the probability of ambiguous generalization is large unless the number of training patterns exceeds the capacity of the set of separating surfaces."
            },
            "slug": "Geometrical-and-Statistical-Properties-of-Systems-Cover",
            "title": {
                "fragments": [],
                "text": "Geometrical and Statistical Properties of Systems of Linear Inequalities with Applications in Pattern Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is shown that a family of surfaces having d degrees of freedom has a natural separating capacity of 2d pattern vectors, thus extending and unifying results of Winder and others on the pattern-separating capacity of hyperplanes."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Electron. Comput."
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145258083"
                        ],
                        "name": "A. Albert",
                        "slug": "A.-Albert",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Albert",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Albert"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 122518468,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4728ba63967c512d01395f77b336d441ccb279b0",
            "isKey": false,
            "numCitedBy": 20,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Mathematical-Theory-of-Pattern-Recognition-Albert",
            "title": {
                "fragments": [],
                "text": "A Mathematical Theory of Pattern Recognition"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 5,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/A-Theory-of-Adaptive-Pattern-Classifiers-Amari/1339348aeef592802288d9d929a085cb3ae61c4b?sort=total-citations"
}