{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745131"
                        ],
                        "name": "S. Seneff",
                        "slug": "S.-Seneff",
                        "structuredName": {
                            "firstName": "Stephanie",
                            "lastName": "Seneff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Seneff"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6668801,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ac8f1fd58be8a8c9f9599fc4da981ea3040945f6",
            "isKey": false,
            "numCitedBy": 410,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "A new natural language system, TINA, has been developed for applications involving spoken language tasks. TINA integrates key ideas from context free grammars, Augmented Transition Networks (ATN's), and the unification concept. TINA provides a seamless interface between syntactic and semantic analysis, and also produces a highly constraining probabilistic language model to improve recognition performance. An initial set of context-free rewrite rules provided by hand is first converted to a network structure. Probability assignments on all arcs in the network are obtained automatically from a set of example sentences. The parser uses a stack decoding search strategy, with a top-down control flow, and includes a feature-passing mechanism to deal with long-distance movement, agreement, and semantic constraints. TINA provides an automatic sentence generation capability that has been effective for identifying overgeneralization problems as well as in producing a word-pair language model for a recognizer. The parser is currently integrated with MIT's SUMMIT recognizer for use in two application domains, with the parser screening recognizer outputs either at the sentential level or to filter partial theories during the active search process."
            },
            "slug": "TINA:-A-Natural-Language-System-for-Spoken-Language-Seneff",
            "title": {
                "fragments": [],
                "text": "TINA: A Natural Language System for Spoken Language Applications"
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "A new natural language system, TINA, has been developed for applications involving spoken language tasks that provides an automatic sentence generation capability that has been effective for identifying overgeneralization problems as well as in producing a word-pair language model for a recognizer."
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Linguistics"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110271578"
                        ],
                        "name": "Scott Miller",
                        "slug": "Scott-Miller",
                        "structuredName": {
                            "firstName": "Scott",
                            "lastName": "Miller",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Scott Miller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2189985"
                        ],
                        "name": "R. Bobrow",
                        "slug": "R.-Bobrow",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Bobrow",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bobrow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2319612"
                        ],
                        "name": "R. Ingria",
                        "slug": "R.-Ingria",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Ingria",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Ingria"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35442155"
                        ],
                        "name": "R. Schwartz",
                        "slug": "R.-Schwartz",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Schwartz",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Schwartz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18903447,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "70d2b25dfe4fbadfa3c816e01666f811dae9a4d1",
            "isKey": false,
            "numCitedBy": 123,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe and evaluate hidden understanding models, a statistical learning approach to natural language understanding. Given a string of words, hidden understanding models determine the most likely meaning for the string. We discuss 1) the problem of representing meaning in this framework, 2) the structure of the statistical model, 3) the process of training the model, and 4) the process of understanding using the model. Finally, we give experimental results, including results on an ARPA evaluation."
            },
            "slug": "Hidden-Understanding-Models-of-Natural-Language-Miller-Bobrow",
            "title": {
                "fragments": [],
                "text": "Hidden Understanding Models of Natural Language"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "This work describes and evaluates hidden understanding models, a statistical learning approach to natural language understanding that determines the most likely meaning for the string of words."
            },
            "venue": {
                "fragments": [],
                "text": "ACL"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2244184"
                        ],
                        "name": "Kenneth Ward Church",
                        "slug": "Kenneth-Ward-Church",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Church",
                            "middleNames": [
                                "Ward"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kenneth Ward Church"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3166885,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a7e084fe51a40eeaaf79bf0b78e837d5bc4a8e10",
            "isKey": false,
            "numCitedBy": 1058,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "A program that tags each word in an input sentence with the most likely part of speech has been written. The program uses a linear-time dynamic programming algorithm to find an assignment of parts of speech to words that optimizes the product of (a) lexical probabilities (probability of observing part of speech i given word i) and (b) contextual probabilities (probability of observing part of speech i given n following parts of speech). Program performance is encouraging; a 400-word sample is presented and is judged to be 99.5% correct.<<ETX>>"
            },
            "slug": "A-Stochastic-Parts-Program-and-Noun-Phrase-Parser-Church",
            "title": {
                "fragments": [],
                "text": "A Stochastic Parts Program and Noun Phrase Parser for Unrestricted Text"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "A program that tags each word in an input sentence with the most likely part of speech has been written and performance is encouraging; a 400-word sample is presented and is judged to be 99.5% correct."
            },
            "venue": {
                "fragments": [],
                "text": "ANLP"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145505730"
                        ],
                        "name": "M. Bates",
                        "slug": "M.-Bates",
                        "structuredName": {
                            "firstName": "Madeleine",
                            "lastName": "Bates",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Bates"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2248665"
                        ],
                        "name": "S. Boisen",
                        "slug": "S.-Boisen",
                        "structuredName": {
                            "firstName": "Sean",
                            "lastName": "Boisen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Boisen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "10080270"
                        ],
                        "name": "J. Makhoul",
                        "slug": "J.-Makhoul",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Makhoul",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Makhoul"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12006131,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "55a1bf99b29436197fd4d872a78155a196a77a88",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "There has been a long-standing methodology for evaluating work in speech recognition (SR), but until recently no community-wide methodology existed for either natural language (NL) researchers or speech understanding (SU) researchers for evaluating the systems they developed.Recently considerable progress has been made by a number of groups involved in the DARPA Spoken Language Systems (SLS) program to agree on a methodology for comparative evaluation of SLS systems, and that methodology is being used in practice for the first time.This paper gives an overview of the process that was followed in creating a meaningful evaluation mechanism, describes the current mechanism, and presents some directions for future development."
            },
            "slug": "Developing-an-Evaluation-Methodology-for-Spoken-Bates-Boisen",
            "title": {
                "fragments": [],
                "text": "Developing an Evaluation Methodology for Spoken Language Systems"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "An overview of the process that was followed in creating a meaningful evaluation mechanism is given, the current mechanism is described, and some directions for future development are presented."
            },
            "venue": {
                "fragments": [],
                "text": "HLT"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2580777"
                        ],
                        "name": "David M. Magerman",
                        "slug": "David-M.-Magerman",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Magerman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David M. Magerman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 608,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f0a14be7e7f5614b91d0f648ae5f2baafc6d7036",
            "isKey": false,
            "numCitedBy": 717,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Syntactic natural language parsers have shown themselves to be inadequate for processing highly-ambiguous large-vocabulary text, as is evidenced by their poor performance on domains like the Wall Street Journal, and by the movement away from parsing-based approaches to text-processing in general. In this paper, I describe SPATTER, a statistical parser based on decision-tree learning techniques which constructs a complete parse for every sentence and achieves accuracy rates far better than any published result. This work is based on the following premises: (1) grammars are too complex and detailed to develop manually for most interesting domains; (2) parsing models must rely heavily on lexical and contextual information to analyze sentences accurately; and (3) existing n-gram modeling techniques are inadequate for parsing models. In experiments comparing SPATTER with IBM's computer manuals parser, SPATTER significantly outperforms the grammar-based parser. Evaluating SPATTER against the Penn Treebank Wall Street Journal corpus using the PARSEVAL measures, SPATTER achieves 86% precision, 86% recall, and 1.3 crossing brackets per sentence for sentences of 40 words or less, and 91% precision, 90% recall, and 0.5 crossing brackets for sentences between 10 and 20 words in length."
            },
            "slug": "Statistical-Decision-Tree-Models-for-Parsing-Magerman",
            "title": {
                "fragments": [],
                "text": "Statistical Decision-Tree Models for Parsing"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "SPATTER is described, a statistical parser based on decision-tree learning techniques which constructs a complete parse for every sentence and achieves accuracy rates far better than any published result."
            },
            "venue": {
                "fragments": [],
                "text": "ACL"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48258694"
                        ],
                        "name": "P. Price",
                        "slug": "P.-Price",
                        "structuredName": {
                            "firstName": "Patti",
                            "lastName": "Price",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Price"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3047811,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8df509919b31397e225280962c59384fbe83144e",
            "isKey": false,
            "numCitedBy": 426,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Progress can be measured and encouraged via standards for comparison and evaluation. Though qualitative assessments can be useful in initial stages, quantifiable measures of systems under the same conditions are essential for comparing results and assessing claims. This paper will address the emerging standards for evaluation of spoken language systems."
            },
            "slug": "Evaluation-of-Spoken-Language-Systems:-the-ATIS-Price",
            "title": {
                "fragments": [],
                "text": "Evaluation of Spoken Language Systems: the ATIS Domain"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "This paper will address the emerging standards for evaluation of spoken language systems with quantifiable measures essential for comparing results and assessing claims."
            },
            "venue": {
                "fragments": [],
                "text": "HLT"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2214048"
                        ],
                        "name": "Damaris M. Ayuso",
                        "slug": "Damaris-M.-Ayuso",
                        "structuredName": {
                            "firstName": "Damaris",
                            "lastName": "Ayuso",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Damaris M. Ayuso"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2248665"
                        ],
                        "name": "S. Boisen",
                        "slug": "S.-Boisen",
                        "structuredName": {
                            "firstName": "Sean",
                            "lastName": "Boisen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Boisen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "20866393"
                        ],
                        "name": "Heidi Fox",
                        "slug": "Heidi-Fox",
                        "structuredName": {
                            "firstName": "Heidi",
                            "lastName": "Fox",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Heidi Fox"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1793645"
                        ],
                        "name": "H. Gish",
                        "slug": "H.-Gish",
                        "structuredName": {
                            "firstName": "Herbert",
                            "lastName": "Gish",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Gish"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2319612"
                        ],
                        "name": "R. Ingria",
                        "slug": "R.-Ingria",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Ingria",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Ingria"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1732071"
                        ],
                        "name": "R. Weischedel",
                        "slug": "R.-Weischedel",
                        "structuredName": {
                            "firstName": "Ralph",
                            "lastName": "Weischedel",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Weischedel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This adaptation, related to that of ( Stolcke 1995 ), involves reformulating the Earley algorithm to work with probabilistic recursive transition networks rather than with deterministic production rules."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 53771606,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f82c3dd34684a54a6df2f57d6dcf07460897acb1",
            "isKey": false,
            "numCitedBy": 75,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Traditional approaches to the problem of extracting data from texts have emphasized hand-crafted linguistic knowledge. In contrast, BBN's PLUM system (Probabilistic Language Understanding Model) was developed as part of a DARPA-funded research effort on integrating probabilistic language models with more traditional linguistic techniques. Our research and development goals are• more rapid development of new applications,• the ability to train (and re-train) systems based on user markings of correct and incorrect output,• more accurate selection among interpretations when more than one is found, and• more robust partial interpretation when no complete interpretation can be found."
            },
            "slug": "BBN:-description-of-the-PLUM-system-as-used-for-Ayuso-Boisen",
            "title": {
                "fragments": [],
                "text": "BBN: description of the PLUM system as used for MUC-4"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "BBN's PLUM system (Probabilistic Language Understanding Model) was developed as part of a DARPA-funded research effort on integrating probabilistic language models with more traditional linguistic techniques."
            },
            "venue": {
                "fragments": [],
                "text": "MUC"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1788050"
                        ],
                        "name": "R. Grishman",
                        "slug": "R.-Grishman",
                        "structuredName": {
                            "firstName": "Ralph",
                            "lastName": "Grishman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Grishman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144360624"
                        ],
                        "name": "J. Sterling",
                        "slug": "J.-Sterling",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Sterling",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Sterling"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 31309344,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "df689baf1b57a9d19f79f30197cfd2d1c5fc669e",
            "isKey": false,
            "numCitedBy": 21,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "The Proteus syntactic analyzer was developed starting in the fall of 1984 as a common base for all the applications of the Proteus Project . Many aspects of it s design reflect its heritage in the Linguistic String Parser, previously developed an d still in use at New York University . The current system, including the Restriction Language compiler, the lexical analyzer, and the parser proper, comprise approximately 4500 lines of Common Lisp ."
            },
            "slug": "New-York-University:-description-of-the-Proteus-as-Grishman-Sterling",
            "title": {
                "fragments": [],
                "text": "New York University: description of the Proteus system as used for MUC-5"
            },
            "tldr": {
                "abstractSimilarityScore": 81,
                "text": "Theproteus syntactic analyzer was developed starting in the fall of 1984 as a common base for all the applications of the Proteus Project and comprises approximately 4500 lines of Common Lisp."
            },
            "venue": {
                "fragments": [],
                "text": "MUC"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1830767"
                        ],
                        "name": "P. Placeway",
                        "slug": "P.-Placeway",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Placeway",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Placeway"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35442155"
                        ],
                        "name": "R. Schwartz",
                        "slug": "R.-Schwartz",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Schwartz",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Schwartz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1683412"
                        ],
                        "name": "Pascale Fung",
                        "slug": "Pascale-Fung",
                        "structuredName": {
                            "firstName": "Pascale",
                            "lastName": "Fung",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Pascale Fung"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2150603996"
                        ],
                        "name": "L. Nguyen",
                        "slug": "L.-Nguyen",
                        "structuredName": {
                            "firstName": "Long",
                            "lastName": "Nguyen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Nguyen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 18070943,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a8fcc058607129590fa6ab692a38807efc7d7f1f",
            "isKey": false,
            "numCitedBy": 107,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors consider the estimation of powerful statistical language models using a technique that scales from very small to very large amounts of domain-dependent data. They begin with improved modeling of the grammar statistics, based on a combination of the backing-off technique and zero-frequency techniques. These are extended to be more amenable to the particular system considered here. The resulting technique is greatly simplified, more robust, and gives improved recognition performance over either of the previous techniques. The authors also consider the problem of robustness of a model based on a small training corpus by grouping words into obvious semantic classes. This significantly improves the robustness of the resulting statistical grammar. A technique that allows the estimation of a high-order model on modest computation resources is also presented. This makes it possible to run a 4-gram statistical model of a 50-million word corpus on a workstation of only modest capability and cost. Finally, the authors discuss results from applying a 2-gram statistical language model integrated in the HMM (hidden Markov model) search, obtaining a list of the N-best recognition results, and rescoring this list with a higher-order statistical model.<<ETX>>"
            },
            "slug": "The-estimation-of-powerful-language-models-from-and-Placeway-Schwartz",
            "title": {
                "fragments": [],
                "text": "The estimation of powerful language models from small and large corpora"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "The authors consider the estimation of powerful statistical language models using a technique that scales from very small to very large amounts of domain-dependent data, and considers the problem of robustness of a model based on a small training corpus by grouping words into obvious semantic classes."
            },
            "venue": {
                "fragments": [],
                "text": "1993 IEEE International Conference on Acoustics, Speech, and Signal Processing"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1788050"
                        ],
                        "name": "R. Grishman",
                        "slug": "R.-Grishman",
                        "structuredName": {
                            "firstName": "Ralph",
                            "lastName": "Grishman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Grishman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144360624"
                        ],
                        "name": "J. Sterling",
                        "slug": "J.-Sterling",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Sterling",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Sterling"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34617501"
                        ],
                        "name": "C. Macleod",
                        "slug": "C.-Macleod",
                        "structuredName": {
                            "firstName": "Catherine",
                            "lastName": "Macleod",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Macleod"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 53771137,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "96652ef7abd829eb95bfd0d527ec7a07cf43ca5c",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "The Proteus system which we have used for MUC-5 is largely unchanged from that used for MUC-3 and MUC-4. It has three main components: a syntactic analyzer, a semantic analyzer, and a template generator."
            },
            "slug": "New-York-University:-description-of-the-PROTEUS-as-Grishman-Sterling",
            "title": {
                "fragments": [],
                "text": "New York University: description of the PROTEUS system as used for MUC-3"
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "The Proteus system which the MUC-5 team has used is largely unchanged from that used for MUCs 3 and 4, and has three main components: a syntactic analyzer, a semantic analyzers, and a template generator."
            },
            "venue": {
                "fragments": [],
                "text": "MUC"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1786370"
                        ],
                        "name": "D. Pallett",
                        "slug": "D.-Pallett",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Pallett",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pallett"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3241934"
                        ],
                        "name": "J. Fiscus",
                        "slug": "J.-Fiscus",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Fiscus",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Fiscus"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144982775"
                        ],
                        "name": "W. Fisher",
                        "slug": "W.-Fisher",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Fisher",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Fisher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2467151"
                        ],
                        "name": "John S. Garofolo",
                        "slug": "John-S.-Garofolo",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Garofolo",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John S. Garofolo"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6752118,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "4b04d2f1f7e0d4eb51937e8980b01b5ed8876bd0",
            "isKey": false,
            "numCitedBy": 128,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper documents benchmark tests implemented within the DARPA Spoken Language Program during the period November, 1992 - January, 1993. Tests were conducted using the Wall Street Journal-based Continuous Speech Recognition (WSJ-CSR) corpus and the Air Travel Information System (ATIS) corpus collected by the Multi-site ATIS Data COllection Working (MADCOW) Group. The WSJ-CSR tests consist of tests of large vocabulary (lexicons of 5,000 to more than 20,000 words) continuous speech recognition systems. The ATIS tests consist of tests of (1) ATIS-domain spontaneous speech (lexicons typically less than 2,000 words), (2) natural language understanding, and (3) spoken language understanding. These tests were reported on and discussed in detail at the Spoken Language Systems Technology Workshop held at the Massachusetts Institute of Technology, January 20-22, 1993."
            },
            "slug": "Benchmark-Tests-for-the-DARPA-Spoken-Language-Pallett-Fiscus",
            "title": {
                "fragments": [],
                "text": "Benchmark Tests for the DARPA Spoken Language Program"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "These tests were reported on and discussed in detail at the Spoken Language Systems Technology Workshop held at the Massachusetts Institute of Technology, January 20-22, 1993."
            },
            "venue": {
                "fragments": [],
                "text": "HLT"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1762744"
                        ],
                        "name": "A. Stolcke",
                        "slug": "A.-Stolcke",
                        "structuredName": {
                            "firstName": "Andreas",
                            "lastName": "Stolcke",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Stolcke"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 49,
                                "start": 37
                            }
                        ],
                        "text": "This adaptation, related to that of (Stolcke 1995), involves reformulating the Earley algorithm to work with probabilistic recursive transition networks rather than with deterministic production rules."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 11595344,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "79fbfc1dc8846379074aaf4deb7fb0a96722eeed",
            "isKey": false,
            "numCitedBy": 401,
            "numCiting": 63,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe an extension of Earley's parser for stochastic context-free grammars that computes the following quantities given a stochastic context-free grammar and an input string: a) probabilities of successive prefixes being generated by the grammar; b) probabilities of substrings being generated by the nonterminals, including the entire string being generated by the grammar; c) most likely (Viterbi) parse of the string; d) posterior expected number of applications of each grammar production, as required for reestimating rule probabilities. Probabilities (a) and (b) are computed incrementally in a single left-to-right pass over the input. Our algorithm compares favorably to standard bottom-up parsing methods for SCFGs in that it works efficiently on sparse grammars by making use of Earley's top-down control structure. It can process any context-free rule format without conversion to some normal form, and combines computations for (a) through (d) in a single algorithm. Finally, the algorithm has simple extensions for processing partially bracketed inputs, and for finding partial parses and their likelihoods on ungrammatical inputs."
            },
            "slug": "An-Efficient-Probabilistic-Context-Free-Parsing-Stolcke",
            "title": {
                "fragments": [],
                "text": "An Efficient Probabilistic Context-Free Parsing Algorithm that Computes Prefix Probabilities"
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "An extension of Earley's parser for stochastic context-free grammars that computes probabilities of successive prefixes being generated by the grammar and an input string and posterior expected number of applications of each grammar production, as required for reestimating rule probabilities."
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Linguistics"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1786370"
                        ],
                        "name": "D. Pallett",
                        "slug": "D.-Pallett",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Pallett",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pallett"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3241934"
                        ],
                        "name": "J. Fiscus",
                        "slug": "J.-Fiscus",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Fiscus",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Fiscus"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144982775"
                        ],
                        "name": "W. Fisher",
                        "slug": "W.-Fisher",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Fisher",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Fisher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2467151"
                        ],
                        "name": "John S. Garofolo",
                        "slug": "John-S.-Garofolo",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Garofolo",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John S. Garofolo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2061874374"
                        ],
                        "name": "Bruce A. Lund",
                        "slug": "Bruce-A.-Lund",
                        "structuredName": {
                            "firstName": "Bruce",
                            "lastName": "Lund",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bruce A. Lund"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2282719"
                        ],
                        "name": "Mark A. Przybocki",
                        "slug": "Mark-A.-Przybocki",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Przybocki",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mark A. Przybocki"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 30485956,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "71a286f8e6eeb611bd216f07bb749d3cc04ed2b7",
            "isKey": false,
            "numCitedBy": 182,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper reports results obtained in benchmark tests conducted within the ARPA Spoken Language program in November and December of 1993. In addition to ARPA contractors, participants included a number of \"volunteers\", including foreign participants from Canada, France, Germany, and the United Kingdom. The body of the paper is limited to an outline of the structure of the tests and presents highlights and discussion of selected results. Detailed tabulations of reported \"official\" results, and additional explanatory text appears in the Appendix."
            },
            "slug": "1993-Benchmark-Tests-for-the-ARPA-Spoken-Language-Pallett-Fiscus",
            "title": {
                "fragments": [],
                "text": "1993 Benchmark Tests for the ARPA Spoken Language Program"
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "This paper reports results obtained in benchmark tests conducted within the ARPA Spoken Language program in November and December of 1993, including foreign participants from Canada, France, Germany, and the United Kingdom."
            },
            "venue": {
                "fragments": [],
                "text": "HLT"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144954740"
                        ],
                        "name": "J. Earley",
                        "slug": "J.-Earley",
                        "structuredName": {
                            "firstName": "Jay",
                            "lastName": "Earley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Earley"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 164
                            }
                        ],
                        "text": "In order to explore the space of possible parses efficiently, the parsing model is searched using a decoder based on an adaptation of the Earley parsing algorithm (Earley 1970)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 35664,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "62ea2ef8b7d98cf3a3b912a62a7a42ee82650e6b",
            "isKey": false,
            "numCitedBy": 1339,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "A parsing algorithm which seems to be the most efficient general context-free algorithm known is described. It is similar to both Knuth's LR(<italic>k</italic>) algorithm and the familiar top-down algorithm. It has a time bound proportional to <italic>n</italic><supscrpt>3</supscrpt> (where <italic>n</italic> is the length of the string being parsed) in general; it has an <italic>n</italic><supscrpt>2</supscrpt> bound for unambiguous grammars; and it runs in linear time on a large class of grammars, which seems to include most practical context-free programming language grammars. In an empirical comparison it appears to be superior to the top-down and bottom-up algorithms studied by Griffiths and Petrick."
            },
            "slug": "An-efficient-context-free-parsing-algorithm-Earley",
            "title": {
                "fragments": [],
                "text": "An efficient context-free parsing algorithm"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "A parsing algorithm which seems to be the most efficient general context-free algorithm known is described and appears to be superior to the top-down and bottom-up algorithms studied by Griffiths and Petrick."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144518334"
                        ],
                        "name": "E. Levin",
                        "slug": "E.-Levin",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Levin",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Levin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58189243,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "007051b6cd3d90cac0111929dfe37b5c80743aff",
            "isKey": false,
            "numCitedBy": 76,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "CHRONUS,-The-next-generation-Levin",
            "title": {
                "fragments": [],
                "text": "CHRONUS, The next generation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3029946"
                        ],
                        "name": "Joshua Koppelman",
                        "slug": "Joshua-Koppelman",
                        "structuredName": {
                            "firstName": "Joshua",
                            "lastName": "Koppelman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Joshua Koppelman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2714577"
                        ],
                        "name": "S. D. Pietra",
                        "slug": "S.-D.-Pietra",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Pietra",
                            "middleNames": [
                                "Della"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. D. Pietra"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2052717227"
                        ],
                        "name": "M. Epstein",
                        "slug": "M.-Epstein",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Epstein",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Epstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781292"
                        ],
                        "name": "S. Roukos",
                        "slug": "S.-Roukos",
                        "structuredName": {
                            "firstName": "Salim",
                            "lastName": "Roukos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Roukos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144582029"
                        ],
                        "name": "T. Ward",
                        "slug": "T.-Ward",
                        "structuredName": {
                            "firstName": "Todd",
                            "lastName": "Ward",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Ward"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 183,
                                "start": 162
                            }
                        ],
                        "text": "Development of a complete end-to-end statistical understanding system has been the focus of several ongoing research efforts, including (Miller et al. 1995) and (Koppelman et al. 1995)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 41471957,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d7694cb281101a6318c7df083b094a15fec72bb6",
            "isKey": false,
            "numCitedBy": 4,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-statistical-approach-to-language-modelling-for-Koppelman-Pietra",
            "title": {
                "fragments": [],
                "text": "A statistical approach to language modelling for the ATIS task"
            },
            "venue": {
                "fragments": [],
                "text": "EUROSPEECH"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1732071"
                        ],
                        "name": "R. Weischedel",
                        "slug": "R.-Weischedel",
                        "structuredName": {
                            "firstName": "Ralph",
                            "lastName": "Weischedel",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Weischedel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2214048"
                        ],
                        "name": "Damaris M. Ayuso",
                        "slug": "Damaris-M.-Ayuso",
                        "structuredName": {
                            "firstName": "Damaris",
                            "lastName": "Ayuso",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Damaris M. Ayuso"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2248665"
                        ],
                        "name": "S. Boisen",
                        "slug": "S.-Boisen",
                        "structuredName": {
                            "firstName": "Sean",
                            "lastName": "Boisen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Boisen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "20866393"
                        ],
                        "name": "Heidi Fox",
                        "slug": "Heidi-Fox",
                        "structuredName": {
                            "firstName": "Heidi",
                            "lastName": "Fox",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Heidi Fox"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2319612"
                        ],
                        "name": "R. Ingria",
                        "slug": "R.-Ingria",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Ingria",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Ingria"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153330102"
                        ],
                        "name": "Tomoyoshi Matsukawa",
                        "slug": "Tomoyoshi-Matsukawa",
                        "structuredName": {
                            "firstName": "Tomoyoshi",
                            "lastName": "Matsukawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tomoyoshi Matsukawa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145030811"
                        ],
                        "name": "C. Papageorgiou",
                        "slug": "C.-Papageorgiou",
                        "structuredName": {
                            "firstName": "Constantine",
                            "lastName": "Papageorgiou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Papageorgiou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47051488"
                        ],
                        "name": "D. MacLaughlin",
                        "slug": "D.-MacLaughlin",
                        "structuredName": {
                            "firstName": "Dawn",
                            "lastName": "MacLaughlin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. MacLaughlin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39558581"
                        ],
                        "name": "Masaichiro Kitagawa",
                        "slug": "Masaichiro-Kitagawa",
                        "structuredName": {
                            "firstName": "Masaichiro",
                            "lastName": "Kitagawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Masaichiro Kitagawa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113529902"
                        ],
                        "name": "Tsutomu Sakai",
                        "slug": "Tsutomu-Sakai",
                        "structuredName": {
                            "firstName": "Tsutomu",
                            "lastName": "Sakai",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tsutomu Sakai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50017558"
                        ],
                        "name": "J. Abe",
                        "slug": "J.-Abe",
                        "structuredName": {
                            "firstName": "June",
                            "lastName": "Abe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Abe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3386879"
                        ],
                        "name": "Hiroto Hosihi",
                        "slug": "Hiroto-Hosihi",
                        "structuredName": {
                            "firstName": "Hiroto",
                            "lastName": "Hosihi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hiroto Hosihi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48356794"
                        ],
                        "name": "Y. Miyamoto",
                        "slug": "Y.-Miyamoto",
                        "structuredName": {
                            "firstName": "Yoichi",
                            "lastName": "Miyamoto",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Miyamoto"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "123937952"
                        ],
                        "name": "Scott Miller",
                        "slug": "Scott-Miller",
                        "structuredName": {
                            "firstName": "Scott",
                            "lastName": "Miller",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Scott Miller"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 871522,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "ae682bd026492882e8509e9d7556686bd1487bc6",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper provides a quick summary of our technical approach, which has been developing since 1991 and wa s first fielded in MUC-3 . First a quick review of what is new is provided, then a walkthrough of system components . Perhaps most interesting is out analysis, following the walkthrough, of what we learned through MUC-6 and o f what directions we would take now to break the performance barriers of cur rent information extraction technology."
            },
            "slug": "BBN:-description-of-the-PLUM-system-as-used-for-Weischedel-Ayuso",
            "title": {
                "fragments": [],
                "text": "BBN: description of the PLUM system as used for MUC-5"
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "This paper provides a quick summary of the technical approach to information extraction, which has been developing since 1991 and was first fielded in MUC-3 and is followed by a walkthrough of system components."
            },
            "venue": {
                "fragments": [],
                "text": "MUC"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "CHRONUS: The Next Generation Spoken Language Systems Technology Workshop"
            },
            "venue": {
                "fragments": [],
                "text": "CHRONUS: The Next Generation Spoken Language Systems Technology Workshop"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Recent Progress in Hidden Understanding Models"
            },
            "venue": {
                "fragments": [],
                "text": "Spoken Language Systems Technology Workshop"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 44,
                                "start": 33
                            }
                        ],
                        "text": "For details of the decoder, see (Miller 1996)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Hidden Understanding Models"
            },
            "venue": {
                "fragments": [],
                "text": "Northeastern University"
            },
            "year": 1996
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 2,
            "methodology": 3
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 20,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/A-Fully-Statistical-Approach-to-Natural-Language-Miller-Stallard/e9c1f510bcf5933d3cf8ec8108a04a9ba601a843?sort=total-citations"
}