{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698422"
                        ],
                        "name": "J. MacCormick",
                        "slug": "J.-MacCormick",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "MacCormick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. MacCormick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 39,
                                "start": 35
                            }
                        ],
                        "text": "The second line uses the fact (see [15]) that for large n, the normalisation constant for the weights is approximately 1=n | so i p 0(xi)=(np(xi))."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 66,
                                "start": 58
                            }
                        ],
                        "text": "Full details on densities of the form (8) can be found in [15, 16], for example."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 110,
                                "start": 106
                            }
                        ],
                        "text": "A proof that the weighted resampling operation does not alter the underlying distribution can be found in [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 94
                            }
                        ],
                        "text": "Figure 9 is a still from a movie which shows the system in action; this movie is available at [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 67,
                                "start": 63
                            }
                        ],
                        "text": "An informal proof of (4) follows; more details can be found in [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 30553826,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a2812728b2b97d5134352c9fa51b6d7398a53d73",
            "isKey": false,
            "numCitedBy": 69,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A central problem in computer vision is to track objects as they move and deform in a video sequence. Stochastic algorithms -- in particular, particle filters and the Condensation algorithm -- have dramatically enhanced the state of the art for such visual tracking problems in recent years. This book presents a unified framework for visual tracking using particle filters, including the new technique of partitioned sampling which can alleviate the \"curse of dimensionality\" suffered by standard particle filters. The book also introduces the notion of contour likelihood: a collection of models for assessing object shape, colour and motion, which are derived from the statistical properties of image features. Because of their statistical nature, contour likelihoods are ideal for use in stochastic algorithms. A unifying theme of the book is the use of statistics and probability, which enable the final output of the algorithms presented to be interpreted as the computer's \"belief\" about the state of the world. The book will be of use and interest to students, researchers and practitioners in computer vision, and assumes only an elementary knowledge of probability theory."
            },
            "slug": "Stochastic-algorithms-for-visual-tracking:-and-for-MacCormick",
            "title": {
                "fragments": [],
                "text": "Stochastic algorithms for visual tracking: probabilistic modelling and stochastic algorithms for visual localisation and tracking"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This book presents a unified framework for visual tracking using particle filters, including the new technique of partitioned sampling which can alleviate the \"curse of dimensionality\" suffered by standard particle filters."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698422"
                        ],
                        "name": "J. MacCormick",
                        "slug": "J.-MacCormick",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "MacCormick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. MacCormick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145162067"
                        ],
                        "name": "A. Blake",
                        "slug": "A.-Blake",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Blake",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Blake"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 66,
                                "start": 58
                            }
                        ],
                        "text": "Full details on densities of the form (8) can be found in [15, 16], for example."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 12792560,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6c34c8335c2bd459395ab78dcc022b05fb6499db",
            "isKey": false,
            "numCitedBy": 64,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "A method of localising objects in images is proposed. Possible configurations are evaluated using the contour discriminant, a likelihood ratio which is derived from a probabilistic model of the feature detection process. We treat each step in this process probabilistically, including the occurrence of clutter features, and derive the observation densities for both correct \"target\" configurations and incorrect \"clutter\" configurations. The contour discriminant distinguishes target objects from the background even in heavy clutter, making only the most general assumptions about the form that clutter might take. The method generates samples stochastically to avoid the cost of processing an entire image, and promises to be particularly suited to the task of initialising contour trackers based on sampling methods."
            },
            "slug": "A-probabilistic-contour-discriminant-for-object-MacCormick-Blake",
            "title": {
                "fragments": [],
                "text": "A probabilistic contour discriminant for object localisation"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "A method of localising objects in images by treating each step in this process probabilistically, including the occurrence of clutter features, and derive the observation densities for both correct \"target\" configurations and incorrect \"clutter\" configurations."
            },
            "venue": {
                "fragments": [],
                "text": "Sixth International Conference on Computer Vision (IEEE Cat. No.98CH36271)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2090818"
                        ],
                        "name": "M. Isard",
                        "slug": "M.-Isard",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Isard",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Isard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698422"
                        ],
                        "name": "J. MacCormick",
                        "slug": "J.-MacCormick",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "MacCormick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. MacCormick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 64,
                                "start": 60
                            }
                        ],
                        "text": "Details of these tools can be found in our technical report [10]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16215961,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8ff3ad0f8f8f2d2c2124512717b4f69eae8bb55a",
            "isKey": false,
            "numCitedBy": 8,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "This report should be regarded as an appendix to our paper 9]. It provides technical details on the hand tracking system described there, and on the vision-based drawing package developed to demonstrate its use in applications. 1 The hand tracker This section describes the implementation of a robust and accurate hand tracker using ICon-densation 5] and partitioned sampling 9]."
            },
            "slug": "Hand-Tracking-for-Vision-Based-Drawing-Isard-MacCormick",
            "title": {
                "fragments": [],
                "text": "Hand Tracking for Vision-Based Drawing"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "This section describes the implementation of a robust and accurate hand tracker using ICon-densation and partitioned sampling and the vision-based drawing package developed to demonstrate its use in applications."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2090818"
                        ],
                        "name": "M. Isard",
                        "slug": "M.-Isard",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Isard",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Isard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145162067"
                        ],
                        "name": "A. Blake",
                        "slug": "A.-Blake",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Blake",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Blake"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 10
                            }
                        ],
                        "text": "Of these, [1, 11] are the closest to our system in terms of the method used."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 99
                            }
                        ],
                        "text": "4 Other details Initialisation and re-initialisation are handled by the ICondensation mechanism of [11]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[11]) to tracking problems with high-dimensional con guration spaces, without incurring the large computational cost that would normally be expected in such problems."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 18939846,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "91a389b99a77895e4b33e4a81af2f0a5fe8fc011",
            "isKey": false,
            "numCitedBy": 676,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "Tracking research has diverged into two camps; low-level approaches which are typically fast and robust but provide little fine-scale information, and high-level approaches which track complex deformations in high-dimensional spaces but must trade off speed against robustness. Real-time high-level systems perform poorly in clutter and initialisation for most high-level systems is either performed manually or by a separate module. This paper presents a new technique to combine low- and high-level information in a consistent probabilistic framework, using the statistical technique of importance sampling combined with the Condensation algorithm. The general framework, which we term Icondensation, is described, and a hand tracker is demonstrated which combines colour blob-tracking with a contour model. The resulting tracker is robust to rapid motion, heavy clutter and hand-coloured distractors, and re-initialises automatically. The system runs comfortably in real time on an entry-level desktop workstation."
            },
            "slug": "ICONDENSATION:-Unifying-Low-Level-and-High-Level-in-Isard-Blake",
            "title": {
                "fragments": [],
                "text": "ICONDENSATION: Unifying Low-Level and High-Level Tracking in a Stochastic Framework"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A new technique to combine low- and high-level information in a consistent probabilistic framework is presented, using the statistical technique of importance sampling combined with the Condensation algorithm, and a hand tracker is demonstrated which combines colour blob-tracking with a contour model."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40178596"
                        ],
                        "name": "T. Heap",
                        "slug": "T.-Heap",
                        "structuredName": {
                            "firstName": "Tony",
                            "lastName": "Heap",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Heap"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1967104"
                        ],
                        "name": "David C. Hogg",
                        "slug": "David-C.-Hogg",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hogg",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David C. Hogg"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2418402,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1c3948ca1d291955c78cbc29e998d83e4ede0ab4",
            "isKey": false,
            "numCitedBy": 154,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Existing object tracking algorithms generally use some form of local optimisation, assuming that an object's position and shape change smoothly over time. In some situations this assumption is not valid: the track able shape of an object may change discontinuously, for example if it is the 2D silhouette of a 3D object. In this paper we propose a novel method for modelling temporal shape discontinuities explicitly. Allowable shapes are represented as a union of (learned) bounded regions within a shape space. Discontinuous shape changes are described in terms of transitions between these regions. Transition probabilities are learned from training sequences and stored in a Markov model. In this way we can create 'wormholes' in shape space. Tracking with such models is via an adaptation, of the CONDENSATION algorithm."
            },
            "slug": "Wormholes-in-shape-space:-tracking-through-changes-Heap-Hogg",
            "title": {
                "fragments": [],
                "text": "Wormholes in shape space: tracking through discontinuous changes in shape"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This paper proposes a novel method for modelling temporal shape discontinuities explicitly, represented as a union of (learned) bounded regions within a shape space, which can create 'wormholes' in shape space."
            },
            "venue": {
                "fragments": [],
                "text": "Sixth International Conference on Computer Vision (IEEE Cat. No.98CH36271)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145162067"
                        ],
                        "name": "A. Blake",
                        "slug": "A.-Blake",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Blake",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Blake"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2090818"
                        ],
                        "name": "M. Isard",
                        "slug": "M.-Isard",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Isard",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Isard"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10214317,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "706c7bd758f933bffd60b5153a4498e83a880a38",
            "isKey": false,
            "numCitedBy": 121,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "Recent developments in video-tracking allow the outlines of moving, natural objects in a video-camera input stream to be tracked live, at full video-rate. Previous systems have been available to do this for specially illuminated objects or for naturally illuminated but polyhedral objects. Other systems have been able to track nonpolyhedral objects in motion, in some cases from live video, but following only centroids or key-points rather than tracking whole curves. The system described here can track accurately the curved silhouettes of moving non-polyhedral objects at frame-rate, for example hands, lips, legs, vehicles, fruit, and without any special hardware beyond a desktop workstation and a video-camera and framestore. The new algorithms are a synthesis of methods in deformable models, B-splines curve representation and control theory. This paper shows how such a facility can be used to turn parts of the body—for instance, hands and lips—into input devices. Rigid motion of a hand can be used as a 3D mouse with non-rigid gestures signalling a button press or the “lifting” of the mouse. Both rigid and non-rigid motions of lips can be tracked independently and used as inputs, for example to animate a computer-generated face."
            },
            "slug": "3D-position,-attitude-and-shape-input-using-video-Blake-Isard",
            "title": {
                "fragments": [],
                "text": "3D position, attitude and shape input using video tracking of hands and lips"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The system described here can track accurately the curved silhouettes of moving non-polyhedral objects at frame-rate, for example hands, lips, legs, vehicles, fruit, and without any special hardware beyond a desktop workstation and a video-camera and framestore."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49967740"
                        ],
                        "name": "S. Ahmad",
                        "slug": "S.-Ahmad",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Ahmad",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ahmad"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 10
                            }
                        ],
                        "text": "Of these, [1, 11] are the closest to our system in terms of the method used."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 9076218,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "774b47614297ff6377cc9ff6c4962989e9237430",
            "isKey": false,
            "numCitedBy": 95,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a computer vision system for tracking human hands. The algorithms used to extract the 3D position, and planar orientation of the hand, and the joint angles of the fingers are described. The combined system is able to track a natural hand at 30 frames per second on a standard workstation with no special image processing hardware other than a frame grabber. The tracker has been used as an interface for navigating around virtual worlds.<<ETX>>"
            },
            "slug": "A-usable-real-time-3D-hand-tracker-Ahmad",
            "title": {
                "fragments": [],
                "text": "A usable real-time 3D hand tracker"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "The algorithms used to extract the 3D position, and planar orientation of the hand, and the joint angles of the fingers are described and the combined system is able to track a natural hand at 30 frames per second on a standard workstation with no special image processing hardware other than a frame grabber."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 1994 28th Asilomar Conference on Signals, Systems and Computers"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69470098"
                        ],
                        "name": "J. Carpenter",
                        "slug": "J.-Carpenter",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Carpenter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Carpenter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145578421"
                        ],
                        "name": "P. Clifford",
                        "slug": "P.-Clifford",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Clifford",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Clifford"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3246901"
                        ],
                        "name": "P. Fearnhead",
                        "slug": "P.-Fearnhead",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Fearnhead",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Fearnhead"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2933178,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "f62a0536c7e8395055f20723e418fbc07ac677a8",
            "isKey": false,
            "numCitedBy": 343,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "The Kalman filter provides an effective solution to the linear Gaussian filtering problem. However where there is nonlinearity, either in the model specification or the observation process, other methods are required. Methods known generically as `particle filters' are considered. These include the condensation algorithm and the Bayesian bootstrap or sampling importance resampling (SIR) filter. These filters represent the posterior distribution of the state variables by a system of particles which evolves and adapts recursively as new information becomes available. In practice, large numbers of particles may be required to provide adequate approximations and for certain applications, after a sequence of updates, the particle system will often collapse to a single point. A method of monitoring the efficiency of these filters is introduced which provides a simple quantitative assessment of sample impoverishment and the authors show how to construct improved particle filters that are both structurally efficient in terms of preventing the collapse of the particle system and computationally efficient in their implementation. This is illustrated with the classic bearings-only tracking problem."
            },
            "slug": "An-improved-particle-filter-for-non-linear-problems-Carpenter-Clifford",
            "title": {
                "fragments": [],
                "text": "An improved particle filter for non-linear problems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69470098"
                        ],
                        "name": "J. Carpenter",
                        "slug": "J.-Carpenter",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Carpenter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Carpenter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145578421"
                        ],
                        "name": "P. Clifford",
                        "slug": "P.-Clifford",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Clifford",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Clifford"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3246901"
                        ],
                        "name": "P. Fearnhead",
                        "slug": "P.-Fearnhead",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Fearnhead",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Fearnhead"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122476255,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "0f7fc9899feb00fc46cbcfee6232877a94335b18",
            "isKey": false,
            "numCitedBy": 830,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The Kalman filter provides an effective solution to the linear Gaussian filtering problem. However where there is nonlinearity, either in the model specification or the observation process, other methods are required. Methods known generically as 'particle filters' are considered. These include the condensation algorithm and the Bayesian bootstrap or sampling importance resampling (SIR) filter. These filters represent the posterior distribution of the state variables by a system of particles which evolves and adapts recursively as new information becomes available. In practice, large numbers of particles may be required to provide adequate approximations and for certain applications, after a sequence of updates, the particle system will often collapse to a single point. A method of monitoring the efficiency of these filters is introduced which provides a simple quantitative assessment of sample impoverishment and the authors show how to construct improved particle filters that are both structurally efficient in terms of preventing the collapse of the particle system and computationally efficient in their implementation. This is illustrated with the classic bearings-only tracking problem."
            },
            "slug": "Improved-particle-filter-for-nonlinear-problems-Carpenter-Clifford",
            "title": {
                "fragments": [],
                "text": "Improved particle filter for nonlinear problems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34751187"
                        ],
                        "name": "C. R. Wren",
                        "slug": "C.-R.-Wren",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Wren",
                            "middleNames": [
                                "Richard"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. R. Wren"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144994682"
                        ],
                        "name": "A. Pentland",
                        "slug": "A.-Pentland",
                        "structuredName": {
                            "firstName": "Alex",
                            "lastName": "Pentland",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pentland"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 985365,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "201c954806f2ed40cdce6414e8cea8a4131ed23c",
            "isKey": false,
            "numCitedBy": 159,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes experiments in human motion understanding, defined here as estimation of the physical state of the body (the Plant) combined with interpretation of that part of the motion that cannot be predicted by the plant alone (the Behavior). The described behavior system operates in conjunction with a real-time, fully-dynamic, 3-D person tracking system that provides a mathematically concise formulation for incorporating a wide variety of physical constraints and probabilistic influences. The framework takes the form of a non-linear recursive filter that enables pixel-level, probabilistic processes to take advantage of the contextual knowledge encoded in the higher-level models. Results are shown that demonstrate both qualitative and quantitative gains in tracking performance."
            },
            "slug": "Dynamic-models-of-human-motion-Wren-Pentland",
            "title": {
                "fragments": [],
                "text": "Dynamic models of human motion"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "This paper describes experiments in human motion understanding, defined here as estimation of the physical state of the body combined with interpretation of that part of the motion that cannot be predicted by the plant alone (the Behavior)."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings Third IEEE International Conference on Automatic Face and Gesture Recognition"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745672"
                        ],
                        "name": "R. Cipolla",
                        "slug": "R.-Cipolla",
                        "structuredName": {
                            "firstName": "Roberto",
                            "lastName": "Cipolla",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Cipolla"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1704936"
                        ],
                        "name": "N. Hollinghurst",
                        "slug": "N.-Hollinghurst",
                        "structuredName": {
                            "firstName": "Nicholas",
                            "lastName": "Hollinghurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Hollinghurst"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 12803098,
            "fieldsOfStudy": [
                "Materials Science"
            ],
            "id": "965bbd6d1284d697372fc6ba18954d7ce58dc69d",
            "isKey": false,
            "numCitedBy": 110,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Human-robot-interface-by-pointing-with-uncalibrated-Cipolla-Hollinghurst",
            "title": {
                "fragments": [],
                "text": "Human-robot interface by pointing with uncalibrated stereo vision"
            },
            "venue": {
                "fragments": [],
                "text": "Image Vis. Comput."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2739350"
                        ],
                        "name": "R. Kjeldsen",
                        "slug": "R.-Kjeldsen",
                        "structuredName": {
                            "firstName": "Rick",
                            "lastName": "Kjeldsen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kjeldsen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719062"
                        ],
                        "name": "J. Kender",
                        "slug": "J.-Kender",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Kender",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kender"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6230444,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6b9ad447ec3a5aed79ba8d1b04abda29f6a05802",
            "isKey": false,
            "numCitedBy": 118,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "This work describes the design of a functioning user interface based on visual recognition of hand gestures, and details its performance. In the interface, gesture replaces the mouse for many actions including selecting, moving and resizing windows. A camera below the screen observes the user. The hand is segmented from the background using color. Features of the hand's motion are extracted from the sequence of segmented images, and when needed the hand's pose is classified using a neural net. This information is parsed by a task specific grammar. The system runs in real time on standard PC hardware. It has demonstrated its abilities with various users in several different office environments. Having experimented with a functioning gestural interface, the authors discuss the practicality and best applications of this technology."
            },
            "slug": "Toward-the-use-of-gesture-in-traditional-user-Kjeldsen-Kender",
            "title": {
                "fragments": [],
                "text": "Toward the use of gesture in traditional user interfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "The design of a functioning user interface based on visual recognition of hand gestures, and its performance is described, and the authors discuss the practicality and best applications of this technology."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Second International Conference on Automatic Face and Gesture Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145852650"
                        ],
                        "name": "D. Mackay",
                        "slug": "D.-Mackay",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mackay",
                            "middleNames": [
                                "J.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mackay"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[18] gives a lucid explanation of these phenomena."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 117317747,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5060c088de8d53fbe95862e9cb325b91658fa48e",
            "isKey": false,
            "numCitedBy": 417,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "This chapter describes a sequence of Monte Carlo methods: importance sampling, rejection sampling, the Metropolis method, and Gibbs sampling. For each method, we discuss whether the method is expected to be useful for high—dimensional problems such as arise in inference with graphical models. After the methods have been described, the terminology of Markov chain Monte Carlo methods is presented. The chapter concludes with a discussion of advanced methods, including methods for reducing random walk behaviour."
            },
            "slug": "Introduction-to-Monte-Carlo-Methods-Mackay",
            "title": {
                "fragments": [],
                "text": "Introduction to Monte Carlo Methods"
            },
            "tldr": {
                "abstractSimilarityScore": 81,
                "text": "This chapter describes a sequence of Monte Carlo methods: importance sampling, rejection sampling, the Metropolis method, and Gibbs sampling, including methods for reducing random walk behaviour."
            },
            "venue": {
                "fragments": [],
                "text": "Learning in Graphical Models"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1830945"
                        ],
                        "name": "L. Bretzner",
                        "slug": "L.-Bretzner",
                        "structuredName": {
                            "firstName": "Lars",
                            "lastName": "Bretzner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Bretzner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3205375"
                        ],
                        "name": "T. Lindeberg",
                        "slug": "T.-Lindeberg",
                        "structuredName": {
                            "firstName": "Tony",
                            "lastName": "Lindeberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Lindeberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15045362,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0736163e6e6eedb5c6863878b6544645ed57f29b",
            "isKey": false,
            "numCitedBy": 63,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper addresses the problem of computing three-dimensional structure and motion from an unknown rigid configuration of point and lines viewed by an affine projection model. An algebraic structure, analogous to the trilinear tensor for three perspective cameras, is defined for configurations of three centered affine cameras. This centered affine trifocal tensor contains 12 non-zero coefficients and involves linear relations between point correspondences and trilinear relations between line correspondences. It is shown how the affine trifocal tensor relates to the perspective trilinear tensor, and how three-dimensional motion can be computed from this tensor in a straightforward manner. A factorization approach is also developed to handle point features and line features simultaneously in image sequences. This theory is applied to a specific problem in human-computer interaction of capturing three-dimensional rotations from gestures of a human hand. Besides the obvious application, this test problem illustrates the usefulness of the affine trifocal tensor in a situation where sufficient information is not available to compute the perspective trilinear tensor, while the geometry requires point correspondences as well as line correspondences over at least three views."
            },
            "slug": "Use-Your-Hand-as-a-3-D-Mouse,-or,-Relative-from-of-Bretzner-Lindeberg",
            "title": {
                "fragments": [],
                "text": "Use Your Hand as a 3-D Mouse, or, Relative Orientation from Extended Sequences of Sparse Point and Line Correspondences Using the Affine Trifocal Tensor"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This test problem illustrates the usefulness of the affine trifocal tensor in a situation where sufficient information is not available to compute the perspective trilinear tensor, while the geometry requires point correspondences as well as line correspondences over at least three views."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1775043"
                        ],
                        "name": "H. Graf",
                        "slug": "H.-Graf",
                        "structuredName": {
                            "firstName": "Hans",
                            "lastName": "Graf",
                            "middleNames": [
                                "Peter"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Graf"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3165487"
                        ],
                        "name": "E. Cosatto",
                        "slug": "E.-Cosatto",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Cosatto",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Cosatto"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2387879"
                        ],
                        "name": "D. Gibbon",
                        "slug": "D.-Gibbon",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Gibbon",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gibbon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2535899"
                        ],
                        "name": "M. Kocheisen",
                        "slug": "M.-Kocheisen",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Kocheisen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Kocheisen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2920582"
                        ],
                        "name": "E. Petajan",
                        "slug": "E.-Petajan",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Petajan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Petajan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1249176,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ff3faa698efae2c58ee1782654b2c4769dbb11be",
            "isKey": false,
            "numCitedBy": 152,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "We designed a modular system using a combination of shape analysis, color segmentation and motion information for locating reliably heads and faces of different sizes and orientations in complex images. The first of the system's three channels does a shape analysis on gray-level images to determine the location of individual facial features as well as the outlines of heads. In the second channel the color space is analyzed with a clustering algorithm to find areas of skin colors. The color space is first calibrated, using the results from the other channels. In the third channel motion information is extracted from frame differences. Head outlines are determined by analyzing the shapes of areas with large motion vectors. All three channels produce lists of shapes, each marking an area of the image where a facial feature or a part of the outline of a head may be present. Combinations of such shapes are evaluated with n-gram searches to produce a list of likely head positions and the locations of facial features. We tested the system for tracking faces of people sitting in front of terminals and video phones and used it to track people entering through a doorway."
            },
            "slug": "Multi-modal-system-for-locating-heads-and-faces-Graf-Cosatto",
            "title": {
                "fragments": [],
                "text": "Multi-modal system for locating heads and faces"
            },
            "tldr": {
                "abstractSimilarityScore": 79,
                "text": "A modular system using a combination of shape analysis, color segmentation and motion information for locating reliably heads and faces of different sizes and orientations in complex images for tracking faces of people sitting in front of terminals and video phones is designed."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Second International Conference on Automatic Face and Gesture Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701800"
                        ],
                        "name": "A. Doucet",
                        "slug": "A.-Doucet",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Doucet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Doucet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1708961"
                        ],
                        "name": "S. Godsill",
                        "slug": "S.-Godsill",
                        "structuredName": {
                            "firstName": "Simon",
                            "lastName": "Godsill",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Godsill"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49630843"
                        ],
                        "name": "C. Andrieu",
                        "slug": "C.-Andrieu",
                        "structuredName": {
                            "firstName": "Christophe",
                            "lastName": "Andrieu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Andrieu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 18
                            }
                        ],
                        "text": "That is, 1 Doucet [6] calls it the estimated e ective sample size."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 9,
                                "start": 3
                            }
                        ],
                        "text": "A. Doucet."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 0
                            }
                        ],
                        "text": "[4, 6, 7, 14]) and no single approach has met with resounding success."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 10
                            }
                        ],
                        "text": "That is,1 Doucet [6] calls it the estimated e ective sample size."
                    },
                    "intents": []
                }
            ],
            "corpusId": 13975390,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0c775ef35f358b49b78c8bc20ac340e425abc3b1",
            "isKey": true,
            "numCitedBy": 785,
            "numCiting": 83,
            "paperAbstract": {
                "fragments": [],
                "text": "In this report, we present an overview of sequential simulationbased methods for Bayesian filtering of nonlinear and non-Gaussian dynamic models. It includes in a general framework numerous methods proposed independently in various areas of science and proposes some original developments."
            },
            "slug": "On-sequential-simulation-based-methods-for-Bayesian-Doucet-Godsill",
            "title": {
                "fragments": [],
                "text": "On sequential simulation-based methods for Bayesian filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 85,
                "text": "This report presents an overview of sequential simulationbased methods for Bayesian filtering of nonlinear and non-Gaussian dynamic models and proposes some original developments."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50740237"
                        ],
                        "name": "Jun S. Liu",
                        "slug": "Jun-S.-Liu",
                        "structuredName": {
                            "firstName": "Jun",
                            "lastName": "Liu",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jun S. Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "79735252"
                        ],
                        "name": "Rong Chen",
                        "slug": "Rong-Chen",
                        "structuredName": {
                            "firstName": "Rong",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rong Chen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 0
                            }
                        ],
                        "text": "[4, 6, 7, 14]) and no single approach has met with resounding success."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15817579,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9873a6453ec35a65596263d66529131cba188e60",
            "isKey": false,
            "numCitedBy": 2125,
            "numCiting": 76,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract We provide a general framework for using Monte Carlo methods in dynamic systems and discuss its wide applications. Under this framework, several currently available techniques are studied and generalized to accommodate more complex features. All of these methods are partial combinations of three ingredients: importance sampling and resampling, rejection sampling, and Markov chain iterations. We provide guidelines on how they should be used and under what circumstance each method is most suitable. Through the analysis of differences and connections, we consolidate these methods into a generic algorithm by combining desirable features. In addition, we propose a general use of Rao-Blackwellization to improve performance. Examples from econometrics and engineering are presented to demonstrate the importance of Rao–Blackwellization and to compare different Monte Carlo procedures."
            },
            "slug": "Sequential-Monte-Carlo-methods-for-dynamic-systems-Liu-Chen",
            "title": {
                "fragments": [],
                "text": "Sequential Monte Carlo methods for dynamic systems"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "A general framework for using Monte Carlo methods in dynamic systems and a general use of Rao-Blackwellization is proposed to improve performance and to compare different Monte Carlo procedures."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145161220"
                        ],
                        "name": "J. Geweke",
                        "slug": "J.-Geweke",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Geweke",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Geweke"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 90,
                                "start": 87
                            }
                        ],
                        "text": "Speci cally, the survival rate is given by = Z p0(x)2=p(x) dx 1: (3) (See theorem 2 of [7] for another use of this quantity."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 0
                            }
                        ],
                        "text": "[4, 6, 7, 14]) and no single approach has met with resounding success."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 121945365,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4c8684b45d6d4635ca2384145334772469479e9d",
            "isKey": false,
            "numCitedBy": 1564,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Methods for the systematic application of Monte Carlo integration with importance sampling to Bayesian inference are developed. Conditions under which the numerical approximation converges almost surely to the true value with the number of Monte Carlo replications, and its numerical accuracy may be assessed reliably, are given. Importance sampling densities are derived from multivariate normal or student approximations to the posterior density. These densities are modified by automatic rescaling along each axis. The concept of relative numerical efficiency is introduced to evaluate the adequacy of a chosen importance sampling density. Applications in two illustrative models are presented. Copyright 1989 by The Econometric Society."
            },
            "slug": "Bayesian-Inference-in-Econometric-Models-Using-Geweke",
            "title": {
                "fragments": [],
                "text": "Bayesian Inference in Econometric Models Using Monte Carlo Integration"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2122942"
                        ],
                        "name": "B. Ripley",
                        "slug": "B.-Ripley",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Ripley",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Ripley"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 110
                            }
                        ],
                        "text": "The weighted resampling function is analogous to the importance function used in standard importance sampling [19]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 6151205,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a4180abb06c3e6931474c4a3e0ff079d2d5a0382",
            "isKey": false,
            "numCitedBy": 2209,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "One fifth (4 of 20) of the research articles published in the Journal of Educational Statistics in 1988 include simulation studies that justify or illustrate the authors' conclusions. A similar fraction (6 of 33) of the articles in the 1988 volume of Psychometrika include simulations; comparable proportions could be expected in other journals at the boundary of theoretical statistics and social/psychological applications. Due in part to the complexity of the problems tackled today and in part to the availability of cheap, powerful computing—by no means independent influences—simulation and Monte Carlo methods have become both necessary and practical tools for statisticians and applied workers in quantitative areas of education and psychology. Simulation has become popular—not only in the quantitative social sciences, but in all of the mathematical sciences from physics to operations research to number theory—because it is almost always easy to do. This ease of use makes the simulation experimenter vulnerable to two common pitfalls. Selection of the basic source of \"random numbers\" is often passive: Whatever is available in the computer's standard subroutine library is used. However, the fact that a pseudo-random number generator appears in a popular software package or operating system is hardly reason to trust it, as is shown by the infamous RANDU generator, once popular on IBM mainframes and PDP mini-computers, and by the generators burned into RAM on today's PCs. Simulation design and reporting also deserve special care. Some attempt must be made to assess the accuracy of the simulation estimates: One should accurately estimate and report SE (6) as well as 6. In addition, enough detail should be reported that the interested reader can replicate the study and check the results, just as with other experiments. Yet these considerations are also easy to overlook. Brian D. Ripley's Stochastic Simulation is a short, yet ambitious, survey of modern simulation techniques. Three themes run throughout the book. First, one shoud not take basic simulation subroutines for granted, especially on minior microcomputers where they tend to be poor implementations, implementations of poor algorithms, or both. Second, design of experiments, or variance reduction as it is known in this field, deserves greater consideration. Third, modern methods make it possible to simulate and analyze processes that are dependent over time, and using such processes opens the door to new simulation techniques, such as simulated annealing in optimization. Ripley intends this book to be a \"comprehensive guide,\" and it is indeed most accurately described as a researcher's handbook with examples and"
            },
            "slug": "Stochastic-simulation-Ripley",
            "title": {
                "fragments": [],
                "text": "Stochastic simulation"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Brian D. Ripley's Stochastic Simulation is a short, yet ambitious, survey of modern simulation techniques, and three themes run throughout the book."
            },
            "venue": {
                "fragments": [],
                "text": "Wiley series in probability and mathematical statistics : applied probability and statistics"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69365392"
                        ],
                        "name": "L. Brettzner",
                        "slug": "L.-Brettzner",
                        "structuredName": {
                            "firstName": "L.",
                            "lastName": "Brettzner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Brettzner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3205375"
                        ],
                        "name": "T. Lindeberg",
                        "slug": "T.-Lindeberg",
                        "structuredName": {
                            "firstName": "Tony",
                            "lastName": "Lindeberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Lindeberg"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 0
                            }
                        ],
                        "text": "[3, 9]), while others do not appear to have su cient accuracy for the applications envisaged here (e."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 60079156,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6409731df10b435dedf6edb5d32d6143b6cbb266",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Use-your-hand-as-a-3D-mouse-Brettzner-Lindeberg",
            "title": {
                "fragments": [],
                "text": "Use your hand as a 3D mouse"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 0
                            }
                        ],
                        "text": "[4, 6, 7, 14]) and no single approach has met with resounding success."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An improved particle lter for nonlinear problems"
            },
            "venue": {
                "fragments": [],
                "text": "An improved particle lter for nonlinear problems"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 0
                            }
                        ],
                        "text": "[4, 6, 7, 14]) and no single approach has met with resounding success."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Sequential Monte Carlo methods for dynamic sys tems"
            },
            "venue": {
                "fragments": [],
                "text": "J. Amer. Statist. Assoc.,"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 0
                            }
                        ],
                        "text": "[4, 6, 7, 14]) and no single approach has met with resounding success."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An improved particle lter for non linear problems"
            },
            "venue": {
                "fragments": [],
                "text": "Technical report, Dept. of Statistics, University of Oxford,"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Introduction to Monte Carlo methods Learning in Graphical Models Available as ftp"
            },
            "venue": {
                "fragments": [],
                "text": "Introduction to Monte Carlo methods Learning in Graphical Models Available as ftp"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Dynamic modeling of human motion In Third I E E E I n ternational Conference o n A utomatic Face and Gesture R ecognition"
            },
            "venue": {
                "fragments": [],
                "text": "Dynamic modeling of human motion In Third I E E E I n ternational Conference o n A utomatic Face and Gesture R ecognition"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 110,
                                "start": 106
                            }
                        ],
                        "text": "A proof that the weighted resampling operation does not alter the underlying distribution can be found in [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 66,
                                "start": 58
                            }
                        ],
                        "text": "Full details on densities of the form (8) can be found in [15, 16], for example."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 94
                            }
                        ],
                        "text": "Figure 9 is a still from a movie which shows the system in action; this movie is available at [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Probabilistic modelling and stochastic algorithms for visual lo calisation and tracking"
            },
            "venue": {
                "fragments": [],
                "text": "PhD thesis, University of Oxford,"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 21
                            }
                        ],
                        "text": "Kohler and Schr\u007foter [13] give a comprehensive survey."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Schr\u007foter. A Survey of Video-based Gesture Recognition: Stereo and Mono Systems"
            },
            "venue": {
                "fragments": [],
                "text": "Technical Report 693,"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A Survey of Video-based Gesture Recognition: Stereo and Mono Systems"
            },
            "venue": {
                "fragments": [],
                "text": "A Survey of Video-based Gesture Recognition: Stereo and Mono Systems"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Dynamic modeling of human motion"
            },
            "venue": {
                "fragments": [],
                "text": "Third IEEE International Conference on Automatic Face and Gesture Recognition"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Dynamic modeling of human motion"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 22
                            }
                        ],
                        "text": "Kohler and Schr\u007f oter [13] give a comprehensive survey."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Schr\u007f  oter. A Survey of Video-based Gesture  Recognition: Stereo and Mono Systems"
            },
            "venue": {
                "fragments": [],
                "text": "Technical Report 693, Infor matik VII, University of Dortmund/Germany,"
            },
            "year": 1998
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 15,
            "methodology": 3
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 31,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Partitioned-Sampling,-Articulated-Objects,-and-Hand-MacCormick-Isard/86efc15754e34254e5991c3a0fdcffbffbc47a3e?sort=total-citations"
}