{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2090818"
                        ],
                        "name": "M. Isard",
                        "slug": "M.-Isard",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Isard",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Isard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145162067"
                        ],
                        "name": "A. Blake",
                        "slug": "A.-Blake",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Blake",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Blake"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8369379,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9c5a0951cea300222834497c8e12ac2be99cd11e",
            "isKey": false,
            "numCitedBy": 1435,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of tracking curves in dense visual clutter is a challenging one. Trackers based on Kalman filters are of limited use; because they are based on Gaussian densities which are unimodal, they cannot represent simultaneous alternative hypotheses. Extensions to the Kalman filter to handle multiple data associations work satisfactorily in the simple case of point targets, but do not extend naturally to continuous curves. A new, stochastic algorithm is proposed here, the Condensation algorithm — Conditional Density Propagation over time. It uses ‘factored sampling’, a method previously applied to interpretation of static images, in which the distribution of possible interpretations is represented by a randomly generated set of representatives. The Condensation algorithm combines factored sampling with learned dynamical models to propagate an entire probability distribution for object position and shape, over time. The result is highly robust tracking of agile motion in clutter, markedly superior to what has previously been attainable from Kalman filtering. Notwithstanding the use of stochastic methods, the algorithm runs in near real-time."
            },
            "slug": "Contour-Tracking-by-Stochastic-Propagation-of-Isard-Blake",
            "title": {
                "fragments": [],
                "text": "Contour Tracking by Stochastic Propagation of Conditional Density"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The Condensation algorithm combines factored sampling with learned dynamical models to propagate an entire probability distribution for object position and shape, over time, and is markedly superior to what has previously been attainable from Kalman filtering."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144854796"
                        ],
                        "name": "D. Gavrila",
                        "slug": "D.-Gavrila",
                        "structuredName": {
                            "firstName": "Dariu",
                            "lastName": "Gavrila",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gavrila"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1762260"
                        ],
                        "name": "V. Philomin",
                        "slug": "V.-Philomin",
                        "structuredName": {
                            "firstName": "Vasanth",
                            "lastName": "Philomin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Philomin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Experiments demonstrate the effectiveness of the M2 model in two domains: tracking walking people using chamfer distances on binary edge images and tracking mouth movements by means of a shuffle distance."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "A given image z is to be approximated, in the familiar pattern theoretic manner [20], as an ideal image or object x 2 X that has been subjected to a geometrical transformation T from a continuous set 2 A, i.e.,\nz T x: (1)"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 69
                            }
                        ],
                        "text": "In this case, the measure (x; ~x) used is a (non-symmetric) “chamfer” distance [12]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 766556,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bb490d879512b3d43b267e3ac8931c099a5a2fd3",
            "isKey": false,
            "numCitedBy": 760,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents an efficient shape-based object detection method based on Distance Transforms and describes its use for real-time vision on-board vehicles. The method uses a template hierarchy to capture the variety of object shapes; efficient hierarchies can be generated offline for given shape distributions using stochastic optimization techniques (i.e. simulated annealing). Online, matching involves a simultaneous coarse-to-fine approach over the shape hierarchy and over the transformation parameters. Very large speed-up factors are typically obtained when comparing this approach with the equivalent brute-force formulation; we have measured gains of several orders of magnitudes. We present experimental results on the real-time detection of traffic signs and pedestrians from a moving vehicle. Because of the highly time sensitive nature of these vision tasks, we also discuss some hardware-specific implementations of the proposed method as far as SIMD parallelism is concerned."
            },
            "slug": "Real-time-object-detection-for-\"smart\"-vehicles-Gavrila-Philomin",
            "title": {
                "fragments": [],
                "text": "Real-time object detection for \"smart\" vehicles"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "An efficient shape-based object detection method based on Distance Transforms is presented and its use for real-time vision on-board vehicles and some hardware-specific implementations of the proposed method as far as SIMD parallelism is concerned are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Seventh IEEE International Conference on Computer Vision"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713089"
                        ],
                        "name": "D. Huttenlocher",
                        "slug": "D.-Huttenlocher",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Huttenlocher",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Huttenlocher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102957487"
                        ],
                        "name": "Jae J. Noh",
                        "slug": "Jae-J.-Noh",
                        "structuredName": {
                            "firstName": "Jae",
                            "lastName": "Noh",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jae J. Noh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116003"
                        ],
                        "name": "W. Rucklidge",
                        "slug": "W.-Rucklidge",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Rucklidge",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Rucklidge"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "The mixture model above leads to an observation likelihood\np(zjX) p(zj ; k) / 1 Z\nexp (z; T ~xk): (5) If only motion is to be tracked, the hypothesis is simply so the observation likelihood becomes\np(zj ) / X k k 1 Z exp (z; T ~xk);\na mixture with component priors k."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 474612,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "4bba44fd7661f2f1665cd32f7880614ed0303dcf",
            "isKey": false,
            "numCitedBy": 280,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors describe a model-based method for tracking nonrigid objects moving in a complex scene. The method operates by extracting two-dimensional models of an object from a sequence of images. The basic idea underlying the technique is to decompose the image of a solid object moving in space into two components: a two-dimensional motion and a two-dimensional shape change. The motion component is factored out and the shape change is represented explicitly by a sequence of two-dimensional models, one corresponding to each image frame. The major assumption underlying the method is that the two-dimensional shape of an object will change slowly from one frame to the next. There is no assumption, however, that the two-dimensional image motion between successive frames will be small.<<ETX>>"
            },
            "slug": "Tracking-non-rigid-objects-in-complex-scenes-Huttenlocher-Noh",
            "title": {
                "fragments": [],
                "text": "Tracking non-rigid objects in complex scenes"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "A model-based method for tracking nonrigid objects moving in a complex scene by extracting two-dimensional models of an object from a sequence of images to decompose the image of a solid object moving in space into two components."
            },
            "venue": {
                "fragments": [],
                "text": "1993 (4th) International Conference on Computer Vision"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1926674"
                        ],
                        "name": "G. Storvik",
                        "slug": "G.-Storvik",
                        "structuredName": {
                            "firstName": "Geir",
                            "lastName": "Storvik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Storvik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 65
                            }
                        ],
                        "text": "Principally, it provides alternatives to standard learning algorithms by allowing the use of metrics that are not embedded in a vector space."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 7829773,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2da4e0c66ed3ec205cfd7f50aeabffc10f6cace6",
            "isKey": false,
            "numCitedBy": 203,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "In many applications of image analysis, simply connected objects are to be located in noisy images. During the last 5-6 years active contour models have become popular for finding the contours of such objects. Connected to these models are iterative algorithms for finding the minimizing energy curves making the curves behave dynamically through the iterations. These approaches do however have several disadvantages. The numerical algorithms that are in use constrain the models that can be used. Furthermore, in many cases only local minima can be achieved. In this paper, the author discusses a method for curve detection based on a fully Bayesian approach. A model for image contours which allows the number of nodes on the contours to vary is introduced. Iterative algorithms based on stochastic sampling is constructed, which make it possible to simulate samples from the posterior distribution, making estimates and uncertainty measures of specific quantities available. Further, simulated annealing schemes making the curve move dynamically towards the global minimum energy configuration are presented. In theory, no restrictions on the models are made. In practice, however, computational aspects must be taken into consideration when choosing the models. Much more general models than the one used for active contours may however be applied. The approach is applied to ultrasound images of the left ventricle and to magnetic resonance images of the human brain, and show promising results. >"
            },
            "slug": "A-Bayesian-Approach-to-Dynamic-Contours-Through-and-Storvik",
            "title": {
                "fragments": [],
                "text": "A Bayesian Approach to Dynamic Contours Through Stochastic Sampling and Simulated Annealing"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A model for image contours which allows the number of nodes on the contours to vary is introduced, and Iterative algorithms based on stochastic sampling are constructed, which make it possible to simulate samples from the posterior distribution, making estimates and uncertainty measures of specific quantities available."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1734027"
                        ],
                        "name": "Kiriakos N. Kutulakos",
                        "slug": "Kiriakos-N.-Kutulakos",
                        "structuredName": {
                            "firstName": "Kiriakos",
                            "lastName": "Kutulakos",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kiriakos N. Kutulakos"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 34,
                                "start": 30
                            }
                        ],
                        "text": "For robustness we will use a “shuffle distance” [19], in which each pixel in one image is first associated with the most similar pixel in a neighbourhood around the corresponding pixel in the other image."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 12855265,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "2f9d8a89064358ac046327aa59936ed3af39db83",
            "isKey": false,
            "numCitedBy": 116,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper introduces a new mult-iview reconstruction problem called approximate N-view stereo. The goal of this problem is to recover a one-parameter family of volumes that are increasingly tighter supersets of an unknown, arbitrarily-shaped 3D scene. By studying 3D shapes that reproduce the input photographs up to a special image transformation called a shuffle transformation, we prove that (1) these shapes can be organized hierarchically into nested supersets of the scene, and (2) they can be computed using a simple algorithm called Approximate Space Carving that is provably-correct for arbitrary discrete scenes (i.e., for unknown, arbitrarily-shaped Lambertian scenes that are defined by a finite set of voxels and are viewed from N arbitrarily-distributed viewpoints inside or around them). The approach is specifically designed to attack practical reconstruction problems, including (1) recovering shape from images with inaccurate calibration information, and (2) building coarse scene models from multiple views."
            },
            "slug": "Approximate-N-View-Stereo-Kutulakos",
            "title": {
                "fragments": [],
                "text": "Approximate N-View Stereo"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper proves that by studying 3D shapes that reproduce the input photographs up to a special image transformation called a shuffle transformation, these shapes can be organized hierarchically into nested supersets of the scene, and they can be computed using a simple algorithm called Approximate Space Carving."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144549270"
                        ],
                        "name": "M. Brand",
                        "slug": "M.-Brand",
                        "structuredName": {
                            "firstName": "Matthew",
                            "lastName": "Brand",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brand"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Experiments demonstrate the effectiveness of the M2 model in two domains: tracking walking people using chamfer distances on binary edge images and tracking mouth movements by means of a shuffle distance."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 45365612,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "13a1d20381ef248068a881ebab27d1fe60cf3228",
            "isKey": false,
            "numCitedBy": 256,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "The mapping between 3D body poses and 2D shadows is fundamentally many-to-many and defeats regression methods, even with windowed context. We show how to learn a function between paths in the two systems, resolving ambiguities by integrating information over the entire length of a sequence. The basis of this function is a configural and dynamical manifold that summarizes the target system's behaviour. This manifold can be modeled from data with a hidden Markov model having special topological properties that we obtain via entropy minimization. Inference is then a matter of solving for the geodesic on the manifold that best explains the evidence in the cue sequence. We give a closed-form maximum a posteriori solution for geodesics through the learned density space, thereby obtaining optimal paths over the dynamical manifold. These methods give a completely general way to perform inference over time-series; in vision they support analysis, recognition, classification and synthesis of behaviours in linear time. We demonstrate with a prototype that infers 3D from monocular monochromatic sequences (e.g., back-subtractions), without using any articulatory body model. The framework readily accommodates multiple cameras and other sources of evidence such as optical flow or feature tracking."
            },
            "slug": "Shadow-puppetry-Brand",
            "title": {
                "fragments": [],
                "text": "Shadow puppetry"
            },
            "tldr": {
                "abstractSimilarityScore": 36,
                "text": "A closed-form maximum a posteriori solution for geodesics through the learned density space, thereby obtaining optimal paths over the dynamical manifold gives a completely general way to perform inference over time-series."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Seventh IEEE International Conference on Computer Vision"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2592057"
                        ],
                        "name": "B. Bascle",
                        "slug": "B.-Bascle",
                        "structuredName": {
                            "firstName": "B.",
                            "lastName": "Bascle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Bascle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1702017"
                        ],
                        "name": "R. Deriche",
                        "slug": "R.-Deriche",
                        "structuredName": {
                            "firstName": "Rachid",
                            "lastName": "Deriche",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Deriche"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 4
                            }
                        ],
                        "text": "The Metric Mixture approach combines the advantages of exemplar-based models [12] with a probabilistic framework [11] into a single probabilistic exemplar-based paradigm."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 208,
                                "start": 202
                            }
                        ],
                        "text": "Where the observations are curves, this induces a transformation\nrz(s) = T rx(s)\nand in the case of patches, the induced transformation is\nIz(T r) = Ix(r):\n0-7695-1143-0/01 $10.00 (C) 2001 IEEE\n3.3 The Metric Mixture (M2) Model\nThe observation likelihood functions, at the heart of the M2 approach, can now be specified."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 15
                            }
                        ],
                        "text": "We propose the Metric Mixture (M2) model, described below, to solve this problem."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 120
                            }
                        ],
                        "text": "Using exemplars in place of a parameterized model poses several challenges, addressed here with what we call the “Metric Mixture” (M2) approach."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2487409,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "e65eefd6346c64fd7784ee43351b2e16853b8f88",
            "isKey": true,
            "numCitedBy": 146,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "The paper describes an approach to the tracking of complex shapes through image sequences, that combines deformable region models and deformable contours. A deformable region model is presented: its optimisation is based on texture correlation and is constrained by the use of a motion model, such as rigid, affine or homographic. The use of texture information (versus edge information) noticeably improves the tracking performances of deformable models in the presence of texture. Then the region contour is refined using an edge based deformable model in order to better deal with specularities, non planar objects and occlusions. The method is illustrated and validated by experimental results on real images.<<ETX>>"
            },
            "slug": "Region-tracking-through-image-sequences-Bascle-Deriche",
            "title": {
                "fragments": [],
                "text": "Region tracking through image sequences"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "An approach to the tracking of complex shapes through image sequences, that combines deformable region models and deformable contours is described, which noticeably improves the tracking performances of deformable models in the presence of texture."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE International Conference on Computer Vision"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749650"
                        ],
                        "name": "B. Frey",
                        "slug": "B.-Frey",
                        "structuredName": {
                            "firstName": "Brendan",
                            "lastName": "Frey",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Frey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698689"
                        ],
                        "name": "N. Jojic",
                        "slug": "N.-Jojic",
                        "structuredName": {
                            "firstName": "Nebojsa",
                            "lastName": "Jojic",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Jojic"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Experiments demonstrate the effectiveness of the M2 model in two domains: tracking walking people using chamfer distances on binary edge images and tracking mouth movements by means of a shuffle distance."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 203,
                                "start": 199
                            }
                        ],
                        "text": "…z; i.e., each component is a distribution p(zjX), where X = ( ; k) The details of this density, and the algorithm for learning it, constitute a new approach to the vexed question of how to model image observations probabilistically without tripping over the issue of statistical independence."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17496442,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f9252977eb13c12b3eeade1fce08653a2367e9e5",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Mixtures of Gaussians, factor analyzers (probabilistic PCA) and hidden Markov models are staples of static and dynamic data modeling and image and video modeling in particular. We show how topographic transformations in the input, such as translation and shearing in images, can be accounted for in these models by including a discrete transformation variable. The resulting models perform clustering, dimensionality reduction and time-series analysis in a way that is invariant to transformations in the input. Using the EM algorithm, these transformation invariant models can be fit to static data and time series. We give results on filtering microscopy images, face and facial pose clustering, handwritten digit modeling and recognition, video clustering, object tracking, and removal of distractions from video sequences."
            },
            "slug": "Learning-Graphical-Models-of-Images,-Videos-and-Frey-Jojic",
            "title": {
                "fragments": [],
                "text": "Learning Graphical Models of Images, Videos and Their Spatial Transformations"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "Mixtures of Gaussians, factor analyzers, and hidden Markov models are shown how topographic transformations in the input, such as translation and shearing in images, can be accounted for in these models by including a discrete transformation variable."
            },
            "venue": {
                "fragments": [],
                "text": "UAI"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1708660"
                        ],
                        "name": "A. Amini",
                        "slug": "A.-Amini",
                        "structuredName": {
                            "firstName": "Amir",
                            "lastName": "Amini",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Amini"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32885803"
                        ],
                        "name": "S. Tehrani",
                        "slug": "S.-Tehrani",
                        "structuredName": {
                            "firstName": "Saeid",
                            "lastName": "Tehrani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Tehrani"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3164501"
                        ],
                        "name": "T. Weymouth",
                        "slug": "T.-Weymouth",
                        "structuredName": {
                            "firstName": "Terry",
                            "lastName": "Weymouth",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Weymouth"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "There is, of course, a substantial literature on tracking, driven either by image features [1, 18] or by raw intensity [3, 4, 15], or both [7]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 26936234,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "46df9c3bb6f44cea6d5ea31d628215968d2e0ef1",
            "isKey": false,
            "numCitedBy": 272,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Energy-Minimizing Active Contour Models (snakes) have recently been proposed by Kass et al. [8] as a top-down mechanism for locating features of interest in images. The Kass et al.’s algorithm involves four steps: setting up a variational integral on the continuous plane, deriving a pair of Euler equations, discretizing them, and solving the discrete equations iteratively until convergence. This algorithm suffers from a number of problems. We discuss these problems and present an algoIithm for active contours based on dynamic programming. The optimization problem is set up as a discrete multi-stage decision process and is solved by a “time-delayed” discrete dynamic programming algorithm. This formulation leads to a stable behavior for the active contours over iterations, in addition to allowing for hard constraints to be enforced on the behavior of the solution. Results of the application of the proposed algorithm to real images is presented."
            },
            "slug": "Using-Dynamic-Programming-For-Minimizing-The-Energy-Amini-Tehrani",
            "title": {
                "fragments": [],
                "text": "Using Dynamic Programming For Minimizing The Energy Of Active Contours In The Presence Of Hard Constraints"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The optimization problem is set up as a discrete multi-stage decision process and is solved by a “time-delayed” discrete dynamic programming algorithm, which leads to a stable behavior for the active contours over iterations, in addition to allowing for hard constraints to be enforced on the behavior of the solution."
            },
            "venue": {
                "fragments": [],
                "text": "[1988 Proceedings] Second International Conference on Computer Vision"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49649079"
                        ],
                        "name": "D. Field",
                        "slug": "D.-Field",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Field",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Field"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Experiments demonstrate the effectiveness of the M2 model in two domains: tracking walking people using chamfer distances on binary edge images and tracking mouth movements by means of a shuffle distance."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1600874,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aeb37769d72999bcbfb0582b73607fd8d23f4545",
            "isKey": false,
            "numCitedBy": 3274,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "The relative efficiency of any particular image-coding scheme should be defined only in relation to the class of images that the code is likely to encounter. To understand the representation of images by the mammalian visual system, it might therefore be useful to consider the statistics of images from the natural environment (i.e., images with trees, rocks, bushes, etc). In this study, various coding schemes are compared in relation to how they represent the information in such natural images. The coefficients of such codes are represented by arrays of mechanisms that respond to local regions of space, spatial frequency, and orientation (Gabor-like transforms). For many classes of image, such codes will not be an efficient means of representing information. However, the results obtained with six natural images suggest that the orientation and the spatial-frequency tuning of mammalian simple cells are well suited for coding the information in such images if the goal of the code is to convert higher-order redundancy (e.g., correlation between the intensities of neighboring pixels) into first-order redundancy (i.e., the response distribution of the coefficients). Such coding produces a relatively high signal-to-noise ratio and permits information to be transmitted with only a subset of the total number of cells. These results support Barlow's theory that the goal of natural vision is to represent the information in the natural environment with minimal redundancy."
            },
            "slug": "Relations-between-the-statistics-of-natural-images-Field",
            "title": {
                "fragments": [],
                "text": "Relations between the statistics of natural images and the response properties of cortical cells."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The results obtained with six natural images suggest that the orientation and the spatial-frequency tuning of mammalian simple cells are well suited for coding the information in such images if the goal of the code is to convert higher-order redundancy into first- order redundancy."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768236"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Freeman",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1891751"
                        ],
                        "name": "E. Pasztor",
                        "slug": "E.-Pasztor",
                        "structuredName": {
                            "firstName": "Egon",
                            "lastName": "Pasztor",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Pasztor"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Experiments demonstrate the effectiveness of the M2 model in two domains: tracking walking people using chamfer distances on binary edge images and tracking mouth movements by means of a shuffle distance."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 60327,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "ea2e5eb93f194ebf8a5c350cb5e20c63a66ff6bd",
            "isKey": false,
            "numCitedBy": 81,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "We seek the scene interpretation that best explains image data. For example, we may want to infer the projected velocities (scene) which best explain two consecutive image frames (image). From synthetic data, we model the relationship between image and scene patches, and between a scene patch and neighboring scene patches. Given a new image, we propagate likelihoods in a Markov network (ignoring the effect of loops) to infer the underlying scene. This yields an efficient method to form low-level scene interpretations. We demonstrate the technique for motion analysis and estimating high resolution images from low-resolution ones."
            },
            "slug": "Learning-to-Estimate-Scenes-from-Images-Freeman-Pasztor",
            "title": {
                "fragments": [],
                "text": "Learning to Estimate Scenes from Images"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "From synthetic data, the relationship between image and scene patches is modeled, and between a scene patch and neighboring scene patches, and this yields an efficient method to form low-level scene interpretations."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144998829"
                        ],
                        "name": "N. Gordon",
                        "slug": "N.-Gordon",
                        "structuredName": {
                            "firstName": "Neil",
                            "lastName": "Gordon",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Gordon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144775895"
                        ],
                        "name": "D. Salmond",
                        "slug": "D.-Salmond",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Salmond",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Salmond"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2109352679"
                        ],
                        "name": "Adrian F. M. Smith",
                        "slug": "Adrian-F.-M.-Smith",
                        "structuredName": {
                            "firstName": "Adrian",
                            "lastName": "Smith",
                            "middleNames": [
                                "F.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Adrian F. M. Smith"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12644877,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5794f07b2ce5a04241198d42e81623380d2c7e2e",
            "isKey": false,
            "numCitedBy": 7793,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm, the bootstrap filter, is proposed for implementing recursive Bayesian filters. The required density of the state vector is represented as a set of random samples, which are updated and propagated by the algorithm. The method is not restricted by assumptions of linear- ity or Gaussian noise: it may be applied to any state transition or measurement model. A simula- tion example of the bearings only tracking problem is presented. This simulation includes schemes for improving the efficiency of the basic algorithm. For this example, the performance of the bootstrap filter is greatly superior to the standard extended Kalman filter."
            },
            "slug": "Novel-approach-to-nonlinear/non-Gaussian-Bayesian-Gordon-Salmond",
            "title": {
                "fragments": [],
                "text": "Novel approach to nonlinear/non-Gaussian Bayesian state estimation"
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "An algorithm, the bootstrap filter, is proposed for implementing recursive Bayesian filters, represented as a set of random samples, which are updated and propagated by the algorithm."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117481816"
                        ],
                        "name": "D. Mumford",
                        "slug": "D.-Mumford",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mumford",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mumford"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 18,
                                "start": 14
                            }
                        ],
                        "text": "Many such tracking algorithms, however, demand that complex models be defined and trained for each object class to be tracked – a process that is often laborious and difficult to automate fully."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14031538,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "ab30727628a021657ed0d997449eced41af01599",
            "isKey": false,
            "numCitedBy": 146,
            "numCiting": 59,
            "paperAbstract": {
                "fragments": [],
                "text": "The term “Pattern Theory” was introduced by Ulf Grenander in the 70s as a name for a field of applied mathematics which gave a theoretical setting for a large number of related ideas, techniques and results from fields such as computer vision, speech recognition, image and acoustic signal processing, pattern recognition and its statistical side, neural nets and parts of artificial intelligence (see [Grenander 76–81]). When I first began to study computer vision about ten years ago, I read parts of this book but did not really understand his insight. However, as I worked in the field, every time I felt I saw what was going on in a broader perspective or saw some theme which seemed to pull together the field as a whole, it turned out that this theme was part of what Grenander called pattern theory. It seems to me now that this is the right framework for these areas, and, as these fields have been growing explosively, the time is ripe for making an attempt to reexamine recent progress and try to make the ideas behind this unification better known. This article presents pattern theory from my point of view, which may be somewhat narrower than Grenander’s, updated with recent examples involving interesting new mathematics."
            },
            "slug": "Pattern-theory:-a-unifying-perspective-Mumford",
            "title": {
                "fragments": [],
                "text": "Pattern theory: a unifying perspective"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7205190"
                        ],
                        "name": "Tim Cootes",
                        "slug": "Tim-Cootes",
                        "structuredName": {
                            "firstName": "Tim",
                            "lastName": "Cootes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tim Cootes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50564384"
                        ],
                        "name": "G. Edwards",
                        "slug": "G.-Edwards",
                        "structuredName": {
                            "firstName": "Gareth",
                            "lastName": "Edwards",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Edwards"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144482985"
                        ],
                        "name": "C. Taylor",
                        "slug": "C.-Taylor",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Taylor",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Taylor"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 193,
                                "start": 190
                            }
                        ],
                        "text": "…learned from a training image sequence Z = fz 1 ; : : : ; z T g. Images may be preprocessed for ease of analysis, for example by filtering to produce an intensity image with certain features (e.g., ridges) enhanced, or nonlinearly filtered to produce a sparse binary image with edge pixels marked."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 144,
                                "start": 142
                            }
                        ],
                        "text": "Using exemplars in place of a parameterized model poses several challenges, addressed here with what we call the “Metric Mixture” (M2) approach."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 152,
                                "start": 149
                            }
                        ],
                        "text": "While distraction is not a problem, the complex articulations of the mouth make tracking difficult (even state-of-the-art face-tracking algorithms [7, 21] have difficulty tracking lip and tongue articulation)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2230657,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "76b532e2cb573fdf29f3ae68dc1372f3319c93c2",
            "isKey": false,
            "numCitedBy": 3786,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a new method of matching statistical models of appearance to images. A set of model parameters control modes of shape and gray-level variation learned from a training set. We construct an efficient iterative matching algorithm by learning the relationship between perturbations in the model parameters and the induced image errors."
            },
            "slug": "Active-Appearance-Models-Cootes-Edwards",
            "title": {
                "fragments": [],
                "text": "Active Appearance Models"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "A new method of matching statistical models of appearance to images by learning the relationship between perturbations in the model parameters and the induced image errors is described."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34437150"
                        ],
                        "name": "Li-yi Wei",
                        "slug": "Li-yi-Wei",
                        "structuredName": {
                            "firstName": "Li-yi",
                            "lastName": "Wei",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Li-yi Wei"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1801789"
                        ],
                        "name": "M. Levoy",
                        "slug": "M.-Levoy",
                        "structuredName": {
                            "firstName": "Marc",
                            "lastName": "Levoy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Levoy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3131710,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e1e1a39534aed2cf4894896de75d0ba1fa75ab6a",
            "isKey": false,
            "numCitedBy": 1601,
            "numCiting": 73,
            "paperAbstract": {
                "fragments": [],
                "text": "Texture synthesis is important for many applications in computer graphics, vision, and image processing. However, it remains difficult to design an algorithm that is both efficient and capable of generating high quality results. In this paper, we present an efficient algorithm for realistic texture synthesis. The algorithm is easy to use and requires only a sample texture as input. It generates textures with perceived quality equal to or better than those produced by previous techniques, but runs two orders of magnitude faster. This permits us to apply texture synthesis to problems where it has traditionally been considered impractical. In particular, we have applied it to constrained synthesis for image editing and temporal texture generation. Our algorithm is derived from Markov Random Field texture models and generates textures through a deterministic searching process. We accelerate this synthesis process using tree-structured vector quantization."
            },
            "slug": "Fast-texture-synthesis-using-tree-structured-vector-Wei-Levoy",
            "title": {
                "fragments": [],
                "text": "Fast texture synthesis using tree-structured vector quantization"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper presents an efficient algorithm for realistic texture synthesis derived from Markov Random Field texture models and generates textures through a deterministic searching process that accelerates this synthesis process using tree-structured vector quantization."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '00"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1763086"
                        ],
                        "name": "Alexei A. Efros",
                        "slug": "Alexei-A.-Efros",
                        "structuredName": {
                            "firstName": "Alexei",
                            "lastName": "Efros",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alexei A. Efros"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145266088"
                        ],
                        "name": "T. Leung",
                        "slug": "T.-Leung",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Leung",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Leung"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Experiments demonstrate the effectiveness of the M2 model in two domains: tracking walking people using chamfer distances on binary edge images and tracking mouth movements by means of a shuffle distance."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 221583955,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bba3264d6794538381687ad6e151a7f42f3872a9",
            "isKey": false,
            "numCitedBy": 1647,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "A non-parametric method for texture synthesis is proposed. The texture synthesis process grows a new image outward from an initial seed, one pixel at a time. A Markov random field model is assumed, and the conditional distribution of a pixel given all its neighbors synthesized so far is estimated by querying the sample image and finding all similar neighborhoods. The degree of randomness is controlled by a single perceptually intuitive parameter. The method aims at preserving as much local structure as possible and produces good results for a wide variety of synthetic and real-world textures."
            },
            "slug": "Texture-synthesis-by-non-parametric-sampling-Efros-Leung",
            "title": {
                "fragments": [],
                "text": "Texture synthesis by non-parametric sampling"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "A non-parametric method for texture synthesis that aims at preserving as much local structure as possible and produces good results for a wide variety of synthetic and real-world textures."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Seventh IEEE International Conference on Computer Vision"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144517651"
                        ],
                        "name": "T. Vetter",
                        "slug": "T.-Vetter",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Vetter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Vetter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 198,
                                "start": 194
                            }
                        ],
                        "text": "…learned from a training image sequence Z = fz 1 ; : : : ; z T g. Images may be preprocessed for ease of analysis, for example by filtering to produce an intensity image with certain features (e.g., ridges) enhanced, or nonlinearly filtered to produce a sparse binary image with edge pixels marked."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 26288947,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "688da1cdc435eadaed83a564ae2c30de4f216e59",
            "isKey": false,
            "numCitedBy": 60,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "The need to generate new views of a 3D object from a single real image arises in several fields, including graphics and object recognition. While the traditional approach relies on the use of 3D models, we exploit 2D image transformations that are specific to the relevant object class and learnable from example views of other “prototypical” objects of the same class."
            },
            "slug": "Image-Synthesis-from-a-Single-Example-Image-Vetter-Poggio",
            "title": {
                "fragments": [],
                "text": "Image Synthesis from a Single Example Image"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "This work exploits 2D image transformations that are specific to the relevant object class and learnable from example views of other “prototypical” objects of the same class."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712517"
                        ],
                        "name": "L. Rabiner",
                        "slug": "L.-Rabiner",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Rabiner",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Rabiner"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13618539,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "8fe2ea0a67954f1380b3387e3262f1cdb9f9b3e5",
            "isKey": false,
            "numCitedBy": 24804,
            "numCiting": 98,
            "paperAbstract": {
                "fragments": [],
                "text": "The fabric comprises a novel type of netting which will have particular utility in screening out mosquitoes and like insects and pests. The fabric is defined of voids having depth as well as width and length. The fabric is usable as a material from which to form clothing for wear, or bed coverings, or sleeping bags, etc., besides use simply as a netting."
            },
            "slug": "A-Tutorial-on-Hidden-Markov-Models-and-Selected-Rabiner",
            "title": {
                "fragments": [],
                "text": "A Tutorial on Hidden Markov Models and Selected Applications"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The fabric comprises a novel type of netting which will have particular utility in screening out mosquitoes and like insects and pests."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145317070"
                        ],
                        "name": "A. Haddad",
                        "slug": "A.-Haddad",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Haddad",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Haddad"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 298,
                                "start": 294
                            }
                        ],
                        "text": "…fixed time-series data, and used to learn two components (assumed independent) of p(XtjXt 1):\n1. a Markov matrix M for p(ktjkt 1), learned by histogramming transitions; 2. a first order auto-regressive process (ARP) for p( tj t 1), with coefficients calculated using the Yule-Walker algorithm [13]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 36107084,
            "fieldsOfStudy": [
                "Engineering",
                "Mathematics"
            ],
            "id": "d6fb0f67eb2cc76bc88b8422918c165d6dd55890",
            "isKey": false,
            "numCitedBy": 1896,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Optimal FilteringIntroduction to Random Signals and Applied Kalman Filtering with Matlab Exercises and SolutionsApplied Optimal ControlInverse Problem Theory and Methods for Model Parameter EstimationBayesian Estimation and TrackingInverse Methods for Atmospheric SoundingOptimal ControlBayesian Filtering and SmoothingStatistical Orbit DeterminationEstimation and Control of Dynamical SystemsPractical Methods for Optimal Control and Estimation Using Nonlinear ProgrammingApplied Optimal ControlOptimal Control and EstimationOptimal Estimation of Dynamic SystemsOptimal State EstimationOptimal Estimation of Dynamic SystemsBeyond the Kalman Filter: Particle Filters for Tracking ApplicationsEstimation with Applications to Tracking and NavigationApplied Optimal EstimationKalman FilteringProgress in Astronautics and AeronauticsMethods of Model Based Process ControlAn Engineering Approach to Optimal Control and Estimation TheoryOptimal and Robust EstimationApplied Optimal EstimationOptimal Control and EstimationStochastic Processes and Filtering TheoryOptimal Estimation of Dynamic Systems, Second EditionAn Introduction to Optimal Estimation of Dynamical SystemsState Estimation for Dynamic SystemsState Estimation for RoboticsApplied State Estimation and AssociationContinuous Time Dynamical SystemsApplied Optimal Control & EstimationOptimal State Estimation for Process Monitoring, Fault Diagnosis and ControlEstimation, Control, and the Discrete Kalman FilterKalman FiltersState Estimation in ChemometricsStochastic Models, Estimation, and ControlApplied optimal estimation"
            },
            "slug": "Applied-optimal-estimation-Haddad",
            "title": {
                "fragments": [],
                "text": "Applied optimal estimation"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47934783"
                        ],
                        "name": "J. Davenport",
                        "slug": "J.-Davenport",
                        "structuredName": {
                            "firstName": "Janina",
                            "lastName": "Davenport",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Davenport"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 121
                            }
                        ],
                        "text": "a first order auto-regressive process (ARP) for p( tj t 1), with coefficients calculated using the Yule-Walker algorithm [13]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 220072940,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "56b332dc42f9bb3f3202e53eb6a9a63147bc6564",
            "isKey": false,
            "numCitedBy": 5209,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Editor-Davenport",
            "title": {
                "fragments": [],
                "text": "Editor"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 48,
                                "start": 43
                            }
                        ],
                        "text": "We thank P. Anandan, Brendan Frey, Nebojsa Jojic, Neil Lawrence, and Chris Williams for stimulating discussions; John MacCormick kindly provided video data."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 90,
                                "start": 72
                            }
                        ],
                        "text": "The use of exemplars offers an alternative that can tackle this problem [6, 8, 10, 11, 12]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 113
                            }
                        ],
                        "text": "The Metric Mixture approach combines the advantages of exemplar-based models [12] with a probabilistic framework [11] into a single probabilistic exemplar-based paradigm."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 19,
                                "start": 15
                            }
                        ],
                        "text": "Frey and Jojic [11] have demonstrated elegantly how exemplars can be embedded in learned probabilistic models by treating them as centers in probabilistic mixtures."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 104,
                                "start": 100
                            }
                        ],
                        "text": "The probabilistic dependency structure for the M(2) model is depicted in Figure 2 and is similar to [11]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 106,
                                "start": 102
                            }
                        ],
                        "text": "The problem, therefore, is to combine exemplars in a metric space [12] with a probabilistic treatment [11], retaining the best features of each approach."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Learning graphical models of images"
            },
            "venue": {
                "fragments": [],
                "text": "videos and their spatial transformations. In Proc. Conf. Uncertainty in Artificial Intelligence"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 18,
                                "start": 4
                            }
                        ],
                        "text": "The Metric Mixture approach combines the advantages of exemplar-based models [12] with a probabilistic framework [11] into a single probabilistic exemplar-based paradigm."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 216,
                                "start": 202
                            }
                        ],
                        "text": "Where the observations are curves, this induces a transformation\nrz(s) = T rx(s)\nand in the case of patches, the induced transformation is\nIz(T r) = Ix(r):\n0-7695-1143-0/01 $10.00 (C) 2001 IEEE\n3.3 The Metric Mixture (M2) Model\nThe observation likelihood functions, at the heart of the M2 approach, can now be specified."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 29,
                                "start": 15
                            }
                        ],
                        "text": "We propose the Metric Mixture (M2) model, described below, to solve this problem."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 132,
                                "start": 128
                            }
                        ],
                        "text": "Using exemplars in place of a parameterized model poses several challenges, addressed here with what we call the “Metric Mixture” (M2) approach."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Xvision: combining image warping and geometric constraints for fast tracking"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. 4th European Conf. Computer Vision"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117481816"
                        ],
                        "name": "D. Mumford",
                        "slug": "D.-Mumford",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mumford",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mumford"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 119864896,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "13f9fa9c8f65f5bc501b18bfec10037573701bb0",
            "isKey": false,
            "numCitedBy": 33,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Perception-as-Bayesian-Inference:-Pattern-theory:-A-Mumford",
            "title": {
                "fragments": [],
                "text": "Perception as Bayesian Inference: Pattern theory: A unifying perspective"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1717841"
                        ],
                        "name": "R. Szeliski",
                        "slug": "R.-Szeliski",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Szeliski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Szeliski"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 43,
                                "start": 39
                            }
                        ],
                        "text": "Principally, it provides alternatives to standard learning algorithms by allowing the use of metrics that are not embedded in a vector space."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 61134880,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bd13c71fa6a6242e702041d54eadd7f4cb19108e",
            "isKey": false,
            "numCitedBy": 423,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Tracking-with-Kalman-snakes-Terzopoulos-Szeliski",
            "title": {
                "fragments": [],
                "text": "Tracking with Kalman snakes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145162067"
                        ],
                        "name": "A. Blake",
                        "slug": "A.-Blake",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Blake",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Blake"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2090818"
                        ],
                        "name": "M. Isard",
                        "slug": "M.-Isard",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Isard",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Isard"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 62,
                                "start": 59
                            }
                        ],
                        "text": "In line with recent developments in probabilistic tracking [5], sequences of estimated Xt from a training set are treated as if they were fixed time-series data, and used to learn two components (assumed independent) of p(XtjXt 1):\n1. a Markov matrix M for p(ktjkt 1), learned by histogramming…"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 6566027,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a90110adc8b77f2d8116500a4e92a6cb602457c9",
            "isKey": false,
            "numCitedBy": 1027,
            "numCiting": 211,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Active-Contours-Blake-Isard",
            "title": {
                "fragments": [],
                "text": "Active Contours"
            },
            "venue": {
                "fragments": [],
                "text": "Springer London"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Selected Topics in Vision & Learning"
            },
            "venue": {
                "fragments": [],
                "text": "Selected Topics in Vision & Learning"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Advanced topics in computer and human vision"
            },
            "venue": {
                "fragments": [],
                "text": "Advanced topics in computer and human vision"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 91
                            }
                        ],
                        "text": "There is, of course, a substantial literature on tracking, driven either by image features [1, 18] or by raw intensity [3, 4, 15], or both [7]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "and T"
            },
            "venue": {
                "fragments": [],
                "text": "Weymouth. Using dynamic programming for minimizing the energy of active contours 0-7695-1143-0/01 $10.00 (C) 2001 IEEE  in the presence of hard constraints. In Proc. 2nd Int. Conf. on Computer Vision, pages 95–99"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Visual tracking by stochastic propagation of conditional density"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. 4th European Conf. Computer Vision"
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "IEEE Trans. on Pattern Analysis and Machine Intelligence"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. on Pattern Analysis and Machine Intelligence"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Snakes : Active contour models Approximate N - view stereo"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 91
                            }
                        ],
                        "text": "Using exemplars in place of a parameterized model poses several challenges, addressed here with what we call the “Metric Mixture” (M2) approach."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Using dynamic programming for minimizing the energy of active contours 0-7695-1143-0/01 $10.00 (C) 2001 IEEE in the presence of hard constraints"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. 2nd Int. Conf. on Computer Vision"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Appendix Quadratic Chamfer distance has a scaled ¾ distribution . We have"
            },
            "venue": {
                "fragments": [],
                "text": "Appendix Quadratic Chamfer distance has a scaled ¾ distribution . We have"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 157,
                                "start": 153
                            }
                        ],
                        "text": "While distraction is not a problem, the complex articulations of the mouth make tracking difficult (even state-of-the-art face-tracking algorithms [7, 21] have difficulty tracking lip and tongue articulation)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Siggraph Demo Session"
            },
            "venue": {
                "fragments": [],
                "text": "Siggraph Demo Session"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 154,
                                "start": 147
                            }
                        ],
                        "text": "While distraction is not a problem, the complex articulations of the mouth make tracking difficult (even state-of-the-art face-tracking algorithms [7, 21] have difficulty tracking lip and tongue articulation)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "In Siggraph Demo Session"
            },
            "venue": {
                "fragments": [],
                "text": "Los Angeles"
            },
            "year": 2000
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 16,
            "methodology": 11
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 35,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Probabilistic-tracking-in-a-metric-space-Toyama-Blake/7bfe222d83e9dd9117bc4f8508962a01fb0b1626?sort=total-citations"
}