{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2235827"
                        ],
                        "name": "U. Dräger",
                        "slug": "U.-Dräger",
                        "structuredName": {
                            "firstName": "Ursula",
                            "lastName": "Dräger",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Dräger"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 13
                            }
                        ],
                        "text": "In the mouse (Drager 1975) cells with orientation specificity are common but in contrast to the cat and monkey form only about 50% of the population."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 20737809,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "f4fc3f1d05553603b5ffa1316e756bd57685359c",
            "isKey": false,
            "numCitedBy": 399,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "The visual cortex was studied in the mouse (C57 Black/6J strain) by recording from single units, and a topographic map of the visual field was constructed. Forty‐five percent of the neurons in striate cortex responded best to oriented line stimuli moving over their receptive fields; they were classified as simple (17%), complex (25%) and hypercomplex (3%). Of all preferred orientations horizontal was most common. Fifty‐five percent of receptive fields were cicularly symmetric: these were on‐center (25%), off‐center (7%) and homogeneous on‐off in type (23%). Optimal stimulus velocities were much higher than those reported in the cat, mostly varying between 20° and 300°/sec. The field of vision common to the two eyes projected to more than one‐third of the striate cortex. Although the contralateral eye provided the dominating influence on cells in this binocular area, more than two‐thirds of cells could also be driven through the ipsilateral eye. The topography of area 17 was similar to that found in other mammals: the upper visual field projected posteriorly, the most nasal part mapped onto the lateral border. Here the projection did not end at the vertical meridian passing through the animal's long axis, but proceeded for at least 10° into the ipsilateral hemifield of vision, so that at least 20° of visual field were represented in both hemispheres. The magnification in area 17 was rather uniform throughout the visual field. In an area latral to area 17 (18a) the fields were projected in condensed mirror image fashion with respect to the arrangement of area 17. Medial to area 17 a third visual area (area 18) was again related to 17 as a condensed mirror image."
            },
            "slug": "Receptive-fields-of-single-cells-and-topography-in-Dräger",
            "title": {
                "fragments": [],
                "text": "Receptive fields of single cells and topography in mouse visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "The visual cortex was studied in the mouse by recording from single units, and a topographic map of the visual field was constructed, and more than two‐thirds of cells could also be driven through the ipsilateral eye."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1035815,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b952bab086707e7bee44f05762393e6b8a951415",
            "isKey": false,
            "numCitedBy": 1241,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "THE RECEPTORS AND NERVE CELLS that make up the visual pathway must convey and interpret information on both the form and the color of retinal images. In higher mammals little is known about the degree to which nerve cells are specialized for handling these types of information. In a visual stimulus the importance of spatial attributes, and especially of dark-light contours, first became obvious with the discovery by Hartline (20 ) of lateral inhibition in the Limulus, a type of study that was extended to mammals when Kuffler (28) demonstrated t,hat the receptive fields of retinal ganglion cells in the cat are subdivided into a center and an opponent surround. The opponent principle, in which spatially separated excitatory and inhibitory regions are pitted against each other, has now been observed for retinal ganglion cells in the frog (1), the lizard (9), the rabbit (3), the rat (4), the ground squirrel (33), and the monkey (24). Similar effects have been seen in the lateral genie ulate bod .y and visual cortex in the cat (23, 25, 26), and also recently at these levels in the monkey. In 1958 De Valois and his collaborators (15) observed geniculate cells in the macaque monkey that were excited by one set of wavelengths and inhibited by another, making it apparent that in higher mammals the spectral composition of the stimulus was also an important variable. Similar opponent-color effects have since been described in the primate at the level of the retin .a1 ganglion cell (24), and in the visual cortex (34). I n the cat the absence or rarity of oppon .ent-color mecha nisms (19, 36 > may be related to an inferior ability to discriminate color (31, 32, 40); indeed since Svaetichin’s (41) original observation of opponent-color responses in the fish retina (Spotentials), similar response patterns have been seen only in animals thought to have good color vision. Given the existence of two opponent mechanisms system, one for the spatial variable and the other for in the monkey visual color, it is natural to ask whether these occupy the same channels, or are confined to separate groups of cells. In the goldfish it is clear from the work of Wagner, MacNichol, and Wolbarsht (43, 45) that opponent-color and opponent-spatial"
            },
            "slug": "Spatial-and-chromatic-interactions-in-the-lateral-Wiesel-Hubel",
            "title": {
                "fragments": [],
                "text": "Spatial and chromatic interactions in the lateral geniculate body of the rhesus monkey."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The opponent principle, in which spatially separated excitatory and inhibitory regions are pitted against each other, has now been observed for retinal ganglion cells in the frog, the lizard, the rabbit, the rat, the ground squirrel, and the monkey."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12432,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3459632"
                        ],
                        "name": "L. Palmer",
                        "slug": "L.-Palmer",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Palmer",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Palmer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4291951"
                        ],
                        "name": "A. Rosenquist",
                        "slug": "A.-Rosenquist",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Rosenquist",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenquist"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37194343,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "9d05ede22c076feaf49bed9741065fc6026f28aa",
            "isKey": false,
            "numCitedBy": 241,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-receptive-fields-of-single-striate-corical-Palmer-Rosenquist",
            "title": {
                "fragments": [],
                "text": "Visual receptive fields of single striate corical units projecting to the superior colliculus in the cat."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 57
                            }
                        ],
                        "text": "The tree shrew shows no hint of ocular-dominance columns (Hubel 1975; Casagrande & Harting 1975)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 154,
                                "start": 142
                            }
                        ],
                        "text": "Autoradiograph of the brain of a tree shrew whose right eye was injected with a tritiated proline-fucose mixture; dark field, coronal section (Hubel 1975)' On the contralateral side (c) layer IV c is labelled throughout its entire thickness; an upper tier oflabel can be seen in layer IVa (to use a terminology analogous to that employed in the macaque)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 1878,
                                "start": 254
                            }
                        ],
                        "text": "In retinal ganglion cells and in cells of the geniculate, for example, the receptive fields, and especially the receptive-field centres, are very small in the most central region and become progressively larger with increasing eccentricity (Wiesel 1960; Hubel & Wiesel 1960, 1961; Wiesel & Hubel 1966; Hoffman, Stone & Sherman 1972 ). This of course has a psychophysical parallel in the greatly heightened visual acuity in the foveal region compared with the periphery. From all ofthis it is only to be expected that the neural machinery necessary to take care of one square degree of fovea should be much more massive than that subserving the same area of visual field periphery. In the retina the difference is obvious histologically. Figure 7, plate 5, shows that near the primate fovea the ganglion cell layer is many cells thick, whereas peripherally there are not enough cells to make up a single continuous layer (Van Buren 1963). In the cortex one might similarly expect a relative thickening in parts subserving regions of visual field in or near the fovea, but if there is any at all it is so subtle that careful control of plane of sectioning would be required to be certain of it: certainly there is no variation in thickness remotely approaching what is seen in the layer of retinal ganglion cells. The cortex, in fact, finds an entirely different way of devoting proportionately more machinery to central visual field areas than to peripheral. The amount of retinal surface devoted to a degree of visual-field is of course constant; it must be for obvious optical reasons. In the cortex the corresponding amount of surface is far from constant, being large in the foveal region and falling off progressively as eccentricity increases. This variation in magnification (mm cortex/degree visual field) was first systematically analysed by Daniel & Whitteridge (1961). Magnification in fact seems to vary with eccentricity in such a way as to guarantee a uniform thickness of cortex (Hubel & Wiesel 1974b)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 2193,
                                "start": 89
                            }
                        ],
                        "text": "Roughly four classes of cells can be distinguished, in a series of ascending complexity (Hubel & Wiesel 1959, 1962, 1965, 1968). These are termed 'circularly symmetric', 'simple', 'complex' and' hypercomplex'. We assume that cells at each stage receive their major input from cells at the previous stage, with the circularly symmetric cells receiving their inputs predominantly from geniculate cells. Circularly symmetric cells, as their name implies, show no preference to any particular orientation of lines, and, indeed, seem similar in their properties to geniculate cells. Simple cells are the first in the hierarchy to show orientation specificity, so that the rearrangements responsible for orientation specificity are presumed to take place between the circularly symmetric and the simple cells. A simple cell responds to an optimally oriented line in some narrowly defined position: even a slight displacement of the line to a new position, without change in orientation, renders the line ineffective. A complex cell, on the contrary, is probably just as specific in its orientation requirements as the simple cell, but is far less particular about the exact positioning of the line. Such a cell will respond wherever a line is projected within a rectangle such as that of figure 3; if the cell responds to a dark or light line (rather than to an edge), increasing the line's thickness beyond some value that is far less than the width of the receptive field renders it ineffective. Thus a patch of light as large as the entire receptive field evokes no response at all. This is equivalent to saying that diffuse light is ineffective. As mentioned above, sweeping the line over the receptive field usually evokes a sustained discharge from the cell. Hypercomplex cells, finally, resemble complex cells in all respects but one: extending a line beyond the region from which responses are evoked produces a marked reduction or complete abolition of the response. A few years ago Bishop & Henry (1972) described in cat cortex a type of cell whose properties resembled those of sim pIe cells, except that extending the line led to a drop in the response. Schiller, Finlay & Volman (1976) and we have seen such cells in"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 202,
                                "start": 179
                            }
                        ],
                        "text": "At least in the mid-periphery and periphery of the visual fields the stripes when projected into the visual fields turn out to be approximately semi-circles (figure 25); see also Hubel & Freeman (1977). This figure also shows strikingly the distortion in size that occurs as a consequence of the variation in magnification with eccentricity."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 2008,
                                "start": 89
                            }
                        ],
                        "text": "Roughly four classes of cells can be distinguished, in a series of ascending complexity (Hubel & Wiesel 1959, 1962, 1965, 1968). These are termed 'circularly symmetric', 'simple', 'complex' and' hypercomplex'. We assume that cells at each stage receive their major input from cells at the previous stage, with the circularly symmetric cells receiving their inputs predominantly from geniculate cells. Circularly symmetric cells, as their name implies, show no preference to any particular orientation of lines, and, indeed, seem similar in their properties to geniculate cells. Simple cells are the first in the hierarchy to show orientation specificity, so that the rearrangements responsible for orientation specificity are presumed to take place between the circularly symmetric and the simple cells. A simple cell responds to an optimally oriented line in some narrowly defined position: even a slight displacement of the line to a new position, without change in orientation, renders the line ineffective. A complex cell, on the contrary, is probably just as specific in its orientation requirements as the simple cell, but is far less particular about the exact positioning of the line. Such a cell will respond wherever a line is projected within a rectangle such as that of figure 3; if the cell responds to a dark or light line (rather than to an edge), increasing the line's thickness beyond some value that is far less than the width of the receptive field renders it ineffective. Thus a patch of light as large as the entire receptive field evokes no response at all. This is equivalent to saying that diffuse light is ineffective. As mentioned above, sweeping the line over the receptive field usually evokes a sustained discharge from the cell. Hypercomplex cells, finally, resemble complex cells in all respects but one: extending a line beyond the region from which responses are evoked produces a marked reduction or complete abolition of the response. A few years ago Bishop & Henry (1972) described in cat cortex a type of cell whose properties resembled those of sim pIe cells, except that extending the line led to a drop in the response."
                    },
                    "intents": []
                }
            ],
            "corpusId": 16126219,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "822e80fc0116702cea9cd5be8501632a2f774d53",
            "isKey": true,
            "numCitedBy": 99,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-autoradiographic-study-of-the-retino-cortical-in-Hubel",
            "title": {
                "fragments": [],
                "text": "An autoradiographic study of the retino-cortical projections in the tree shrew (Tupaia glis)"
            },
            "venue": {
                "fragments": [],
                "text": "Brain Research"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2059655842"
                        ],
                        "name": "D. C. Freeman",
                        "slug": "D.-C.-Freeman",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Freeman",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. C. Freeman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11097452,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "07de0ffb823ddbf1b0eaf5554d498bef9278f4e8",
            "isKey": false,
            "numCitedBy": 89,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Projection-into-the-visual-field-of-ocular-columns-Hubel-Freeman",
            "title": {
                "fragments": [],
                "text": "Projection into the visual field of ocular dominance columns in macaque monkey"
            },
            "venue": {
                "fragments": [],
                "text": "Brain Research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8374804,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "f525357b5226a827d04bf881e8d2775390c2d877",
            "isKey": false,
            "numCitedBy": 1507,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "IN THE NORMAL CAT OR KITTEN about four-fifths of cells in the striate cortex can be driven by both eyes (3, 4). If, however, one eye of a newborn kitten is sewn shut and the visual cortex recorded from 3 months later, only a small fraction of cells can be driven from the deprived eye (8) . In contrast, many cells in the latera .I geniculate are driven normally from the d ,eprived eye (7 ), suggesting that the abnormality occurs somewhere between geniculate cells and cortex. Since clear receptive-field orientations and directional preferences to movement are seen in cortical cells of newborn visually inexperienced kittens, the deprivation effects presumably represent some sort of disruption of innately determined connections, rather than a failure of postnatal development related to lack of experience. In these experiments the use of monocular deprivation made it possible to compare adjacent geniculate layers, and also to compare the two eyes in their ability to influence cortical cells, so that each animal acted, in a sense, as its own control. The results led us to expect that depriving both eyes for similar periods would lead to an almost total unresponsiveness of cortical cells to stimulation of either eye. That should be so, provided the effects of depriving one eye were independent of whether or not the other eye was simultaneously deprived. It seemed worthwhile to test such an assumption, since any interdependence of the two pathways would be of considerable interest. We accordingly raised kittens with both eyes covered by lid suture, and recorded from the striate cortex when the animals had reached an age of 23-43 months."
            },
            "slug": "Comparison-of-the-effects-of-unilateral-and-eye-on-Wiesel-Hubel",
            "title": {
                "fragments": [],
                "text": "Comparison of the effects of unilateral and bilateral eye closure on cortical unit responses in kittens."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "In these experiments the use of monocular deprivation made it possible to compare adjacent geniculate layers, and also to compare the two eyes in their ability to influence cortical cells, so that each animal acted, in a sense, as its own control."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14801990,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6f20e254e3993538c79e0ff2b9b8f198d3359cb3",
            "isKey": false,
            "numCitedBy": 4215,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "In the central nervous system the visual pathway from retina to striate cortex provides an opportunity to observe and compare single unit responses at several distinct levels. Patterns of light stimuli most effective in influencing units at one level may no longer be the most effective at the next. From differences in responses at successive stages in the pathway one may hope to gain some understanding of the part each stage plays in visual perception. By shining small spots of light on the light-adapted cat retina Kuffler (1953) showed that ganglion cells have concentric receptive fields, with an 'on' centre and an 'off ' periphery, or vice versa. The 'on' and 'off' areas within a receptive field were found to be mutually antagonistic, and a spot restricted to the centre of the field was more effective than one covering the whole receptive field (Barlow, FitzHugh & Kuffler, 1957). In the freely moving lightadapted cat it was found that the great majority of cortical cells studied gave little or no response to light stimuli covering most of the animal's visual field, whereas small spots shone in a restricted retinal region often evoked brisk responses (Hubel, 1959). A moving spot of light often produced stronger responses than a stationary one, and sometimes a moving spot gave more activation for one direction than for the opposite. The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex. Receptive fields of the cells considered in this paper were divided into separate excitatory and inhibitory ('on' and 'off') areas. In this respect they resembled retinal ganglion-cell receptive fields. However, the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinal ganglion cells. An attempt was made to correlate responses to moving stimuli"
            },
            "slug": "Receptive-fields-of-single-neurones-in-the-cat's-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields of single neurones in the cat's striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex, which resembled retinal ganglion-cell receptive fields, but the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinalganglion cells."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6478458,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e5f4f49721eb3f6bdba304a06728327631e832bb",
            "isKey": false,
            "numCitedBy": 938,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "Single cell recordings in monkey striate cortex have shown differences in response properties from one cell layer to the next and have also shown that the IVth layer, which receives most of its input from the geniculate, is subdivided into a mosaic of regions, some connected to the left eye, others to the right. In the present study small lesions were made in single layers or pairs of layers in the lateral geniculate body, and the striate cortex was later examined with a Fink‐Heimer modification of the Nauta method. We hoped to correlate the laminar distribution of axon terminals in the cortex with functional differences between layers, and to demonstrate the IVth‐layer mosaic anatomically."
            },
            "slug": "Laminar-and-columnar-distribution-of-fibers-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Laminar and columnar distribution of geniculo‐cortical fibers in the macaque monkey"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The laminar distribution of axon terminals in the cortex is correlated with functional differences between layers, and the IVth‐layer mosaic anatomically is demonstrated."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "88900034"
                        ],
                        "name": "P. Daniel",
                        "slug": "P.-Daniel",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Daniel",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Daniel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2837738"
                        ],
                        "name": "D. Whitteridge",
                        "slug": "D.-Whitteridge",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Whitteridge",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Whitteridge"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 29375114,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "831efb7246ac22a24c41570c7741ed1204fe2919",
            "isKey": false,
            "numCitedBy": 1107,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "On the basis of his extensive and elegant anatomical investigations on the visual cortex, Poliak (1932) suggested that a mathematical projection of the retina on the cerebral cortex must exist. Talbot & Marshall (1941) used physiological methods to map the central part of the visual field on to the posterolateral surface ofthe cortex in the monkey. They devised an index of cortical representation expressed as the increment of the angle, measured radially from the centre of gaze, which is represented on each millimetre of cortex. We have confirmed their observations and have extended the mapping to the buried visual cortex in the horizontal and vertical calcarine fissures. We have preferred to use the reciprocal of their index and to call it the cortical magnification, M. When this is measured along radii and at right angles to them, it provides the empirical quantitative relation which Polyak wanted. It also defines the shape and size of the visual receptive field. We have made such a surface, folded it and compared it with the calcarine cortex of the monkey. A preliminary account of this work has been published (Daniel & Whitteridge, 1959)."
            },
            "slug": "The-representation-of-the-visual-field-on-the-in-Daniel-Whitteridge",
            "title": {
                "fragments": [],
                "text": "The representation of the visual field on the cerebral cortex in monkeys"
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "On the basis of his extensive and elegant anatomical investigations on the visual cortex, Poliak (1932) suggested that a mathematical projection of the retina on the cerebral cortex must exist and this work has made such a surface, folded it and compared it with the calcarine cortex of the monkey."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1993085645"
                        ],
                        "name": "P. Schiller",
                        "slug": "P.-Schiller",
                        "structuredName": {
                            "firstName": "P",
                            "lastName": "Schiller",
                            "middleNames": [
                                "H"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Schiller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33760699"
                        ],
                        "name": "B. Finlay",
                        "slug": "B.-Finlay",
                        "structuredName": {
                            "firstName": "Barbara",
                            "lastName": "Finlay",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Finlay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6849044"
                        ],
                        "name": "S. Volman",
                        "slug": "S.-Volman",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Volman",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Volman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15065592,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0be7a5abe126b799d1820b321326f92ba42c65a3",
            "isKey": false,
            "numCitedBy": 519,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The properties of single cells in striate cortex of the rhesus monkey, representing the visual field 2 degrees -5 degrees from the fovea, were examined quantitatively with stationary and moving stimuli. Three distinct classes of cells were identified: S type, CX type, and T type. 2. S-type cells were defined as those oriented cells which to the optimal direction of movement in their receptive fields exhibited one or more spatially separate subfields within each of which a response was obtained to either a light or dark edge, but not to both. Several different types of S-cells were distinguished: a) S1-type cells for which moving edges revealed a single excitatory area within which a response was elicited by either a light or a dark edge but not by both. Most of these cells were unidirectional. b) S2-type cells for which moving edges revealed two spatially separate response areas, one of which was excited by a light edge and the other by a dark edge. Both regions responded to the same direction of movement. c) S3-type cells which had two response areas, one of which was excited by a stimulus moving in one direction (at right angles to the axis of orientation) and the other, of opposite contrast, which responded in the opposite direction, d) S4-type cells which to one direction of movement showed two spatially separate regions sensitive to a light and dark edge and which in the other direction of movement had only one responsive area (either light or dark). e) Cells which had multiple spatially separate subfields (S5-7 types). 3. CX-type cells were defined as those oriented cells which in their receptive fields exhibited no spatial separation for light- and dark-edge responses; they discharged to both edges in the same direction of movement and in the same spatial area. Flashing stimuli elicited both on and off responses throughout the receptive field. CX-type cells were predominantly of two types: those which were selective for direction of stimulus movement and those which were not. 4. A third class of cells (T-type) were those which were excited by only one sign of contrast change and responded in a sustained fashion even when there was no contour within the receptive field. These cells were poorly or not at all oriented; some of them were selective to wavelength. 5. Quantitative comparisons showed the following differences between S-type and CX-type cells: a) S-type cells had smaller receptive fields than CX-type cells but the populations over-lapped considerably. Receptive-field size was smallest in layer 4c. In all other layers S-type cells had the same size fields. CX-type cells, by contrast, tended to have larger fields in layer 5-6 than 2-3. b) The spatial separation between light and dark response areas was the best criterion for distinguishing S-type and CX-type cells. The distribution of this measure disclosed two populations of cells with relatively limited overlap. c) In layers 2 and 3, both S-type and CX-type cells had low spontaneous activity..."
            },
            "slug": "Quantitative-studies-of-single-cell-properties-in-Schiller-Finlay",
            "title": {
                "fragments": [],
                "text": "Quantitative studies of single-cell properties in monkey striate cortex. I. Spatiotemporal organization of receptive fields."
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "The properties of single cells in striate cortex of the rhesus monkey, representing the visual field 2 degrees -5 degrees from the fovea, were examined quantitatively with stationary and moving stimuli and showed differences between S-type and CX-type cells."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32056095"
                        ],
                        "name": "C. Gilbert",
                        "slug": "C.-Gilbert",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Gilbert",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Gilbert"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107682207"
                        ],
                        "name": "J. Kelly",
                        "slug": "J.-Kelly",
                        "structuredName": {
                            "firstName": "James P.",
                            "lastName": "Kelly",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kelly"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30462575,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "48d1cc739308fe3eda7c5953ca5f9527c98a8817",
            "isKey": false,
            "numCitedBy": 708,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "The projection of cells in different layers of several cortical visual areas in the cat were studied using the method of retrograde transport of horseradish peroxidase. Injections of the enzyme were made through a recording micropipette, making it possible to localize the injection site by physiological criteria. We found that layer VI cells projected to the lateral geniculate nucleus, while a distinct population of cells in layer V projected to the superior colliculus. Cells in layers II and III were the major sources of ipsilateral cortico‐cortical connections. This pattern of projection was consistent from one visual area to another. Pyramidal cells appeared to be the source of cortico‐geniculate, cortico‐collicular and cortico‐cortical projections. The proportion of cells within a layer that terminated in a given site varied from layer to layer: apparently all of the large pyramids in layer V had terminals in the superior colliculus, about half of the pyramids in layer VI had terminals in the lateral geniculate nucleus, while only a small proportion of the pyramids in layers II and III had terminals in any single cortical area. The results indicated a remarkable specificity in the projections of the cortical layers."
            },
            "slug": "The-projections-of-cells-in-different-layers-of-the-Gilbert-Kelly",
            "title": {
                "fragments": [],
                "text": "The projections of cells in different layers of the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 79,
                "text": "The projection of cells in different layers of several cortical visual areas in the cat were studied using the method of retrograde transport of horseradish peroxidase, indicating a remarkable specificity in the projections of the cortical layers."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2766727"
                        ],
                        "name": "C. Shatz",
                        "slug": "C.-Shatz",
                        "structuredName": {
                            "firstName": "Carla",
                            "lastName": "Shatz",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Shatz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "51886599"
                        ],
                        "name": "S. Lindstro¨m",
                        "slug": "S.-Lindstro¨m",
                        "structuredName": {
                            "firstName": "Sivert",
                            "lastName": "Lindstro¨m",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Lindstro¨m"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27779195,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0d62d4add8f2223469c4179f9b40083665ecd58d",
            "isKey": false,
            "numCitedBy": 291,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-distribution-of-afferents-representing-the-and-Shatz-Lindstro¨m",
            "title": {
                "fragments": [],
                "text": "The distribution of afferents representing the right and left eyes in the cat's visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Brain Research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 3063181,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "34898b2e1cb9f7872d2d66fdfcf3a9644948463b",
            "isKey": false,
            "numCitedBy": 773,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Cells were recorded with tungsten electrodes in the dorsal lateral geniculate body of the cat. Receptive fields of these units were mapped out, in the light-adapted state, with small sports of light. In their general arrangement geniculate receptive fields resembled those of retinal ganglion cells, having an excitatory ('on') centre and inhibitory ('off') preriphery, or reverse. The two portions of a receptive field were mutually antagonistic; the decrease in centre responses cauded by inclusion of peripheral portions of receptive fields was termed peripheral suppression. Cells recorded in layers A and B of the lateral geniculate body were driven from the contralateral eye; cells in layer A1 from the ipsilateral eye. In penetrations normal to the layers receptive fields of cells in a single layer were close together or superimposed, and from one layer to the next occupied exactly homologous positions in the two retinas. Binocular interaction was not observed in any of the cells studied. All three layers of the lateral geniculate contained both 'on'-centre and 'off'-centre units. Cells in layers A and A1 were similar both in their firing patterns and in average receptive field size. Cells in layer B were more sluggish in their responses to light stimuli, and tended to have larger receptive field centres. Cells with receptive fields within or near the area centralis tended to have smaller field centres and stronger suppression by the receptive field periphery than cells with their fields situated in more peripheral regions of the retina."
            },
            "slug": "Integrative-action-in-the-cat's-lateral-geniculate-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Integrative action in the cat's lateral geniculate body"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Receptive fields of geniculate receptive fields resembled those of retinal ganglion cells, having an excitatory ('on') centre and inhibitory preriphery, or reverse, and cells with receptive fields within or near the area centralis tended to have smaller field centres and stronger suppression by the receptive field periphery than cells with their fields situated in more peripheral regions of the retina."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42437417,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "d0c5bf8e0a100d0daee28830e7d902404501303a",
            "isKey": false,
            "numCitedBy": 416,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The main object of this study was to see whether ordered sequences of orientation columns are present in very young visually naive monkeys. Recordings were made from area 17 in two macaque monkeys three and four weeks of age, whose eyes had been closed near the time of birth. The first monkey was born normally, but one day elapsed before eye closure could be done. The second was delivered by Cesarean section and the lids sutured shut immediately. The results in these two animals were very similar; in both, highly ordered sequences of orientation shifts were present, and were in no obvious way different from those seen in the adult. For example, average values for the size of orientation shifts, for the horizontal component of the distance between shifts, and for the slopes of orientation vs. track distance curves, were all similar to adult values. This indicates that the ordered column system is innately determined and not the result of early visual experience. In these two monkeys and a third one, sutured at two days and examined at 38 days, most of the cells seemed normal by adult standards, with simple, complex or hypercomplex receptive fields, showing about the same range in orientation specificity as is found in adults. About 10–15% of cells showed abnormalities similar to those seen in monkeys binocularly deprived of vision for longer periods. Furthermore, all three deprived monkeys showed a decided lack of cells that could be influenced from both eyes, whereas a normal three‐week‐old control animal seemed similar to the adult, with binocular cells comprising over half of the total population. A monkey deprived by binocular closure from the third to the seventh week also showed a diminution in number of binocularly influenced cells, suggesting that the deprivation from birth resulted in a deterioration of innate connections subserving binocular convergence. To be sure that the abnormalities in the deprived animals represented a deterioration of connections, we recorded from 23 cells in a normal two‐day‐old monkey: here the ocular dominance distribution of cells was about the same as in the adult, and the response characteristics of the cells were normal by adult standards."
            },
            "slug": "Ordered-arrangement-of-orientation-columns-in-Wiesel-Hubel",
            "title": {
                "fragments": [],
                "text": "Ordered arrangement of orientation columns in monkeys lacking visual experience"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "The main object of this study was to see whether ordered sequences of orientation columns are present in very young visually naive monkeys, whose eyes had been closed near the time of birth, and to be sure that the abnormalities in the deprived animals represented a deterioration of connections."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40461235"
                        ],
                        "name": "S. Levay",
                        "slug": "S.-Levay",
                        "structuredName": {
                            "firstName": "Simon",
                            "lastName": "Levay",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Levay"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17405619,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "ea2fa92fbef1ca570ae093f751ecb2e0bcfb67b8",
            "isKey": false,
            "numCitedBy": 1562,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "Ocular dominance columns were examined by a variety of techniques in juvenile macaque monkeys in which one eye had been removed or sutured closed soon after birth. In two monkeys the removal was done at 2 weeks and the cortex studied at 1\\frac{1}{2} years. Physiological recordings showed continuous responses as an electrode advanced along layer IVC in a direction parallel to the surface. Examination of the cortex with the Fink-Heimer modification of the Nauta method after lesions confined to single lateral-geniculate layers showed a marked increase, in layer IVC, in the widths of columns belonging to the surviving eye, and a corresponding shrinkage of those belonging to the removed eye. Monocular lid closures were made in one monkey at 2 weeks of age, for a period of 18 months, in another at 3 weeks for 7 months, and in a third at 2 days for 7 weeks. Recordings from the lateral geniculate body showed brisk activity from the deprived layers and the usual abrupt eye transitions at the boundaries between layers. Cell shrinkage in the deprived layers was moderate - far less severe than that following eye removal, more marked ipsilaterally than contralaterally, and more marked the earlier the onset of the deprivation. In autoradiographs following eye injection with a mixture of tritiated proline and tritiated fucose the labelling of terminals was confined to geniculate layers corresponding to the injected eye. Animals in which the open eye was injected showed no hint of invasion of terminals into the deprived layers. Similarly in the tectum there was no indication of any change in the distribution of terminals from the two eyes. The autoradiographs of the lateral geniculates provide evidence for several previously undescribed zones of optic nerve terminals, in addition to the six classical subdivisions. In the cortex four independent methods, physiological recording, transneuronal autoradiography, Nauta degeneration, and a reduced-silver stain for normal fibres, all agreed in showing a marked shrinkage of deprived-eye columns and expansion of those of the normal eye, with preservation of the normal repeat distance (left-eye column plus right-eye column). There was a suggestion that changes in the columns were more severe when closure was done at 2 weeks as opposed to 3, and more severe on the side ipsilateral to the closure. The temporal crescent representation in layer IVC of the hemisphere opposite the closure showed no obvious adverse effects. Cell size and packing density in the shrunken IVth layer columns seemed normal. In one normal monkey in which an eye was injected the day after birth, autoradiographs of the cortex at 1 week indicated only a very mild degree of segregation of input from the two eyes; this had the form of parallel bands. Tangential recordings in layer IVC at 8 days likewise showed considerable overlap of inputs, though some segregation was clearly present; at 30 days the segregation was much more advanced. These preliminary experiments thus suggest that the layer IVC columns are not fully developed until some weeks after birth. Two alternate possibilities are considered to account for the changes in the ocular dominance columns in layer IVC following deprivation. If one ignores the above evidence in the newborn and assumes that the columns are fully formed at birth, then after eye closure the afferents from the normal eye must extend their territory, invading the deprived-eye columns perhaps by a process of sprouting of terminals. On the other hand, if at birth the fibres from each eye indeed occupy all of lay IVC, retracting to form the columns only during the first 6 weeks or so, perhaps by a process of competition, then closure of one eye may result in a competitive disadvantage of the terminals from that eye, so that they retract more than they would normally. This second possibility has the advantage that it explains the critical period for deprivation effects in the layer IV columns, this being the time after birth during which retraction is completed. It would also explain the greater severity of the changes in the earlier closures, and would provide an interpretation of both cortical and geniculate effects in terms of of competition of terminals in layer IVC for territory on postsynaptic cells."
            },
            "slug": "Plasticity-of-ocular-dominance-columns-in-monkey-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Plasticity of ocular dominance columns in monkey striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "Preliminary experiments suggest that the layer IVC columns in juvenile macaque monkeys are not fully developed until some weeks after birth, which explains the critical period for deprivation effects in the layerIV columns."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3133875"
                        ],
                        "name": "C. Blakemore",
                        "slug": "C.-Blakemore",
                        "structuredName": {
                            "firstName": "Colin",
                            "lastName": "Blakemore",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Blakemore"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "118303839"
                        ],
                        "name": "R. C. Van Sluyters",
                        "slug": "R.-C.-Van-Sluyters",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Van Sluyters",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. C. Van Sluyters"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 23383334,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3518f5d8c33b8c41e4831da7ffb4df95e796dcc3",
            "isKey": false,
            "numCitedBy": 559,
            "numCiting": 76,
            "paperAbstract": {
                "fragments": [],
                "text": "1. This is a study of the receptive fields of 771 cells recorded in the visual cortex of twenty‐five kittens reared normally or subjected to various kinds of visual deprivation or environmental manipulation. 2. Kittens deprived of patterned visual experience, by dark rearing or diffuse occlusion of the eyes, have a majority of cirtical neurones with little or no specificity for the orientation or axis of movement of visual stimuli. However, in such deprived animals, especially those younger than 3 weeks, there are a number of genuinely orientation selective cells. They are broadly \"turned\" (by adult standards), they are almost always of the simple type, are heavily dominated by one eye, and are found mainly in the deeper layers of the cortex, especially layer IV. 3..."
            },
            "slug": "Innate-and-environmental-factors-in-the-development-Blakemore-Sluyters",
            "title": {
                "fragments": [],
                "text": "Innate and environmental factors in the development of the kitten's visual cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "A study of the receptive fields of 771 cells recorded in the visual cortex of twenty‐five kittens reared normally or subjected to various kinds of visual deprivation or environmental manipulation finds that in deprived animals, there are a number of genuinely orientation selective cells."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11551491,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "f70c54029c17f50914996c834930ecbfacda195f",
            "isKey": false,
            "numCitedBy": 2615,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "To UNDERSTAND VISION in physiological terms represents a formidable problem for the biologist. I t am0 unts to learning how the nervous system handles incoming messages so that form, color, movement, and depth can be perceived and interpreted. One approach, perhaps the most direct, is to stimulate the retina with patterns of light while recording from single cells or fibers at various points along the visual pa thway. For each cell the optimum stimulus can be determined, and one can note the charac teristics common to cells at the next. each level in the visual pathway, and compare a given level with"
            },
            "slug": "RECEPTIVE-FIELDS-AND-FUNCTIONAL-ARCHITECTURE-IN-TWO-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "RECEPTIVE FIELDS AND FUNCTIONAL ARCHITECTURE IN TWO NONSTRIATE VISUAL AREAS (18 AND 19) OF THE CAT."
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "To UNDERSTAND VISION in physiological terms represents a formidable problem for the biologist, and one approach is to stimulate the retina with patterns of light while recording from single cells or fibers at various points along the visual pathway."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2655339"
                        ],
                        "name": "J. Lund",
                        "slug": "J.-Lund",
                        "structuredName": {
                            "firstName": "Jennifer",
                            "lastName": "Lund",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lund"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 140,
                                "start": 129
                            }
                        ],
                        "text": "is not fully known, but several synapses are required before the information reaches cells whose axons project out of the cortex (Lund 1973)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 29379404,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3400c22542bd041f97c2bc1fb452ee58c215ca77",
            "isKey": false,
            "numCitedBy": 501,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "A study of neuron morphology in Golgi Rapid and Kopsch preparations of area 17 of the monkey has shown three basic cell groups— pyramidal neurons, stellate neurons with spinous dendrites and stellate neurons with spine‐free or sparsely spined dendrites. These three neuron groups show different distributions in depth from pia to white matter and differ in their relationship to zones of concentrated termination of geniculo‐cortical axons. The neuron type most closely related to the laminae receiving a heavy geniculo‐cortical projection is the spinous stellate cell. This cell type is restricted to lamina IV. Included in this zone is the broadest band of geniculo‐cortical axon projection (lamina IVC), the horizontal fiber band (lamina IVB) comprising the major portion of the stria of Gennari (receiving little or no thalamic projection) and the narrow band of thalamo‐cortical fiber termination which occurs superficial to the stria of Gennari (lamina IVA). Pyramidal neuron cell bodies are almost totally excluded from lamina IVC and the apical dendrites of lower pyramidal neurons bear many fewer spines in lamina IVC than in laminae V and VI. The basal dendrites of upper pyramidal cells spread superficial and deep to lamina IVA rather than within it. Spine‐free stellate neurons occur at all cortical levels and sparselyspined varieties have not been impregnated in lamina IV, but occur in the other laminae."
            },
            "slug": "Organization-of-neurons-in-the-visual-cortex,-area-Lund",
            "title": {
                "fragments": [],
                "text": "Organization of neurons in the visual cortex, area 17, of the monkey (Macaca mulatta)"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "A study of neuron morphology in Golgi Rapid and Kopsch preparations of area 17 of the monkey has shown three basic cell groups— pyramidal neurons, stellate neurons with spinous dendrites and stellates neurons with spine‐free or sparsely spined dendritic groups."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3809364"
                        ],
                        "name": "V. Mountcastle",
                        "slug": "V.-Mountcastle",
                        "structuredName": {
                            "firstName": "Vernon",
                            "lastName": "Mountcastle",
                            "middleNames": [
                                "B."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Mountcastle"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 46,
                                "start": 27
                            }
                        ],
                        "text": "subdivisions was coined by Mountcastle (1957) for a system of aggregations in the"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6822072,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6ded76b03bd0612974d86a826ce70d2a2b143fb2",
            "isKey": false,
            "numCitedBy": 2208,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "THE PRESENT PAPER describes some observations upon the modality and topographical attributes of single neurons of the first somatic sensory area of the cat’s cerebral cortex, the analogue of the cortex of the postcentral gyrus in the primate brain. These data, together with others upon the response latencies of the cells of different layers of the cortex to peripheral stimuli, support an hypothesis of the functional organization of this cortical area. This is that the neurons which lie in narrow vertical columns, or cylinders, extending from layer II through layer VI make up an elementary unit of organization, for they are activated by stimulation of the same single class of peripheral receptors, from almost identical peripheral receptive fields, at latencies ers. It is early These which are not significantly different for the cells of the various layemphasized that this pattern of organization obtains only for the repetitiv neurons ‘e responses may be rela of ted cortical in quite neurons different to brief peripheral stimuli. organization patterns when analyzed in terms of later discharges. A report of these experiments was made to the American Physiological Society in September, 1955 (10, 17)."
            },
            "slug": "Modality-and-topographic-properties-of-single-of-Mountcastle",
            "title": {
                "fragments": [],
                "text": "Modality and topographic properties of single neurons of cat's somatic sensory cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "Observations upon the modality and topographical attributes of single neurons of the first somatic sensory area of the cat’s cerebral cortex, the analogue of the cortex of the postcentral gyrus in the primate brain, support an hypothesis of the functional organization of this cortical area."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7136759,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c5f5311fa1f34159ab3a0a1d58da51cd0340a640",
            "isKey": false,
            "numCitedBy": 6319,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light. Most cells can be categorized as simple, complex, or hypercomplex, with response properties very similar to those previously described in the cat. On the average, however, receptive fields are smaller, and there is a greater sensitivity to changes in stimulus orientation. A small proportion of the cells are colour coded."
            },
            "slug": "Receptive-fields-and-functional-architecture-of-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields and functional architecture of monkey striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light, with response properties very similar to those previously described in the cat."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52367742"
                        ],
                        "name": "P. Bishop",
                        "slug": "P.-Bishop",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Bishop",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Bishop"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32225925"
                        ],
                        "name": "W. Kozak",
                        "slug": "W.-Kozak",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Kozak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Kozak"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3672557"
                        ],
                        "name": "W. Levick",
                        "slug": "W.-Levick",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Levick",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Levick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16568836"
                        ],
                        "name": "G. J. Vakkur",
                        "slug": "G.-J.-Vakkur",
                        "structuredName": {
                            "firstName": "G",
                            "lastName": "Vakkur",
                            "middleNames": [
                                "J"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. J. Vakkur"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 36663753,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "865603dab7948ed02f3df4d967db1f0e24840dd6",
            "isKey": false,
            "numCitedBy": 229,
            "numCiting": 80,
            "paperAbstract": {
                "fragments": [],
                "text": "Henschen (1897, 1898) was the first to provide direct evidence in favour of a retinotopic projection in the lateral geniculate nucleus (LGN). He described a woman suffering from blindness of the lower left quadrants of both visual fields who was subsequently found to have a lesion limited to the dorsal half of the right LGN. Actually these early observations are not in accord with the later experimental studies on primates by Brouwer and subsequent workers (see below). Further early human clinico-pathological observations were made by Wilbrand & Saenger (1904), Ronne (1913, 1914) and Winkler (1912), but the extreme rarity of sufficiently restricted lesions, particularly in the nucleus itself, made it unlikely that the details of the retinotopic projection in the LGN would be unravelled in this way. By enucleating the eye of a cat and studying the distribution of the secondary degeneration in each LGN, Minkowski (1913) provided the first direct experimental evidence that the crossed and uncrossed optic fibres were distributed differently in the nucleus (cf. Minkowski, 1920) and that the binocular part of a visual field projected only to the medial part. The first detailed study of the retinotopic projection in the LGN was, however, carried out by Brouwer and his colleagues (Brouwer, Zeeman & Houwer, 1923). By making small retinal lesions and subsequently studying the degenerating fibres in Marchi preparations they established the quadrantic projections ofthe retina in the rabbit and cat and the quadrantic and intraquandrantic projections of the central and peripheral retinal segments in the monkey (Brouwer & Zeeman, 1925, 1926; Overbosch, 1927). Further details in respect to the monkey were added by Brody (1934), Penman"
            },
            "slug": "The-determination-of-the-projection-of-the-visual-Bishop-Kozak",
            "title": {
                "fragments": [],
                "text": "The determination of the projection of the visual field on to the lateral geniculate nucleus in the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "The first detailed study of the retinotopic projection in the LGN was carried out by Brouwer and his colleagues and by making small retinal lesions and subsequently studying the degenerating fibres in Marchi preparations they established the quadrantic projections of the retina in the rabbit and cat and the Quadrantic and intraquandrantic projections in the central and peripheral retinal segments in the monkey."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2655339"
                        ],
                        "name": "J. Lund",
                        "slug": "J.-Lund",
                        "structuredName": {
                            "firstName": "Jennifer",
                            "lastName": "Lund",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lund"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1993026"
                        ],
                        "name": "R. Lund",
                        "slug": "R.-Lund",
                        "structuredName": {
                            "firstName": "Raymond",
                            "lastName": "Lund",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Lund"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "87661583"
                        ],
                        "name": "A. Hendrickson",
                        "slug": "A.-Hendrickson",
                        "structuredName": {
                            "firstName": "Anita",
                            "lastName": "Hendrickson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Hendrickson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39295271"
                        ],
                        "name": "A. H. Bunt",
                        "slug": "A.-H.-Bunt",
                        "structuredName": {
                            "firstName": "Ann",
                            "lastName": "Bunt",
                            "middleNames": [
                                "Heffington"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. H. Bunt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2178025"
                        ],
                        "name": "A. Fuchs",
                        "slug": "A.-Fuchs",
                        "structuredName": {
                            "firstName": "Albert",
                            "lastName": "Fuchs",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Fuchs"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32325381,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "da0492a876d8e3ccf48ab9d62a85503cfd5e2ea7",
            "isKey": false,
            "numCitedBy": 693,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "The retrograde transport of horseradish peroxidase has been used to identify efferent cells in area 17 of the macaque. Cells projecting to the lateral geniculate nucleus are small to medium sized pyramidal neurons with somata in lamina 6 and the adjacent white matter. The projection to the parvocellular division arises preferentially from the upper half of lamina 6, while that to the magnocellular division arises preferentially from the lower part of the lamina. The projection to both superior colliculus and inferior pulvinar arises from all sizes of pyramidal neurons lying in lamina 5B (Lund and Boothe, '75); at least the largest pyramidal neurons of lamina 5B send collateral axon branches to both destinations. Injections with extensive spread of horseradish peroxidase show that many cells of lamina 4B and the large pyramidal neurons of upper lamina 6 also project extrinsically but their terminal sites have not been identified."
            },
            "slug": "The-origin-of-efferent-pathways-from-the-primary-of-Lund-Lund",
            "title": {
                "fragments": [],
                "text": "The origin of efferent pathways from the primary visual cortex, area 17, of the macaque monkey as shown by retrograde transport of horseradish peroxidase"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "The retrograde transport of horseradish peroxidase has been used to identify efferent cells in area 17 of the macaque and cells projecting to the lateral geniculate nucleus are small to medium sized pyramidal neurons with somata in lamina 6 and the adjacent white matter."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "67339760"
                        ],
                        "name": "L. We",
                        "slug": "L.-We",
                        "structuredName": {
                            "firstName": "Le",
                            "lastName": "We",
                            "middleNames": [
                                "Gros",
                                "Clark"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. We"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62071004,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e38b13f499bbc86e3d8534a69ee150bd49009f5b",
            "isKey": false,
            "numCitedBy": 95,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "THE general structure of the lateral geniculate body in the macaque monkey is now well known. However, the precise disposition of its component laminae in a three-dimensional sense is difficult to grasp by reference to sections, even when these are available in several planes. To overcome this difficulty, and in order to facilitate further studies of this visual centre, it was decided to make a wax reconstruction model. The serial sections of the geniculate body were also used for making a computation of its cell content. Further, in order to arrive at an estimate of the number of cells Which project on to a unit area of the visual cortex, a preliminary operation had been carried out in which a small lesion of known dimensions was made in the striate area. This led to a circumscribed area of retrograde degeneration in the lateral geniculate body from which it was possible to estimate the number of cells affected."
            },
            "slug": "The-laminar-organization-and-cell-content-of-the-in-We",
            "title": {
                "fragments": [],
                "text": "The laminar organization and cell content of the lateral geniculate body in the monkey"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "A wax reconstruction model of the lateral geniculate body in the macaque monkey was made in order to facilitate further studies of this visual centre and to arrive at an estimate of the number of cells affected."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1941
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2030378"
                        ],
                        "name": "K. Hoffmann",
                        "slug": "K.-Hoffmann",
                        "structuredName": {
                            "firstName": "Klaus-Peter",
                            "lastName": "Hoffmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Hoffmann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144469587"
                        ],
                        "name": "J. Stone",
                        "slug": "J.-Stone",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Stone",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Stone"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143980134"
                        ],
                        "name": "S. Sherman",
                        "slug": "S.-Sherman",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Sherman",
                            "middleNames": [
                                "Murray"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sherman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18827464,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5812bc68be7f9809bc446e0f8d9aee12504b207b",
            "isKey": false,
            "numCitedBy": 387,
            "numCiting": 51,
            "paperAbstract": {
                "fragments": [],
                "text": "THE DORSAL lateral geniculate nucleus (LGNd) of the cat is a principal relay nucleus on the direct pathway from the retina to the visual cortex, and several parameters of its organization as a relay are well established. First, relay cells of the LGNd have either onor off-center receptive fields (16), because each relay cell receives direct excitatory drive from either onor off-center retinal ganglion cells (6, 16). Second, retinal ganglion cells fall into two groups (X-cells and Y-cells) according to whether they sum the influences of the center and surround regions of their receptive fields linearly or nonlinearly (8). Most LGNd relay cells can be similarly classified because most receive direct excitatory drive from either Xor Y-type retinal ganglion cells (6). Third, each relay cell receives direct excitatory drive from either fastor slow-conducting retinal afferents, and its own axon is correspondingly either fast or slow conducting (6, 36). The two latter parameters are closely correlated since Y-cells have been shown to have fast axons and Xcells, slow axons (6, 11). The on/off organization is independent of the other two parameters, however. Roth Y-cells and Xcells can have either onor off-center fields. This report examines several features of the LGNd relay in the normal cat, extending previous concepts and establishing a spectrum of normal properties against which the properties of the LGNd in deprived cats (described in the following paper (3W can be compared. First, the separate relay in the LGNd of the Xand Y-cell activity of the retina is described. Second, several properties of Xand Y-cells of the LGNd were observed to vary con-"
            },
            "slug": "Relay-of-receptive-field-properties-in-dorsal-of-Hoffmann-Stone",
            "title": {
                "fragments": [],
                "text": "Relay of receptive-field properties in dorsal lateral geniculate nucleus of the cat."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A spectrum of normal properties is established against which the properties of the LGNd in deprived cats can be compared, and several properties of Xand Y-cell activity of the retina were observed to vary."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10511297,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "34f989681ef0ed85c9f809e96118e1a360702527",
            "isKey": false,
            "numCitedBy": 1083,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "IN A SERIES OF STUDIES on the cat over the past 5 years we have recorded from single cells in the striate cortex and mapped receptive fields using patterned retinal stimulation. The results suggest that connections between geniculate and striate cortex, and between cortical cells, must be highly specific (5). Indeed, cells in the striate cortex respond in such a characteristic way that departures from the normal adult physiology should be easily recognizable. In the present study we have made similar experiments in kittens ranging in age from l-3 weeks. Our purpose was to learn the age at which cortical cells have normal, adult-type receptive fields, and to find out whether such fields exist even in animals that have had no patterned visual stimulation."
            },
            "slug": "RECEPTIVE-FIELDS-OF-CELLS-IN-STRIATE-CORTEX-OF-VERY-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "RECEPTIVE FIELDS OF CELLS IN STRIATE CORTEX OF VERY YOUNG, VISUALLY INEXPERIENCED KITTENS."
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "The purpose was to learn the age at which cortical cells have normal, adult-type receptive fields, and to find out whether such fields exist even in animals that have had no patterned visual stimulation."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143980134"
                        ],
                        "name": "S. Sherman",
                        "slug": "S.-Sherman",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Sherman",
                            "middleNames": [
                                "Murray"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sherman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1700154,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "f1664bc77976d8abacb8e53f51c27dc89b05a8a7",
            "isKey": false,
            "numCitedBy": 168,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-field-defects-in-monocularly-and-binocularly-Sherman",
            "title": {
                "fragments": [],
                "text": "Visual field defects in monocularly and binocularly deprived cats."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 33565783,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b0b13465c36789ebd0751178c5403efd4dd390b9",
            "isKey": false,
            "numCitedBy": 357,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Receptive fields of retinal ganglion cells were studied in the light-adapted spider monkey. All fields mapped with white light had a concentric arrangement sililar to that of the cat retinal ganglion cells, with a sharply demarcated 'on' centre surrounded by an antagonistic 'off' periphery, or the reverse. The smallest receptive field centres were found near the fovea, and the size of centres tended to increase with increasing distance from the fovea. The smallest centre had a diameter of 4 minutes of arc (corresponding to about 20 microns on the retina) and was located 4 degrees from the fovea; the largest centre had a diameter of 2 degrees. Three ganglion cells out of about 100 responded in a specific way to coloured stimuli. In these cells light of short wave-length produced an 'on' response and light of long wave-length evoked inhibition followed by an 'off' response. Transition between the two types of response occurred at about 500 millimicrons, light of this wave-length evoked only feebel 'off' responses. Very weak responses were obtained to white light, presumably owing to the antagonism between light of short and long wavelengths. (Author)"
            },
            "slug": "Receptive-fields-of-optic-nerve-fibres-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields of optic nerve fibres in the spider monkey"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "Receptive fields of retinal ganglion cells were studied in the light-adapted spider monkey with very weak responses to white light, presumably owing to the antagonism between light of short and long wavelengths."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144100262"
                        ],
                        "name": "P. Rakić",
                        "slug": "P.-Rakić",
                        "structuredName": {
                            "firstName": "Pasko",
                            "lastName": "Rakić",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Rakić"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9219801,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d3d593a90f8190950145df3c4a1c0a9f94fa7966",
            "isKey": false,
            "numCitedBy": 711,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "Autoradiographic evidence from juvenile rhesus monkeys that had been exposed to a pulse of [3H]thymidine at different embryonic (E) and early postnatal (P) days indicates that all neurons which compose the visual system of this primate have been generated two months before birth. The first retinal ganglion cells (RGC) are generated around E30 preceding by a few days the onset of genesis of neurones destined for the dorsal lateral geniculate body (LGd) and superior colliculus (SC) both of which begin at E36. Production of neurons destined for the primary visual cortex (area 17) begins at approximately E43 and ends by E102. Neurons destined for layer IV, the major target of axons from the LGd, are generated between E70 and E85. The prenatal development of visual connections was studied by the autoradiographic method of anterograde axoplasmic transport in foetuses killed 14 days after unilateral eye injection of a mixture of [3H]proline and [3H]fucose. Initially, in the LGd and in the SC projections from both eyes overlap. Segregation of the axons and/or terminals from the two eyes occurs in the LGd and SC during the middle period of gestation. Transneuronal transport of tritium shows that although LGd axons form the optic radiation before E78, these fibres do not yet enter the developing cortical plate at this foetal age. During the second half of gestation, geniculocortical axons carrying input from each eye invade the cortex but are not yet segregated into ocular dominance columns. Rather, grains are distributed uniformly over the entire layer IV at E124. Three weeks before birth, at E144, segregation of afferents into sublayers IVA and IVC is apparent, and the first hint of ocular dominance columns is displayed by slight differences in grain counts in alternating areas of layer IV. These results show that all neurons in the primate visual system have been generated, reached their final positions and formed their basic connections subserving ocular dominance before birth, i.e. before visual experience. In the SC and LGD, monocular segregation is well established during the middle period of gestation, whereas in the cortex it has begun, but is not fully developed at birth."
            },
            "slug": "Prenatal-development-of-the-visual-system-in-rhesus-Rakić",
            "title": {
                "fragments": [],
                "text": "Prenatal development of the visual system in rhesus monkey."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Results show that all neurons in the primate visual system have been generated, reached their final positions and formed their basic connections subserving ocular dominance before birth, i.e. before visual experience."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6270661"
                        ],
                        "name": "S. W. Kuffler",
                        "slug": "S.-W.-Kuffler",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Kuffler",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. W. Kuffler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 165,
                                "start": 118
                            }
                        ],
                        "text": "We propose to give only a rough sketch of the subject: those who wish to read further may consult the original papers (Kuffier 1953; Rubel & Wiesel 1959, 1962, 1968)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 106,
                                "start": 92
                            }
                        ],
                        "text": "Because of the concentric, mutually antagonistic centresurround receptive field arrangement (Kuffier 1953), a spot occupying exactly the centre of the receptive field is always more effective than one of larger size, and consequently more effective than diffuse light."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 296,
                                "start": 119
                            }
                        ],
                        "text": "We propose to give only a rough sketch of the subject: those who wish to read further may consult the original papers (Kuffier 1953; Rubel & Wiesel 1959, 1962, 1968). The position occupied by the striate cortex in the visual pathway is illustrated in figure 1, a diagram taken from Polyak (1957). The brain in this figure is seen from below."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 18591943,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b446e3fb01026b4e5ad978812540f172405fff6f",
            "isKey": true,
            "numCitedBy": 2575,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "THE DISCHARGES carried in the optic nerve fibers contain all the information which the central nervous system receives from the retina. A correct interpretation of discharge patterns therefore constitutes an important step in the analysis of visual events. Further, investigations of nervous activity arising in the eye reveal many aspects of the functional organization of the neural elements within the retina itself. Following studies of discharges in the optic nerve of the eel’s eye by Adrian and Matthews (2,3), Hartline and his colleagues described the discharge pattern in the eye of the Limulus in a series of important and lucid papers (for a summary see 20). In the Limulus the relationship between the stimulus to the primary receptor cell and the nerve discharges proved relatively simple, apparently because the connection between sense cell and nerve fiber was a direct one. Thus, when stimulation is confined to one receptor the discharge in a single Limulus nerve fiber will provide a good indication of excitatory events which take place as a result of photochemical processes. Discharges last for the duration of illumination and their frequency is a measure of stimulus strength. Lately, however, it was shown by Hartline et al. (22) that inhibitory interactions may be revealed when several receptors are excited. On the whole, the Limulus preparation shows many features which are similar to other simple sense organs, for instance, stretch receptors. In the latter, however, instead of photochemical events, stretch-deformation acts as the adequate stimulus on sensory terminals and is translated into a characteristic discharge pattern. The discharge from the cold-blooded vertebrate retina (mainly frogs) proved much more complex. Hartline found three main types when recording from single optic nerve fibers: (i) “on” discharges, similar to those in the Limulus, firing for the duration of the light stimulus, (ii) “off” discharges appearing when a light stimulus was withdrawn, and (iii) ‘con-off” discharges, a combination of the former two, with activity confined mainly to onset and cessation of illumination. The mammalian discharge patterns were studied in a number of species by Granit and his co-workers in the course of their extensive work on the physiology of the visual system (summaries in 13, 15). On the whole, they did not observe any fundamental differences between frog and mammalian discharge types (see later)."
            },
            "slug": "Discharge-patterns-and-functional-organization-of-Kuffler",
            "title": {
                "fragments": [],
                "text": "Discharge patterns and functional organization of mammalian retina."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The Limulus preparation shows many features which are similar to other simple sense organs, for instance, stretch receptors, however, instead of photochemical events, stretch-deformation acts as the adequate stimulus on sensory terminals and is translated into a characteristic discharge pattern."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40461235"
                        ],
                        "name": "S. Levay",
                        "slug": "S.-Levay",
                        "structuredName": {
                            "firstName": "Simon",
                            "lastName": "Levay",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Levay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 78,
                                "start": 59
                            }
                        ],
                        "text": "The reconstruction of the operculum is shown in figure 24a (LeVay et al. 1975)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 193,
                                "start": 174
                            }
                        ],
                        "text": "(a) Reconstruct,ion of layer IV c ocular dominance columns over the entire exposed part of area 17 in the right occipital lobe, made from a series of reduced-silver sections (LeVay et al. 1975)' Dotted line on the left represents the midsagittal plane where the cortex bends around."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17640072,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "2f9d1f37d46969d496fb3acc850f920d0d2bdaef",
            "isKey": false,
            "numCitedBy": 392,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "A pattern of alternative dark and pale bands was observed in the straite cortex of the macaque monkey. The bands, which ran parallel to the surface, were seen in tangential sections stained with a reduced silver method for normal fibers and were most clear in layer 4C α, immediately deep to the line of Gennari. The dark bands were about 300 μ wide and showed blind endings and bifurcations. The light bands were about 50 μ wide and did not branch or terminate within area 17."
            },
            "slug": "The-pattern-of-ocular-dominance-columns-in-macaque-Levay-Hubel",
            "title": {
                "fragments": [],
                "text": "The pattern of ocular dominance columns in macaque visual cortex revealed by a reduced silver stain"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "A pattern of alternative dark and pale bands was observed in the straite cortex of the macaque monkey, observed in tangential sections stained with a reduced silver method for normal fibers."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2122676122"
                        ],
                        "name": "R. W. Guillery",
                        "slug": "R.-W.-Guillery",
                        "structuredName": {
                            "firstName": "Rainer",
                            "lastName": "Guillery",
                            "middleNames": [
                                "Walter"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. W. Guillery"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5448008"
                        ],
                        "name": "D. Stelzner",
                        "slug": "D.-Stelzner",
                        "structuredName": {
                            "firstName": "Dennis",
                            "lastName": "Stelzner",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Stelzner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26944052,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e5080f65b12de5db9d62356a262f08d576cc8190",
            "isKey": false,
            "numCitedBy": 304,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "One eyelid has been sutured in each of three seven‐day old kittens. Three months later the brains were fixed and stained by the Nissl method. In the contralateral lateral geniculate nucleus the cells of the deprived lamina A were smaller, more closely packed and paler staining than those in the normally innervated, ipsilateral lamina A. However, these changes were seen in the medial parts of the contralateral lamina A only. The lateral parts, which extend beyond the border of lamina A1 and which project to the monocular parts of the visual cortex showed no change. These results show that some geniculate cells are not affected by deprivation. The observations are consistent with the view that during normal development geniculate cell axons from adjacent laminae compete with each other for synaptic surfaces upon binocular cortical neurons: that unilateral lid suture upsets the balance of this competition and that the reduced perikaryal growth in the lateral geniculate nucleus is secondary to the unbalanced axonal development, which occurs in the binocular portions of the geniculocortical projection but which cannot occur in the monocular portions, where there is no competition."
            },
            "slug": "The-differential-effects-of-unilateral-lid-closure-Guillery-Stelzner",
            "title": {
                "fragments": [],
                "text": "The differential effects of unilateral lid closure upon the monocular and binocular segments of the dorsal lateral geniculate nucleus in the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The observations are consistent with the view that during normal development geniculate cell axons from adjacent laminae compete with each other for synaptic surfaces upon binocular cortical neurons: that unilateral lid suture upsets the balance of this competition and that the reduced perikaryal growth in the lateral geniculated nucleus is secondary to the unbalanced axonal development."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5647202"
                        ],
                        "name": "J. Lettvin",
                        "slug": "J.-Lettvin",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Lettvin",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lettvin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2701850"
                        ],
                        "name": "H. Maturana",
                        "slug": "H.-Maturana",
                        "structuredName": {
                            "firstName": "Humberto",
                            "lastName": "Maturana",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Maturana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4605464"
                        ],
                        "name": "W. McCulloch",
                        "slug": "W.-McCulloch",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "McCulloch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. McCulloch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50314979"
                        ],
                        "name": "W. Pitts",
                        "slug": "W.-Pitts",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Pitts",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pitts"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8739509,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bc4e084831b9f987826b2cf184356e347ee155f8",
            "isKey": false,
            "numCitedBy": 1756,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we analyze the activity of single fibers in the optic nerve of a frog. Our method is to find what sort of stimulus causes the largest activity in one nerve fiber and then what is the exciting aspect of that stimulus such that variations in everything else cause little change in the response. It has been known for the past 20 years that each fiber is connected not to a few rods and cones in the retina but to very many over a fair area. Our results show that for the most part within that area, it is not the light intensity itself but rather the pattern of local variation of intensity that is the exciting factor. There are four types of fibers, each type concerned with a different sort of pattern. Each type is uniformly distributed over the whole retina of the frog. Thus, there are four distinct parallel distributed channels whereby the frog's eye informs his brain about the visual image in terms of local pattern independent of average illumination. We describe the patterns and show the functional and anatomical separation of the channels. This work has been done on the frog, and our interpretation applies only to the frog."
            },
            "slug": "What-the-Frog's-Eye-Tells-the-Frog's-Brain-Lettvin-Maturana",
            "title": {
                "fragments": [],
                "text": "What the Frog's Eye Tells the Frog's Brain"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The results show that for the most part within that area of the optic nerve of a frog, it is not the light intensity itself but rather the pattern of local variation of intensity that is the exciting factor."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IRE"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13140630,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d1d186fe8eae26824a380f70454be04d6a756bef",
            "isKey": false,
            "numCitedBy": 896,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper is concerned with the relationship between orientation columns, ocular‐dominance columns, the topographic mapping of visual fields onto cortex, and receptive‐field size and scatter. Although the orientation columns are an order of magnitude smaller than the ocular‐dominance columns, the horizontal distance corresponding to a complete cycle of orientation columns, representing a rotation through 180°, seems to be roughly the same size as a left‐plus‐right ocular dominance set, with a thickness of about 0.5–1 mm, independent of eccentricity at least out to 15°. We use the term hypercolumn to refer to a complete set of either type (180°, or left‐plus‐right eyes)."
            },
            "slug": "Uniformity-of-monkey-striate-cortex:-A-parallel-and-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Uniformity of monkey striate cortex: A parallel relationship between field size, scatter, and magnification factor"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "The term hypercolumn is used to refer to a complete set of either type (180°, or left‐plus‐right eyes), with implications for the topographic mapping of visual fields onto cortex, and receptive‐field size and scatter."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107682207"
                        ],
                        "name": "J. Kelly",
                        "slug": "J.-Kelly",
                        "structuredName": {
                            "firstName": "James P.",
                            "lastName": "Kelly",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kelly"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1392063491"
                        ],
                        "name": "D. van Essen",
                        "slug": "D.-van-Essen",
                        "structuredName": {
                            "firstName": "D. C.",
                            "lastName": "van Essen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. van Essen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 27724501,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7f6f8180829ca1d451f4031da9ed8ce156b6be74",
            "isKey": false,
            "numCitedBy": 270,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The organization of the visual cortex was studied with a technique that allows one to determine the physiology and morphology of individual cells. Micro‐electrodes filled with the fluorescent dye Procion yellow were used to record intracellularly from cells in area 17 of the cat. The visual receptive field of each neurone was classified as simple, complex, or hypercomplex, and the cell was then stained by the iontophoretic injection of dye."
            },
            "slug": "Cell-structure-and-function-in-the-visual-cortex-of-Kelly-Essen",
            "title": {
                "fragments": [],
                "text": "Cell structure and function in the visual cortex of the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "The organization of the visual cortex was studied with a technique that allows one to determine the physiology and morphology of individual cells and classified them as simple, complex, or hypercomplex."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5151755"
                        ],
                        "name": "R. Guillery",
                        "slug": "R.-Guillery",
                        "structuredName": {
                            "firstName": "Ray",
                            "lastName": "Guillery",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Guillery"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 866297,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5ff5644a1a837a2ea7c815109bb3bf6c93f5c14f",
            "isKey": false,
            "numCitedBy": 337,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "It has been shown previously that, in kittens, geniculate laminae that are visually deprived by a unilateral lid‐suture grow less than normal. However, cell growth is affected only where the deprived laminae lie opposite a normally innervated lamina. The most lateral part of lamina A, which is innervated from the monocular crescent of the visual field and which extends beyond the edge of lamina A1, is not affected by lid‐suture. One interpretation of this result is that a binocular competition controls geniculate cell growth and that the normal competitive balance is upset by the lid‐suture."
            },
            "slug": "Binocular-competition-in-the-control-of-geniculate-Guillery",
            "title": {
                "fragments": [],
                "text": "Binocular competition in the control of geniculate cell growth"
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "This work has shown that geniculate laminae that are visually deprived by a unilateral lid‐suture grow less than normal, but the most lateral part of lamina A, which is innervated from the monocular crescent of the visual field and which extends beyond the edge ofLamina A1, is not affected by lid‐Suture."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15685782,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1c387b70f37fd902735e6c2b76d9715a251d1b5e",
            "isKey": false,
            "numCitedBy": 1059,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "The striate cortex of the macaque monkey is subdivided into two independent and overlapping systems of columns termed “orientation columns” and “ocular dominance columns.” The present paper is concerned with the orientation columns, particularly their geometry and the relationship between successive columns. The arrangement of the columns is highly ordered; in the great majority of oblique or tangential microelectrode penetrations the preferred orientations of cells changed systematically with electrode position, in a clockwise or counterclockwise direction. Graphs of orientation vs. electrode track distance were virtually straight lines over distances of up to several millimeters; such orderly sequences were often terminated by sudden changes in the direction of orientation shifts, from clockwise to counterclockwise or back. The orientations at which these reversals occurred were quite unpredictable. Total rotations of 180–360° were frequently seen between reversals. In tangential or almost tangential penetrations orientation shifts occurred almost every time the electrode was moved forward, indicating that the columns were either not discrete or had a thickness of less than 25–50 μ, the smallest order of distance that our methods could resolve. In penetrations that were almost perpendicular to the surface, the graphs of orientation vs. track distance were relatively flatter, as expected if the surfaces of constant orientation are perpendicular to the cortical surface. Stepwise changes in orientation of about 10° could sometimes be seen in perpendicular penetrations, each orientation persisting through several clear advances of the electrode, suggesting a set of discrete columnar subdivisions. The possibility of some kind of continuous variation in orientation with horizontal distance along the cortex was not, however, completely ruled out. Occasionally a highly ordered sequence was broken by an abrupt large shift in orientation of up to 90°. Shifts in ocular dominance occurred roughly every 0.25–0.5 mm and were independent of orientation shifts. In multiple parallel penetrations spaced closer than about 250 μ the slopes of the orientation vs. track distance curves were almost the same; reconstruction of these penetrations indicated that the regions of constant orientation are parallel sheets. On crossing perpendicular to these sheets, a total orientation shift of 180° took place over a distance of 0.5–1.0 mm. Column thickness, size of shifts in orientation, and the rate of change of orientation with distance along the cortex seemed to be independent of eccentricity, at least between 2° and 15° from the fovea. A few penetrations made in area 17 of the cat and in area 18 of the monkey showed similar orderly sequences of receptive‐field orientation shifts."
            },
            "slug": "Sequence-regularity-and-geometry-of-orientation-in-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Sequence regularity and geometry of orientation columns in the monkey striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Column thickness, size of shifts in orientation, and the rate of change of orientation with distance along the cortex seemed to be independent of eccentricity, at least between 2° and 15° from the fovea."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1993085645"
                        ],
                        "name": "P. Schiller",
                        "slug": "P.-Schiller",
                        "structuredName": {
                            "firstName": "P",
                            "lastName": "Schiller",
                            "middleNames": [
                                "H"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Schiller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33760699"
                        ],
                        "name": "B. Finlay",
                        "slug": "B.-Finlay",
                        "structuredName": {
                            "firstName": "Barbara",
                            "lastName": "Finlay",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Finlay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6849044"
                        ],
                        "name": "S. Volman",
                        "slug": "S.-Volman",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Volman",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Volman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14270911,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "09b4ba65735f8e1ae2b2bf71dec784911f9f67bc",
            "isKey": false,
            "numCitedBy": 229,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The response properties of single cells in monkey striate cortex were examined using moving bars, square-wave gratings, and sine-wave gratings. 2. The moving of cells studied were not selective for bar width or for the spatial frequency of square-wave gratings. 3. Most cells responded selectively to the spatial frequency of the sine-wave gratings. 4. The spatial frequency of the sine-wave grating eliciting the optimal response could not be predicted from the organization of the receptive field of each cell as determined by stationary or moving stimuli. 5. The sharpness of spatial-frequency selectivity is only slightly more pronounced in S-type cells than in CX-type cells. 6. S-type and CX-type cells differ significantly in the temporal modulation of their discharges to gratings. S-type cells discharge in sharp bursts to each cycle which traverses the receptive field. CX-type cells discharge in a rather continuous fashion. This measure can be used reliably to classify cells as S or CS type."
            },
            "slug": "Quantitative-studies-of-single-cell-properties-in-Schiller-Finlay",
            "title": {
                "fragments": [],
                "text": "Quantitative studies of single-cell properties in monkey striate cortex. III. Spatial frequency."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The spatial frequency of the sine-wave grating eliciting the optimal response could not be predicted from the organization of the receptive field of each cell as determined by stationary or moving stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1720750"
                        ],
                        "name": "C. J. Campbell",
                        "slug": "C.-J.-Campbell",
                        "structuredName": {
                            "firstName": "C",
                            "lastName": "Campbell",
                            "middleNames": [
                                "J"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. J. Campbell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 84316145,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "0c0b5b17de57f2de579bfbb80e800253367ce958",
            "isKey": false,
            "numCitedBy": 156,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This book describes a series of careful and detailed histologic studies of the retina in which the topographical arrangements of the ganglion cells were related to lesions at various levels of the visual pathways in the central nervous system. The experimental material from macaques and tissue from clinical human cases were stained by conventional techniques and intravitally with methylene blue. In the humans the author relates the histologic data, the patients' visual acuity, and visual fields. In general necrosis occurs to those ganglion cells connected to areas of the central nervous system, including the occipital cortex, which are subjected to destruction. Visual field defects apparently reflected the density of the degenerated ganglion cells but the relation between visual acuity and ganglion cell loss was far less precise."
            },
            "slug": "The-Retinal-Ganglion-Cell-Layer.-Campbell",
            "title": {
                "fragments": [],
                "text": "The Retinal Ganglion Cell Layer."
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This book describes a series of careful and detailed histologic studies of the retina in which the topographical arrangements of the ganglion cells were related to lesions at various levels of the visual pathways in the central nervous system."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5151755"
                        ],
                        "name": "R. Guillery",
                        "slug": "R.-Guillery",
                        "structuredName": {
                            "firstName": "Ray",
                            "lastName": "Guillery",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Guillery"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 208,
                                "start": 154
                            }
                        ],
                        "text": "Such an influence has been demonstrated in the cat geniculate, where there are also opportunities for direct interchange of information across the layers (Sanderson, Darian-Smith & Bishop 1969; Guillery 1966), but not, so far, in the monkey."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 21353554,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "8478b681b61b277e94b7049477ac2005ab99b72b",
            "isKey": false,
            "numCitedBy": 458,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "Four cell types are distinguishable in the lateral geniculate nucleus. The largest (class 1) have their dendrites oriented in relation to the plane of the laminae. The dendrites cross laminar borders freely and bear many fine spines. Class 2 cells show less orientation of their dendrites. These dendrites bear clusters of grape‐like appendages close to the branching points and fine spines on their peripheral segments. Only the peripheral segments cross laminar borders. The smallest (class 3) cells have long stalked appendages and give rise to intrinsic axons which ramify close to the perikaryon. Cell classes 1 and 2 occur in laminae A and A1, with class 1 cells mainly concentrated between laminae. Class 3 cells occur in all major laminae. Class 4 cells, with long smooth dendrites oriented parallel to the lamina, lie in lamina B."
            },
            "slug": "A-study-of-Golgi-preparations-from-the-dorsal-of-Guillery",
            "title": {
                "fragments": [],
                "text": "A study of Golgi preparations from the dorsal lateral geniculate nucleus of the adult cat"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "Four cell types are distinguishable in the lateral geniculate nucleus: the largest (class 1) have their dendrites oriented in relation to the plane of the laminae, the smallest (class 3) cells have long stalked appendages and give rise to intrinsic axons which ramify close to the perikaryon."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4938282"
                        ],
                        "name": "C. Ribak",
                        "slug": "C.-Ribak",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Ribak",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Ribak"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144993651"
                        ],
                        "name": "A. Peters",
                        "slug": "A.-Peters",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Peters",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Peters"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 6613291,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bcab2d9dd1ebb293e75ee0bfe52d6ebc6844290b",
            "isKey": false,
            "numCitedBy": 409,
            "numCiting": 64,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-autoradiographic-study-of-the-projections-from-Ribak-Peters",
            "title": {
                "fragments": [],
                "text": "An autoradiographic study of the projections from the lateral geniculate body of the rat"
            },
            "venue": {
                "fragments": [],
                "text": "Brain Research"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2008056"
                        ],
                        "name": "B. Grafstein",
                        "slug": "B.-Grafstein",
                        "structuredName": {
                            "firstName": "Bernice",
                            "lastName": "Grafstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Grafstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6428825"
                        ],
                        "name": "R. Laureno",
                        "slug": "R.-Laureno",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Laureno",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Laureno"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35288402,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "9dfb130d591abc8d52c903e6967bb70ba2851921",
            "isKey": false,
            "numCitedBy": 115,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Transport-of-radioactivity-from-eye-to-visual-in-Grafstein-Laureno",
            "title": {
                "fragments": [],
                "text": "Transport of radioactivity from eye to visual cortex in the mouse."
            },
            "venue": {
                "fragments": [],
                "text": "Experimental neurology"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4249397"
                        ],
                        "name": "H. Hartline",
                        "slug": "H.-Hartline",
                        "structuredName": {
                            "firstName": "Haldan",
                            "lastName": "Hartline",
                            "middleNames": [
                                "Keffer"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Hartline"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 106,
                                "start": 90
                            }
                        ],
                        "text": "In studying the physiology of the visual pathway we have made use of methods developed by Hartline (1940), Kuffler (1953), Talbot & Marshall (1941), and others."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 14394803,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "ec71953a116a869a063cf516fe5e57700fff6567",
            "isKey": false,
            "numCitedBy": 393,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Appreciation of the form of the retinal image depends upon a correspondence between the distribution of light on the retina and the distribution of activity among the fibers of the optic nerve. This correspondence may be studied directly by recording the activity in single optic nerve fibers in response to illuminating various parts of the retina. A given optic nerve fiber responds to light only if a particular region of the retina receives illumination. This region is termed the receptive field of that fiber. In a previous paper describing the responses in single optic nerve fibers from the cold-blooded vertebrate eye (Hartline, 1938) it was noted that the receptive fields of the optic nerve fibers are of small but appreciable extent, and that their locations on the retina are fixed. It is the purpose of the present paper to describe further the characteristics of receptive fields, and to discuss some of the spatial factors involved in the excitation of the fibers of the optic nerve. METHOD. The method for recording the activity in single optic nerve fibers from the eyes of cold-blooded vertebrates has been described in the previous paper (lot. cit.). An eye is excised, cut open, and small bundles of optic nerve fibers are dissected from the anterior surface of the exposed retina. The action potentials in these bundles are amplified and recorded with an oscillograph. When such a bundle has been split successfully , until only a single active fiber remains, the retina must be searched with a small spot of light to determine the region supplying that fiber. This search is aided by noting the direction, on the retina, from which the nerve fibers in the small bundle come, and by using large spots of light at first to locate the approximate position of the sensitive region. The optical system employed in these experiments has likewise been described. A spot of light of suitable size is projected upon the exposed retina; the coordinates of its position, referred to an arbitrary point of origin on the retina, are obtained from readings of crossed micrometers which control its location. The micrometer readings are reduced to millimeters on the retina by multiplying them by the magnification of the optical system (0.32 or 0.15). Sharpness of focus of the spot on the retina 690"
            },
            "slug": "THE-RECEPTIVE-FIELDS-OF-OPTIC-NERVE-FIBERS-Hartline",
            "title": {
                "fragments": [],
                "text": "THE RECEPTIVE FIELDS OF OPTIC NERVE FIBERS"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "The purpose of the present paper is to describe further the characteristics of receptive fields, and to discuss some of the spatial factors involved in the excitation of the fibers of the optic nerve."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1940
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32056095"
                        ],
                        "name": "C. Gilbert",
                        "slug": "C.-Gilbert",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Gilbert",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Gilbert"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 34,
                                "start": 19
                            }
                        ],
                        "text": "monkey cortex, and Gilbert (1977) has confirmed their presence in the cat striate cortex."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 31178862,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b83b8b4232d9c4ce8461c7acc21630e2cbf644c4",
            "isKey": false,
            "numCitedBy": 673,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Cells in area 17 of the cat visual cortex were studied with a view towards correlating receptive field properties with layering. A number of receptive field parameters were measured for all units, and nearly every unit was marked with a microlesion to determine accurately the layer in which it was found."
            },
            "slug": "Laminar-differences-in-receptive-field-properties-Gilbert",
            "title": {
                "fragments": [],
                "text": "Laminar differences in receptive field properties of cells in cat primary visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "Cells in area 17 of the cat visual cortex were studied with a view towards correlating receptive field properties with layering to determine accurately the layer in which it was found."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145627289"
                        ],
                        "name": "W. Cowan",
                        "slug": "W.-Cowan",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Cowan",
                            "middleNames": [
                                "Maxwell"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Cowan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2821297"
                        ],
                        "name": "D. Gottlieb",
                        "slug": "D.-Gottlieb",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Gottlieb",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gottlieb"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "87661583"
                        ],
                        "name": "A. Hendrickson",
                        "slug": "A.-Hendrickson",
                        "structuredName": {
                            "firstName": "Anita",
                            "lastName": "Hendrickson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Hendrickson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1859772"
                        ],
                        "name": "J. Price",
                        "slug": "J.-Price",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Price",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Price"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4264071"
                        ],
                        "name": "T. Woolsey",
                        "slug": "T.-Woolsey",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Woolsey",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Woolsey"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 35115378,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "9e5f6bbae13e881c7d872be4c881adcd15d2d7ba",
            "isKey": false,
            "numCitedBy": 1535,
            "numCiting": 79,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-autoradiographic-demonstration-of-axonal-in-the-Cowan-Gottlieb",
            "title": {
                "fragments": [],
                "text": "The autoradiographic demonstration of axonal connections in the central nervous system."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2077655621"
                        ],
                        "name": "S. Sherman",
                        "slug": "S.-Sherman",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Sherman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sherman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5151755"
                        ],
                        "name": "R. Guillery",
                        "slug": "R.-Guillery",
                        "structuredName": {
                            "firstName": "Ray",
                            "lastName": "Guillery",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Guillery"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2328544"
                        ],
                        "name": "J. Kaas",
                        "slug": "J.-Kaas",
                        "structuredName": {
                            "firstName": "Jon",
                            "lastName": "Kaas",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kaas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39520959"
                        ],
                        "name": "K. Sanderson",
                        "slug": "K.-Sanderson",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Sanderson",
                            "middleNames": [
                                "James"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Sanderson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45351272,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "20a31e0c24713cf2bd19483ad8a0e4175f7e42e1",
            "isKey": false,
            "numCitedBy": 158,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "Cats were raised with one eye sutured and with a lesion in the retina of the other eye. In these cats the competitive interaction between the pathways that go to the cortex from each eye was tested by studying the behavioral capacities, the electrophysiological responses and the morphological appearance of the geniculo‐cortical pathways."
            },
            "slug": "Behavioral,-electrophysiological-and-morphological-Sherman-Guillery",
            "title": {
                "fragments": [],
                "text": "Behavioral, electrophysiological and morphological studies of binocular competition in the development of the geniculo–corticalpathways of cats"
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "In cats raised with one eye sutured and with a lesion in the retina of the other eye the competitive interaction between the pathways that go to the cortex from each eye was tested by studying the behavioral capacities, the electrophysiological responses and the morphological appearance of the geniculo‐cortical pathways."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4265895,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "c8c479845a17376705951c80551ed707b9678e9b",
            "isKey": false,
            "numCitedBy": 550,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Random-dot stereoscopic patterns have been used to provide behavioural evidence of stereoscopic vision in macaque monkeys. Cells sensitive to binocular depth have been found in area 18 of the macaque monkey cortex."
            },
            "slug": "Stereoscopic-Vision-in-Macaque-Monkey:-Cells-to-in-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Stereoscopic Vision in Macaque Monkey: Cells sensitive to Binocular Depth in Area 18 of the Macaque Monkey Cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "Random-dot stereoscopic patterns have been used to provide behavioural evidence of stereoscopic vision in macaque monkeys and cells sensitive to binocular depth have been found in area 18 of the macaque monkey cortex."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2052187313"
                        ],
                        "name": "S. Goldberg",
                        "slug": "S.-Goldberg",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Goldberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Goldberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "88426015"
                        ],
                        "name": "M. Kotani",
                        "slug": "M.-Kotani",
                        "structuredName": {
                            "firstName": "Minoru",
                            "lastName": "Kotani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Kotani"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34472936,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7f7c2abb5bf00e9951846f499c234ed78bc63325",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Tritiated leucine was unilaterally introduced into the vitreous chambers of metamorphosing bullfrog tadpoles in an attempt to determine whether the optic fibers may be traced by radioautography. After injection, the animals were sacrificed at varying time intervals from 4½ minutes to 32 days. Serial sections of the brain were subjected to radioautography. The optic fibers were thereby traced to their known terminations and to a small thalamic cell cluster to which we found no reference in the literature. Significant differential radioactivity was detectable in the contralateral optic lobe as early as six hours postinjection, suggesting a flow, whether intra‐ or extraaxonal, of at least 10–22 mm/day."
            },
            "slug": "The-projection-of-optic-nerve-fibers-in-the-frog-as-Goldberg-Kotani",
            "title": {
                "fragments": [],
                "text": "The projection of optic nerve fibers in the frog Rana catesbeiana as studied by radioautography"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Tritiated leucine was unilaterally introduced into the vitreous chambers of metamorphosing bullfrog tadpoles in an attempt to determine whether the optic fibers may be traced by radioautography."
            },
            "venue": {
                "fragments": [],
                "text": "The Anatomical record"
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4991113"
                        ],
                        "name": "R. Lasek",
                        "slug": "R.-Lasek",
                        "structuredName": {
                            "firstName": "Raymond",
                            "lastName": "Lasek",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Lasek"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "25535604"
                        ],
                        "name": "B. S. Joseph",
                        "slug": "B.-S.-Joseph",
                        "structuredName": {
                            "firstName": "B",
                            "lastName": "Joseph",
                            "middleNames": [
                                "S"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. S. Joseph"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47409285"
                        ],
                        "name": "D. Whitlock",
                        "slug": "D.-Whitlock",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Whitlock",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Whitlock"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10895581,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0eaf7d48407116f3d077b080fea5db4a52a3e333",
            "isKey": false,
            "numCitedBy": 229,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Evaluation-of-a-radioautographic-neuroanatomical-Lasek-Joseph",
            "title": {
                "fragments": [],
                "text": "Evaluation of a radioautographic neuroanatomical tracing method."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2881454"
                        ],
                        "name": "B. Cleland",
                        "slug": "B.-Cleland",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Cleland",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Cleland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3672557"
                        ],
                        "name": "W. Levick",
                        "slug": "W.-Levick",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Levick",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Levick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 25868923,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "01690fd54ae6c9c1daa6f33604e4d2ab15fa8946",
            "isKey": false,
            "numCitedBy": 395,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "1. In a reference sample of 960 cat retinal ganglion cells, seventy‐three had receptive fields departing from the concentric centre—surround pattern."
            },
            "slug": "Properties-of-rarely-encountered-types-of-ganglion-Cleland-Levick",
            "title": {
                "fragments": [],
                "text": "Properties of rarely encountered types of ganglion cells in the cat's retina and on overall classification"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "In a reference sample of 960 cat retinal ganglion cells, seventy‐three had receptive fields departing from the concentric centre—surround pattern."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40461235"
                        ],
                        "name": "S. Levay",
                        "slug": "S.-Levay",
                        "structuredName": {
                            "firstName": "Simon",
                            "lastName": "Levay",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Levay"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 84,
                                "start": 65
                            }
                        ],
                        "text": "The result of such an experiment is shown in figure 22, plate 10 (Rubel et al. 1976)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 7650221,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0e446e9960a9fa3aedd30237a9e7fa7e97115c31",
            "isKey": false,
            "numCitedBy": 178,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "service Email alerting click here the box at the top right corner of the article or Receive free email alerts when new articles cite this article-sign up in"
            },
            "slug": "Functional-architecture-of-area-17-in-normal-and-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Functional architecture of area 17 in normal and monocularly deprived macaque monkeys."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The next generation of policymakers and decision-makers will have to consider climate change in a more holistic way than in the past when making decisions on climate change policy and regulation."
            },
            "venue": {
                "fragments": [],
                "text": "Cold Spring Harbor symposia on quantitative biology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "87382177"
                        ],
                        "name": "R. Fink",
                        "slug": "R.-Fink",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Fink",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Fink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4877571"
                        ],
                        "name": "L. Heimer",
                        "slug": "L.-Heimer",
                        "structuredName": {
                            "firstName": "Lennart",
                            "lastName": "Heimer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Heimer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37578384,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "417a4fe2675b23632843ae6bd9257f78a89235a7",
            "isKey": false,
            "numCitedBy": 1698,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Two-methods-for-selective-silver-impregnation-of-in-Fink-Heimer",
            "title": {
                "fragments": [],
                "text": "Two methods for selective silver impregnation of degenerating axons and their synaptic endings in the central nervous system."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "21056463"
                        ],
                        "name": "A. Portmann",
                        "slug": "A.-Portmann",
                        "structuredName": {
                            "firstName": "Adolf",
                            "lastName": "Portmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Portmann"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 160988136,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "78efdf8862122540937c92990117b34ed1cbb352",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Die-Tiergestalt-:-Studien-über-die-Bedeutung-der-Portmann",
            "title": {
                "fragments": [],
                "text": "Die Tiergestalt : Studien über die Bedeutung der tierischen Erscheinung"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "77693801"
                        ],
                        "name": "W. Andrew",
                        "slug": "W.-Andrew",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "Andrew",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Andrew"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 87938027,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "065b39db841cf80d7febdbb910a734a2ca73f4ef",
            "isKey": false,
            "numCitedBy": 1180,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-vertebrate-visual-system-Andrew",
            "title": {
                "fragments": [],
                "text": "The vertebrate visual system"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50431698"
                        ],
                        "name": "S. A. Talbot",
                        "slug": "S.-A.-Talbot",
                        "structuredName": {
                            "firstName": "Samuel",
                            "lastName": "Talbot",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. A. Talbot"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "92060670"
                        ],
                        "name": "W. H. Marshall",
                        "slug": "W.-H.-Marshall",
                        "structuredName": {
                            "firstName": "Wade",
                            "lastName": "Marshall",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. H. Marshall"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 72257458,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "92e66e4fccb455fbebfb46bc90254207c90f5090",
            "isKey": false,
            "numCitedBy": 471,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Physiological-Studies-on-Neural-Mechanisms-of-and-Talbot-Marshall",
            "title": {
                "fragments": [],
                "text": "Physiological Studies on Neural Mechanisms of Visual Localization and Discrimination"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1941
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2606156"
                        ],
                        "name": "F. Cordes",
                        "slug": "F.-Cordes",
                        "structuredName": {
                            "firstName": "Frederick",
                            "lastName": "Cordes",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Cordes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 71471318,
            "fieldsOfStudy": [
                "Biology",
                "Medicine"
            ],
            "id": "94b5fd15bdff03c8e3077e0fd60b040701b8b1e7",
            "isKey": false,
            "numCitedBy": 192,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Vertebrate-Visual-System,-Stephen-Polyak-(Ed.).-Cordes",
            "title": {
                "fragments": [],
                "text": "The Vertebrate Visual System, Stephen Polyak (Ed.). the University of Chicago Press, Chicago (1957), 1390, 546 illustrations, index, bibliography. Price: $45.00."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2685465"
                        ],
                        "name": "B. Brouwer",
                        "slug": "B.-Brouwer",
                        "structuredName": {
                            "firstName": "Bernard",
                            "lastName": "Brouwer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Brouwer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "80067432"
                        ],
                        "name": "W. Zeeman",
                        "slug": "W.-Zeeman",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Zeeman",
                            "middleNames": [
                                "P.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Zeeman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 196377183,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a17d41aecfd6a6fbc05e3cfb5b08c374eae90e3f",
            "isKey": false,
            "numCitedBy": 153,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "THE-PROJECTION-OF-THE-RETINA-IN-THE-PRIMARY-OPTIC-Brouwer-Zeeman",
            "title": {
                "fragments": [],
                "text": "THE PROJECTION OF THE RETINA IN THE PRIMARY OPTIC NEURON IN MONKEYS"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1926
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2235827"
                        ],
                        "name": "U. Dräger",
                        "slug": "U.-Dräger",
                        "structuredName": {
                            "firstName": "Ursula",
                            "lastName": "Dräger",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Dräger"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46675253,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a21734b97f89d739491708f13af0a66363a17e64",
            "isKey": false,
            "numCitedBy": 187,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Autoradiography-of-tritiated-proline-and-fucose-the-Dräger",
            "title": {
                "fragments": [],
                "text": "Autoradiography of tritiated proline and fucose transported transneuronally from the eye to the visual cortex in pigmented and albino mice."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6688131"
                        ],
                        "name": "V. Casagrande",
                        "slug": "V.-Casagrande",
                        "structuredName": {
                            "firstName": "Vivien",
                            "lastName": "Casagrande",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Casagrande"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39706277"
                        ],
                        "name": "J. K. Harting",
                        "slug": "J.-K.-Harting",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Harting",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. K. Harting"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 19912112,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3e8de7b7e0e903500090a9afe246e5255b2251ec",
            "isKey": false,
            "numCitedBy": 104,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Transneuronal-transport-of-tritiated-fucose-and-in-Casagrande-Harting",
            "title": {
                "fragments": [],
                "text": "Transneuronal transport of tritiated fucose and proline in the visual pathways of tree shrew Tupaia glis\n"
            },
            "venue": {
                "fragments": [],
                "text": "Brain Research"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 21324401,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7ddefa77a4bd01a01d52c51a04e225782ff805de",
            "isKey": false,
            "numCitedBy": 205,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Receptive-fields-of-ganglion-cells-in-the-cat's-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields of ganglion cells in the cat's retina"
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5505304"
                        ],
                        "name": "R. A. Fisken",
                        "slug": "R.-A.-Fisken",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Fisken",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. A. Fisken"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2090920"
                        ],
                        "name": "L. Garey",
                        "slug": "L.-Garey",
                        "structuredName": {
                            "firstName": "Laurence",
                            "lastName": "Garey",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Garey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144416252"
                        ],
                        "name": "T. Powell",
                        "slug": "T.-Powell",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Powell",
                            "middleNames": [
                                "Philip",
                                "Stroud"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Powell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40578420,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "21b3abb51adecb4cc0e13d42f9d9156e2d911dc3",
            "isKey": false,
            "numCitedBy": 68,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Patterns-of-degeneration-after-intrinsic-lesions-of-Fisken-Garey",
            "title": {
                "fragments": [],
                "text": "Patterns of degeneration after intrinsic lesions of the visual cortex (area 17) of the monkey."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144469587"
                        ],
                        "name": "J. Stone",
                        "slug": "J.-Stone",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Stone",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Stone"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46864905"
                        ],
                        "name": "Y. Fukuda",
                        "slug": "Y.-Fukuda",
                        "structuredName": {
                            "firstName": "Yutaka",
                            "lastName": "Fukuda",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Fukuda"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38662998,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "597c9902f0129e66aa175a3b32b777a863cd2382",
            "isKey": false,
            "numCitedBy": 502,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Properties-of-cat-retinal-ganglion-cells:-a-of-with-Stone-Fukuda",
            "title": {
                "fragments": [],
                "text": "Properties of cat retinal ganglion cells: a comparison of W-cells with X- and Y-cells."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145606123"
                        ],
                        "name": "P. O. Bishop",
                        "slug": "P.-O.-Bishop",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Bishop",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. O. Bishop"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2088293"
                        ],
                        "name": "G. Henry",
                        "slug": "G.-Henry",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Henry",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Henry"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6182630,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "96e0b8d5118b81d22ec4c73eff190506fbe87247",
            "isKey": false,
            "numCitedBy": 84,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Striate-neurons:-receptive-field-concepts.-Bishop-Henry",
            "title": {
                "fragments": [],
                "text": "Striate neurons: receptive field concepts."
            },
            "venue": {
                "fragments": [],
                "text": "Investigative ophthalmology"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16711514"
                        ],
                        "name": "J. T. Wiitanen",
                        "slug": "J.-T.-Wiitanen",
                        "structuredName": {
                            "firstName": "J",
                            "lastName": "Wiitanen",
                            "middleNames": [
                                "T"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. T. Wiitanen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34492850,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "32336d57b435b60016c4a2b2833c7c356040a484",
            "isKey": false,
            "numCitedBy": 178,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Selective-silver-impregnation-of-degenerating-axons-Wiitanen",
            "title": {
                "fragments": [],
                "text": "Selective silver impregnation of degenerating axons and axon terminals in the central nervous system of the monkey (Macaca mulatta)."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144120455"
                        ],
                        "name": "C. Kennedy",
                        "slug": "C.-Kennedy",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Kennedy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Kennedy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6609127"
                        ],
                        "name": "M. D. des Rosiers",
                        "slug": "M.-D.-des-Rosiers",
                        "structuredName": {
                            "firstName": "M",
                            "lastName": "des Rosiers",
                            "middleNames": [
                                "H"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. D. des Rosiers"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2074260"
                        ],
                        "name": "L. Sokoloff",
                        "slug": "L.-Sokoloff",
                        "structuredName": {
                            "firstName": "Louis",
                            "lastName": "Sokoloff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Sokoloff"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4402076"
                        ],
                        "name": "M. Reivich",
                        "slug": "M.-Reivich",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Reivich",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Reivich"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48289114"
                        ],
                        "name": "J. Jehle",
                        "slug": "J.-Jehle",
                        "structuredName": {
                            "firstName": "Jane",
                            "lastName": "Jehle",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Jehle"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24828852,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1ae165e9675a6f48ab6c00072623ffb12dede60c",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-ocular-dominance-columns-of-the-striate-cortex-Kennedy-Rosiers",
            "title": {
                "fragments": [],
                "text": "The ocular dominance columns of the striate cortex as studied by the deoxyglucose method for measurement of local cerebral glucose utilization."
            },
            "venue": {
                "fragments": [],
                "text": "Transactions of the American Neurological Association"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39520959"
                        ],
                        "name": "K. Sanderson",
                        "slug": "K.-Sanderson",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Sanderson",
                            "middleNames": [
                                "James"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Sanderson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1402738149"
                        ],
                        "name": "I. Darian‐Smith",
                        "slug": "I.-Darian‐Smith",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Darian‐Smith",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Darian‐Smith"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145606123"
                        ],
                        "name": "P. O. Bishop",
                        "slug": "P.-O.-Bishop",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Bishop",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. O. Bishop"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28708638,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7a0214d0bd3ac041f7e6989f5665f7c82de92e0b",
            "isKey": false,
            "numCitedBy": 86,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Binocular-corresponding-receptive-fields-of-single-Sanderson-Darian‐Smith",
            "title": {
                "fragments": [],
                "text": "Binocular corresponding receptive fields of single units in the cat dorsal lateral geniculate nucleus."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28466449,
            "fieldsOfStudy": [
                "Chemistry",
                "Medicine"
            ],
            "id": "3c366f4de363c2f37043700fd954e30ddb9bb6af",
            "isKey": false,
            "numCitedBy": 51,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-re-examination-of-stereoscopic-mechanisms-in-area-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "A re-examination of stereoscopic mechanisms in area 17 of the cat."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "12924772"
                        ],
                        "name": "W. le Gros Clark",
                        "slug": "W.-le-Gros-Clark",
                        "structuredName": {
                            "firstName": "Wilfrid",
                            "lastName": "le Gros Clark",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. le Gros Clark"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4884026"
                        ],
                        "name": "S. Sunderland",
                        "slug": "S.-Sunderland",
                        "structuredName": {
                            "firstName": "Sydney",
                            "lastName": "Sunderland",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sunderland"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27941289,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e2b8bd60663db0eea66d479460614cc787dee3c5",
            "isKey": false,
            "numCitedBy": 46,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Structural-changes-in-the-isolated-visual-cortex.-Clark-Sunderland",
            "title": {
                "fragments": [],
                "text": "Structural changes in the isolated visual cortex."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of anatomy"
            },
            "year": 1939
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14337861,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "cc099151146866673e340e3a23b3c0b5011c8cac",
            "isKey": false,
            "numCitedBy": 2428,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "SINGLE-CELL-RESPONSES-IN-STRIATE-CORTEX-OF-KITTENS-Wiesel-Hubel",
            "title": {
                "fragments": [],
                "text": "SINGLE-CELL RESPONSES IN STRIATE CORTEX OF KITTENS DEPRIVED OF VISION IN ONE EYE."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1963
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 38
                            }
                        ],
                        "text": "Nevertheless, as with zebras' stripes (Portmann 1948) certain general rules seem to be obeyed in all the monkeys we have so far looked at."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Tiergestalt - Studien iiber die Bedeutung der tierischen Erscheinung"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1948
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A quantitative study of the projection area of the central and paracentral visual field in area 17 of the cat. II. The spatial organization of the orientation domain"
            },
            "venue": {
                "fragments": [],
                "text": "Exp. Brain Res"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 216,
                                "start": 34
                            }
                        ],
                        "text": "These are described in figure 21 (Rubel et al. 1976). The targets to which these aggregations project are unknown, and their significance is quite obscure.) A few years before our studies, Grafstein & Laureno (1973) had obRerved that in a mouse whose eye had been injected with a mixture of radioactive proline and fucose, some of the label was transported all the way to the striate cortex of the opposite hemisphere."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Visual· field representation in layer IV C"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Influence of functional activity on local cerebral glucose utilization"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Projections of individual laminae of the lateral geniculate nucleus in the prosimian"
            },
            "venue": {
                "fragments": [],
                "text": "4th ann. meet. Soo. Neurosci. (St Louis) Abstr"
            },
            "year": 1974
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The distribution of afferents"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 10,
            "methodology": 2
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 75,
        "totalPages": 8
    },
    "page_url": "https://www.semanticscholar.org/paper/Functional-architecture-of-macaque-monkey-visual-Rubel-Wiesel/e9c63ea314bd66b56e1751e8b9f1cc8598df4486?sort=total-citations"
}