{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144153201"
                        ],
                        "name": "J. Baker",
                        "slug": "J.-Baker",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Baker",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Baker"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121084921,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6c79a9bb8f885050cad70b4c69e016b186ffa538",
            "isKey": false,
            "numCitedBy": 654,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Algorithms which are based on modeling speech as a finite‐state, hidden Markov process have been very successful in recent years. This paper presents a generalization of these algorithms to certain denumerable‐state, hidden Markov processes. This algorithm permits automatic training of the stochastic analog of an arbitrary context free grammar. In particular, in contrast to many grammatical inference methods, the new algorithm allows the grammar to have an arbitrary degree of ambiguity. Since natural language is often syntactically ambiguous, it is necessary for the grammatical inference algorithm to allow for this ambiguity. Furthermore, allowing ambiguity in the grammar allows errors in the recognition process to be explicitly modeled in the grammar rather than added as an extra component."
            },
            "slug": "Trainable-grammars-for-speech-recognition-Baker",
            "title": {
                "fragments": [],
                "text": "Trainable grammars for speech recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "This paper presents a generalization of these algorithms to certain denumerable‐state, hidden Markov processes that permits automatic training of the stochastic analog of an arbitrary context free grammar."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143957166"
                        ],
                        "name": "L. G. Miller",
                        "slug": "L.-G.-Miller",
                        "structuredName": {
                            "firstName": "Laura",
                            "lastName": "Miller",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. G. Miller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1759195"
                        ],
                        "name": "S. Levinson",
                        "slug": "S.-Levinson",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Levinson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Levinson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62094912,
            "fieldsOfStudy": [
                "Linguistics",
                "Computer Science"
            ],
            "id": "37e30c09eabc6000377a6b9fc06519d095902278",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors describe a syntactive component for large vocabulary speech recognition that incorporates a context-free covering grammar as the language model. The component comprises two modules: a preprocessing module and a syntactic analysis module. The preprocessing module consists of a lexical and a grammar preprocessor. The preprocessors facilitate grammar development. The syntactic analysis module consists of an error correcting maximum likelihood Cocke-Younger-Kasami parser and a context-free covering grammar. The parsar determines the sentence of maximum likelihood accepted by the grammar with respect to a word log likelihood matrix supplied b the acoustic/phonetic component of the speech recognition system. The effectiveness of this type of syntactic analysis was tested in a simulation using a 1040 word vocabulary. Results and error correcting examples are given.<<ETX>>"
            },
            "slug": "Syntactic-analysis-for-large-vocabulary-speech-a-Miller-Levinson",
            "title": {
                "fragments": [],
                "text": "Syntactic analysis for large vocabulary speech recognition using a context-free covering grammar"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "A syntactive component for large vocabulary speech recognition that incorporates a context-free covering grammar as the language model and the effectiveness of this type of syntactic analysis was tested in a simulation using a 1040 word vocabulary."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP-88., International Conference on Acoustics, Speech, and Signal Processing"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2472759"
                        ],
                        "name": "F. Jelinek",
                        "slug": "F.-Jelinek",
                        "structuredName": {
                            "firstName": "Frederick",
                            "lastName": "Jelinek",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Jelinek"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60744956,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d64cae6538bb3b8e595007585477a9fdef106602",
            "isKey": false,
            "numCitedBy": 97,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "A language model is a conceptual device which, given a string of past words, provides an estimate of the probability that any given word from an allowed vocabulary will follow the string. In speech recognition, a language model is used to direct the hypothesis search for the sentence that was spoken. In fact, its probability assignments are a factor in evaluating the likelihood that any word string was uttered, and in ordering the word string hypotheses to be examined (1). Language models are also useful in text encoding for compression or transmission, in character recognition of printed or handwritten text, etc. Ideally, the probability assigned by a language model to any word should depend on the entire past sequence of words. However, it is practically impossible to implement such a dependence: 1) The probability estimate involved would have to be extracted from a giant sample of training text containing billions of words; 2) If the probabilities were extractable, sufficient space in computer memory could not be found to store them."
            },
            "slug": "Markov-Source-Modeling-of-Text-Generation-Jelinek",
            "title": {
                "fragments": [],
                "text": "Markov Source Modeling of Text Generation"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A language model is a conceptual device which, given a string of past words, provides an estimate of the probability that any given word from an allowed vocabulary will follow the string."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1759195"
                        ],
                        "name": "S. Levinson",
                        "slug": "S.-Levinson",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Levinson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Levinson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 20391216,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6f90d340bbf9854a3c4e9436ba51f5fd090571fe",
            "isKey": false,
            "numCitedBy": 181,
            "numCiting": 123,
            "paperAbstract": {
                "fragments": [],
                "text": "The past decade has witnessed substantial progress toward the goal of constructing a machine capable of understanding colloquial discourse. Central to this progress has been the development and application of mathematical methods that permit modeling the speech signal as a complex code with several coexisting levels of structure. The most successful of these are \"template matching,\" stochastic modeling, and probabilistic parsing. The manifestation of common themes such as dynamic programming and finite-state descriptions accentuates a superficial likeness amongst the methods which is often mistaken for the deeper similarity arising from their shared Bayesian foundation. In this paper, we outline the mathematical bases of these methods, invariant metrics, hidden Markov chains, and formal grammars, respectively. We then recount and briefly interpret the results of experiments in speech recognition to which the various methods were applied. Since these mathematical principles seem to bear little resemblance to traditional linguistic characterizations of speech, the success of the experiments is occasionally attributed, even by their authors, merely to excellent engineering. We conclude by speculating that, quite to the contrary, these methods actually constitute a powerful theory of speech that can be reconciled with and elucidate conventional linguistic theories while being used to build truly competent mechanical speech recognizers."
            },
            "slug": "Structural-methods-in-automatic-speech-recognition-Levinson",
            "title": {
                "fragments": [],
                "text": "Structural methods in automatic speech recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is speculated that these mathematical principles constitute a powerful theory of speech that can be reconciled with and elucidate conventional linguistic theories while being used to build truly competent mechanical speech recognizers."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "114531657"
                        ],
                        "name": "Noam Chomsky",
                        "slug": "Noam-Chomsky",
                        "structuredName": {
                            "firstName": "Noam",
                            "lastName": "Chomsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Noam Chomsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16792674,
            "fieldsOfStudy": [
                "Computer Science",
                "Linguistics"
            ],
            "id": "dafabc60fe64f5fea4d20d464d453c262d2649b4",
            "isKey": false,
            "numCitedBy": 1343,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-Certain-Formal-Properties-of-Grammars-Chomsky",
            "title": {
                "fragments": [],
                "text": "On Certain Formal Properties of Grammars"
            },
            "venue": {
                "fragments": [],
                "text": "Inf. Control."
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1759195"
                        ],
                        "name": "S. Levinson",
                        "slug": "S.-Levinson",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Levinson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Levinson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712517"
                        ],
                        "name": "L. Rabiner",
                        "slug": "L.-Rabiner",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Rabiner",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Rabiner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34830449"
                        ],
                        "name": "M. Sondhi",
                        "slug": "M.-Sondhi",
                        "structuredName": {
                            "firstName": "Man",
                            "lastName": "Sondhi",
                            "middleNames": [
                                "Mohan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Sondhi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46254718,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "090f3ea5bc188bbb03aec02aba9ed9c7b38ff870",
            "isKey": false,
            "numCitedBy": 1082,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we present several of the salient theoretical and practical issues associated with modeling a speech signal as a probabilistic function of a (hidden) Markov chain. First we give a concise review of the literature with emphasis on the Baum-Welch algorithm. This is followed by a detailed discussion of three issues not treated in the literature: alternatives to the Baum-Welch algorithm; critical facets of the implementation of the algorithms, with emphasis on their numerical properties; and behavior of Markov models on certain artificial but realistic problems. Special attention is given to a particular class of Markov models, which we call “left-to-right” models. This class of models is especially appropriate for isolated word recognition. The results of the application of these methods to an isolated word, speaker-independent speech recognition experiment are given in a companion paper."
            },
            "slug": "An-introduction-to-the-application-of-the-theory-of-Levinson-Rabiner",
            "title": {
                "fragments": [],
                "text": "An introduction to the application of the theory of probabilistic functions of a Markov process to automatic speech recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "This paper presents several of the salient theoretical and practical issues associated with modeling a speech signal as a probabilistic function of a (hidden) Markov chain, and focuses on a particular class of Markov models, which are especially appropriate for isolated word recognition."
            },
            "venue": {
                "fragments": [],
                "text": "The Bell System Technical Journal"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "114531657"
                        ],
                        "name": "Noam Chomsky",
                        "slug": "Noam-Chomsky",
                        "structuredName": {
                            "firstName": "Noam",
                            "lastName": "Chomsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Noam Chomsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 19519474,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "56fcae8e3616df9398e231795c6a687caaf88f76",
            "isKey": false,
            "numCitedBy": 1069,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "We investigate several conceptions of linguistic structure to determine whether or not they can provide simple and \"revealing\" grammars that generate all of the sentences of English and only these. We find that no finite-state Markov process that produces symbols with transition from state to state can serve as an English grammar. Furthermore, the particular subclass of such processes that produce n -order statistical approximations to English do not come closer, with increasing n , to matching the output of an English grammar. We formalize-the notions of \"phrase structure\" and show that this gives us a method for describing language which is essentially more powerful, though still representable as a rather elementary type of finite-state process. Nevertheless, it is successful only when limited to a small subset of simple sentences. We study the formal properties of a set of grammatical transformations that carry sentences with phrase structure into new sentences with derived phrase structure, showing that transformational grammars are processes of the same elementary type as phrase-structure grammars; that the grammar of English is materially simplified if phrase structure description is limited to a kernel of simple sentences from which all other sentences are constructed by repeated transformations; and that this view of linguistic structure gives a certain insight into the use and understanding of language."
            },
            "slug": "Three-models-for-the-description-of-language-Chomsky",
            "title": {
                "fragments": [],
                "text": "Three models for the description of language"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "It is found that no finite-state Markov process that produces symbols with transition from state to state can serve as an English grammar, and the particular subclass of such processes that produce n -order statistical approximations to English do not come closer, with increasing n, to matching the output of anEnglish grammar."
            },
            "venue": {
                "fragments": [],
                "text": "IRE Trans. Inf. Theory"
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102429215"
                        ],
                        "name": "Kai-Fu Lee",
                        "slug": "Kai-Fu-Lee",
                        "structuredName": {
                            "firstName": "Kai-Fu",
                            "lastName": "Lee",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kai-Fu Lee"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 195701839,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bf2dbecb0adcd9b1bec1ec90f78f7bf4aaa13db4",
            "isKey": false,
            "numCitedBy": 207,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "Context-dependent phone models are applied to speaker-independent continuous speech recognition and shown to be effective in this domain. Several previously proposed context-dependent models are evaluated, and two new context-dependent phonetic units are introduced: function-word-dependent phone models, which focus on the most difficult subvocabulary; and generalized triphones, which combine similar triphones on the basis of an information-theoretic measure. The subword clustering procedure used for generalized triphones can find the optimal number of models, given a fixed amount of training data. It is shown that context-dependent modeling reduces the error rate by as much as 60%. >"
            },
            "slug": "Context-independent-phonetic-hidden-Markov-models-Lee",
            "title": {
                "fragments": [],
                "text": "Context-independent phonetic hidden Markov models for speaker-independent continuous speech recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Two new context-dependent phonetic units are introduced: function-word-dependent phone models, which focus on the most difficult subvocabulary; and generalized triphones, which combine similar triphones on the basis of an information-theoretic measure."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2696176"
                        ],
                        "name": "L. Bahl",
                        "slug": "L.-Bahl",
                        "structuredName": {
                            "firstName": "Lalit",
                            "lastName": "Bahl",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Bahl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32538203"
                        ],
                        "name": "P. Brown",
                        "slug": "P.-Brown",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Brown",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Brown"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144856857"
                        ],
                        "name": "P. D. Souza",
                        "slug": "P.-D.-Souza",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Souza",
                            "middleNames": [
                                "V.",
                                "de"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. D. Souza"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2474650"
                        ],
                        "name": "R. Mercer",
                        "slug": "R.-Mercer",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Mercer",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Mercer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1774515"
                        ],
                        "name": "M. Picheny",
                        "slug": "M.-Picheny",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Picheny",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Picheny"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 54146566,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3e101af2334009070ea71b5bc752cd0d0bc70dcc",
            "isKey": false,
            "numCitedBy": 85,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "The Speech Recognition Group at IBM Research has developed a real-time, isolated-word speech recognizer called Tangora, which accepts natural English sentences drawn from a vocabulary of 20000 words. Despite its large vocabulary, the Tangora recognizer requires only about 20 minutes of speech from each new user for training purposes. The accuracy of the system and its ease of training are largely attributable to the use of hidden Markov models in its acoustic match component. An automatic technique for constructing Markov word models is described and results are included of experiments with speaker-dependent and speaker-independent models on several isolated-word recognition tasks.<<ETX>>"
            },
            "slug": "Acoustic-Markov-models-used-in-the-Tangora-speech-Bahl-Brown",
            "title": {
                "fragments": [],
                "text": "Acoustic Markov models used in the Tangora speech recognition system"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "An automatic technique for constructing Markov word models is described and results are included of experiments with speaker-dependent and speaker-independent models on several isolated-word recognition tasks."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP-88., International Conference on Acoustics, Speech, and Signal Processing"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145322333"
                        ],
                        "name": "H. Ney",
                        "slug": "H.-Ney",
                        "structuredName": {
                            "firstName": "Hermann",
                            "lastName": "Ney",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Ney"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16642315,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1e4193d03eb3c5a695a3d8b3506f80704f9dfc19",
            "isKey": false,
            "numCitedBy": 380,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper is of tutorial nature and describes a one-stage dynamic programming algorithm for file problem of connected word recognition. The algorithm to be developed is essentially identical to one presented by Vintsyuk [1] and later by Bridle and Brown [2] ; but the notation and the presentation have been clarified. The derivation used for optimally time synchronizing a test pattern, consisting of a sequence of connected words, is straightforward and simple in comparison with other approaches decomposing the pattern matching problem into several levels. The approach presented relies basically on parameterizing the time warping path by a single index and on exploiting certain path constraints both in the word interior and at the word boundaries. The resulting algorithm turns out to be significantly more efficient than those proposed by Sakoe [3] as well as Myers and Rabiner [4], while providing the same accuracy in estimating the best possible matching string. Its most important feature is that the computational expenditure per word is independent of the number of words in the input string. Thus, it is well suited for recognizing comparatively long word sequences and for real-time operation. Furthermore, there is no need to specify the maximum number of words in the input string. The practical implementation of the algorithm is discussed; it requires no heuristic rules and no overhead. The algorithm can be modified to deal with syntactic constraints in terms of a finite state syntax."
            },
            "slug": "The-use-of-a-one-stage-dynamic-programming-for-word-Ney",
            "title": {
                "fragments": [],
                "text": "The use of a one-stage dynamic programming algorithm for connected word recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "The algorithm to be developed is essentially identical to one presented by Vintsyuk and later by Bridle and Brown, but the notation and the presentation have been clarified and the computational expenditure per word is independent of the number of words in the input string."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712517"
                        ],
                        "name": "L. Rabiner",
                        "slug": "L.-Rabiner",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Rabiner",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Rabiner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143604406"
                        ],
                        "name": "B. Juang",
                        "slug": "B.-Juang",
                        "structuredName": {
                            "firstName": "Biing-Hwang",
                            "lastName": "Juang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Juang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1759195"
                        ],
                        "name": "S. Levinson",
                        "slug": "S.-Levinson",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Levinson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Levinson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34830449"
                        ],
                        "name": "M. Sondhi",
                        "slug": "M.-Sondhi",
                        "structuredName": {
                            "firstName": "Man",
                            "lastName": "Sondhi",
                            "middleNames": [
                                "Mohan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Sondhi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35749818,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e90c15e0de8b5452c6291359e98ddc099e3b93f6",
            "isKey": false,
            "numCitedBy": 281,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we extend previous work on isolated-word recognition based on hidden Markov models by replacing the discrete symbol representation of the speech signal with a continuous Gaussian mixture density. In this manner the inherent quantization error introduced by the discrete representation is essentially eliminated. The resulting recognizer was tested on a vocabulary of the ten digits across a wide range of talkers and test conditions and shown to have an error rate comparable to that of the best template recognizers and significantly lower than that of the discrete symbol hidden Markov model system. We discuss several issues involved in the training of the continuous density models and in the implementation of the recognizer."
            },
            "slug": "Recognition-of-isolated-digits-using-hidden-Markov-Rabiner-Juang",
            "title": {
                "fragments": [],
                "text": "Recognition of isolated digits using hidden Markov models with continuous mixture densities"
            },
            "tldr": {
                "abstractSimilarityScore": 95,
                "text": "This paper extends previous work on isolated-word recognition based on hidden Markov models by replacing the discrete symbol representation of the speech signal with a continuous Gaussian mixture density, thereby eliminating the inherent quantization error introduced by the discrete representation."
            },
            "venue": {
                "fragments": [],
                "text": "AT&T Technical Journal"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1684537"
                        ],
                        "name": "W. Kuich",
                        "slug": "W.-Kuich",
                        "structuredName": {
                            "firstName": "Werner",
                            "lastName": "Kuich",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Kuich"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 12863185,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4c58e55c54a1331f22c3e1c695132294ddcfe0bb",
            "isKey": false,
            "numCitedBy": 146,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-the-Entropy-of-Context-Free-Languages-Kuich",
            "title": {
                "fragments": [],
                "text": "On the Entropy of Context-Free Languages"
            },
            "venue": {
                "fragments": [],
                "text": "Inf. Control."
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1785148"
                        ],
                        "name": "F. Kubala",
                        "slug": "F.-Kubala",
                        "structuredName": {
                            "firstName": "Francis",
                            "lastName": "Kubala",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Kubala"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2727234"
                        ],
                        "name": "Y. Chow",
                        "slug": "Y.-Chow",
                        "structuredName": {
                            "firstName": "Yen-lu",
                            "lastName": "Chow",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Chow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48992097"
                        ],
                        "name": "A. Derr",
                        "slug": "A.-Derr",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Derr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Derr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145753070"
                        ],
                        "name": "M.-W. Feng",
                        "slug": "M.-W.-Feng",
                        "structuredName": {
                            "firstName": "M.-W.",
                            "lastName": "Feng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M.-W. Feng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3353221"
                        ],
                        "name": "O. Kimball",
                        "slug": "O.-Kimball",
                        "structuredName": {
                            "firstName": "Owen",
                            "lastName": "Kimball",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Kimball"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "10080270"
                        ],
                        "name": "J. Makhoul",
                        "slug": "J.-Makhoul",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Makhoul",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Makhoul"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48258694"
                        ],
                        "name": "P. Price",
                        "slug": "P.-Price",
                        "structuredName": {
                            "firstName": "Patti",
                            "lastName": "Price",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Price"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2803620"
                        ],
                        "name": "J. R. Rohlicek",
                        "slug": "J.-R.-Rohlicek",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Rohlicek",
                            "middleNames": [
                                "Robin"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. R. Rohlicek"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46924970"
                        ],
                        "name": "Salim Roukos",
                        "slug": "Salim-Roukos",
                        "structuredName": {
                            "firstName": "Salim",
                            "lastName": "Roukos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Salim Roukos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152901373"
                        ],
                        "name": "R. Schwartz",
                        "slug": "R.-Schwartz",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Schwartz",
                            "middleNames": [
                                "Evan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Schwartz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50174005"
                        ],
                        "name": "J. Vandegrift",
                        "slug": "J.-Vandegrift",
                        "structuredName": {
                            "firstName": "Jeffrey",
                            "lastName": "Vandegrift",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Vandegrift"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60930140,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "58af06f02cf2411e4defedf3f921b56557b653c1",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The system was trained in a speaker dependent mode on 28 minutes of speech from each of 8 speakers, and was tested on independent test material for each speaker. The system was tested with three artificial grammars spanning a broad perplexity range. The average performance of the system measured in percent word error was: 1.4% for a pattern grammar of perplexity 9, 7.5% for a word-pair grammar of perplexity 62, and 32.4% for a null grammar of perplexity 1000.<<ETX>>"
            },
            "slug": "Continuous-speech-recognition-results-of-the-BYBLOS-Kubala-Chow",
            "title": {
                "fragments": [],
                "text": "Continuous speech recognition results of the BYBLOS system on the DARPA 1000-word resource management database"
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "The system was trained in a speaker dependent mode on 28 minutes of speech from each of 8 speakers, and was tested on independent test material for each speaker with three artificial grammars spanning a broad perplexity range."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP-88., International Conference on Acoustics, Speech, and Signal Processing"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102429215"
                        ],
                        "name": "Kai-Fu Lee",
                        "slug": "Kai-Fu-Lee",
                        "structuredName": {
                            "firstName": "Kai-Fu",
                            "lastName": "Lee",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kai-Fu Lee"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145058181"
                        ],
                        "name": "H. Hon",
                        "slug": "H.-Hon",
                        "structuredName": {
                            "firstName": "Hsiao-Wuen",
                            "lastName": "Hon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Hon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58752898,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "97e69d2e23ab04cb3f00466585b76a767c44a53e",
            "isKey": false,
            "numCitedBy": 119,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "SPHINX, the first large-vocabulary speaker-independent continuous-speech recognizer is described. SPHINX is a hidden-Markov-model (HMM)-based recognizer using multiple codebooks of various LPC-derived features. Two types of HMMs are used in SPHINX: context-independent phone models and function-word-dependent phone models. On a 997-word task using a bigram grammar, SPHINX achieved a word accuracy of 93%. This demonstrates the feasibility of speaker-independent continuous-speech recognition, and the appropriateness of hidden Markov models for such a task.<<ETX>>"
            },
            "slug": "Large-vocabulary-speaker-independent-continuous-HMM-Lee-Hon",
            "title": {
                "fragments": [],
                "text": "Large-vocabulary speaker-independent continuous speech recognition using HMM"
            },
            "tldr": {
                "abstractSimilarityScore": 31,
                "text": "On a 997-word task using a bigram grammar, SPHINX achieved a word accuracy of 93%."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP-88., International Conference on Acoustics, Speech, and Signal Processing"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102429215"
                        ],
                        "name": "Kai-Fu Lee",
                        "slug": "Kai-Fu-Lee",
                        "structuredName": {
                            "firstName": "Kai-Fu",
                            "lastName": "Lee",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kai-Fu Lee"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145058181"
                        ],
                        "name": "H. Hon",
                        "slug": "H.-Hon",
                        "structuredName": {
                            "firstName": "Hsiao-Wuen",
                            "lastName": "Hon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Hon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 37373402,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3034afcd45fc190ed71982828b77f6e4154bdc5c",
            "isKey": false,
            "numCitedBy": 1044,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "Hidden Markov modeling is extended to speaker-independent phone recognition. Using multiple codebooks of various linear-predictive-coding (LPC) parameters and discrete hidden Markov models (HMMs) the authors obtain a speaker-independent phone recognition accuracy of 58.8-73.8% on the TIMIT database, depending on the type of acoustic and language models used. In comparison, the performance of expert spectrogram readers is only 69% without use of higher level knowledge. The authors introduce the co-occurrence smoothing algorithm, which enables accurate recognition even with very limited training data. Since the results were evaluated on a standard database, they can be used as benchmarks to evaluate future systems. >"
            },
            "slug": "Speaker-independent-phone-recognition-using-hidden-Lee-Hon",
            "title": {
                "fragments": [],
                "text": "Speaker-independent phone recognition using hidden Markov models"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The authors introduce the co-occurrence smoothing algorithm, which enables accurate recognition even with very limited training data, and can be used as benchmarks to evaluate future systems."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Acoust. Speech Signal Process."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102429215"
                        ],
                        "name": "Kai-Fu Lee",
                        "slug": "Kai-Fu-Lee",
                        "structuredName": {
                            "firstName": "Kai-Fu",
                            "lastName": "Lee",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kai-Fu Lee"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145058181"
                        ],
                        "name": "H. Hon",
                        "slug": "H.-Hon",
                        "structuredName": {
                            "firstName": "Hsiao-Wuen",
                            "lastName": "Hon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Hon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144091892"
                        ],
                        "name": "M. Hwang",
                        "slug": "M.-Hwang",
                        "structuredName": {
                            "firstName": "Mei-Yuh",
                            "lastName": "Hwang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Hwang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34413227"
                        ],
                        "name": "Sanjoy Mahajan",
                        "slug": "Sanjoy-Mahajan",
                        "structuredName": {
                            "firstName": "Sanjoy",
                            "lastName": "Mahajan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sanjoy Mahajan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62604702,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8ac652ffc805880fa9148d0ef5a34bb9d91a7bc8",
            "isKey": false,
            "numCitedBy": 8,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Recent-progress-and-future-outlook-of-the-SPHINX-Lee-Hon",
            "title": {
                "fragments": [],
                "text": "Recent progress and future outlook of the SPHINX speech recognition system"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110094"
                        ],
                        "name": "J. Bridle",
                        "slug": "J.-Bridle",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Bridle",
                            "middleNames": [
                                "Scott"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bridle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2111289375"
                        ],
                        "name": "Michael D. Brown",
                        "slug": "Michael-D.-Brown",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brown",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael D. Brown"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39515755"
                        ],
                        "name": "R. Chamberlain",
                        "slug": "R.-Chamberlain",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Chamberlain",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Chamberlain"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5823473,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8b49fce77d75f671e5f41326e85794501835b0fc",
            "isKey": false,
            "numCitedBy": 185,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The principles of an efficient one-pass dynamic programming whole-word pattern matching algorithm for the recognition of spoken sequences of connected words are described. Particular attention is given to the technique for keeping track of word-sequence decisions, which may be constrained by a finite-state syntax. Some extensions of the technique are discussed."
            },
            "slug": "An-algorithm-for-connected-word-recognition-Bridle-Brown",
            "title": {
                "fragments": [],
                "text": "An algorithm for connected word recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "The principles of an efficient one-pass dynamic programming whole-word pattern matching algorithm for the recognition of spoken sequences of connected words are described and some extensions of the technique are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2696176"
                        ],
                        "name": "L. Bahl",
                        "slug": "L.-Bahl",
                        "structuredName": {
                            "firstName": "Lalit",
                            "lastName": "Bahl",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Bahl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2472759"
                        ],
                        "name": "F. Jelinek",
                        "slug": "F.-Jelinek",
                        "structuredName": {
                            "firstName": "Frederick",
                            "lastName": "Jelinek",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Jelinek"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2474650"
                        ],
                        "name": "R. Mercer",
                        "slug": "R.-Mercer",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Mercer",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Mercer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14789841,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c4775e2f0d27e8be4aae7b5b5c2560b96ce2eb58",
            "isKey": false,
            "numCitedBy": 1403,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "Speech recognition is formulated as a problem of maximum likelihood decoding. This formulation requires statistical models of the speech production process. In this paper, we describe a number of statistical models for use in speech recognition. We give special attention to determining the parameters for such models from sparse data. We also describe two decoding methods, one appropriate for constrained artificial languages and one appropriate for more realistic decoding tasks. To illustrate the usefulness of the methods described, we review a number of decoding results that have been obtained with them."
            },
            "slug": "A-Maximum-Likelihood-Approach-to-Continuous-Speech-Bahl-Jelinek",
            "title": {
                "fragments": [],
                "text": "A Maximum Likelihood Approach to Continuous Speech Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This paper describes a number of statistical models for use in speech recognition, with special attention to determining the parameters for such models from sparse data, and describes two decoding methods appropriate for constrained artificial languages and one appropriate for more realistic decoding tasks."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3029039"
                        ],
                        "name": "T. Booth",
                        "slug": "T.-Booth",
                        "structuredName": {
                            "firstName": "Taylor",
                            "lastName": "Booth",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Booth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "97813852"
                        ],
                        "name": "Richarda . Thompson",
                        "slug": "Richarda-.-Thompson",
                        "structuredName": {
                            "firstName": "Richarda",
                            "lastName": "Thompson",
                            "middleNames": [
                                "."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Richarda . Thompson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41410699,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c9d7b1f9b13d6ea4ff45b908285cc65af959cc5b",
            "isKey": false,
            "numCitedBy": 269,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of assigning a probability to each word of a language is considered. Two methods are discussed. One method assigns a probability to a word on the basis of particular measurable features of the language. The second method is applied to languages L(G) generated by a grammar G. A probability is associated with each production of G. These in turn define the word probabilities of each word in the language. The conditions for this assignment to be a probabilistic measure are derived."
            },
            "slug": "Applying-Probability-Measures-to-Abstract-Languages-Booth-Thompson",
            "title": {
                "fragments": [],
                "text": "Applying Probability Measures to Abstract Languages"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "The problem of assigning a probability to each word of a language is considered and two methods are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712517"
                        ],
                        "name": "L. Rabiner",
                        "slug": "L.-Rabiner",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Rabiner",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Rabiner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143604406"
                        ],
                        "name": "B. Juang",
                        "slug": "B.-Juang",
                        "structuredName": {
                            "firstName": "Biing-Hwang",
                            "lastName": "Juang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Juang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1759195"
                        ],
                        "name": "S. Levinson",
                        "slug": "S.-Levinson",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Levinson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Levinson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34830449"
                        ],
                        "name": "M. Sondhi",
                        "slug": "M.-Sondhi",
                        "structuredName": {
                            "firstName": "Man",
                            "lastName": "Sondhi",
                            "middleNames": [
                                "Mohan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Sondhi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43997221,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0ad9f79c744bec1f1325b621ff590172db9a511d",
            "isKey": false,
            "numCitedBy": 82,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Many signals can be modeled as probabilistic functions of Markov chains in which the observed signal is a random vector whose probability density function (pdf) depends on the current state of an underlying Markov chain. Such models are called Hidden Markov Models (HMMs) and are useful representations for speech signals in terms of some convenient observations (e.g., cepstral coefficients or pseudolog area ratios). One method of estimating parameters of HMMs is the well-known Baum-Welch reestimation method. For continuous pdf's, the method was known to work only for elliptically symmetric densities. We have recently shown that the method can be generalized to handle mixtures of elliptically symmetric pdf's. Any continuous pdf can be approximated to any desired accuracy by such mixtures, in particular, by mixtures of multivariate Gaussian pdf's. To effectively make use of this method of parameter estimation, it is necessary to understand how it is affected by the amount of training data available, the number of states in the Markov chain, the dimensionality of the signal, etc. To study these issues, Markov chains and random vector generators were simulated to generate training sequences from “toy” models. The model parameters were estimated from these training sequences and compared to the “true” parameters by means of an appropriate distance measure. The results of several such experiments show the strong sensitivity of the method to some (but not all) of the model parameters. A procedure for getting good initial parameter estimates is, therefore, of considerable importance."
            },
            "slug": "Some-properties-of-continuous-hidden-Markov-model-Rabiner-Juang",
            "title": {
                "fragments": [],
                "text": "Some properties of continuous hidden Markov model representations"
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "It is shown that the Baum-Welch reestimation method can be generalized to handle mixtures of elliptically symmetric pdf's, and any continuous pdf can be approximated to any desired accuracy by such mixtures, in particular, by mixture of multivariate Gaussian pdf's."
            },
            "venue": {
                "fragments": [],
                "text": "AT&T Technical Journal"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1721830"
                        ],
                        "name": "L. Gillick",
                        "slug": "L.-Gillick",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Gillick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Gillick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35132323"
                        ],
                        "name": "S. Cox",
                        "slug": "S.-Cox",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Cox",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Cox"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 312937,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "774c6a9405b6d52d5d30a15e82601ca4635369c6",
            "isKey": false,
            "numCitedBy": 699,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors present two simple tests for deciding whether the difference in error rates between two algorithms tested on the same data set is statistically significant. The first (McNemar's test) requires the errors made by an algorithm to be independent events and is found to be most appropriate for isolated-word algorithms. The second (a matched-pairs test) can be used even when errors are not independent events and is more appropriate for connected speech.<<ETX>>"
            },
            "slug": "Some-statistical-issues-in-the-comparison-of-speech-Gillick-Cox",
            "title": {
                "fragments": [],
                "text": "Some statistical issues in the comparison of speech recognition algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The authors present two simple tests for deciding whether the difference in error rates between two algorithms tested on the same data set is statistically significant."
            },
            "venue": {
                "fragments": [],
                "text": "International Conference on Acoustics, Speech, and Signal Processing,"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144661684"
                        ],
                        "name": "S. Soule",
                        "slug": "S.-Soule",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Soule",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Soule"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 33366684,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "58f1efe8e9ea97000ad6f3f5a4c70adfc27f677f",
            "isKey": false,
            "numCitedBy": 40,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Entropies-of-Probabilistic-Grammars-Soule",
            "title": {
                "fragments": [],
                "text": "Entropies of Probabilistic Grammars"
            },
            "venue": {
                "fragments": [],
                "text": "Inf. Control."
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144461837"
                        ],
                        "name": "C. Shannon",
                        "slug": "C.-Shannon",
                        "structuredName": {
                            "firstName": "Claude",
                            "lastName": "Shannon",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Shannon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9101213,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c1e3f2d537e50e0d5263e4731ab6c7983acd6687",
            "isKey": false,
            "numCitedBy": 2530,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A new method of estimating the entropy and redundancy of a language is described. This method exploits the knowledge of the language statistics possessed by those who speak the language, and depends on experimental results in prediction of the next letter when the preceding text is known. Results of experiments in prediction are given, and some properties of an ideal predictor are developed."
            },
            "slug": "Prediction-and-entropy-of-printed-English-Shannon",
            "title": {
                "fragments": [],
                "text": "Prediction and entropy of printed English"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "A new method of estimating the entropy and redundancy of a language is described, which exploits the knowledge of the language statistics possessed by those who speak the language, and depends on experimental results in prediction of the next letter when the preceding text is known."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1951
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3142489"
                        ],
                        "name": "B. Oshika",
                        "slug": "B.-Oshika",
                        "structuredName": {
                            "firstName": "Beatrice",
                            "lastName": "Oshika",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Oshika"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710543"
                        ],
                        "name": "V. Zue",
                        "slug": "V.-Zue",
                        "structuredName": {
                            "firstName": "Victor",
                            "lastName": "Zue",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Zue"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34736318"
                        ],
                        "name": "R. Weeks",
                        "slug": "R.-Weeks",
                        "structuredName": {
                            "firstName": "Rollin",
                            "lastName": "Weeks",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Weeks"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40199106"
                        ],
                        "name": "H. Neu",
                        "slug": "H.-Neu",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Neu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Neu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70049704"
                        ],
                        "name": "J. Aurbach",
                        "slug": "J.-Aurbach",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Aurbach",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Aurbach"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120386603,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "335a03bfa8ed5a21d5f6257403c39ae35a8cc1f4",
            "isKey": false,
            "numCitedBy": 109,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents some phonological rules which describe systematic pronunciation variation occurring in natural continuous speech. It is argued that a speech understanding system must account for such variation by incorporating phonological rules, either implicitly or explicitly, into the system. Spectrographic evidence for the phonological phenomena described by the rules is included."
            },
            "slug": "The-role-of-phonological-rules-in-speech-research-Oshika-Zue",
            "title": {
                "fragments": [],
                "text": "The role of phonological rules in speech understanding research"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2058083042"
                        ],
                        "name": "M. Russel",
                        "slug": "M.-Russel",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Russel",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Russel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2360286"
                        ],
                        "name": "K. Ponting",
                        "slug": "K.-Ponting",
                        "structuredName": {
                            "firstName": "Keith",
                            "lastName": "Ponting",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Ponting"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2392554"
                        ],
                        "name": "S. M. Peeling",
                        "slug": "S.-M.-Peeling",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Peeling",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. M. Peeling"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2263289"
                        ],
                        "name": "S. Browning",
                        "slug": "S.-Browning",
                        "structuredName": {
                            "firstName": "Sue",
                            "lastName": "Browning",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Browning"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110094"
                        ],
                        "name": "J. Bridle",
                        "slug": "J.-Bridle",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Bridle",
                            "middleNames": [
                                "Scott"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bridle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145914568"
                        ],
                        "name": "Roger K. Moore",
                        "slug": "Roger-K.-Moore",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Moore",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Roger K. Moore"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145428317"
                        ],
                        "name": "I. Galiano",
                        "slug": "I.-Galiano",
                        "structuredName": {
                            "firstName": "Isabel",
                            "lastName": "Galiano",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Galiano"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2075901628"
                        ],
                        "name": "P. Howell",
                        "slug": "P.-Howell",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Howell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Howell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60675407,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3e8b7f015be311855fcefe392148b976dcff1f0a",
            "isKey": false,
            "numCitedBy": 31,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Research on continuous-speech recognition using phoneme-level hidden Markov models (HMMs) is described. The aim of the project is automatic recognition of spoken airborne reconnaissance mission (ARM) reports. The evolution of the ARM system from a simple baseline system to its current configuration is described, and a considerable number of experimental results are included. Work on alternative approaches to modeling contextual effects and on improved duration modeling is described.<<ETX>>"
            },
            "slug": "The-ARM-continuous-speech-recognition-system-Russel-Ponting",
            "title": {
                "fragments": [],
                "text": "The ARM continuous speech recognition system"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "Research on continuous-speech recognition using phoneme-level hidden Markov models (HMMs) is described, and work on alternative approaches to modeling contextual effects and on improved duration modeling is described."
            },
            "venue": {
                "fragments": [],
                "text": "International Conference on Acoustics, Speech, and Signal Processing"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144665059"
                        ],
                        "name": "Y. Linde",
                        "slug": "Y.-Linde",
                        "structuredName": {
                            "firstName": "Y.",
                            "lastName": "Linde",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Linde"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1805395"
                        ],
                        "name": "A. Buzo",
                        "slug": "A.-Buzo",
                        "structuredName": {
                            "firstName": "Andres",
                            "lastName": "Buzo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Buzo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144790332"
                        ],
                        "name": "R. Gray",
                        "slug": "R.-Gray",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Gray",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gray"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18530691,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7c46799502bebfe6a9ae0f457b7b8b92248ec260",
            "isKey": false,
            "numCitedBy": 7891,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "An efficient and intuitive algorithm is presented for the design of vector quantizers based either on a known probabilistic model or on a long training sequence of data. The basic properties of the algorithm are discussed and demonstrated by examples. Quite general distortion measures and long blocklengths are allowed, as exemplified by the design of parameter vector quantizers of ten-dimensional vectors arising in Linear Predictive Coded (LPC) speech compression with a complicated distortion measure arising in LPC analysis that does not depend only on the error vector."
            },
            "slug": "An-Algorithm-for-Vector-Quantizer-Design-Linde-Buzo",
            "title": {
                "fragments": [],
                "text": "An Algorithm for Vector Quantizer Design"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "An efficient and intuitive algorithm is presented for the design of vector quantizers based either on a known probabilistic model or on a long training sequence of data."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Commun."
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144790332"
                        ],
                        "name": "R. Gray",
                        "slug": "R.-Gray",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Gray",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gray"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14754287,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "81a5952532cdd48eec5e3dc326907c36a70e0a24",
            "isKey": false,
            "numCitedBy": 2922,
            "numCiting": 88,
            "paperAbstract": {
                "fragments": [],
                "text": "A vector quantizer is a system for mapping a sequence of continuous or discrete vectors into a digital sequence suitable for communication over or storage in a digital channel. The goal of such a system is data compression: to reduce the bit rate so as to minimize communication channel capacity or digital storage memory requirements while maintaining the necessary fidelity of the data. The mapping for each vector may or may not have memory in the sense of depending on past actions of the coder, just as in well established scalar techniques such as PCM, which has no memory, and predictive quantization, which does. Even though information theory implies that one can always obtain better performance by coding vectors instead of scalars, scalar quantizers have remained by far the most common data compression system because of their simplicity and good performance when the communication rate is sufficiently large. In addition, relatively few design techniques have existed for vector quantizers. During the past few years several design algorithms have been developed for a variety of vector quantizers and the performance of these codes has been studied for speech waveforms, speech linear predictive parameter vectors, images, and several simulated random processes. It is the purpose of this article to survey some of these design techniques and their applications."
            },
            "slug": "Vector-quantization-Gray",
            "title": {
                "fragments": [],
                "text": "Vector quantization"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "During the past few years several design algorithms have been developed for a variety of vector quantizers and the performance of these codes has been studied for speech waveforms, speech linear predictive parameter vectors, images, and several simulated random processes."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE ASSP Magazine"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1715952"
                        ],
                        "name": "A. Aho",
                        "slug": "A.-Aho",
                        "structuredName": {
                            "firstName": "Alfred",
                            "lastName": "Aho",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Aho"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1706504"
                        ],
                        "name": "J. Hopcroft",
                        "slug": "J.-Hopcroft",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Hopcroft",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hopcroft"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1742391"
                        ],
                        "name": "J. Ullman",
                        "slug": "J.-Ullman",
                        "structuredName": {
                            "firstName": "Jeffrey",
                            "lastName": "Ullman",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 64893718,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "55395c610edc5e271b8991118ca3638973e53b77",
            "isKey": false,
            "numCitedBy": 2003,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "From the Publisher: \nThis book presents the data structures and algorithms that underpin much of today's computer programming. The basis of this book is the material contained in the first six chapters of our earlier work, The Design and Analysis of Computer Algorithms. We have expanded that coverage and have added material on algorithms for external storage and memory management. As a consequence, this book should be suitable as a text for a first course on data structures and algorithms. The only prerequisite we assume is familiarity with some high-level programming language such as Pascal."
            },
            "slug": "Data-Structures-and-Algorithms-Aho-Hopcroft",
            "title": {
                "fragments": [],
                "text": "Data Structures and Algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "The basis of this book is the material contained in the first six chapters of the earlier work, The Design and Analysis of Computer Algorithms, and has added material on algorithms for external storage and memory management."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144461837"
                        ],
                        "name": "C. Shannon",
                        "slug": "C.-Shannon",
                        "structuredName": {
                            "firstName": "Claude",
                            "lastName": "Shannon",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Shannon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 55379485,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a54194422c56399b2923b2ad706b8175c8c48258",
            "isKey": false,
            "numCitedBy": 34823,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "In this final installment of the paper we consider the case where the signals or the messages or both are continuously variable, in contrast with the discrete nature assumed until now. To a considerable extent the continuous case can be obtained through a limiting process from the discrete case by dividing the continuum of messages and signals into a large but finite number of small regions and calculating the various parameters involved on a discrete basis. As the size of the regions is decreased these parameters in general approach as limits the proper values for the continuous case. There are, however, a few new effects that appear and also a general change of emphasis in the direction of specialization of the general results to particular cases."
            },
            "slug": "A-mathematical-theory-of-communication-Shannon",
            "title": {
                "fragments": [],
                "text": "A mathematical theory of communication"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "This final installment of the paper considers the case where the signals or the messages or both are continuously variable, in contrast with the discrete nature assumed until now."
            },
            "venue": {
                "fragments": [],
                "text": "MOCO"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1779317"
                        ],
                        "name": "N. Kingsbury",
                        "slug": "N.-Kingsbury",
                        "structuredName": {
                            "firstName": "Nick",
                            "lastName": "Kingsbury",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Kingsbury"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145109856"
                        ],
                        "name": "P. Rayner",
                        "slug": "P.-Rayner",
                        "structuredName": {
                            "firstName": "Pjw",
                            "lastName": "Rayner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Rayner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123459057,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9486a00e62f8a7cb6c642b675c880b4065a69c14",
            "isKey": false,
            "numCitedBy": 157,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "A method of computation is described in which all signals are encoded logarithmically, giving a great improvement in dynamic range compared with fixed-point linearly encoded arithmetic. Two ways of adding or subtracting logarithmically encoded numbers are suggested, together with a logarithmic digital-analogue convertor."
            },
            "slug": "Digital-filtering-using-logarithmic-arithmetic-Kingsbury-Rayner",
            "title": {
                "fragments": [],
                "text": "Digital filtering using logarithmic arithmetic"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A method of computation is described in which all signals are encoded logarithmically, giving a great improvement in dynamic range compared with fixed-point linearly encoded arithmetic."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1416649471"
                        ],
                        "name": "J. O'connor",
                        "slug": "J.-O'connor",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "O'connor",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. O'connor"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47788490"
                        ],
                        "name": "J. Trim",
                        "slug": "J.-Trim",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Trim",
                            "middleNames": [
                                "L.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Trim"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 147476655,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "3c13393cd504b9762930f47652d77b71c8213498",
            "isKey": false,
            "numCitedBy": 58,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Vowel,-Consonant,-and-Syllable—A-Phonological-O'connor-Trim",
            "title": {
                "fragments": [],
                "text": "Vowel, Consonant, and Syllable—A Phonological Definition"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1953
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "corpusId": 125366958,
            "fieldsOfStudy": [],
            "id": "33cf619113fea43560a50ed80595025a039d351e",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Theory of Branching Processes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69577099"
                        ],
                        "name": "T. W. Anderson",
                        "slug": "T.-W.-Anderson",
                        "structuredName": {
                            "firstName": "Theodore",
                            "lastName": "Anderson",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. W. Anderson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39867082"
                        ],
                        "name": "L. A. Goodman",
                        "slug": "L.-A.-Goodman",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Goodman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. A. Goodman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 121291157,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a0fd8e122d23f388fe0c2979ad7ad6f9e6b1df20",
            "isKey": false,
            "numCitedBy": 1362,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Statistical-Inference-about-Markov-Chains-Anderson-Goodman",
            "title": {
                "fragments": [],
                "text": "Statistical Inference about Markov Chains"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "97306284"
                        ],
                        "name": "K. Fu",
                        "slug": "K.-Fu",
                        "structuredName": {
                            "firstName": "King-Sun",
                            "lastName": "Fu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Fu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58254634,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e3df5bffe26ef85245d1be984184e865d17971f3",
            "isKey": false,
            "numCitedBy": 6,
            "numCiting": 56,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Learning-with-Stochastic-Automata-and-Stochastic-Fu",
            "title": {
                "fragments": [],
                "text": "Learning with Stochastic Automata and Stochastic Languages"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145502114"
                        ],
                        "name": "R. Reddy",
                        "slug": "R.-Reddy",
                        "structuredName": {
                            "firstName": "Raj",
                            "lastName": "Reddy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Reddy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102429215"
                        ],
                        "name": "Kai-Fu Lee",
                        "slug": "Kai-Fu-Lee",
                        "structuredName": {
                            "firstName": "Kai-Fu",
                            "lastName": "Lee",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kai-Fu Lee"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 54110621,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c0afb2945389d55df4dc09d03c2a70e752458d1e",
            "isKey": false,
            "numCitedBy": 346,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Large-vocabulary-speaker-independent-continuous-the-Reddy-Lee",
            "title": {
                "fragments": [],
                "text": "Large-vocabulary speaker-independent continuous speech recognition: the sphinx system"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1693256"
                        ],
                        "name": "D. Sankoff",
                        "slug": "D.-Sankoff",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Sankoff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Sankoff"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 124314945,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0f5524fd936d692beac6ab0bfcfcfa656cc3178b",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Branching-processes-with-terminal-types:-to-Sankoff",
            "title": {
                "fragments": [],
                "text": "Branching processes with terminal types: application to context-free grammars"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 36,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Applications-of-stochastic-context-free-grammars-Lari-Young/9ba08e0a53bfdcbe0b70a4761c3e2b62f150fc74?sort=total-citations"
}