{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4801654"
                        ],
                        "name": "Y. Amit",
                        "slug": "Y.-Amit",
                        "structuredName": {
                            "firstName": "Yali",
                            "lastName": "Amit",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Amit"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707642"
                        ],
                        "name": "D. Geman",
                        "slug": "D.-Geman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 30
                            }
                        ],
                        "text": "The precursor of this work is (Amit and Geman, 1999): Features are spatial arrangements of edge fragments, induced from training faces at a reference pose, and computation is minimized via a generalized Hough transform; there is no on-line optimization and no segmentation apart from visual selection itself."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 115
                            }
                        ],
                        "text": "Some notable exceptions include work on hashing (Lamdan et al., 1988), Hough transforms (Rojer and Schwartz, 1992; Amit and Geman, 1999; Amit, 1999), and treestructured search (Grimson, 1990), all of which have influenced our thinking."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 51,
                                "start": 31
                            }
                        ],
                        "text": "The precursor of this work is (Amit and Geman, 1999): Features are spatial arrangements of edge fragments, induced from training faces at a reference pose, and computation is minimized via a generalized Hough transform; there is no on-line optimization and no segmentation apart from visual…"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 39
                            }
                        ],
                        "text": "The edge filter we use is described in Amit and Geman (1999) and additional details may be found in Fleuret (2000)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 40
                            }
                        ],
                        "text": "Our face training set is the same as in Amit and Geman (1999) and smaller than in Rowley et al. (1998), Sung and Poggio (1998)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 40
                            }
                        ],
                        "text": "Our algorithm is faster than the one in Amit and Geman (1999) and much faster than the one in Rowley (1999), which requires 140s to process the scene in Fig."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 38,
                                "start": 17
                            }
                        ],
                        "text": "The algorithm in Amit and Geman (1999) is perhaps the simplest: The object representation is very compact and training only occurs at a reference pose, requiring only a few minutes as opposed to about an hour here and much longer in Rowley (1999)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 136,
                                "start": 115
                            }
                        ],
                        "text": "Still, due to the comprehensive analysis in Rowley (1999) of publicly available images and to our familiarity with Amit and Geman (1999), a few general statements appear evident."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 26
                            }
                        ],
                        "text": ", 1988), Hough transforms (Rojer and Schwartz, 1992; Amit and Geman, 1999; Amit, 1999), and treestructured search (Grimson, 1990), all of which have influenced our thinking."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 7784637,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "61b2d0383b186c4d634c5f51421cab67c16d90a1",
            "isKey": false,
            "numCitedBy": 197,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a computational model for detecting and localizing instances from an object class in static gray-level images. We divide detection into visual selection and final classification, concentrating on the former: drastically reducing the number of candidate regions that require further, usually more intensive, processing, but with a minimum of computation and missed detections. Bottom-up processing is based on local groupings of edge fragments constrained by loose geometrical relationships. They have no a priori semantic or geometric interpretation. The role of training is to select special groupings that are moderately likely at certain places on the object but rare in the background. We show that the statistics in both populations are stable. The candidate regions are those that contain global arrangements of several local groupings. Whereas our model was not conceived to explain brain functions, it does cohere with evidence about the functions of neurons in V1 and V2, such as responses to coarse or incomplete patterns (e.g., illusory contours) and to scale and translation invariance in IT. Finally, the algorithm is applied to face and symbol detection."
            },
            "slug": "A-Computational-Model-for-Visual-Selection-Amit-Geman",
            "title": {
                "fragments": [],
                "text": "A Computational Model for Visual Selection"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The model was not conceived to explain brain functions, but it does cohere with evidence about the functions of neurons in V1 and V2, such as responses to coarse or incomplete patterns and to scale and translation invariance in IT."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4801654"
                        ],
                        "name": "Y. Amit",
                        "slug": "Y.-Amit",
                        "structuredName": {
                            "firstName": "Yali",
                            "lastName": "Amit",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Amit"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707642"
                        ],
                        "name": "D. Geman",
                        "slug": "D.-Geman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This theme was pursued in the context of classification trees and stepwise entropy reduction in  Amit and Geman (1997) , Geman and Jedynak (1996), Jedynak and Fleuret (1996) and Wilder (1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 96
                            }
                        ],
                        "text": "This theme was pursued in the context of classification trees and stepwise entropy reduction in Amit and Geman (1997), Geman and Jedynak (1996), Jedynak and Fleuret (1996) and Wilder (1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 12470146,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "de5e95325e139fd0a46df1dd28aabecd0273b772",
            "isKey": false,
            "numCitedBy": 1152,
            "numCiting": 78,
            "paperAbstract": {
                "fragments": [],
                "text": "We explore a new approach to shape recognition based on a virtually infinite family of binary features (queries) of the image data, designed to accommodate prior information about shape invariance and regularity. Each query corresponds to a spatial arrangement of several local topographic codes (or tags), which are in themselves too primitive and common to be informative about shape. All the discriminating power derives from relative angles and distances among the tags. The important attributes of the queries are a natural partial ordering corresponding to increasing structure and complexity; semi-invariance, meaning that most shapes of a given class will answer the same way to two queries that are successive in the ordering; and stability, since the queries are not based on distinguished points and substructures. No classifier based on the full feature set can be evaluated, and it is impossible to determine a priori which arrangements are informative. Our approach is to select informative features and build tree classifiers at the same time by inductive learning. In effect, each tree provides an approximation to the full posterior where the features chosen depend on the branch that is traversed. Due to the number and nature of the queries, standard decision tree construction based on a fixed-length feature vector is not feasible. Instead we entertain only a small random sample of queries at each node, constrain their complexity to increase with tree depth, and grow multiple trees. The terminal nodes are labeled by estimates of the corresponding posterior distribution over shape classes. An image is classified by sending it down every tree and aggregating the resulting distributions. The method is applied to classifying handwritten digits and synthetic linear and nonlinear deformations of three hundred symbols. State-of-the-art error rates are achieved on the National Institute of Standards and Technology database of digits. The principal goal of the experiments on symbols is to analyze invariance, generalization error and related issues, and a comparison with artificial neural networks methods is presented in this context. Figure 1: LATEX Symbol"
            },
            "slug": "Shape-Quantization-and-Recognition-with-Randomized-Amit-Geman",
            "title": {
                "fragments": [],
                "text": "Shape Quantization and Recognition with Randomized Trees"
            },
            "tldr": {
                "abstractSimilarityScore": 84,
                "text": "A new approach to shape recognition based on a virtually infinite family of binary features (queries) of the image data, designed to accommodate prior information about shape invariance and regularity, and a comparison with artificial neural networks methods is presented."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4801654"
                        ],
                        "name": "Y. Amit",
                        "slug": "Y.-Amit",
                        "structuredName": {
                            "firstName": "Yali",
                            "lastName": "Amit",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Amit"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 2113,
                                "start": 39
                            }
                        ],
                        "text": "The edge filter we use is described in Amit and Geman (1999) and additional details may be found in Fleuret (2000). Briefly, the filter is applied at each location in G, and has an direction (horizontal, vertical, and two diagonals) and a contrast (positive or negative), yielding eight “types” denoted by ξ = 1, . . . , 8. For example, in the case of a horizontal edge “at” (u, v), the absolute difference |I (u, v) − I (u, v + 1)| is compared with a threshold, with the differences |I (u, v)− I (u′, v′)| for the nearest neighbors (u′, v′) of (u, v) and with the differences |I (u, v+1)− I (u′, v′)| for the nearest neighbors (u′, v′) of (u, v + 1); it has positive contrast if I (u, v)> I (u, v + 1). The definitions of the other filters are analogous. The principal motivation for using comparisons of intensity differences is to gain a measure of photometric invariance. One major difficulty in detecting faces is the variation in the appearance of faces due to the vagaries of lighting; see for example the discussion in Ullman (1996). In order to diminish the variation, methods such as those based on neural networks usually require preprocessing (Rowley, 1999), for instance subtracting a linear component from the grey level map followed by histogram equalization (Sung and Poggio, 1998), which can be costly. Instead, the information we extract from the greylevels are comparisons of intensity differences, which are invariant to linear transformations of the greyscale. In Fig. 7 we show three versions of a training face together with the detected edges. There is an one elementary test X = X (I ) for each location (u, v), each filter type ξ and each “tolerance” η = 1, 2, . . . , 10. Then X = 1 if there is an edge of type ξ at any location along a line of length η centered at (u, v) and orthogonal to the filter direction; otherwise X = 0. Thus, for example, in the case of a positive, horizontal type at location (u, v) and tolerance η= 3, the test X = 1 if there is an horizontal edge with positive contrast at at least one of the locations {(u, v − 1), (u, v), (u, v + 1)}; see Fleuret (2000) for more details."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 819,
                                "start": 31
                            }
                        ],
                        "text": "The precursor of this work is (Amit and Geman, 1999): Features are spatial arrangements of edge fragments, induced from training faces at a reference pose, and computation is minimized via a generalized Hough transform; there is no on-line optimization and no segmentation apart from visual selection itself. In evaluating our results, we are also going to focus on comparisons with the work in Rowley (1999) and Rowley et al. (1998) since this seems to be among the most comprehensive studies as well as a fair representation of the state-of-the-art. This work stems from a broader project on visual recognition as a “twenty questions game,” in other words a problem in efficient sequential testing. This theme was pursued in the context of classification trees and stepwise entropy reduction in Amit and Geman (1997), Geman and Jedynak (1996), Jedynak and Fleuret (1996) and Wilder (1998)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 434,
                                "start": 31
                            }
                        ],
                        "text": "The precursor of this work is (Amit and Geman, 1999): Features are spatial arrangements of edge fragments, induced from training faces at a reference pose, and computation is minimized via a generalized Hough transform; there is no on-line optimization and no segmentation apart from visual selection itself. In evaluating our results, we are also going to focus on comparisons with the work in Rowley (1999) and Rowley et al. (1998) since this seems to be among the most comprehensive studies as well as a fair representation of the state-of-the-art."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 1041,
                                "start": 39
                            }
                        ],
                        "text": "The edge filter we use is described in Amit and Geman (1999) and additional details may be found in Fleuret (2000). Briefly, the filter is applied at each location in G, and has an direction (horizontal, vertical, and two diagonals) and a contrast (positive or negative), yielding eight “types” denoted by ξ = 1, . . . , 8. For example, in the case of a horizontal edge “at” (u, v), the absolute difference |I (u, v) − I (u, v + 1)| is compared with a threshold, with the differences |I (u, v)− I (u′, v′)| for the nearest neighbors (u′, v′) of (u, v) and with the differences |I (u, v+1)− I (u′, v′)| for the nearest neighbors (u′, v′) of (u, v + 1); it has positive contrast if I (u, v)> I (u, v + 1). The definitions of the other filters are analogous. The principal motivation for using comparisons of intensity differences is to gain a measure of photometric invariance. One major difficulty in detecting faces is the variation in the appearance of faces due to the vagaries of lighting; see for example the discussion in Ullman (1996). In order to diminish the variation, methods such as those based on neural networks usually require preprocessing (Rowley, 1999), for instance subtracting a linear component from the grey level map followed by histogram equalization (Sung and Poggio, 1998), which can be costly."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 891,
                                "start": 31
                            }
                        ],
                        "text": "The precursor of this work is (Amit and Geman, 1999): Features are spatial arrangements of edge fragments, induced from training faces at a reference pose, and computation is minimized via a generalized Hough transform; there is no on-line optimization and no segmentation apart from visual selection itself. In evaluating our results, we are also going to focus on comparisons with the work in Rowley (1999) and Rowley et al. (1998) since this seems to be among the most comprehensive studies as well as a fair representation of the state-of-the-art. This work stems from a broader project on visual recognition as a “twenty questions game,” in other words a problem in efficient sequential testing. This theme was pursued in the context of classification trees and stepwise entropy reduction in Amit and Geman (1997), Geman and Jedynak (1996), Jedynak and Fleuret (1996) and Wilder (1998). The detection counterpart of classification is sequential testing in order to discover which of two classes is true; one is the target and the other, “background,” is dominant."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 39
                            }
                        ],
                        "text": "The edge filter we use is described in Amit and Geman (1999) and additional details may be found in Fleuret (2000)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 39
                            }
                        ],
                        "text": "The edge filter we use is described in Amit and Geman (1999) and additional details may be found in Fleuret (2000). Briefly, the filter is applied at each location in G, and has an direction (horizontal, vertical, and two diagonals) and a contrast (positive or negative), yielding eight “types” denoted by ξ = 1, ."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 409,
                                "start": 31
                            }
                        ],
                        "text": "The precursor of this work is (Amit and Geman, 1999): Features are spatial arrangements of edge fragments, induced from training faces at a reference pose, and computation is minimized via a generalized Hough transform; there is no on-line optimization and no segmentation apart from visual selection itself. In evaluating our results, we are also going to focus on comparisons with the work in Rowley (1999) and Rowley et al."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 1390011,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "62ccf3020ac41088b39c3982d119752b0ba6b261",
            "isKey": true,
            "numCitedBy": 34,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "This article describes a parallel neural net architecture for efficient and robust visual selection in generic gray-level images. Objects are represented through flexible star-type planar arrangements of binary local features which are in turn star-type planar arrangements of oriented edges. Candidate locations are detected over a range of scales and other deformations, using a generalized Hough transform. The flexibility of the arrangements provides the required invariance. Training involves selecting a small number of stable local features from a predefined pool, which are well localized on registered examples of the object. Training therefore requires only small data sets. The parallel architecture is constructed so that the Hough transform associated with any object can be implemented without creating or modifying any connections. The different object representations are learned and stored in a central module. When one of these representations is evoked, it primes the appropriate layers in the network so that the corresponding Hough transform is computed. Analogies between the different layers in the network and those in the visual system are discussed. Furthermore, the model can be used to explain certain experiments on visual selection reported in the literature."
            },
            "slug": "A-Neural-Network-Architecture-for-Visual-Selection-Amit",
            "title": {
                "fragments": [],
                "text": "A Neural Network Architecture for Visual Selection"
            },
            "tldr": {
                "abstractSimilarityScore": 64,
                "text": "A parallel neural net architecture for efficient and robust visual selection in generic gray-level images, constructed so that the Hough transform associated with any object can be implemented without creating or modifying any connections."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2055501916"
                        ],
                        "name": "Thomas Maurer",
                        "slug": "Thomas-Maurer",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Maurer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Thomas Maurer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1704573"
                        ],
                        "name": "C. Malsburg",
                        "slug": "C.-Malsburg",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Malsburg",
                            "middleNames": [
                                "von",
                                "der"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Malsburg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 178,
                                "start": 145
                            }
                        ],
                        "text": "…neural networks (Rowley\net al., 1998; Sung and Poggio, 1998), support vector machines (Osuna et al., 1997), graph-matching (Leung et al., 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor, 1996), deformable templates (Miao et al., 1999; Yuille et al., 1992) and…"
                    },
                    "intents": []
                }
            ],
            "corpusId": 17312452,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ce5f297cb037b2101da175344e2597a52c0e5908",
            "isKey": false,
            "numCitedBy": 144,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "We demonstrate a system capable of tracking in real world image sequences, landmarks such as eyes, mouth, or chin on a face. In the standard version, knowledge previously collected about faces is used for finding the landmarks in the first frame. In a second version, the system is able to track the face without any prior knowledge about faces and is thus applicable to other object classes. By using Gabor filters as visual features, and by both avoiding limiting assumptions and many parameters our tracking tool is simple and easy to use. As a first application the tracking results are used to estimate the pose of a face."
            },
            "slug": "Tracking-and-learning-graphs-and-pose-on-image-of-Maurer-Malsburg",
            "title": {
                "fragments": [],
                "text": "Tracking and learning graphs and pose on image sequences of faces"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "A system capable of tracking in real world image sequences, landmarks such as eyes, mouth, or chin on a face, and is applicable to other object classes by using Gabor filters as visual features."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Second International Conference on Automatic Face and Gesture Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145266088"
                        ],
                        "name": "T. Leung",
                        "slug": "T.-Leung",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Leung",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Leung"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2511655"
                        ],
                        "name": "M. Burl",
                        "slug": "M.-Burl",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Burl",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Burl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1690922"
                        ],
                        "name": "P. Perona",
                        "slug": "P.-Perona",
                        "structuredName": {
                            "firstName": "Pietro",
                            "lastName": "Perona",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Perona"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 164,
                                "start": 146
                            }
                        ],
                        "text": "…including artificial neural networks (Rowley\net al., 1998; Sung and Poggio, 1998), support vector machines (Osuna et al., 1997), graph-matching (Leung et al., 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor, 1996), deformable templates (Miao et al., 1999; Yuille…"
                    },
                    "intents": []
                }
            ],
            "corpusId": 2904067,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0d50d0e2af0b45cc7ed25fe4aa97af900c9bd32a",
            "isKey": false,
            "numCitedBy": 389,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm for locating quasi-frontal views of human faces in cluttered scenes is presented. The algorithm works by coupling a set of local feature detectors with a statistical model of the mutual distances between facial features it is invariant with respect to translation, rotation (in the plane), and scale and can handle partial occlusions of the face. On a challenging database with complicated and varied backgrounds, the algorithm achieved a correct localization rate of 95% in images where the face appeared quasi-frontally.<<ETX>>"
            },
            "slug": "Finding-faces-in-cluttered-scenes-using-random-Leung-Burl",
            "title": {
                "fragments": [],
                "text": "Finding faces in cluttered scenes using random labeled graph matching"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "An algorithm for locating quasi-frontal views of human faces in cluttered scenes is presented and it is found that it is invariant with respect to translation, rotation, and scale and can handle partial occlusions of the face."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE International Conference on Computer Vision"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145235303"
                        ],
                        "name": "Jun Miao",
                        "slug": "Jun-Miao",
                        "structuredName": {
                            "firstName": "Jun",
                            "lastName": "Miao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jun Miao"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1714354"
                        ],
                        "name": "Baocai Yin",
                        "slug": "Baocai-Yin",
                        "structuredName": {
                            "firstName": "Baocai",
                            "lastName": "Yin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Baocai Yin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2641821"
                        ],
                        "name": "Kongqiao Wang",
                        "slug": "Kongqiao-Wang",
                        "structuredName": {
                            "firstName": "Kongqiao",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kongqiao Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1808618"
                        ],
                        "name": "Lansun Shen",
                        "slug": "Lansun-Shen",
                        "structuredName": {
                            "firstName": "Lansun",
                            "lastName": "Shen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lansun Shen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46772962"
                        ],
                        "name": "Xuecun Chen",
                        "slug": "Xuecun-Chen",
                        "structuredName": {
                            "firstName": "Xuecun",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Xuecun Chen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6464488,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4db205eb15a72c177438275746eebeaabf7e6b1a",
            "isKey": false,
            "numCitedBy": 135,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-hierarchical-multiscale-and-multiangle-system-for-Miao-Yin",
            "title": {
                "fragments": [],
                "text": "A hierarchical multiscale and multiangle system for human face detection in a complex background using gravity-center template"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38817267"
                        ],
                        "name": "K. Sung",
                        "slug": "K.-Sung",
                        "structuredName": {
                            "firstName": "Kah",
                            "lastName": "Sung",
                            "middleNames": [
                                "Kay"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Sung"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 104
                            }
                        ],
                        "text": "Our face training set is the same as in Amit and Geman (1999) and smaller than in Rowley et al. (1998), Sung and Poggio (1998)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 254,
                                "start": 233
                            }
                        ],
                        "text": "In order to diminish the variation, methods such as those based on neural networks usually require preprocessing (Rowley, 1999), for instance subtracting a linear component from the grey level map followed by histogram equalization (Sung and Poggio, 1998), which can be costly."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 140,
                                "start": 119
                            }
                        ],
                        "text": "A variety of methods have been proposed for face detection, including artificial neural networks (Rowley\net al., 1998; Sung and Poggio, 1998), support vector machines (Osuna et al., 1997), graph-matching (Leung et al., 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor,…"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 194,
                                "start": 172
                            }
                        ],
                        "text": "The induction process does not utilize a background model (such as the minimax entropy model proposed in Zhu et al. (1997)) or samples of backgrounds and confusions (as in Sung and Poggio (1998) and Rowley et al. (1998)), both of which might improve discrimination."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 7164794,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "088eb2d102c6bb486f5270d0b2adff76961994cf",
            "isKey": true,
            "numCitedBy": 2061,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "We present an example-based learning approach for locating vertical frontal views of human faces in complex scenes. The technique models the distribution of human face patterns by means of a few view-based \"face\" and \"nonface\" model clusters. At each image location, a difference feature vector is computed between the local image pattern and the distribution-based model. A trained classifier determines, based on the difference feature vector measurements, whether or not a human face exists at the current image location. We show empirically that the distance metric we adopt for computing difference feature vectors, and the \"nonface\" clusters we include in our distribution-based model, are both critical for the success of our system."
            },
            "slug": "Example-Based-Learning-for-View-Based-Human-Face-Sung-Poggio",
            "title": {
                "fragments": [],
                "text": "Example-Based Learning for View-Based Human Face Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "An example-based learning approach for locating vertical frontal views of human faces in complex scenes and shows empirically that the distance metric adopted for computing difference feature vectors, and the \"nonface\" clusters included in the distribution-based model, are both critical for the success of the system."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 190,
                                "start": 177
                            }
                        ],
                        "text": "Some notable exceptions include work on hashing (Lamdan et al., 1988), Hough transforms (Rojer and Schwartz, 1992; Amit and Geman, 1999; Amit, 1999), and treestructured search (Grimson, 1990), all of which have influenced our thinking."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 129,
                                "start": 114
                            }
                        ],
                        "text": ", 1988), Hough transforms (Rojer and Schwartz, 1992; Amit and Geman, 1999; Amit, 1999), and treestructured search (Grimson, 1990), all of which have influenced our thinking."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1530384,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4462c82748d81489f4f453f516754438b35a8cec",
            "isKey": false,
            "numCitedBy": 961,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "With contributions from Tomas LozanoPerez and Daniel P. Huttenlocher.An intelligent system must know \"what \"the objects are and \"where \"they are in its environment. Examples of this ubiquitous problem in computer vision arise in tasks involving hand-eye coordination (such as assembling or sorting), inspection tasks, gauging operations, and in navigation and localization of mobile robots. This book describes an extended series of experiments into the role of geometry in the critical area of object recognition. It provides precise definitions of the recognition and localization problems, describes the methods used to address them, analyzes the solutions to these problems, and addresses the implications of this analysis.The solution to problems of object recognition are of fundamental importance in many real applications and versions of the techniques described here are already being used in industrial settings. Although a number of questions remain to be solved, the authors provide a valuable framework for understanding both the strengths and limitations of using object shape to guide recognition.W. Eric L. Grimson is Matsushita Associate Professor in the Department of Electrical Engineering and Computer Science at MIT.Contents: Introduction. Recognition as a Search Problem. Searching for Correspondences. Two-Dimensional Constraints. Three-Dimensional Constraints. Verifying Hypotheses. Controlling the Search Explosion. Selecting Subspaces of the Search Space. Empirical Testing. The Combinatorics of the Matching Process. The Combinatorics of Hough Transforms. The Combinatorics of Verification. The Combinatorics of Indexing. Evaluating the Methods. Recognition from Libraries. Parameterized Objects. The Role of Grouping. Sensing Strategies. Applications. The Next Steps."
            },
            "slug": "Object-recognition-by-computer-the-role-of-Grimson",
            "title": {
                "fragments": [],
                "text": "Object recognition by computer - the role of geometric constraints"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This book describes an extended series of experiments into the role of geometry in the critical area of object recognition, providing precise definitions of the recognition and localization problems, the methods used to address them, the solutions to these problems, and the implications of this analysis."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39682833"
                        ],
                        "name": "H. Rowley",
                        "slug": "H.-Rowley",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Rowley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Rowley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1767244"
                        ],
                        "name": "S. Baluja",
                        "slug": "S.-Baluja",
                        "structuredName": {
                            "firstName": "Shumeet",
                            "lastName": "Baluja",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Baluja"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733113"
                        ],
                        "name": "T. Kanade",
                        "slug": "T.-Kanade",
                        "structuredName": {
                            "firstName": "Takeo",
                            "lastName": "Kanade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kanade"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 69
                            }
                        ],
                        "text": "First, our false negative rate is smaller; a 15% rate is reported in Rowley (1999) for an ensemble of images, and other authors (e.g., (Miao et al., 1999)) obtain similar rates."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 47
                            }
                        ],
                        "text": "Second, there seem to be fewer false alarms in Rowley (1999)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 99,
                                "start": 86
                            }
                        ],
                        "text": "In evaluating our results, we are also going to focus on comparisons with the work in Rowley (1999) and Rowley et al. (1998) since this seems to be among the most comprehensive studies as well as a fair representation of the state-of-the-art."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 114
                            }
                        ],
                        "text": "In order to diminish the variation, methods such as those based on neural networks usually require preprocessing (Rowley, 1999), for instance subtracting a linear component from the grey level map followed by histogram equalization (Sung and Poggio, 1998), which can be costly."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 107,
                                "start": 94
                            }
                        ],
                        "text": "Our algorithm is faster than the one in Amit and Geman (1999) and much faster than the one in Rowley (1999), which requires 140s to process the scene in Fig."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 246,
                                "start": 233
                            }
                        ],
                        "text": "The algorithm in Amit and Geman (1999) is perhaps the simplest: The object representation is very compact and training only occurs at a reference pose, requiring only a few minutes as opposed to about an hour here and much longer in Rowley (1999)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 57,
                                "start": 44
                            }
                        ],
                        "text": "Still, due to the comprehensive analysis in Rowley (1999) of publicly available images and to our familiarity with Amit and Geman (1999), a few general statements appear evident."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 83,
                                "start": 71
                            }
                        ],
                        "text": "Another is P3(X A = 1) ≥ U (k), obtained numerically and recursively from\n• U (0) = min1≤i≤N P3(Xi = 1) • U (2k) = ρ ·U (k) · (1−U (k))+U (k)2\n• U (2k + 1) = ρ · √U (k) · (1−U (k)) ·U (k + 1)·√ (1−U (k + 1))+U (k) ·U (k + 1)\nThere is no analytic expression for U ."
                    },
                    "intents": []
                }
            ],
            "corpusId": 40120983,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3d76ef8e61395a6e9c32627f1f108772d084e2e9",
            "isKey": true,
            "numCitedBy": 4155,
            "numCiting": 134,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a neural network-based face detection system. A retinally connected neural network examines small windows of an image and decides whether each window contains a face. The system arbitrates between multiple networks to improve performance over a single network. We use a bootstrap algorithm for training the networks, which adds false detections into the training set as training progresses. This eliminates the difficult task of manually selecting non-face training examples, which must be chosen to span the entire space of non-face images. Comparisons with other state-of-the-art face detection systems are presented; our system has better performance in terms of detection and false-positive rates."
            },
            "slug": "Neural-network-based-face-detection-Rowley-Baluja",
            "title": {
                "fragments": [],
                "text": "Neural Network-Based Face Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "A neural network-based face detection system that arbitrates between multiple networks to improve performance over a single network using a bootstrap algorithm, which eliminates the difficult task of manually selecting non-face training examples."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733172"
                        ],
                        "name": "E. Saber",
                        "slug": "E.-Saber",
                        "structuredName": {
                            "firstName": "Eli",
                            "lastName": "Saber",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Saber"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1747853"
                        ],
                        "name": "A. Tekalp",
                        "slug": "A.-Tekalp",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Tekalp",
                            "middleNames": [
                                "Murat"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Tekalp"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "et al., 1998; Sung and Poggio, 1998), support vector machines (Osuna et al., 1997), graph-matching (Leung et al., 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor, 1996), deformable templates (Miao et al., 1999; Yuille et al., 1992) and those based on color (Haiyuan et al., 1999;  Sabert and Tekalp, 1998 ) and motion (Ming and Akastuka, 1998; Wee et al., 1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 206037537,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3bc9273d93d8b2ccb23564b4843be118cbc4f254",
            "isKey": false,
            "numCitedBy": 279,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Frontal-view-face-detection-and-facial-feature-and-Saber-Tekalp",
            "title": {
                "fragments": [],
                "text": "Frontal-view face detection and facial feature extraction using color, shape and symmetry based cost functions"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit. Lett."
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2152311849"
                        ],
                        "name": "Ming Xu",
                        "slug": "Ming-Xu",
                        "structuredName": {
                            "firstName": "Ming",
                            "lastName": "Xu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ming Xu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3562715"
                        ],
                        "name": "T. Akatsuka",
                        "slug": "T.-Akatsuka",
                        "structuredName": {
                            "firstName": "Takao",
                            "lastName": "Akatsuka",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Akatsuka"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 110887513,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6080fb0d0087c117f34be5a8531ba88508ee0b1d",
            "isKey": false,
            "numCitedBy": 2,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we proposed a multi-module method for detecting human face from complex background. Each module utilizes one of the cues of human face, such as color, geometric property, motion, depth and etc.. Facial region is obtained by fusion of detected parameters result from each module, and the result is surely robust than that of using any single module. As an actual preliminary implementation, we constructed a face detection system using color module and geometric module. Although only two modules are realized in our system, the conceptual structure of the proposed multi-module method is through to be an efficient solution to the problem of face detection. Multi-module method can not only improve the robustness of detection, but also make the development of new applications, especially face detection systems an easy task, which only need to combine the extra modules with other pre-existing modules. Experimental results show that faces in complex background can be extracted efficiently with multi-module method."
            },
            "slug": "Multimodule-method-for-detection-of-a-human-face-Xu-Akatsuka",
            "title": {
                "fragments": [],
                "text": "Multimodule method for detection of a human face from complex backgrounds"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Experimental results show that faces in complex background can be extracted efficiently with multi-module method, which can not only improve the robustness of detection, but also make the development of new applications, especially face detection systems an easy task, which only need to combine the extra modules with other pre-existing modules."
            },
            "venue": {
                "fragments": [],
                "text": "Optics & Photonics"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781874"
                        ],
                        "name": "E. Osuna",
                        "slug": "E.-Osuna",
                        "structuredName": {
                            "firstName": "Edgar",
                            "lastName": "Osuna",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Osuna"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1771659"
                        ],
                        "name": "R. Freund",
                        "slug": "R.-Freund",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Freund",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Freund"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804489"
                        ],
                        "name": "F. Girosi",
                        "slug": "F.-Girosi",
                        "structuredName": {
                            "firstName": "Federico",
                            "lastName": "Girosi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Girosi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 166,
                                "start": 148
                            }
                        ],
                        "text": "…have been proposed for face detection, including artificial neural networks (Rowley\net al., 1998; Sung and Poggio, 1998), support vector machines (Osuna et al., 1997), graph-matching (Leung et al., 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor, 1996), deformable…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2845602,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9008cdacbdcff8a218a6928e94fe7c6dfc237b24",
            "isKey": false,
            "numCitedBy": 2841,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "We investigate the application of Support Vector Machines (SVMs) in computer vision. SVM is a learning technique developed by V. Vapnik and his team (AT&T Bell Labs., 1985) that can be seen as a new method for training polynomial, neural network, or Radial Basis Functions classifiers. The decision surfaces are found by solving a linearly constrained quadratic programming problem. This optimization problem is challenging because the quadratic form is completely dense and the memory requirements grow with the square of the number of data points. We present a decomposition algorithm that guarantees global optimality, and can be used to train SVM's over very large data sets. The main idea behind the decomposition is the iterative solution of sub-problems and the evaluation of optimality conditions which are used both to generate improved iterative values, and also establish the stopping criteria for the algorithm. We present experimental results of our implementation of SVM, and demonstrate the feasibility of our approach on a face detection problem that involves a data set of 50,000 data points."
            },
            "slug": "Training-support-vector-machines:-an-application-to-Osuna-Freund",
            "title": {
                "fragments": [],
                "text": "Training support vector machines: an application to face detection"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "A decomposition algorithm that guarantees global optimality, and can be used to train SVM's over very large data sets is presented, and the feasibility of the approach on a face detection problem that involves a data set of 50,000 data points is demonstrated."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707642"
                        ],
                        "name": "D. Geman",
                        "slug": "D.-Geman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2521020"
                        ],
                        "name": "B. Jedynak",
                        "slug": "B.-Jedynak",
                        "structuredName": {
                            "firstName": "Bruno",
                            "lastName": "Jedynak",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Jedynak"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This theme was pursued in the context of classification trees and stepwise entropy reduction in Amit and Geman (1997),  Geman and Jedynak (1996) , Jedynak and Fleuret (1996) and Wilder (1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 143,
                                "start": 119
                            }
                        ],
                        "text": "This theme was pursued in the context of classification trees and stepwise entropy reduction in Amit and Geman (1997), Geman and Jedynak (1996), Jedynak and Fleuret (1996) and Wilder (1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 7358010,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0ce6df6d6f009cbdd5f8c395bd422581e9aa0769",
            "isKey": false,
            "numCitedBy": 598,
            "numCiting": 63,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new approach for tracking roads from satellite images, and thereby illustrate a general computational strategy (\"active testing\") for tracking 1D structures and other recognition tasks in computer vision. Our approach is related to recent work in active vision on \"where to look next\" and motivated by the \"divide-and-conquer\" strategy of parlour games. We choose \"tests\" (matched filters for short road segments) one at a time in order to remove as much uncertainty as possible about the \"true hypothesis\" (road position) given the results of the previous tests. The tests are chosen online based on a statistical model for the joint distribution of tests and hypotheses. The problem of minimizing uncertainty (measured by entropy) is formulated in simple and explicit analytical terms. At each iteration new image data are examined and a new entropy minimization problem is solved (exactly), resulting in a new image location to inspect, and so forth. We report experiments using panchromatic SPOT satellite imagery with a ground resolution of ten meters."
            },
            "slug": "An-Active-Testing-Model-for-Tracking-Roads-in-Geman-Jedynak",
            "title": {
                "fragments": [],
                "text": "An Active Testing Model for Tracking Roads in Satellite Images"
            },
            "tldr": {
                "abstractSimilarityScore": 81,
                "text": "A new approach for tracking roads from satellite images, and thereby illustrate a general computational strategy for tracking 1D structures and other recognition tasks in computer vision, related to recent work in active vision and motivated by the \"divide-and-conquer\" strategy of parlour games."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3096453"
                        ],
                        "name": "Y. Lamdan",
                        "slug": "Y.-Lamdan",
                        "structuredName": {
                            "firstName": "Yehezkel",
                            "lastName": "Lamdan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Lamdan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144035149"
                        ],
                        "name": "J. Schwartz",
                        "slug": "J.-Schwartz",
                        "structuredName": {
                            "firstName": "Jacob",
                            "lastName": "Schwartz",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Schwartz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1756534"
                        ],
                        "name": "H. Wolfson",
                        "slug": "H.-Wolfson",
                        "structuredName": {
                            "firstName": "Haim",
                            "lastName": "Wolfson",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wolfson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36500949,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1f314b8066e4b8248172e0b9c1e73a31588e73f6",
            "isKey": false,
            "numCitedBy": 325,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Novel techniques are described for model-based recognition of 3-D objects from unknown viewpoints using single-gray-scale images. The objects in the scene may be overlapping and partially occluded. Efficient matching algorithms, which assume affine approximation to the perspective viewing transformation, are proposed. The study is currently restricted to flat rigid 3-D objects. Point, line and curve matching algorithms are presented. The study especially emphasizes the curve matching problem. Experimental results are included.<<ETX>>"
            },
            "slug": "Object-recognition-by-affine-invariant-matching-Lamdan-Schwartz",
            "title": {
                "fragments": [],
                "text": "Object recognition by affine invariant matching"
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "Novel techniques are described for model-based recognition of 3-D objects from unknown viewpoints using single-gray-scale images and efficient matching algorithms are proposed, which assume affine approximation to the perspective viewing transformation."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings CVPR '88: The Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36427051"
                        ],
                        "name": "Peter W. Hallinan",
                        "slug": "Peter-W.-Hallinan",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Hallinan",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Peter W. Hallinan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115017312"
                        ],
                        "name": "David S. Cohen",
                        "slug": "David-S.-Cohen",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Cohen",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David S. Cohen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 151,
                                "start": 111
                            }
                        ],
                        "text": ", 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor, 1996), deformable templates (Miao et al., 1999; Yuille et al., 1992) and those based on color (Haiyuan et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 164,
                                "start": 145
                            }
                        ],
                        "text": "…(Leung et al., 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor, 1996), deformable templates (Miao et al., 1999; Yuille et al., 1992) and those based on color (Haiyuan et al., 1999; Sabert and Tekalp, 1998) and motion (Ming and Akastuka, 1998; Wee et al., 1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8700837,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "52956a66b0d6951906f8bfd76574327ef90b672b",
            "isKey": false,
            "numCitedBy": 1500,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a method for detecting and describing features of faces using deformable templates. The feature of interest, an eye for example, is described by a parameterized template. An energy function is defined which links edges, peaks, and valleys in the image intensity to corresponding properties of the template. The template then interacts dynamically with the image by altering its parameter values to minimize the energy function, thereby deforming itself to find the best fit. The final parametr values can be used as descriptors for the feature. We illustrate this method by showing deformable templates detecting eyes and mouths in real images. We demonstrate their ability for tracking features."
            },
            "slug": "Feature-extraction-from-faces-using-deformable-Yuille-Hallinan",
            "title": {
                "fragments": [],
                "text": "Feature extraction from faces using deformable templates"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "De deformable templates are illustrated by showing their ability for tracking features and altering parameter values to minimize the energy function, thereby deforming itself to find the best fit."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings CVPR '89: IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7205190"
                        ],
                        "name": "Tim Cootes",
                        "slug": "Tim-Cootes",
                        "structuredName": {
                            "firstName": "Tim",
                            "lastName": "Cootes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tim Cootes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144482985"
                        ],
                        "name": "C. Taylor",
                        "slug": "C.-Taylor",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Taylor",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Taylor"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 88,
                                "start": 63
                            }
                        ],
                        "text": ", 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor, 1996), deformable templates (Miao et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 146
                            }
                        ],
                        "text": "…1998), support vector machines (Osuna et al., 1997), graph-matching (Leung et al., 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor, 1996), deformable templates (Miao et al., 1999; Yuille et al., 1992) and those based on color (Haiyuan et al., 1999; Sabert and…"
                    },
                    "intents": []
                }
            ],
            "corpusId": 29326531,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f0ad8f033087944c3b6fa8a443c443dde7782e0d",
            "isKey": false,
            "numCitedBy": 53,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a method of locating hypotheses for the positions of faces in an image. We use statistical feature detectors to locate candidates for features, then use a statistical model of the shape and orientation of the features to test combinations of such features to find the most plausible. The best sets can be used as the initial position of an Active Shape Model, which can then accurately locate the full face."
            },
            "slug": "Locating-faces-using-statistical-feature-detectors-Cootes-Taylor",
            "title": {
                "fragments": [],
                "text": "Locating faces using statistical feature detectors"
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "A method of locating hypotheses for the positions of faces in an image by using statistical feature detectors to locate candidates for features, then using a statistical model of the shape and orientation of the features to test combinations of such features to find the most plausible."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Second International Conference on Automatic Face and Gesture Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145380991"
                        ],
                        "name": "Song-Chun Zhu",
                        "slug": "Song-Chun-Zhu",
                        "structuredName": {
                            "firstName": "Song-Chun",
                            "lastName": "Zhu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Song-Chun Zhu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39092098"
                        ],
                        "name": "Y. Wu",
                        "slug": "Y.-Wu",
                        "structuredName": {
                            "firstName": "Ying",
                            "lastName": "Wu",
                            "middleNames": [
                                "Nian"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Wu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117481816"
                        ],
                        "name": "D. Mumford",
                        "slug": "D.-Mumford",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mumford",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mumford"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "The induction process does not utilize a background model (such as the minimax entropy model proposed in  Zhu et al. (1997) ) or samples of backgrounds and confusions (as in Sung and Poggio (1998) and Rowley et al. (1998)), both of which might improve discrimination."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 122,
                                "start": 105
                            }
                        ],
                        "text": "The induction process does not utilize a background model (such as the minimax entropy model proposed in Zhu et al. (1997)) or samples of backgrounds and confusions (as in Sung and Poggio (1998) and Rowley et al. (1998)), both of which might improve discrimination."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 15926,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dd9ed76e8b9fa8b69257d3fc61fbc38bee973016",
            "isKey": false,
            "numCitedBy": 492,
            "numCiting": 85,
            "paperAbstract": {
                "fragments": [],
                "text": "This article proposes a general theory and methodology, called the minimax entropy principle, for building statistical models for images (or signals) in a variety of applications. This principle consists of two parts. The first is the maximum entropy principle for feature binding (or fusion): for a given set of observed feature statistics, a distribution can be built to bind these feature statistics together by maximizing the entropy over all distributions that reproduce them. The second part is the minimum entropy principle for feature selection: among all plausible sets of feature statistics, we choose the set whose maximum entropy distribution has the minimum entropy. Computational and inferential issues in both parts are addressed; in particular, a feature pursuit procedure is proposed for approximately selecting the optimal set of features. The minimax entropy principle is then corrected by considering the sample variation in the observed feature statistics, and an information criterion for feature pursuit is derived. The minimax entropy principle is applied to texture modeling, where a novel Markov random field (MRF) model, called FRAME (filter, random field, and minimax entropy), is derived, and encouraging results are obtained in experiments on a variety of texture images. The relationship between our theory and the mechanisms of neural computation is also discussed."
            },
            "slug": "Minimax-Entropy-Principle-and-Its-Application-to-Zhu-Wu",
            "title": {
                "fragments": [],
                "text": "Minimax Entropy Principle and Its Application to Texture Modeling"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The minimax entropy principle is applied to texture modeling, where a novel Markov random field model, called FRAME, is derived, and encouraging results are obtained in experiments on a variety of texture images."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2403454"
                        ],
                        "name": "E. Baum",
                        "slug": "E.-Baum",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Baum",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Baum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733689"
                        ],
                        "name": "D. Haussler",
                        "slug": "D.-Haussler",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Haussler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Haussler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 269,
                                "start": 255
                            }
                        ],
                        "text": "We have not appealed to general theories for hypothesis testing (for instance likelihood ratio tests based on models for P0 and P1) or for inductive learning (for instance structural risk minimization (Vapnik, 1996)) or feedforward classifiers ((Baum and Haussler, 1989; Devroye et al., 1995)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 15659829,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "25406e6733a698bfc4ac836f8e74f458e75dad4f",
            "isKey": false,
            "numCitedBy": 1696,
            "numCiting": 50,
            "paperAbstract": {
                "fragments": [],
                "text": "We address the question of when a network can be expected to generalize from m random training examples chosen from some arbitrary probability distribution, assuming that future test examples are drawn from the same distribution. Among our results are the following bounds on appropriate sample vs. network size. Assume 0 < ∊ 1/8. We show that if m O(W/∊ log N/∊) random examples can be loaded on a feedforward network of linear threshold functions with N nodes and W weights, so that at least a fraction 1 ∊/2 of the examples are correctly classified, then one has confidence approaching certainty that the network will correctly classify a fraction 1 ∊ of future test examples drawn from the same distribution. Conversely, for fully-connected feedforward nets with one hidden layer, any learning algorithm using fewer than (W/∊) random training examples will, for some distributions of examples consistent with an appropriate weight choice, fail at least some fixed fraction of the time to find a weight choice that will correctly classify more than a 1 ∊ fraction of the future test examples."
            },
            "slug": "What-Size-Net-Gives-Valid-Generalization-Baum-Haussler",
            "title": {
                "fragments": [],
                "text": "What Size Net Gives Valid Generalization?"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It is shown that if m O(W/ ∊ log N/∊) random examples can be loaded on a feedforward network of linear threshold functions with N nodes and W weights, so that at least a fraction 1 ∊/2 of the examples are correctly classified, then one has confidence approaching certainty that the network will correctly classify a fraction 2 ∊ of future test examples drawn from the same distribution."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1794240"
                        ],
                        "name": "Haiyuan Wu",
                        "slug": "Haiyuan-Wu",
                        "structuredName": {
                            "firstName": "Haiyuan",
                            "lastName": "Wu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Haiyuan Wu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "122439944"
                        ],
                        "name": "Qian Chen",
                        "slug": "Qian-Chen",
                        "structuredName": {
                            "firstName": "Qian",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qian Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1735941"
                        ],
                        "name": "M. Yachida",
                        "slug": "M.-Yachida",
                        "structuredName": {
                            "firstName": "Masahiko",
                            "lastName": "Yachida",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Yachida"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5869722,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "080f57ebfe8b6e5e26b3c9589c95ee84feeb2a71",
            "isKey": false,
            "numCitedBy": 297,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a new method to detect faces in color images based on the fuzzy theory. We make two fuzzy models to describe the skin color and hair color, respectively. In these models, we use a perceptually uniform color space to describe the color information to increase the accuracy and stableness. We use the two models to extract the skin color regions and the hair color regions, and then comparing them with the prebuilt head-shape models by using a fuzzy theory based pattern-matching method to detect face candidates."
            },
            "slug": "Face-Detection-From-Color-Images-Using-a-Fuzzy-Wu-Chen",
            "title": {
                "fragments": [],
                "text": "Face Detection From Color Images Using a Fuzzy Pattern Matching Method"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Two fuzzy models are made to describe the skin color and hair color and then compared with the prebuilt head-shape models by using a fuzzy theory based pattern-matching method to detect face candidates."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50560492"
                        ],
                        "name": "V. Vapnik",
                        "slug": "V.-Vapnik",
                        "structuredName": {
                            "firstName": "Vladimir",
                            "lastName": "Vapnik",
                            "middleNames": [
                                "Naumovich"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Vapnik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7138354,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8213dbed4db44e113af3ed17d6dad57471a0c048",
            "isKey": false,
            "numCitedBy": 38755,
            "numCiting": 72,
            "paperAbstract": {
                "fragments": [],
                "text": "Setting of the learning problem consistency of learning processes bounds on the rate of convergence of learning processes controlling the generalization ability of learning processes constructing learning algorithms what is important in learning theory?."
            },
            "slug": "The-Nature-of-Statistical-Learning-Theory-Vapnik",
            "title": {
                "fragments": [],
                "text": "The Nature of Statistical Learning Theory"
            },
            "venue": {
                "fragments": [],
                "text": "Statistics for Engineering and Information Science"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 67
                            }
                        ],
                        "text": "Up to translation and reflection, there is one learning problem for\neach cell3 in the decomposition of2."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "An important constraint is that the size of L3 would not be sufficiently large to reliably estimate a number of inter-dependent parameters of the same order as the number we estimate."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 102,
                                "start": 89
                            }
                        ],
                        "text": "The exact sampling procedure for choosing F◦(k) ⊂ F(k) and then AL(k) ⊂ F◦(k) is described in (Fleuret, 2000)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "As can be seen, the bound in (4) captures the actual rate of decrease fairly well."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 43,
                                "start": 30
                            }
                        ],
                        "text": "Some results are reported in (Fleuret, 2000)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 147,
                                "start": 133
                            }
                        ],
                        "text": "The generic component of the learning is the concept of a decomposable arrangement, which might be of interest in other domains; see Fleuret (2000) for some remarks about natural language and cortical function."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 252,
                                "start": 238
                            }
                        ],
                        "text": "Thus, for example, in the case of a positive, horizontal type at location (u, v) and tolerance η= 3, the test X = 1 if there is an horizontal edge with positive contrast at at least one of the locations {(u, v − 1), (u, v), (u, v + 1)}; see Fleuret (2000) for more details."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 100
                            }
                        ],
                        "text": "The edge filter we use is described in Amit and Geman (1999) and additional details may be found in Fleuret (2000)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 19
                            }
                        ],
                        "text": "1 is much flatter (Fleuret, 2000)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "A test X A is ρ-decomposable if it is an elementary test or if there exist two ρ-decomposable tests X B and XC with\n• A= B ∪ C, B ∩ C = ∅ • ||B| − |C || ≤ 1 • ρ(X B, XC) ≥ ρ"
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Dtection hirarchique de visages par apprentissage statistique"
            },
            "venue": {
                "fragments": [],
                "text": "Dtection hirarchique de visages par apprentissage statistique"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 104
                            }
                        ],
                        "text": "Our face training set is the same as in Amit and Geman (1999) and smaller than in Rowley et al. (1998), Sung and Poggio (1998)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 254,
                                "start": 233
                            }
                        ],
                        "text": "In order to diminish the variation, methods such as those based on neural networks usually require preprocessing (Rowley, 1999), for instance subtracting a linear component from the grey level map followed by histogram equalization (Sung and Poggio, 1998), which can be costly."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 140,
                                "start": 119
                            }
                        ],
                        "text": "A variety of methods have been proposed for face detection, including artificial neural networks (Rowley\net al., 1998; Sung and Poggio, 1998), support vector machines (Osuna et al., 1997), graph-matching (Leung et al., 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor,…"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 194,
                                "start": 172
                            }
                        ],
                        "text": "The induction process does not utilize a background model (such as the minimax entropy model proposed in Zhu et al. (1997)) or samples of backgrounds and confusions (as in Sung and Poggio (1998) and Rowley et al. (1998)), both of which might improve discrimination."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Example-based learning for view-based face detection"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. PAMI"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 30
                            }
                        ],
                        "text": "The precursor of this work is (Amit and Geman, 1999): Features are spatial arrangements of edge fragments, induced from training faces at a reference pose, and computation is minimized via a generalized Hough transform; there is no on-line optimization and no segmentation apart from visual selection itself."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 115
                            }
                        ],
                        "text": "Some notable exceptions include work on hashing (Lamdan et al., 1988), Hough transforms (Rojer and Schwartz, 1992; Amit and Geman, 1999; Amit, 1999), and treestructured search (Grimson, 1990), all of which have influenced our thinking."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 51,
                                "start": 31
                            }
                        ],
                        "text": "The precursor of this work is (Amit and Geman, 1999): Features are spatial arrangements of edge fragments, induced from training faces at a reference pose, and computation is minimized via a generalized Hough transform; there is no on-line optimization and no segmentation apart from visual…"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 39
                            }
                        ],
                        "text": "The edge filter we use is described in Amit and Geman (1999) and additional details may be found in Fleuret (2000)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 40
                            }
                        ],
                        "text": "Our face training set is the same as in Amit and Geman (1999) and smaller than in Rowley et al. (1998), Sung and Poggio (1998)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 40
                            }
                        ],
                        "text": "Our algorithm is faster than the one in Amit and Geman (1999) and much faster than the one in Rowley (1999), which requires 140s to process the scene in Fig."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 38,
                                "start": 17
                            }
                        ],
                        "text": "The algorithm in Amit and Geman (1999) is perhaps the simplest: The object representation is very compact and training only occurs at a reference pose, requiring only a few minutes as opposed to about an hour here and much longer in Rowley (1999)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 136,
                                "start": 115
                            }
                        ],
                        "text": "Still, due to the comprehensive analysis in Rowley (1999) of publicly available images and to our familiarity with Amit and Geman (1999), a few general statements appear evident."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 26
                            }
                        ],
                        "text": ", 1988), Hough transforms (Rojer and Schwartz, 1992; Amit and Geman, 1999; Amit, 1999), and treestructured search (Grimson, 1990), all of which have influenced our thinking."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A computational model for visual"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 181,
                                "start": 162
                            }
                        ],
                        "text": "We have tested the algorithm on several scenes collected from the WWW and from the set “C” of images collected at Carnegie Mellon University by H.A. Rowley et al. (Rowley et al., 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 104
                            }
                        ],
                        "text": "In evaluating our results, we are also going to focus on comparisons with the work in Rowley (1999) and Rowley et al. (1998) since this seems to be among the most comprehensive studies as well as a fair representation of the state-of-the-art."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 219,
                                "start": 199
                            }
                        ],
                        "text": "The induction process does not utilize a background model (such as the minimax entropy model proposed in Zhu et al. (1997)) or samples of backgrounds and confusions (as in Sung and Poggio (1998) and Rowley et al. (1998)), both of which might improve discrimination."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 102,
                                "start": 82
                            }
                        ],
                        "text": "Our face training set is the same as in Amit and Geman (1999) and smaller than in Rowley et al. (1998), Sung and Poggio (1998)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 98
                            }
                        ],
                        "text": "A variety of methods have been proposed for face detection, including artificial neural networks (Rowley\net al., 1998; Sung and Poggio, 1998), support vector machines (Osuna et al., 1997), graph-matching (Leung et al., 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor,…"
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Neural networkbased face detection"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. PAMI"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 102,
                                "start": 89
                            }
                        ],
                        "text": "The exact sampling procedure for choosing F◦(k) ⊂ F(k) and then AL(k) ⊂ F◦(k) is described in (Fleuret, 2000)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 43,
                                "start": 30
                            }
                        ],
                        "text": "Some results are reported in (Fleuret, 2000)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 147,
                                "start": 133
                            }
                        ],
                        "text": "The generic component of the learning is the concept of a decomposable arrangement, which might be of interest in other domains; see Fleuret (2000) for some remarks about natural language and cortical function."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 252,
                                "start": 238
                            }
                        ],
                        "text": "Thus, for example, in the case of a positive, horizontal type at location (u, v) and tolerance η= 3, the test X = 1 if there is an horizontal edge with positive contrast at at least one of the locations {(u, v − 1), (u, v), (u, v + 1)}; see Fleuret (2000) for more details."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 100
                            }
                        ],
                        "text": "The edge filter we use is described in Amit and Geman (1999) and additional details may be found in Fleuret (2000)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 19
                            }
                        ],
                        "text": "1 is much flatter (Fleuret, 2000)."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "D  ́ etection hiérarchique de visages par apprentissage statistique"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 194,
                                "start": 172
                            }
                        ],
                        "text": "The induction process does not utilize a background model (such as the minimax entropy model proposed in Zhu et al. (1997)) or samples of backgrounds and confusions (as in Sung and Poggio (1998) and Rowley et al. (1998)), both of which might improve discrimination."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 254,
                                "start": 233
                            }
                        ],
                        "text": "In order to diminish the variation, methods such as those based on neural networks usually require preprocessing (Rowley, 1999), for instance subtracting a linear component from the grey level map followed by histogram equalization (Sung and Poggio, 1998), which can be costly."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 104
                            }
                        ],
                        "text": "Our face training set is the same as in Amit and Geman (1999) and smaller than in Rowley et al. (1998), Sung and Poggio (1998)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 140,
                                "start": 119
                            }
                        ],
                        "text": "A variety of methods have been proposed for face detection, including artificial neural networks (Rowley\net al., 1998; Sung and Poggio, 1998), support vector machines (Osuna et al., 1997), graph-matching (Leung et al., 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor,…"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 211,
                                "start": 190
                            }
                        ],
                        "text": "Another is P3(X A = 1) ≥ U (k), obtained numerically and recursively from\n• U (0) = min1≤i≤N P3(Xi = 1) • U (2k) = ρ ·U (k) · (1−U (k))+U (k)2\n• U (2k + 1) = ρ · √U (k) · (1−U (k)) ·U (k + 1)·√ (1−U (k + 1))+U (k) ·U (k + 1)\nThere is no analytic expression for U ."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Example-based learning for viewbased face detection"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. PAMI"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 102,
                                "start": 89
                            }
                        ],
                        "text": "The exact sampling procedure for choosing F◦(k) ⊂ F(k) and then AL(k) ⊂ F◦(k) is described in (Fleuret, 2000)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 43,
                                "start": 30
                            }
                        ],
                        "text": "Some results are reported in (Fleuret, 2000)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 147,
                                "start": 133
                            }
                        ],
                        "text": "The generic component of the learning is the concept of a decomposable arrangement, which might be of interest in other domains; see Fleuret (2000) for some remarks about natural language and cortical function."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 252,
                                "start": 238
                            }
                        ],
                        "text": "Thus, for example, in the case of a positive, horizontal type at location (u, v) and tolerance η= 3, the test X = 1 if there is an horizontal edge with positive contrast at at least one of the locations {(u, v − 1), (u, v), (u, v + 1)}; see Fleuret (2000) for more details."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 100
                            }
                        ],
                        "text": "The edge filter we use is described in Amit and Geman (1999) and additional details may be found in Fleuret (2000)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 19
                            }
                        ],
                        "text": "1 is much flatter (Fleuret, 2000)."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Détection hiérarchique de visages par apprentissage statistique"
            },
            "venue": {
                "fragments": [],
                "text": "Détection hiérarchique de visages par apprentissage statistique"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102993460"
                        ],
                        "name": "中澤 真",
                        "slug": "中澤-真",
                        "structuredName": {
                            "firstName": "中澤",
                            "lastName": "真",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "中澤 真"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117329261,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9495e37bbaacdf30390b46b9402a77e7d0a33312",
            "isKey": false,
            "numCitedBy": 351,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Devroye,-L.,-Gyorfi,-L.-and-Lugosi,-G.-:-A-Theory-中澤",
            "title": {
                "fragments": [],
                "text": "Devroye, L., Gyorfi, L. and Lugosi, G. : A Probabilistic Theory of Pattern Recognition, Springer (1996)."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35651617"
                        ],
                        "name": "Kenneth Wilder",
                        "slug": "Kenneth-Wilder",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Wilder",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kenneth Wilder"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707642"
                        ],
                        "name": "D. Geman",
                        "slug": "D.-Geman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 189,
                                "start": 176
                            }
                        ],
                        "text": "This theme was pursued in the context of classification trees and stepwise entropy reduction in Amit and Geman (1997), Geman and Jedynak (1996), Jedynak and Fleuret (1996) and Wilder (1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Keywords: visual selection, face detection, pose decomposition, coarse-to-fine search, sequential testing"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 62316538,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "497b046479974514fbb380c452c7e914d198872d",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Decision-tree-algorithms-for-handwritten-digit-Wilder-Geman",
            "title": {
                "fragments": [],
                "text": "Decision tree algorithms for handwritten digit recognition"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50560492"
                        ],
                        "name": "V. Vapnik",
                        "slug": "V.-Vapnik",
                        "structuredName": {
                            "firstName": "Vladimir",
                            "lastName": "Vapnik",
                            "middleNames": [
                                "Naumovich"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Vapnik"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 214,
                                "start": 202
                            }
                        ],
                        "text": "We have not appealed to general theories for hypothesis testing (for instance likelihood ratio tests based on models for P0 and P1) or for inductive learning (for instance structural risk minimization (Vapnik, 1996)) or feedforward classifiers ((Baum and Haussler, 1989; Devroye et al., 1995)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 215,
                                "start": 201
                            }
                        ],
                        "text": "We have not appealed to general theories for hypothesis testing (for instance likelihood ratio tests based on models for P0 and P1) or for inductive learning (for instance structural risk minimization (Vapnik, 1996)) or feedforward classifiers ((Baum and Haussler, 1989; Devroye et al."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 59752996,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "5451278e1a11cf3f1be28a05f38d36c8641e68f7",
            "isKey": false,
            "numCitedBy": 4579,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Nature-of-Statistical-Learning-Vapnik",
            "title": {
                "fragments": [],
                "text": "The Nature of Statistical Learning"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2141437395"
                        ],
                        "name": "Thomas Leung",
                        "slug": "Thomas-Leung",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Leung",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Thomas Leung"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2511655"
                        ],
                        "name": "M. Burl",
                        "slug": "M.-Burl",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Burl",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Burl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1690922"
                        ],
                        "name": "P. Perona",
                        "slug": "P.-Perona",
                        "structuredName": {
                            "firstName": "Pietro",
                            "lastName": "Perona",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Perona"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 24
                            }
                        ],
                        "text": ", 1997), graph-matching (Leung et al., 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor, 1996), deformable templates (Miao et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 164,
                                "start": 146
                            }
                        ],
                        "text": "…including artificial neural networks (Rowley\net al., 1998; Sung and Poggio, 1998), support vector machines (Osuna et al., 1997), graph-matching (Leung et al., 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor, 1996), deformable templates (Miao et al., 1999; Yuille…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 203665849,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9232bfb8109b3d3237be4a2cf870e6201519ce5d",
            "isKey": false,
            "numCitedBy": 44,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Finding-Faces-in-Cluttered-Scenes-Using-Labeled-Leung-Burl",
            "title": {
                "fragments": [],
                "text": "Finding Faces in Cluttered Scenes Using Labeled Random Graph Matching."
            },
            "venue": {
                "fragments": [],
                "text": "ICCV 1995"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 68,
                                "start": 49
                            }
                        ],
                        "text": "Some notable exceptions include work on hashing (Lamdan et al., 1988), Hough transforms (Rojer and Schwartz, 1992; Amit and Geman, 1999; Amit, 1999), and treestructured search (Grimson, 1990), all of which have influenced our thinking."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Object recognition by aane invariant matching"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. IEEE Conf. on Computer Vision and Pattern Recognition"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 145
                            }
                        ],
                        "text": "This theme was pursued in the context of classification trees and stepwise entropy reduction in Amit and Geman (1997), Geman and Jedynak (1996), Jedynak and Fleuret (1996) and Wilder (1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Reconnaissance d'objets 3d l'aide d'arbres de classiication"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Image'Com 96'"
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 269,
                                "start": 246
                            }
                        ],
                        "text": "We have not appealed to general theories for hypothesis testing (for instance likelihood ratio tests based on models for P0 and P1) or for inductive learning (for instance structural risk minimization (Vapnik, 1996)) or feedforward classifiers ((Baum and Haussler, 1989; Devroye et al., 1995)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 291,
                                "start": 244
                            }
                        ],
                        "text": "We have not appealed to general theories for hypothesis testing (for instance likelihood ratio tests based on models forP0 and P1) or for inductive learning (for instance structural risk minimization (Vapnik, 1996)) or feedforward classifiers ((Baum and Haussler, 1989; Devroye et al., 1995)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Coarse-to-Fine Face Detection"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 147,
                                "start": 137
                            }
                        ],
                        "text": "Some notable exceptions include work on hashing (Lamdan et al., 1988), Hough transforms (Rojer and Schwartz, 1992; Amit and Geman, 1999; Amit, 1999), and treestructured search (Grimson, 1990), all of which have influenced our thinking."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A neural network architecture for visual selection', Neural Compu- tation"
            },
            "venue": {
                "fragments": [],
                "text": "A neural network architecture for visual selection', Neural Compu- tation"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Reconaissance d ’ objets 3 d ` a l ’ ai e d ’ arbres de classification"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 44
                            }
                        ],
                        "text": ", 1999; Sabert and Tekalp, 1998) and motion (Ming and Akastuka, 1998; Wee et al., 1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 292,
                                "start": 276
                            }
                        ],
                        "text": "…(Leung et al., 1995; Maurer and von der Malsburg, 1996), Bayesian inference (Cootes and Taylor, 1996), deformable templates (Miao et al., 1999; Yuille et al., 1992) and those based on color (Haiyuan et al., 1999; Sabert and Tekalp, 1998) and motion (Ming and Akastuka, 1998; Wee et al., 1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Face detection using pattern information and deformable template in motion images"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Fifth Inter. Conf. on Soft Computing and Information/Intelligent Systems"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 145
                            }
                        ],
                        "text": "This theme was pursued in the context of classification trees and stepwise entropy reduction in Amit and Geman (1997), Geman and Jedynak (1996), Jedynak and Fleuret (1996) and Wilder (1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Reconaissance d'objets 3d3d`3dà l'aide d'arbres de classification"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Image'Com 96"
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 291,
                                "start": 271
                            }
                        ],
                        "text": "We have not appealed to general theories for hypothesis testing (for instance likelihood ratio tests based on models for P0 and P1) or for inductive learning (for instance structural risk minimization (Vapnik, 1996)) or feedforward classifiers ((Baum and Haussler, 1989; Devroye et al., 1995)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Probabilistic Methods for Pattern Recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Probabilistic Methods for Pattern Recognition"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 113,
                                "start": 89
                            }
                        ],
                        "text": "Some notable exceptions include work on hashing (Lamdan et al., 1988), Hough transforms (Rojer and Schwartz, 1992; Amit and Geman, 1999; Amit, 1999), and treestructured search (Grimson, 1990), all of which have influenced our thinking."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 26
                            }
                        ],
                        "text": ", 1988), Hough transforms (Rojer and Schwartz, 1992; Amit and Geman, 1999; Amit, 1999), and treestructured search (Grimson, 1990), all of which have influenced our thinking."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A quotient space hough transform for space variant visual attention"
            },
            "venue": {
                "fragments": [],
                "text": "Neural Networks for Vision and Image Processing"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 145
                            }
                        ],
                        "text": "This theme was pursued in the context of classification trees and stepwise entropy reduction in Amit and Geman (1997), Geman and Jedynak (1996), Jedynak and Fleuret (1996) and Wilder (1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Reconaissance d’objets 3d à l’aide d’arbres de classification"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Image’Com 96, Bordeaux, France."
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 77,
                                "start": 66
                            }
                        ],
                        "text": "We induce features and estimate thresholds based on the empirical measure P̂3 generated by a training set L3."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 164,
                                "start": 151
                            }
                        ],
                        "text": "One major difficulty in detecting faces\nis the variation in the appearance of faces due to the vagaries of lighting; see for example the discussion in Ullman (1996)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "High-Level Vision"
            },
            "venue": {
                "fragments": [],
                "text": "High-Level Vision"
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 164,
                                "start": 151
                            }
                        ],
                        "text": "One major difficulty in detecting faces\nis the variation in the appearance of faces due to the vagaries of lighting; see for example the discussion in Ullman (1996)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "High-Level Vision. M.I.T. Press: Cambridge"
            },
            "venue": {
                "fragments": [],
                "text": "High-Level Vision. M.I.T. Press: Cambridge"
            },
            "year": 1996
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 20,
            "methodology": 23,
            "result": 2
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 43,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/Coarse-to-Fine-Face-Detection-Fleuret-Geman/9b535f4edc4cbf8d4fb6182ec6b5c54db3c1cccb?sort=total-citations"
}