{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40316280"
                        ],
                        "name": "Dennis Tell",
                        "slug": "Dennis-Tell",
                        "structuredName": {
                            "firstName": "Dennis",
                            "lastName": "Tell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dennis Tell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153120475"
                        ],
                        "name": "S. Carlsson",
                        "slug": "S.-Carlsson",
                        "structuredName": {
                            "firstName": "Stefan",
                            "lastName": "Carlsson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Carlsson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "inv[13] = D 12 = 8>>>>>>< >>>>>>: (M 00 ) 2 M 010 10 M 200 01 M 000 00 M 010 10 M 000 01 M 200"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Recently, Tell and Carlsson [13] also proposed a wide baseline correspondence method based on affine invariance."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 38014951,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1a6ea7bd5be7631f671ea0069bc296cc51654895",
            "isKey": false,
            "numCitedBy": 111,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of establishing correspondences between images taken from different viewpoints is fundamental in computer vision. We propose an algorithm which is capable of handling larger changes in viewpoint than classical correlation based techniques. Optimal performance for the algorithm is achieved for textured objects which are locally planar in at least one direction. The algorithm works by computing affinely invariant fourier features from intensity profiles in each image. The intensity profiles are extracted from the image data between randomly selected pairs of image interest points. Using a voting scheme, pairs of interest points are matched across images by comparing vectors of fourier features. Outliers among the matches are rejected in two stages, a fast stage using novel view consistency constraints, and a second, slower stage using RANSAC and fundamental matrix computation. In order to demonstrate the quality of the results, the algorithm is tested on several different image pairs."
            },
            "slug": "Wide-Baseline-Point-Matching-Using-Affine-Computed-Tell-Carlsson",
            "title": {
                "fragments": [],
                "text": "Wide Baseline Point Matching Using Affine Invariants Computed from Intensity Profiles"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An algorithm which is capable of handling larger changes in viewpoint than classical correlation based techniques is proposed, which works by computing affinely invariant fourier features from intensity profiles in each image."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35238678"
                        ],
                        "name": "D. Lowe",
                        "slug": "D.-Lowe",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Lowe",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Lowe"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "inv[5] = D 02 (similar)"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "extended these ideas to real scale-invariance [5], using circular regions that maximize the output of a difference of Gaussians (DOG) filter in scale space."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5258236,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f9f836d28f52ad260213d32224a6d227f8e8849a",
            "isKey": false,
            "numCitedBy": 16255,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "An object recognition system has been developed that uses a new class of local image features. The features are invariant to image scaling, translation, and rotation, and partially invariant to illumination changes and affine or 3D projection. These features share similar properties with neurons in inferior temporal cortex that are used for object recognition in primate vision. Features are efficiently detected through a staged filtering approach that identifies stable points in scale space. Image keys are created that allow for local geometric deformations by representing blurred image gradients in multiple orientation planes and at multiple scales. The keys are used as input to a nearest neighbor indexing method that identifies candidate object matches. Final verification of each match is achieved by finding a low residual least squares solution for the unknown model parameters. Experimental results show that robust object recognition can be achieved in cluttered partially occluded images with a computation time of under 2 seconds."
            },
            "slug": "Object-recognition-from-local-scale-invariant-Lowe",
            "title": {
                "fragments": [],
                "text": "Object recognition from local scale-invariant features"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Experimental results show that robust object recognition can be achieved in cluttered partially occluded images with a computation time of under 2 seconds."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Seventh IEEE International Conference on Computer Vision"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1919611"
                        ],
                        "name": "Florica Mindru",
                        "slug": "Florica-Mindru",
                        "structuredName": {
                            "firstName": "Florica",
                            "lastName": "Mindru",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Florica Mindru"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2525101"
                        ],
                        "name": "T. Moons",
                        "slug": "T.-Moons",
                        "structuredName": {
                            "firstName": "Theo",
                            "lastName": "Moons",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Moons"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1681236"
                        ],
                        "name": "L. Gool",
                        "slug": "L.-Gool",
                        "structuredName": {
                            "firstName": "Luc",
                            "lastName": "Gool",
                            "middleNames": [
                                "Van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Gool"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 7100288,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ee146084f94c240857206208c214aa37951db244",
            "isKey": false,
            "numCitedBy": 129,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "New invariant features are presented that can be used for the recognition of planar color patterns such as labels, logos, pictograms, etc., irrespective of the viewpoint or the illumination conditions, and without the need for error prone contour extraction. The new features are based on moments of powers of the intensities in the individual color bands and combinations thereof. These moments implicitly characterize the shape, the intensity and the color distribution of the pattern in a uniform manner. The paper gives a classification of all functions of such moments which are invariant under both affine deformations of the pattern (thus achieving viewpoint invariance) as well as linear changes of the intensity values of the color bands (hence, coping with changes in the irradiance pattern due to different lighting conditions and/or viewpoints). The discriminant power and classification performance of the new invariants for color pattern recognition is tested on a data set of images of outdoors advertising panels. A comparison to moment invariants presented in literature is included as well."
            },
            "slug": "Recognizing-color-patterns-irrespective-of-and-Mindru-Moons",
            "title": {
                "fragments": [],
                "text": "Recognizing color patterns irrespective of viewpoint and illumination"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "New invariant features are presented that can be used for the recognition of planar color patterns such as labels, logos, pictograms, etc., irrespective of the viewpoint or the illumination conditions, and without the need for error prone contour extraction."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. 1999 IEEE Computer Society Conference on Computer Vision and Pattern Recognition (Cat. No PR00149)"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1704728"
                        ],
                        "name": "T. Tuytelaars",
                        "slug": "T.-Tuytelaars",
                        "structuredName": {
                            "firstName": "Tinne",
                            "lastName": "Tuytelaars",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Tuytelaars"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1681236"
                        ],
                        "name": "L. Gool",
                        "slug": "L.-Gool",
                        "structuredName": {
                            "firstName": "Luc",
                            "lastName": "Gool",
                            "middleNames": [
                                "Van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Gool"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 17
                            }
                        ],
                        "text": "In previous work [14], we have extended this approach to affine invariance, by introducing a method to delineate parallelogram shaped regions that automatically adopt different shapes for different viewpoints, such that they systematically cover the same, physical part of a surface."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 70,
                                "start": 66
                            }
                        ],
                        "text": "In this contribution, some refinements to the system described in [14] are proposed."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 82
                            }
                        ],
                        "text": "(M000 00 ) 4 M 200 00 M 000 00 (M 100 00 ) 2 2 M 020 00 M 000 00 (M 010 00 ) 2 inv[14] = D 12 (similar)"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 56
                            }
                        ],
                        "text": "This method is not meant to replace the one proposed in [14], but rather to be used as a complementary method."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 22188121,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "979089260419884b43cfeb3b23df23b6a7734f9f",
            "isKey": false,
            "numCitedBy": 239,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "This contribution develops a new technique for content-based image retrieval. Where most existing image retrieval systems mainly focus on color and color distribution or texture, we classify the images based on local invariants. These features represent the image in a very compact way and allow fast comparison and feature matching with images in the database. Using local features makes the system robust to occlusions and changes in the background. Using invariants makes it robust to changes in viewpoint and illumination."
            },
            "slug": "Content-Based-Image-Retrieval-Based-on-Local-Tuytelaars-Gool",
            "title": {
                "fragments": [],
                "text": "Content-Based Image Retrieval Based on Local Affinely Invariant Regions"
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "This contribution develops a new technique for content-based image retrieval that classify the images based on local invariants that represent the image in a very compact way and allow fast comparison and feature matching with images in the database."
            },
            "venue": {
                "fragments": [],
                "text": "VISUAL"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153120475"
                        ],
                        "name": "S. Carlsson",
                        "slug": "S.-Carlsson",
                        "structuredName": {
                            "firstName": "Stefan",
                            "lastName": "Carlsson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Carlsson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "inv[2] = S 12 (similar)"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "This is akin to the work of Carlsson [2], who has recently proposed a view compatibility constraint for five points in two views based on a scaled orthographic camera model."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 11718504,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f2438a354b10d8cb78843fde331ba366d384f8d7",
            "isKey": false,
            "numCitedBy": 23,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a method for the recognition of walking people in monocular image sequences based on the extraction of coordinates of specific point locations on the body. The method works by a comparison of sequences of recorded coordinates with a library of sequences from different individuals. The comparison is based on the evaluation of view invariant and calibration independent view consistency constraints. These constraints are functions of corresponding image coordinates in two views and are satisfied whenever the two views are projected from the same three-dimensional (3D) object. By evaluating the view consistency constraints for each pair of frames in a sequence of a walking person and a stored sequence, we obtain a matrix of consistency values that ideally are zero whenever the pair of images depict the same 3D posture. The method is virtually parameter free and computes a consistency residual between a pair of sequences that can be used as a distance for clustering and classification. Using interactively extracted data we present experimental results that are superior to those of previously published algorithms both in terms of performance and generality."
            },
            "slug": "Recognizing-Walking-People-Carlsson",
            "title": {
                "fragments": [],
                "text": "Recognizing Walking People"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The method is virtually parameter free and computes a consistency residual between a pair of sequences that can be used as a distance for clustering and classification and presents experimental results that are superior to those of previously published algorithms both in terms of performance and generality."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2076817912"
                        ],
                        "name": "P. Pritchett",
                        "slug": "P.-Pritchett",
                        "structuredName": {
                            "firstName": "Philip",
                            "lastName": "Pritchett",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Pritchett"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688869"
                        ],
                        "name": "Andrew Zisserman",
                        "slug": "Andrew-Zisserman",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Zisserman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Andrew Zisserman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 88,
                                "start": 85
                            }
                        ],
                        "text": "It is even possible to der ive the fundamental matrix starting from two homographies [9]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 38920342,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f2f6b9cb86b069a7ab2fb0b00248cdfc2694fb87",
            "isKey": false,
            "numCitedBy": 59,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "The objective of this work is to automatically estimate the trifocal tensor and feature correspondences over images triplets, under unrestricted camera motions and changes in internal parameters between views. To this end we extend a previous wide baseline 2-view algorithm to 3-views. The algorithm is based on establishing feature correspondences between views together with a homography which enables a viewpoint invariant affinity score. The input is the three images, and the output the trifocal tensor and image correspondences, which in turn facilitate a projective reconstruction of the cameras and scene."
            },
            "slug": "Matching-and-Reconstruction-from-Widely-Separated-Pritchett-Zisserman",
            "title": {
                "fragments": [],
                "text": "Matching and Reconstruction from Widely Separated Views"
            },
            "tldr": {
                "abstractSimilarityScore": 95,
                "text": "The objective of this work is to automatically estimate the trifocal tensor and feature correspondences over images triplets, under unrestricted camera motions and changes in internal parameters between views, by extending a previous wide baseline 2-view algorithm to 3-views."
            },
            "venue": {
                "fragments": [],
                "text": "SMILE"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2465976"
                        ],
                        "name": "M. Fischler",
                        "slug": "M.-Fischler",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Fischler",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Fischler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764443"
                        ],
                        "name": "R. Bolles",
                        "slug": "R.-Bolles",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Bolles",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bolles"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 57871996,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4f37468a95ccc62debb9e5a4cb0d73489ca61190",
            "isKey": false,
            "numCitedBy": 6878,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Paradigm-for-Model-Fitting-with-Applications-to-Fischler-Bolles",
            "title": {
                "fragments": [],
                "text": "A Paradigm for Model Fitting with Applications to Image Analysis and Automated Cartography"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2465976"
                        ],
                        "name": "M. Fischler",
                        "slug": "M.-Fischler",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Fischler",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Fischler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764443"
                        ],
                        "name": "R. Bolles",
                        "slug": "R.-Bolles",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Bolles",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bolles"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 972888,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "278c9a78d4505cfaf6b709df364dbd1206a017c1",
            "isKey": false,
            "numCitedBy": 15951,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "A new paradigm, Random Sample Consensus (RANSAC), for fitting a model to experimental data is introduced. RANSAC is capable of interpreting/smoothing data containing a significant percentage of gross errors, and is thus ideally suited for applications in automated image analysis where interpretation is based on the data provided by error-prone feature detectors. A major portion of this paper describes the application of RANSAC to the Location Determination Problem (LDP): Given an image depicting a set of landmarks with known locations, determine that point in space from which the image was obtained. In response to a RANSAC requirement, new results are derived on the minimum number of landmarks needed to obtain a solution, and algorithms are presented for computing these minimum-landmark solutions in closed form. These results provide the basis for an automatic system that can solve the LDP under difficult viewing"
            },
            "slug": "Random-sample-consensus:-a-paradigm-for-model-with-Fischler-Bolles",
            "title": {
                "fragments": [],
                "text": "Random sample consensus: a paradigm for model fitting with applications to image analysis and automated cartography"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "New results are derived on the minimum number of landmarks needed to obtain a solution, and algorithms are presented for computing these minimum-landmark solutions in closed form that provide the basis for an automatic system that can solve the Location Determination Problem under difficult viewing."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3140335"
                        ],
                        "name": "A. Shashua",
                        "slug": "A.-Shashua",
                        "structuredName": {
                            "firstName": "Amnon",
                            "lastName": "Shashua",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Shashua"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1815078"
                        ],
                        "name": "S. Avidan",
                        "slug": "S.-Avidan",
                        "structuredName": {
                            "firstName": "Shai",
                            "lastName": "Avidan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Avidan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "All possible plane-related homographies between two images span a fourdimensional subspace of the nine-dimensional space of matrices [6,  11 ]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 452664,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "efd179582ae305354a04cebb3904c1a0a400a195",
            "isKey": false,
            "numCitedBy": 91,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "It has been established that certain trilinear froms of three perspective views give rise to a tensor of 27 intrinsic coefficients [8]. Further investigations have shown the existence of quadlinear forms across four views with the negative result that further views would not add any new constraints [3, 12, 5]. We show in this paper first general results on any number of views. Rather than seeking new constraints (which we know now is not possible) we seek connections across trilinear tensors of triplets of views. Two main results are shown: (i) trilinear tensors across m>3 views are embedded in a low dimensional linear subspace, (ii) given two views, all the induced homography matrices are embedded in a four-dimensional linear subspace. The two results, separately and combined, offer new possibilities of handling the consistency across multiple views in a linear manner (via factorization), some of which are further detailed in this paper."
            },
            "slug": "The-Rank-4-Constraint-in-Multiple-(>=3)-View-Shashua-Avidan",
            "title": {
                "fragments": [],
                "text": "The Rank 4 Constraint in Multiple (>=3) View Geometry"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "First general results on any number of views of trilinear tensors across m>3 views are shown, and given two views, all the induced homography matrices are embedded in a four-dimensional linear subspace."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2127116590"
                        ],
                        "name": "Thomas de Quincey",
                        "slug": "Thomas-de-Quincey",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "de Quincey",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Thomas de Quincey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 3
                            }
                        ],
                        "text": "inv[10] = D 12 = 8>>>>>>< >>>>>>: (M 00 ) 2 M 100 10 M 020 01 M 000 00 M 100 10 M 000 01 M 020"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 25
                            }
                        ],
                        "text": "The focus in the work of Schmid and Mohr and our previous work was on object recognition and image database retrieval."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 56,
                                "start": 52
                            }
                        ],
                        "text": "An excellent example is the work by Schmid and Mohr [10]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 239491155,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "927881a5602f430ffd145d44b8c35cf7a07b464d",
            "isKey": true,
            "numCitedBy": 69632,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "In supernova (SN) spectroscopy relatively little attention has been given to the properties of optically thick spectral lines in epochs following the photosphere’s recession. Most treatments and analyses of post-photospheric optical spectra of SNe assume that forbidden-line emission comprises most if not all spectral features. However, evidence exists that suggests that some spectra exhibit line profiles formed via optically thick resonance-scattering even months or years after the SN explosion. To explore this possibility, we present a geometrical approach to SN spectrum formation based on the “Elementary Supernova” model, wherein we investigate the characteristics of resonance-scattering in optically thick lines while replacing the photosphere with a transparent central core emitting non-blackbody continuum radiation, akin to the optical continuum provided by decaying 56Co formed during the explosion. We develop the mathematical framework necessary for solving the radiative transfer equation under these conditions and calculate spectra for both isolated and blended lines. Our comparisons with analogous results from the Elementary Supernova code SYNOW reveal several marked differences in line formation. Most notably, resonance lines in these conditions form P Cygni-like profiles, but the emission peaks and absorption troughs shift redward and blueward, respectively, from the line’s rest wavelength by a significant amount, despite the spherically symmetric distribution of the line optical depth in the ejecta. These properties and others that we find in this work could lead to misidentification of lines or misattribution of properties of line-forming material at post-photospheric times in SN optical spectra."
            },
            "slug": "[C]-Quincey",
            "title": {
                "fragments": [],
                "text": "[C]"
            },
            "venue": {
                "fragments": [],
                "text": "The Works of Thomas De Quincey, Vol. 1: Writings, 1799–1820"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2055532508"
                        ],
                        "name": "David Sinclair",
                        "slug": "David-Sinclair",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Sinclair",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David Sinclair"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723059"
                        ],
                        "name": "H. Christensen",
                        "slug": "H.-Christensen",
                        "structuredName": {
                            "firstName": "Henrik",
                            "lastName": "Christensen",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Christensen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144760431"
                        ],
                        "name": "Charlie Rothwell",
                        "slug": "Charlie-Rothwell",
                        "structuredName": {
                            "firstName": "Charlie",
                            "lastName": "Rothwell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Charlie Rothwell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 56,
                                "start": 52
                            }
                        ],
                        "text": "This line of fixed points is used by Sinclair et al [12] to test whether two rigid planar motions are compatible."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 117485683,
            "fieldsOfStudy": [
                "Materials Science"
            ],
            "id": "8998e4975922dba58725d0b525b9f3488b491207",
            "isKey": false,
            "numCitedBy": 12,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A portable slag beneficiating plant comprises lengthwise adjacent first and second stage sizing devices with an intermediate magnetically operated separating unit arranged to deliver separated metallics to the second stage sizing device and to deliver the separated non-metallic slag to a conveyor for remote accumulation. The first and second stage sizing devices in the slag beneficiating plant and the magnetic separating unit which incorporates a feed conveyor belt and the disposal slag conveyor are individually operated by hydraulic motor subject to the control of individual valves and supplied from a common source of hydraulic fluid pressure enabling the individual sizing separating and conveying devices in the portable slag beneficiating plant to be operated at different speeds and capacities manually variable continuously to expedite rapid and efficient handling of large quantities of slag by the plant."
            },
            "slug": "Using-the-Relation-Between-a-Plane-Projectivity-and-Sinclair-Christensen",
            "title": {
                "fragments": [],
                "text": "Using the Relation Between a Plane Projectivity and the Fundamental Matrix"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The first and second stage sizing devices in the slag beneficiating plant and the magnetic separating unit which incorporates a feed conveyor belt and the disposal slag conveyor are individually operated by hydraulic motor subject to the control of individual valves and supplied from a common source of hydraulic fluid pressure."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 56
                            }
                        ],
                        "text": "Our approach is akin to that of Pritchett and Zisserman [8] who start their wide baseline stereo algorithm by extracting quadrangles present in the image and match these based on a normalized cross-correlation to find local homographies, which are then extended to larger parts of the image."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 31
                            }
                        ],
                        "text": "Our approachis akin to that of Pritchett and Zisserman [8] who start their wide baseline stereo algorithm by extracting quadrangles present in the image and match these based on a normalized cross-correlation to find local homographies, which are then extended to larger parts ofthe image."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 83,
                                "start": 80
                            }
                        ],
                        "text": "(M000 00 ) 4 M 200 00 M 000 00 (M 100 00 ) 2 M 020 00 M 000 00 (M 010 00 ) 2 inv[8] = D 12 (similar)"
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Wide Baseline Stereo"
            },
            "venue": {
                "fragments": [],
                "text": "Int’l Conference on Computer Vision, pp. 754-759"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 57
                            }
                        ],
                        "text": "This method is not meant to repla ce the one proposed in [14], but rather to be used as a complementary method."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 71,
                                "start": 67
                            }
                        ],
                        "text": "In this contribution, some refinements to the system describ ed in [14] are proposed."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 17
                            }
                        ],
                        "text": "In previous work [14], we have extended this approach to affin e invariance, by introducing a method to delineate parallelogram shaped regio ns that automatically adopt different shapes for different viewpoints, such that they s ystematically cover the same, physical part of a surface."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Content-based Image Retrieval based on Local Affinely Invar  iant Regions"
            },
            "venue": {
                "fragments": [],
                "text": "Int’l Conference on Visual Information Systems, pp. 493-5  00"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Wide Baseline Stereo, Int'l Conference on Computer Vision"
            },
            "venue": {
                "fragments": [],
                "text": "Wide Baseline Stereo, Int'l Conference on Computer Vision"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 34,
                                "start": 30
                            }
                        ],
                        "text": "In previous work, we have presented invariant regions that areb s d on a combination of corners and edges."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Bauckhage Local Grey-value Invariants for Image Retrieval"
            },
            "venue": {
                "fragments": [],
                "text": "Int'l Journal on Pattern Analysis and Machine Intelligence"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Avidan The rank 4 constraint in multiple view geometry"
            },
            "venue": {
                "fragments": [],
                "text": "European Conference on Computer Vision"
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 144,
                                "start": 137
                            }
                        ],
                        "text": "All possible plane-related homographies between two images span a fourdimensional subspace of the nine-dimensional space of 3 3 matrices [6, 11]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Fundamental Matrix: theory"
            },
            "venue": {
                "fragments": [],
                "text": "algorithms, and stability analysis, Int’l. Journal on Computer Vision, vol. 17, nr. 1, pp. 43-75"
            },
            "year": 1996
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 5,
            "methodology": 6,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 17,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Wide-Baseline-Stereo-Matching-based-on-Local,-Tuytelaars-Gool/9ad20e6f6f89631caf6960516bb9939b9430bba0?sort=total-citations"
}