{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1789181"
                        ],
                        "name": "Bertrand Coüasnon",
                        "slug": "Bertrand-Coüasnon",
                        "structuredName": {
                            "firstName": "Bertrand",
                            "lastName": "Coüasnon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bertrand Coüasnon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2578743"
                        ],
                        "name": "L. Pasquer",
                        "slug": "L.-Pasquer",
                        "structuredName": {
                            "firstName": "Laurent",
                            "lastName": "Pasquer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Pasquer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30186146,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e796eb564c1f2a091fc3817614d410afff36a8a6",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we present a real-world evaluation of DMOS, a new generic document recognition method. This method uses a new grammatical formalism (EPF) and an associated parser able to introduce context in segmentation. We have implemented this DMOS method to build an automatic generator of structured document recognition systems. We already produced three recognition systems by only changing the EPF grammar: one on musical scores, one on mathematical formulae and one on recursive table structures. We present here a specific light grammar to automatically recognize quite damaged 19th century military forms. The quality of those forms is far from perfect: table lines are not well printed, paper is so thin that there are transparency problems (the forms are two-sided) but the biggest problem comes from small paper sheets hiding part of the structure. The evaluation of this system has been made onto 5268 images and the results show that the system did not make any mistake. Moreover it can recognize the entire structure in 97.2% of the forms (the other 2.8% are automatically set apart)."
            },
            "slug": "A-real-world-evaluation-of-a-generic-document-to-a-Coüasnon-Pasquer",
            "title": {
                "fragments": [],
                "text": "A real-world evaluation of a generic document recognition method applied to a military form of the 19th century"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A specific light grammar is presented to automatically recognize quite damaged 19th century military forms to build an automatic generator of structured document recognition systems."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of Sixth International Conference on Document Analysis and Recognition"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1789181"
                        ],
                        "name": "Bertrand Coüasnon",
                        "slug": "Bertrand-Coüasnon",
                        "structuredName": {
                            "firstName": "Bertrand",
                            "lastName": "Coüasnon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bertrand Coüasnon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1760753"
                        ],
                        "name": "J. Camillerapp",
                        "slug": "J.-Camillerapp",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Camillerapp",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Camillerapp"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 16740341,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "02143c9cffc49ac78423d04c308a9d2872aadb93",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Optical Music Recognition is a form of document analysis for which a priori knowledge is particularly important. Musical notation is governed by a substantial set of rules, but current systems fail to use them adequately. In complex scores, existing systems cannot overcome the well-known segmentation problems of document analysis, due mainly to the high density of music information. This paper proposes a new method of recognition which uses a grammar in order to formalize the syntactic rules and represent the context. However, where objects touch, there is a discrepancy between the way the existing knowledge (grammar) will describe an object and the way it is recognized, since touching objects have to be segmented first. Following a description of the grammar, this paper shall go on to propose the use of an operator to modify the way the grammar parses the image so that the system can deal with certain touching objects (e.g. where an accidental touches a notehead)."
            },
            "slug": "A-way-to-separate-knowledge-from-program-in-to-Coüasnon-Camillerapp",
            "title": {
                "fragments": [],
                "text": "A way to separate knowledge from program in structured document analysis: application to optical music recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A new method of recognition is proposed which uses a grammar in order to formalize the syntactic rules and represent the context and the use of an operator to modify the way the grammar parses the image so that the system can deal with certain touching objects."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "73133324"
                        ],
                        "name": "C. Brisset",
                        "slug": "C.-Brisset",
                        "structuredName": {
                            "firstName": "Corinne",
                            "lastName": "Brisset",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Brisset"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10213034,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e7da7b3b4cb4ff262691863e5104c975d3f67b1b",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "Optical Music Recognition is a particular form of document analysis in which there is much knowledge about document structure. Indeed there exists an important set of rules for musical notation, but current systems do not fully use them. We propose a new solution using a grammar to guide the segmentation of the graphical objects and their recognition. The grammar is essentially a description of the relations (relative position and size, adjacency, etc) between the graphical objects. Inspired by Deenite Clause Grammar techniques, the grammar can be directly implemented in Prolog, a higher-order dialect of Prolog. Moreover, the translation from the grammar into Prolog code can be done automatically. Our approach is justiied by the rst encouraging results obtained with a prototype for music score recognition."
            },
            "slug": "Using-Logic-Programming-Languages-For-Optical-Music-Brisset",
            "title": {
                "fragments": [],
                "text": "Using Logic Programming Languages For Optical Music Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "A new solution using a grammar to guide the segmentation of the graphical objects and their recognition, inspired by Deenite Clause Grammar techniques and directly implemented in Prolog, a higher-order dialect of Prolog."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750784"
                        ],
                        "name": "É. Anquetil",
                        "slug": "É.-Anquetil",
                        "structuredName": {
                            "firstName": "Éric",
                            "lastName": "Anquetil",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "É. Anquetil"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1789181"
                        ],
                        "name": "Bertrand Coüasnon",
                        "slug": "Bertrand-Coüasnon",
                        "structuredName": {
                            "firstName": "Bertrand",
                            "lastName": "Coüasnon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bertrand Coüasnon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48664925"
                        ],
                        "name": "F. Dambreville",
                        "slug": "F.-Dambreville",
                        "structuredName": {
                            "firstName": "Frédéric",
                            "lastName": "Dambreville",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Dambreville"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46300668,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dcc403788f75dfcdc99a82304fce7f8ae5782b0f",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose in this paper a new framework to develop a transparent classifier able to deal with reject notions. The generated classifier can be characterized by a strong reliability without loosing good properties in generalization. We show on a musical scores recognition system that this classifier is very well suited to develop a complete document recognition system. Indeed this classifier allows them firstly to extract known symbols in a document (text for example) and secondly to validate segmentation hypotheses. Tests had been successfully performed on musical and digit symbols databases."
            },
            "slug": "A-Symbol-Classifier-Able-to-Reject-Wrong-Shapes-for-Anquetil-Coüasnon",
            "title": {
                "fragments": [],
                "text": "A Symbol Classifier Able to Reject Wrong Shapes for Document Recognition Systems"
            },
            "tldr": {
                "abstractSimilarityScore": 84,
                "text": "A new framework to develop a transparent classifier able to deal with reject notions can be characterized by a strong reliability without loosing good properties in generalization and is shown on a musical scores recognition system that this classifier is very well suited to developed a complete document recognition system."
            },
            "venue": {
                "fragments": [],
                "text": "GREC"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3133943"
                        ],
                        "name": "Ann Grbavec",
                        "slug": "Ann-Grbavec",
                        "structuredName": {
                            "firstName": "Ann",
                            "lastName": "Grbavec",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ann Grbavec"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1703931"
                        ],
                        "name": "D. Blostein",
                        "slug": "D.-Blostein",
                        "structuredName": {
                            "firstName": "Dorothea",
                            "lastName": "Blostein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Blostein"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 33241949,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0826c4264d6f20e871b1c9e7298e4fbaf4cb7799",
            "isKey": false,
            "numCitedBy": 84,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper investigates graph rewriting as a tool for high-level recognition of two-dimensional mathematical notation. \"High-level recognition\" is the process of determining the meaning of a diagram from the output of a symbol recognizer. Characteristic problems of high-level mathematics recognition include: determining the groupings of symbols into recursive subexpressions and resolving ambiguities that depend upon global context. Our graph-rewriting approach uses knowledge of the notational conventions of mathematics, such as operator precedence and operator range, more effectively than syntactic or previous structural methods. Graph rewriting offers a flexible formalism with a strong theoretical foundation for manipulating two-dimensional patterns. It has been shown to be a useful technique for high-level recognition of circuit diagrams and musical scores. By demonstrating a graph-rewriting strategy for mathematics recognition, this paper provides further evidence for graph rewriting as a general tool for diagram recognition, and identifies some of the issues that must be considered as this potential is explored."
            },
            "slug": "Mathematics-recognition-using-graph-rewriting-Grbavec-Blostein",
            "title": {
                "fragments": [],
                "text": "Mathematics recognition using graph rewriting"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "This paper provides further evidence for graph rewriting as a general tool for diagram recognition, and identifies some of the issues that must be considered as this potential is explored."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1789181"
                        ],
                        "name": "Bertrand Coüasnon",
                        "slug": "Bertrand-Coüasnon",
                        "structuredName": {
                            "firstName": "Bertrand",
                            "lastName": "Coüasnon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bertrand Coüasnon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2272840"
                        ],
                        "name": "Bernard Rétif",
                        "slug": "Bernard-Rétif",
                        "structuredName": {
                            "firstName": "Bernard",
                            "lastName": "Rétif",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bernard Rétif"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 18818043,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3b97949f436f929ed11ee76358e07fa1a61d2e01",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Optical Music Recognition needs to be reliable to avoid users to detect and correct errors by controlling all the recognized score. Reliability can be reach by improving the recognition quality (on segmentation problems) and by making the system able to detect itself its recognition errors. This is possible only by using as much as possible the musical knowledge. Therefore, we propose a grammar to formalize the musical knowledge on full scores with poly-phonic staves. We then show how this grammar can help detection of most of errors on note duration. The presented system is in an implementation phase but is already able to deal with full scores and to point on errors."
            },
            "slug": "Using-a-Grammar-for-a-Reliable-Full-Score-System-Coüasnon-Rétif",
            "title": {
                "fragments": [],
                "text": "Using a Grammar for a Reliable Full Score Recognition System"
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "A grammar to formalize the musical knowledge on full scores with poly-phonic staves is proposed and it is shown how this grammar can help detection of most of errors on note duration."
            },
            "venue": {
                "fragments": [],
                "text": "ICMC"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809138"
                        ],
                        "name": "D. Searls",
                        "slug": "D.-Searls",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Searls",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Searls"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144799688"
                        ],
                        "name": "S. Taylor",
                        "slug": "S.-Taylor",
                        "structuredName": {
                            "firstName": "Suzanne",
                            "lastName": "Taylor",
                            "middleNames": [
                                "Liebowitz"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Taylor"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60244805,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0cf9658b78d3c63404026c7b4c47ea52342a0636",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "Logic grammars such as Definite Clause Grammars — linguistic formalisms closely associated with the Prolog language — are powerful and highly versatile systems for specifying and detecting patterns not only in natural language, but in any suitably organized string, signal, or image. This paper reviews several such prototypes we have developed, which demonstrate the characteristics that make logic grammars a good vehicle for many Syntactic Pattern Recognition applications."
            },
            "slug": "Document-Image-Analysis-Using-Logic-Grammar-Based-Searls-Taylor",
            "title": {
                "fragments": [],
                "text": "Document Image Analysis Using Logic-Grammar-Based Syntactic Pattern Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Several prototypes of Definite Clause Grammars are reviewed, which demonstrate the characteristics that make logic grammars a good vehicle for many Syntactic Pattern Recognition applications."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2072254465"
                        ],
                        "name": "John L. Pfaltz",
                        "slug": "John-L.-Pfaltz",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Pfaltz",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John L. Pfaltz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2056010918"
                        ],
                        "name": "Azriel Rosenfeld",
                        "slug": "Azriel-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Azriel Rosenfeld"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 46687960,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1dcbd450fc6b2b49c733125d9bda578df0537f77",
            "isKey": false,
            "numCitedBy": 220,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "Classes of \"phrase-structure grammars\" are defined whose \"languages\" consist, not of strings of symbols, but of directed graphs with symbols at their vertices (\"webs\"). Examples of such \"web grammars\" are given, having languages consisting of trees, of two-terminal series-parallel networks, and of \"triangular\" networks. It is shown that if the graphs permitted in a \"context-sensitive\" web grammar are required to be acyclic, and the parsing rules are assumed to be graph homomorphisms, then any sub-graph which is parsed by a rule must be \"convex\", and any rule is a composite of rules each of which parses a subgraph having just two points. Foreword Since the early 1960's, considerable effort has been devoted to the problem of developing formal \"picture languages\" whose \"sentences\" are pictures of various types. This work (see^ for a recent survey) can be thought of as generalizing the concepts and methods of mathematical linguistics from conventional languages, in which sentences are strings formed by concatenating symbols, to \"languages\" in which \"sentences\" are formed by combining symbols in more general ways. The present paper describes a method of defining \"languages\" whose \"sentences\" are directed graphs with symbols at their vertices."
            },
            "slug": "Web-Grammars-Pfaltz-Rosenfeld",
            "title": {
                "fragments": [],
                "text": "Web Grammars"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "A method of defining \"languages\" whose \"sentences\" are directed graphs with symbols at their vertices is described, showing that if the graphs permitted in a \"context-sensitive\" web grammar are required to be acyclic, and the parsing rules are assumed to be graph homomorphisms, then any sub-graph which is parsed by a rule must be \"convex\"."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145366908"
                        ],
                        "name": "Fernando C Pereira",
                        "slug": "Fernando-C-Pereira",
                        "structuredName": {
                            "firstName": "Fernando",
                            "lastName": "Pereira",
                            "middleNames": [
                                "C"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fernando C Pereira"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1879397"
                        ],
                        "name": "D. Warren",
                        "slug": "D.-Warren",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Warren",
                            "middleNames": [
                                "H.",
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Warren"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2133116,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fbc04a1951003ba164303b2898fb7f3c6b4e9083",
            "isKey": false,
            "numCitedBy": 1034,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Definite-Clause-Grammars-for-Language-Analysis-A-of-Pereira-Warren",
            "title": {
                "fragments": [],
                "text": "Definite Clause Grammars for Language Analysis - A Survey of the Formalism and a Comparison with Augmented Transition Networks"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31743562"
                        ],
                        "name": "Jerome Feder",
                        "slug": "Jerome-Feder",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Feder",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jerome Feder"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37456288,
            "fieldsOfStudy": [
                "Computer Science",
                "Linguistics"
            ],
            "id": "38174f465527ef2140eb5a23e3d2b2d750595b03",
            "isKey": false,
            "numCitedBy": 197,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Plex-languages-Feder",
            "title": {
                "fragments": [],
                "text": "Plex languages"
            },
            "venue": {
                "fragments": [],
                "text": "Inf. Sci."
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727287"
                        ],
                        "name": "W. Brainerd",
                        "slug": "W.-Brainerd",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Brainerd",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Brainerd"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 39850406,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0bc5d902e442fcbfacbde541dbee3ddb9c27a5d7",
            "isKey": false,
            "numCitedBy": 251,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Tree-Generating-Regular-Systems-Brainerd",
            "title": {
                "fragments": [],
                "text": "Tree Generating Regular Systems"
            },
            "venue": {
                "fragments": [],
                "text": "Inf. Control."
            },
            "year": 1969
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Definite clauses for language analysis"
            },
            "venue": {
                "fragments": [],
                "text": "Arrificiol Intelligence,"
            },
            "year": 1980
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 12,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/DMOS:-a-generic-document-recognition-method,-to-an-Coüasnon/c8afc676c5f2ee8090b67b4c60ab2d8a9e3ebd4a?sort=total-citations"
}