{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1836606"
                        ],
                        "name": "T. Landauer",
                        "slug": "T.-Landauer",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Landauer",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Landauer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 285,
                                "start": 271
                            }
                        ],
                        "text": "The technique was originally developed in the context of information retrieval (Deerwester, Dumais, Furnas, Landauer, & Harshman, 1990) and was adapted for psycholinguistic analyses by Landauer and his colleagues (Landauer & Dumais, 1997; Landauer, Foltz, & Laham, 1998; Landauer, 1999)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 135
                            }
                        ],
                        "text": "To demonstrate the diversity of word senses, consider this selection form Webster’s Collegiate Dictionary from the 30 senses listed for the verb run (intransitive):\nthe horse runs the ship runs before the wind the cat ran away the salmon run every year\n*E-mail address: wkintsch@psych.colorado.edu…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 144716593,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f67a7ba2718399521ebdf6ec834f686e89a247d2",
            "isKey": false,
            "numCitedBy": 77,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "Latent semantic analysis (LSA) is a theory of how word meaning—and possibly other knowledge—is derived from statistics of experience, and of how passage meaning is represented by combinations of words. Given a large and representative sample of text, LSA combines the way thousands of words are used in thousands of contexts to map a point for each into a common semantic space. LSA goes beyond pair-wise co-occurrence or correlation to find latent dimensions of meaning that best relate every word and passage to every other. After learning from comparable bodies of text, LSA has scored almost as well as humans on vocabulary and subject-matter tests, accurately simulated many aspects of human judgment and behavior based on verbal meaning, and been successfully applied to measure the coherence and conceptual content of text. The surprising success of LSA has implications for the nature of generalization and language."
            },
            "slug": "Learning-and-Representing-Verbal-Meaning-Landauer",
            "title": {
                "fragments": [],
                "text": "Learning and Representing Verbal Meaning"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1704065"
                        ],
                        "name": "D. Gentner",
                        "slug": "D.-Gentner",
                        "structuredName": {
                            "firstName": "Dedre",
                            "lastName": "Gentner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gentner"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 0
                            }
                        ],
                        "text": "Gentner and France (1988) performed a series of experiments to investigate the comprehension of sentences in which the noun and verb were mismatched to make the interpretation of the sentence difficult."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 11035185,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "e373a86843c179e9852e7029684cf73956483625",
            "isKey": false,
            "numCitedBy": 101,
            "numCiting": 81,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Verb-Mutability-Effect:-Studies-of-the-of-Nouns-Gentner",
            "title": {
                "fragments": [],
                "text": "The Verb Mutability Effect: Studies of the Combinatorial Semantics of Nouns and Verbs"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2444937"
                        ],
                        "name": "Darrell Laham",
                        "slug": "Darrell-Laham",
                        "structuredName": {
                            "firstName": "Darrell",
                            "lastName": "Laham",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Darrell Laham"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 118703188,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "3b0409cc464dc026b8c7688e51cc38ec4d242b7f",
            "isKey": false,
            "numCitedBy": 80,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Many computational models of semantic memory rely on vector representations of concepts based on explicit encoding of arbitrary feature sets. Latent Semantic Analysis (LSA) creates high dimensional (n = 300+) vectors for concepts in semantic memory through statistical analysis of a large representative corpus of text rather than subjective feature sets linked to object names (for details see Landauer & Dumais, 1997; Landauer, Foltz, & Laham, in press). Concepts can be compared in the semantic space and their similarity indexed by the cosine of the angle between vectors. Computational models of concept relations using LSA representations demonstrate that categories can be emergent and self-organizing based exclusively on the way language is used in the corpus without explicit hand-coding of category membership or semantic features. LSA categorization is context dependent and occurs through a dynamic process of induction. Semantic “meaning” is not encapsulated within an object representation, but emerges as the set of relationships between selected objects in a context-based sub-space. Neuropsychological studies (e.g. Warrington & Shallice, 1984) point to a class of patients who exhibit disnomias for specific categories of objects (natural kinds) while retaining the ability to name other objects (man-made artifacts). The objects from natural kind categories tend to be significantly more clustered in LSA space than are those from artifact categories. If brain structure corresponds to LSA structure, the identification of concepts belonging to strongly clustered categories should suffer more than weakly clustered concepts when their representations are partially damaged. Three types of modeling experiments were conducted: matching base concept names to superordinate categories in forced-choice testing, correlating LSA similarity measures to human judgments of typicality, and multivariate analyses of similarity matrices to capture category boundaries. For the forced-choice matching of concept names to superordinate categories, a selection of 140 objects (rated as most typical in their category) from 14 categories was used. Each object name was compared to each of the 14 category names (apple—flower, apple—mammal, etc.). The LSA match was considered correct when the highest cosine comparison in the set was between an object and its relevant superordinate (apple—fruit). The results show that in all 14 categories, LSA predicts membership well above chance (chance = 7%), however, there are differences in the degree of clustering: the percent correct for animate natural kinds (flowers, mammals, fruit, trees, vegetables, and birds) = 92%; for inanimate natural kinds with observed deficits in neuropsychological patients (gemstones, musical instruments) = 100%; and for man-made artifacts (furniture, vehicles, weapons, tools, toys, and clothing) = 53%. Correlations between LSA similarity judgments and human typicality judgments were consistently better for the natural kinds than for the artifacts. For natural categories, LSA similarities (cosine between concept and either superordinate name, most typical member, or centroid of all members) showed high correlations with human judgments (e.g. fruit: r = .82), while artifact similarities showed low to near-zero correlations with human judgments. As illustrated in Figure 1, multivariate analyses of LSAbased similarity matrices show more cohesive structure for natural kinds than for artifacts. Factors 4-6 in this analysis load high on concepts in the bird category—additional factors (7-15) load on specific artifact concepts (not shown)."
            },
            "slug": "Latent-Semantic-Analysis-Approaches-to-Laham",
            "title": {
                "fragments": [],
                "text": "Latent Semantic Analysis Approaches to Categorization"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "Latent Semantic Analysis creates high dimensional vectors for concepts in semantic memory through statistical analysis of a large representative corpus of text rather than subjective feature sets linked to object names, and multivariate analyses of similarity matrices show more cohesive structure for natural kinds than for artifacts."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2036336"
                        ],
                        "name": "P. Foltz",
                        "slug": "P.-Foltz",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Foltz",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Foltz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3025325"
                        ],
                        "name": "W. Kintsch",
                        "slug": "W.-Kintsch",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Kintsch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Kintsch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1836606"
                        ],
                        "name": "T. Landauer",
                        "slug": "T.-Landauer",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Landauer",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Landauer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 133,
                                "start": 113
                            }
                        ],
                        "text": "To demonstrate the diversity of word senses, consider this selection form Webster’s Collegiate Dictionary from the 30 senses listed for the verb run (intransitive):\nthe horse runs the ship runs before the wind the cat ran away the salmon run every year\n*E-mail address: wkintsch@psych.colorado.edu…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 62729021,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c4732c036d0b00d435bcd41ae904a9e936e4f683",
            "isKey": false,
            "numCitedBy": 793,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "Latent Semantic Analysis (LSA) is used as a technique for measuring the coherence of texts. By comparing the vectors for 2 adjoining segments of text in a high‐dimensional semantic space, the method provides a characterization of the degree of semantic relatedness between the segments. We illustrate the approach for predicting coherence through reanalyzing sets of texts from 2 studies that manipulated the coherence of texts and assessed readers’ comprehension. The results indicate that the method is able to predict the effect of text coherence on comprehension and is more effective than simple term‐term overlap measures. In this manner, LSA can be applied as an automated method that produces coherence predictions similar to propositional modeling. We describe additional studies investigating the application of LSA to analyzing discourse structure and examine the potential of LSA as a psychological model of coherence effects in text comprehension."
            },
            "slug": "The-Measurement-of-Textual-Coherence-with-Latent-Foltz-Kintsch",
            "title": {
                "fragments": [],
                "text": "The Measurement of Textual Coherence with Latent Semantic Analysis."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The approach for predicting coherence through reanalyzing sets of texts from 2 studies that manipulated the coherence of texts and assessed readers’ comprehension indicates that the method is able to predict the effect of text coherence on comprehension and is more effective than simple term‐term overlap measures."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707726"
                        ],
                        "name": "J. Pustejovsky",
                        "slug": "J.-Pustejovsky",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Pustejovsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pustejovsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7129257,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "cae22af9bb9b7a2cebe2b4ee0a0364004ab73491",
            "isKey": false,
            "numCitedBy": 3805,
            "numCiting": 161,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, I will discuss four major topics relating to current research in lexical semantics: methodology, descriptive coverage, adequacy of the representation, and the computational usefulness of representations. In addressing these issues, I will discuss what I think are some of the central problems facing the lexical semantics community, and suggest ways of best approaching these issues. Then, I will provide a method for the decomposition of lexical categories and outline a theory of lexical semantics embodying a notion of cocompositionality and type coercion, as well as several levels of semantic description, where the semantic load is spread more evenly throughout the lexicon. I argue that lexical decomposition is possible if it is performed generatively. Rather than assuming a fixed set of primitives. I will assume a fixed number of generative devices that can be seen as constructing semantic expressions. I develop a theory of Qualia Structure, a representation language for lexical items, which renders much lexical ambiguity in the lexicon unnecessary, while still explaining the systematic polysemy that words carry. Finally, I discuss how individual lexical structures can be integrated into the larger lexical knowledge base through a theory of lexical inheritance. This provides us with the necessary principles of global organization for the lexicon, enabling us to fully integrate our natural language lexicon into a conceptual whole."
            },
            "slug": "The-Generative-Lexicon-Pustejovsky",
            "title": {
                "fragments": [],
                "text": "The Generative Lexicon"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is argued that lexical decomposition is possible if it is performed generatively and a theory of lexical inheritance is outlined, which provides the necessary principles of global organization for the lexicon, enabling us to fully integrate the authors' natural language lexicon into a conceptual whole."
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Linguistics"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1836606"
                        ],
                        "name": "T. Landauer",
                        "slug": "T.-Landauer",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Landauer",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Landauer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728602"
                        ],
                        "name": "S. Dumais",
                        "slug": "S.-Dumais",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Dumais",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Dumais"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 21
                            }
                        ],
                        "text": "Among the former are Landauer and Dumais (1997), who have discussed vocab-\nulary acquisition as the construction of a semantic space, modeled by LSA; Laham’s (1997) investigation of the emergence of natural categories from the LSA space; and Foltz, Kintsch, & Landauer’s (1998) work on textual…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 29
                            }
                        ],
                        "text": "A counterexample is given by Landauer & Dumais (1997), who were able to describe the choices people make on the TOEFL test (Test of English as a Foreign Language) simply by computing the cosine between the word to be judged and the alternatives among which a choice had to be made."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 237,
                                "start": 214
                            }
                        ],
                        "text": "The technique was originally developed in the context of information retrieval (Deerwester, Dumais, Furnas, Landauer, & Harshman, 1990) and was adapted for psycholinguistic analyses by Landauer and his colleagues (Landauer & Dumais, 1997; Landauer, Foltz, & Laham, 1998; Landauer, 1999)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 269,
                                "start": 246
                            }
                        ],
                        "text": "It has also been strikingly successful in practical applications and has provided a solution to one of the toughest previously unresolved puzzles in the psychology of language—to explain the astonishing rate of vocabulary acquisition in children (Landauer & Dumais, 1997)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 74
                            }
                        ],
                        "text": "The method is described in detail and an illustrative example is given in Landauer & Dumais (1997)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1144461,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "68dd4b89ce1407372a29d05ca9e4e1a2e0513617",
            "isKey": true,
            "numCitedBy": 5789,
            "numCiting": 210,
            "paperAbstract": {
                "fragments": [],
                "text": "How do people know as much as they do with as little information as they get? The problem takes many forms; learning vocabulary from text is an especially dramatic and convenient case for research. A new general theory of acquired similarity and knowledge representation, latent semantic analysis (LSA), is presented and used to successfully simulate such learning and several other psycholinguistic phenomena. By inducing global knowledge indirectly from local co-occurrence data in a large body of representative text, LSA acquired knowledge about the full vocabulary of English at a comparable rate to schoolchildren. LSA uses no prior linguistic or perceptual similarity knowledge; it is based solely on a general mathematical learning method that achieves powerful inductive effects by extracting the right number of dimensions (e.g., 300) to represent objects and contexts. Relations to other theories, phenomena, and problems are sketched."
            },
            "slug": "A-Solution-to-Plato's-Problem:-The-Latent-Semantic-Landauer-Dumais",
            "title": {
                "fragments": [],
                "text": "A Solution to Plato's Problem: The Latent Semantic Analysis Theory of Acquisition, Induction, and Representation of Knowledge."
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "A new general theory of acquired similarity and knowledge representation, latent semantic analysis (LSA), is presented and used to successfully simulate such learning and several other psycholinguistic phenomena."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3095064"
                        ],
                        "name": "A. Wierzbicka",
                        "slug": "A.-Wierzbicka",
                        "structuredName": {
                            "firstName": "Anna",
                            "lastName": "Wierzbicka",
                            "middleNames": [
                                "Maria"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Wierzbicka"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 60949794,
            "fieldsOfStudy": [
                "Linguistics",
                "Computer Science"
            ],
            "id": "834b194664fb4fee66c5d22b446d5b62a6fa584f",
            "isKey": false,
            "numCitedBy": 718,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "“The semantics of grammar” presents a radically semantic approach to syntax and morphology. It offers a methodology which makes it possible to demonstrate, on an empirical basis, that syntax is neither “autonomous” nor “arbitrary”, but that it follows from “semantics”. It is shown that every grammatical construction encodes a certain semantic structure, which can be revealed and rigorously stated, so that the meanings encoded in grammar can be compared in a precise and illuminating way, within one language and across language boundaries. The author develops a semantic metalanguage based on lexical universals or near-universals (and, ultimately, on a system of universal semantic primitives), and shows that the same semantic metalanguage can be used for explicating lexical, grammatical and pragmatic aspects of language and thus offers a method for an integrated linguistic description based on semantic foundations. Analyzing data from a number of different languages (including English, Russian and Japanese) the author explores the notion of ethnosyntax and, via semantics, links syntax and morphology with culture. She attemps to demonstrate that the use of a semantic metalanguage based on lexical universals makes it possible to rephrase the Humboldt-Sapir-Whorf hypothesis in such a way that it can be tested and treated as a program for empirical research."
            },
            "slug": "The-semantics-of-grammar-Wierzbicka",
            "title": {
                "fragments": [],
                "text": "The semantics of grammar"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The author develops a semantic metalanguage based on lexical universals or near-universals (and, ultimately, on a system of universal semantic primitives), and shows that the same semantic metal language can be used for explicating lexical, grammatical and pragmatic aspects of language and thus offers a method for an integrated linguistic description based on semantic foundations."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2653356"
                        ],
                        "name": "R. E. Till",
                        "slug": "R.-E.-Till",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Till",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. E. Till"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3831099"
                        ],
                        "name": "E. F. Mross",
                        "slug": "E.-F.-Mross",
                        "structuredName": {
                            "firstName": "Ernest",
                            "lastName": "Mross",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. F. Mross"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3025325"
                        ],
                        "name": "W. Kintsch",
                        "slug": "W.-Kintsch",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Kintsch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Kintsch"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 42653521,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "c7e8f3b6f78a770b3e2e51d58421b311452ab2fe",
            "isKey": false,
            "numCitedBy": 225,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "The construction of word meanings in a discourse context was conceptualized as a process of sense activation, sense selection, and sense elaboration. In three experiments, subjects read texts presented by a rapid serial visual procedure and performed a lexical decision on visually presented targets that followed ambiguous prime words. When the target was a word, it was either an associate of the prime word, a probable inference suggested by the discourse, or an unrelated word. For associates, lexical decisions that related to either the appropriate or the inappropriate sense of the ambiguous word were generally facilitated at short (200-400 msec) prime-target stimulus onset asynchronies (SOAs). At longer SOAs, responses were faster to appropriate than to inappropriate associates. For the thematic inferences, there was no difference between these (appropriate) inferences and (inappropriate) control words at short SOAs. At long SOAs (1,000 and 1,500 msec), however, inference words were facilitated. The results are interpreted as consistent with a model of lexical processing in which sense activation functions independently of context. Discourse context effects, whether on sense selection (suppression of inappropriate associates) or on sense elaboration (creation of inferences), are seen as postlexical."
            },
            "slug": "Time-course-of-priming-for-associate-and-inference-Till-Mross",
            "title": {
                "fragments": [],
                "text": "Time course of priming for associate and inference words in a discourse context"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "The construction of word meanings in a discourse context was conceptualized as a process of sense activation, sense selection, and sense elaboration and the results are interpreted as consistent with a model of lexical processing in which sense activation functions independently of context."
            },
            "venue": {
                "fragments": [],
                "text": "Memory & cognition"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3594249"
                        ],
                        "name": "S. Glucksberg",
                        "slug": "S.-Glucksberg",
                        "structuredName": {
                            "firstName": "Sam",
                            "lastName": "Glucksberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Glucksberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "11646608"
                        ],
                        "name": "P. Gildea",
                        "slug": "P.-Gildea",
                        "structuredName": {
                            "firstName": "Patricia",
                            "lastName": "Gildea",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Gildea"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4953223"
                        ],
                        "name": "H. B. Bookin",
                        "slug": "H.-B.-Bookin",
                        "structuredName": {
                            "firstName": "Howard",
                            "lastName": "Bookin",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. B. Bookin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143718724,
            "fieldsOfStudy": [
                "Psychology",
                "Philosophy"
            ],
            "id": "2fe40271f27387bd69300a41f5c5d8adbec272b7",
            "isKey": false,
            "numCitedBy": 344,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-understanding-nonliteral-speech:-Can-people-Glucksberg-Gildea",
            "title": {
                "fragments": [],
                "text": "On understanding nonliteral speech: Can people ignore metaphors?"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1836606"
                        ],
                        "name": "T. Landauer",
                        "slug": "T.-Landauer",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Landauer",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Landauer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2444937"
                        ],
                        "name": "Darrell Laham",
                        "slug": "Darrell-Laham",
                        "structuredName": {
                            "firstName": "Darrell",
                            "lastName": "Laham",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Darrell Laham"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2197285"
                        ],
                        "name": "B. Rehder",
                        "slug": "B.-Rehder",
                        "structuredName": {
                            "firstName": "Bob",
                            "lastName": "Rehder",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Rehder"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144029655"
                        ],
                        "name": "M. E. Schreiner",
                        "slug": "M.-E.-Schreiner",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Schreiner",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. E. Schreiner"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14911179,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "0c074681e891ecd764bb844666011fa41cf7c8f1",
            "isKey": false,
            "numCitedBy": 344,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "How much of the meaning of a naturally occurring English passage is derivable from its combination of words without considering their order? An exploratory approach to this question was provided by asking humans to judge the quality and quantity of knowledge conveyed by short student essays on scientific topics and comparing the interrater reliability and predictive accuracy of their estimates with the performance of a corpus-based statistical model that takes no account of word order within an essay. There was surprisingly little difference between the human judges and the model. In the studies reported here, experts were asked to read short student essays about scientific topics with the goal of determining how much knowledge was accurately reflected in a given essay. We measured the readers’ success by how well their ratings agreed with each other and how well they predicted scores on an objective test on the same subject. All current accounts of human discourse understanding"
            },
            "slug": "How-Well-Can-Passage-Meaning-be-Derived-without-A-Landauer-Laham",
            "title": {
                "fragments": [],
                "text": "How Well Can Passage Meaning be Derived without Using Word Order? A Comparison of Latent Semantic Analysis and Humans"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "An exploratory approach was provided by asking humans to judge the quality and quantity of knowledge conveyed by short student essays on scientific topics and comparing the interrater reliability and predictive accuracy of their estimates with the performance of a corpus-based statistical model that takes no account of word order within an essay."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1721801"
                        ],
                        "name": "C. Fellbaum",
                        "slug": "C.-Fellbaum",
                        "structuredName": {
                            "firstName": "Christiane",
                            "lastName": "Fellbaum",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Fellbaum"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 246,
                                "start": 232
                            }
                        ],
                        "text": "However, George A. Miller and his colleagues, with WordNet, have made an explicit attempt to catalogue word senses for use in linguistic and psychological research, as well as for artificial intelligence applications (Miller, 1996; Fellbaum, 1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5958691,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d87ceda3042f781c341ac17109d1e94a717f5f60",
            "isKey": false,
            "numCitedBy": 13578,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Part 1 The lexical database: nouns in WordNet, George A. Miller modifiers in WordNet, Katherine J. Miller a semantic network of English verbs, Christiane Fellbaum design and implementation of the WordNet lexical database and searching software, Randee I. Tengi. Part 2: automated discovery of WordNet relations, Marti A. Hearst representing verb alterations in WordNet, Karen T. Kohl et al the formalization of WordNet by methods of relational concept analysis, Uta E. Priss. Part 3 Applications of WordNet: building semantic concordances, Shari Landes et al performance and confidence in a semantic annotation task, Christiane Fellbaum et al WordNet and class-based probabilities, Philip Resnik combining local context and WordNet similarity for word sense identification, Claudia Leacock and Martin Chodorow using WordNet for text retrieval, Ellen M. Voorhees lexical chains as representations of context for the detection and correction of malapropisms, Graeme Hirst and David St-Onge temporal indexing through lexical chaining, Reem Al-Halimi and Rick Kazman COLOR-X - using knowledge from WordNet for conceptual modelling, J.F.M. Burg and R.P. van de Riet knowledge processing on an extended WordNet, Sanda M. Harabagiu and Dan I Moldovan appendix - obtaining and using WordNet."
            },
            "slug": "WordNet-:-an-electronic-lexical-database-Fellbaum",
            "title": {
                "fragments": [],
                "text": "WordNet : an electronic lexical database"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "The lexical database: nouns in WordNet, Katherine J. Miller a semantic network of English verbs, and applications of WordNet: building semantic concordances are presented."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3594249"
                        ],
                        "name": "S. Glucksberg",
                        "slug": "S.-Glucksberg",
                        "structuredName": {
                            "firstName": "Sam",
                            "lastName": "Glucksberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Glucksberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2057892"
                        ],
                        "name": "B. Keysar",
                        "slug": "B.-Keysar",
                        "structuredName": {
                            "firstName": "Boaz",
                            "lastName": "Keysar",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Keysar"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 19916213,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "6775b3048f363c23ee01da1cda6afd58b43e6db5",
            "isKey": false,
            "numCitedBy": 691,
            "numCiting": 69,
            "paperAbstract": {
                "fragments": [],
                "text": "Traditionally, metaphors such as \"my job is a jail\" have been treated as implicit similes (i.e., this metaphor would be treated as if it were a comparison statement, \"my job is like a jail\"). Tversky's account of similarity is applied to such nonliteral similarity expressions, and is shown to apply as readily to nonliteral comparisons as to literal comparisons. But treating metaphors as comparison statements fails to account for certain important phenomena, including metaphoricity itself (the judgment that a comparison statement is nonliteral). We argue that metaphors are exactly what they appear to be: class-inclusion assertions, in which the topic of the metaphor (e.g., \"my job\") is assigned to a diagnostic category (e.g., entities that confine one against one's will, are unpleasant, are difficult to escape from). In such assertions, the metaphor vehicle (e.g., \"jail\") refers to that category, and at the same time is a prototypical exemplar of that category. This account of metaphor provides a basis for a theory of metaphor comprehension, and also clarifies why people use metaphors instead of similes. How do people understand nonliteral expressions such as my grandfather is a baby? Taken literally, this sentence seems false. A grandfather must be an adult, and an adult cannot be of an age to be included in the category baby. According to traditional theories of metaphor comprehension (see Ortony, 1979a), the listener must reject this \"false\" literal interpretation and somehow find a nonliteral interpretation that is appropriate to the context of the conversation. In terms of speech act theory, \"where an utterance is defective if taken literally, look for an utterance meaning that differs from sentence meaning\" (Searle, 1979, p. 114, italics added). A comprehension model based on this assumption postulates three stages:"
            },
            "slug": "Understanding-Metaphorical-Comparisons:-Beyond-Glucksberg-Keysar",
            "title": {
                "fragments": [],
                "text": "Understanding Metaphorical Comparisons: Beyond Similarity."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3594249"
                        ],
                        "name": "S. Glucksberg",
                        "slug": "S.-Glucksberg",
                        "structuredName": {
                            "firstName": "Sam",
                            "lastName": "Glucksberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Glucksberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6738980"
                        ],
                        "name": "M. McGlone",
                        "slug": "M.-McGlone",
                        "structuredName": {
                            "firstName": "Matthew",
                            "lastName": "McGlone",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. McGlone"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145784756"
                        ],
                        "name": "D. A. Manfredi",
                        "slug": "D.-A.-Manfredi",
                        "structuredName": {
                            "firstName": "Deanna",
                            "lastName": "Manfredi",
                            "middleNames": [
                                "Ann"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. A. Manfredi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143442015,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "c446f9af1fb98f7c1680291dbeea81d65d4c2d78",
            "isKey": false,
            "numCitedBy": 244,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract Metaphors of the formX is a Ymay be conceived as statements of property attribution, in which properties of the vehicleYare attributed to the topicX. The properties attributed from the vehicle to the topic are those that are epitomized by the vehicle, and may characterize a dimension of within-category variation in the topic. We report two experiments that tested the implications of this “property attribution” view of metaphor comprehension. One implication of this view is that metaphors are not implicitly transformed into comparisons (X is like a Y), but rather are understood as what they appear to be: class-inclusion assertions. If metaphors are understood as class-inclusion assertions, they should either change meaning or become nonsensical when reversed. Experiment 1 provides evidence for this claim. A second implication of the property attribution view is that topics and vehicles provide different kinds of information to guide and constrain the comprehension process. Experiment 2 provides evidence for this claim. These findings cannot be accounted for by models which assume that metaphors are understood as implicit comparisons."
            },
            "slug": "Property-attribution-in-metaphor-comprehension-Glucksberg-McGlone",
            "title": {
                "fragments": [],
                "text": "Property attribution in metaphor comprehension"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31533192"
                        ],
                        "name": "A. Collins",
                        "slug": "A.-Collins",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Collins",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Collins"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69960817"
                        ],
                        "name": "M. R. Quillian",
                        "slug": "M.-R.-Quillian",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Quillian",
                            "middleNames": [
                                "Ross"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. R. Quillian"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 35
                            }
                        ],
                        "text": "An early example of such a system (Collins & Quillian, 1969) was constructed around the IS-A relationship."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 60922154,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "06cb835bda3420186e2c6f6fa2dbc1613a9b2d75",
            "isKey": false,
            "numCitedBy": 2946,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Retrieval-time-from-semantic-memory-Collins-Quillian",
            "title": {
                "fragments": [],
                "text": "Retrieval time from semantic memory"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39952106"
                        ],
                        "name": "Michael B. W. Wolfe",
                        "slug": "Michael-B.-W.-Wolfe",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Wolfe",
                            "middleNames": [
                                "B.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael B. W. Wolfe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144029655"
                        ],
                        "name": "M. E. Schreiner",
                        "slug": "M.-E.-Schreiner",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Schreiner",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. E. Schreiner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2197285"
                        ],
                        "name": "B. Rehder",
                        "slug": "B.-Rehder",
                        "structuredName": {
                            "firstName": "Bob",
                            "lastName": "Rehder",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Rehder"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2444937"
                        ],
                        "name": "Darrell Laham",
                        "slug": "Darrell-Laham",
                        "structuredName": {
                            "firstName": "Darrell",
                            "lastName": "Laham",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Darrell Laham"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2036336"
                        ],
                        "name": "P. Foltz",
                        "slug": "P.-Foltz",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Foltz",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Foltz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3025325"
                        ],
                        "name": "W. Kintsch",
                        "slug": "W.-Kintsch",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Kintsch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Kintsch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1836606"
                        ],
                        "name": "T. Landauer",
                        "slug": "T.-Landauer",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Landauer",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Landauer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62526953,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e0cb6eb8776d372f76be62c95252162086b46eff",
            "isKey": false,
            "numCitedBy": 249,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "This study examines the hypothesis that the ability of a reader to learn from text depends on the match between the background knowledge of the reader and the difficulty of the text information. Latent Semantic Analysis (LSA), a statistical technique that represents the content of a document as a vector in high‐dimensional semantic space based on a large text corpus, is used to predict how much readers will learn from texts based on the estimated conceptual match between their topic knowledge and the text information. Participants completed tests to assess their knowledge of the human heart and circulatory system, then read one of four texts that ranged in difficulty from elementary to medical school level, then completed the tests again. Results show a nonmonotonic relation in which learning was greatest for texts that were neither too easy nor too difficult. LSA proved as effective at predicting learning from these texts as traditional knowledge assessment measures. For these texts, optimal assignment o..."
            },
            "slug": "Learning-from-text:-Matching-readers-and-texts-by-Wolfe-Schreiner",
            "title": {
                "fragments": [],
                "text": "Learning from text: Matching readers and texts by latent semantic analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Results show a nonmonotonic relation in which learning was greatest for texts that were neither too easy nor too difficult, and LSA proved as effective at predicting learning from these texts as traditional knowledge assessment measures."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46777278"
                        ],
                        "name": "M. Singer",
                        "slug": "M.-Singer",
                        "structuredName": {
                            "firstName": "Murray",
                            "lastName": "Singer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Singer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30155790"
                        ],
                        "name": "Michael Halldorson",
                        "slug": "Michael-Halldorson",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Halldorson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael Halldorson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153201483"
                        ],
                        "name": "Jeffrey C. Lear",
                        "slug": "Jeffrey-C.-Lear",
                        "structuredName": {
                            "firstName": "Jeffrey",
                            "lastName": "Lear",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jeffrey C. Lear"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "10764514"
                        ],
                        "name": "Peter Andrusiak",
                        "slug": "Peter-Andrusiak",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Andrusiak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Peter Andrusiak"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 113,
                                "start": 93
                            }
                        ],
                        "text": "Together with the examples presented in Table 3, the analysis of the stimulus materials from Singer et al. (1992) suggests that predication can give a satisfactory account of causal inferences in comprehension."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 46,
                                "start": 26
                            }
                        ],
                        "text": "In this well-known study, Singer et al. (1992) provided evidence that causal bridging inferences were made during reading."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 144322376,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "25adb32fd478291a361a448dc1d93bf5e5ce7611",
            "isKey": false,
            "numCitedBy": 166,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Validation-of-causal-bridging-inferences-in-Singer-Halldorson",
            "title": {
                "fragments": [],
                "text": "Validation of causal bridging inferences in discourse understanding."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2365155"
                        ],
                        "name": "S. Deerwester",
                        "slug": "S.-Deerwester",
                        "structuredName": {
                            "firstName": "Scott",
                            "lastName": "Deerwester",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Deerwester"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728602"
                        ],
                        "name": "S. Dumais",
                        "slug": "S.-Dumais",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Dumais",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Dumais"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1836606"
                        ],
                        "name": "T. Landauer",
                        "slug": "T.-Landauer",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Landauer",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Landauer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2737579"
                        ],
                        "name": "G. Furnas",
                        "slug": "G.-Furnas",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Furnas",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Furnas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3154682"
                        ],
                        "name": "R. Harshman",
                        "slug": "R.-Harshman",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Harshman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Harshman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3252915,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "20a80a7356859daa4170fb4da6b87b84adbb547f",
            "isKey": false,
            "numCitedBy": 7019,
            "numCiting": 70,
            "paperAbstract": {
                "fragments": [],
                "text": "A new method for automatic indexing and retrieval is described. The approach is to take advantage of implicit higher-order structure in the association of terms with documents (“semantic structure”) in order to improve the detection of relevant documents on the basis of terms found in queries. The particular technique used is singular-value decomposition, in which a large term by document matrix is decomposed into a set of ca. 100 orthogonal factors from which the original matrix can be approximated by linear combination. Documents are represented by ca. 100 item vectors of factor weights. Queries are represented as pseudo-document vectors formed from weighted combinations of terms, and documents with supra-threshold cosine values are returned. initial tests find this completely automatic method for retrieval to be promising."
            },
            "slug": "Indexing-by-Latent-Semantic-Analysis-Deerwester-Dumais",
            "title": {
                "fragments": [],
                "text": "Indexing by Latent Semantic Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "A new method for automatic indexing and retrieval to take advantage of implicit higher-order structure in the association of terms with documents (“semantic structure”) in order to improve the detection of relevant documents on the basis of terms found in queries."
            },
            "venue": {
                "fragments": [],
                "text": "J. Am. Soc. Inf. Sci."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3025325"
                        ],
                        "name": "W. Kintsch",
                        "slug": "W.-Kintsch",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Kintsch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Kintsch"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 90,
                                "start": 77
                            }
                        ],
                        "text": "Activation is then spread in this network (using the CI program described in Kintsch, 1998), until a steady state\nis reached."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Finally, a number of applications of that algorithm will be described to demonstrate that it actually performs in the way it is supposed to perform for a few important semantic problems: metaphor interpretation, causal inference, similarity judgments, and homonym disambiguation."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 245,
                                "start": 232
                            }
                        ],
                        "text": "To mention just three of the practical applications, there is first, the use of LSA to select instructional texts that are appropriate to a student’s level of background knowledge (Wolfe, Schreiner, Rehder, Laham, Foltz, Landauer, & Kintsch, 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 80
                            }
                        ],
                        "text": "Usually, these are described as causal inferences, though some authors, such as Kintsch (1998), argue that the term inference is misleading in this context."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 0
                            }
                        ],
                        "text": "Kintsch (1988, 1998) has argued that such a theory is required for discourse understanding in general; here, this argument is extended to the mental lexicon, and made precise through the computational power of LSA."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 116,
                                "start": 97
                            }
                        ],
                        "text": "This is achieved by combining LSA with the construction-integration model of text comprehension (Kintsch, 1988, 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 132,
                                "start": 130
                            }
                        ],
                        "text": "In such cases it is most informative to compute the cosine between the vector in question and the semantic landmark we have in mind."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 78
                            }
                        ],
                        "text": "In order to compute the vector for P(A), the constructionintegration model of Kintsch (1988, 1998) will be used."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 61138693,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "00622988ba6f64554014be5b9cb31fcabc0b6633",
            "isKey": false,
            "numCitedBy": 3837,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Preface Acknowledgements 1. Introduction Part I. The Theory: 2. Cognition and representation 3. Propositional representations 4. Modeling comprehension processes: the construction-integration model Part II. Models of Comprehension: 5. Word identification in discourse 6. Textbases and situation models 7. The role of working memory in comprehension 8. Memory for text 9. Learning from text 10. Word problems 11. Beyond text References name index Subject index."
            },
            "slug": "Comprehension:-A-Paradigm-for-Cognition-Kintsch",
            "title": {
                "fragments": [],
                "text": "Comprehension: A Paradigm for Cognition"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "This work proposes a new model of comprehension processes: the construction-integration model, which combines the role of working memory, Cognition and representation, and Propositional representations."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2326474"
                        ],
                        "name": "E. Heit",
                        "slug": "E.-Heit",
                        "structuredName": {
                            "firstName": "Evan",
                            "lastName": "Heit",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Heit"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2069432298"
                        ],
                        "name": "J. Rubinstein",
                        "slug": "J.-Rubinstein",
                        "structuredName": {
                            "firstName": "Joshua",
                            "lastName": "Rubinstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Rubinstein"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 0
                            }
                        ],
                        "text": "Heit and Rubenstein (1994) report average similarity judgments for 21 comparisons with two different instructions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9806284,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "fa4153addc25d8a1319066c628d3d750f36ca2fa",
            "isKey": false,
            "numCitedBy": 249,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "Three experiments investigated the proposal that inductive inferences about different properties depend on different measures of similarity. In Experiments 1 and 2, Ss were given the premise that a category of animals has some property and judged the probability that another category of animals also has that property. Ss made the strongest inferences when the kind of property (anatomical or behavioral) corresponded to the kind of similarity between the animal categories (anatomical or behavioral). These results cannot be explained in terms of a single measure of similarity underlying induction. In Experiment 3, Ss rated the similarity of animal pairs with respect to anatomy or behavior. Regression analyses showed that both behavioral and anatomical similarity influenced behavioral inferences, but only anatomical similarity influenced anatomical inferences."
            },
            "slug": "Similarity-and-property-effects-in-inductive-Heit-Rubinstein",
            "title": {
                "fragments": [],
                "text": "Similarity and property effects in inductive reasoning."
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "Three experiments investigated the proposal that inductive inferences about different properties depend on different measures of similarity, and found that Ss made the strongest inferences when the kind of property corresponded to theKind of similarity between the animal categories (anatomical or behavioral)."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of experimental psychology. Learning, memory, and cognition"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3025325"
                        ],
                        "name": "W. Kintsch",
                        "slug": "W.-Kintsch",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Kintsch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Kintsch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2072737809"
                        ],
                        "name": "V. Patel",
                        "slug": "V.-Patel",
                        "structuredName": {
                            "firstName": "Vimla",
                            "lastName": "Patel",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Patel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144006592"
                        ],
                        "name": "K. A. Ericsson",
                        "slug": "K.-A.-Ericsson",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Ericsson",
                            "middleNames": [
                                "Anders"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. A. Ericsson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17707367,
            "fieldsOfStudy": [
                "Computer Science",
                "Psychology"
            ],
            "id": "ba9005d343db0b096641d761b7dfc94f98a4ed2b",
            "isKey": false,
            "numCitedBy": 130,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "A distinction is made between short-term working memory, which is capacity limited, and long-term working memory , which is available to experts in their domain of expertise . Text comprehension is viewed as expert performance. The role of long-term working memory in text comprehension is analyzed, with an emphasis on the activation of relevant knowledge during comprehension . Latent semantic analysis used to model knowledge activation in text comprehension."
            },
            "slug": "The-role-of-long-term-working-memory-in-text-Kintsch-Patel",
            "title": {
                "fragments": [],
                "text": "The role of long-term working memory in text comprehension."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The role of long-term working memory in text comprehension is analyzed, with an emphasis on the activation of relevant knowledge during comprehension, and latent semantic analysis is used to model knowledge activation intext comprehension."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2064181"
                        ],
                        "name": "A. Tversky",
                        "slug": "A.-Tversky",
                        "structuredName": {
                            "firstName": "Amos",
                            "lastName": "Tversky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Tversky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "98104006"
                        ],
                        "name": "J. W. Hutchinson",
                        "slug": "J.-W.-Hutchinson",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Hutchinson",
                            "middleNames": [
                                "Wesley"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. W. Hutchinson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 29,
                                "start": 0
                            }
                        ],
                        "text": "Tversky and Hutchinson (1986) point out that we say Korea is like China, but not China is like Korea, presumably because the latter is not very informative and thus violates Gricean maxims."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 83,
                                "start": 57
                            }
                        ],
                        "text": "Mervis, Rips, Rosch, Shoben, & Smith (1975; reprinted in Tversky & Hutchinson, 1986) reports similarity judgments for a 20 3 20 matrix of fruit names."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17034191,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4c98b6b0756588f1ad41f2c128523419bdfd2244",
            "isKey": false,
            "numCitedBy": 182,
            "numCiting": 134,
            "paperAbstract": {
                "fragments": [],
                "text": "Geometric models impose an upper bound on the number of points that can share the same nearest neighbor. A much more restrictive bound is implied by the assumption that the data points represent a sample from some continuous distribution in a multidimensional Euclidean space. The analysis of 100 data sets shows that most perceptual data satisfy the geometric-statistical bound whereas many conceptual data sets exceed it. The most striking discrepancies between the data and their multidimensional representations arise in semantic fields when the stimulus set includes a focal element (e.g., a superordinate category) that is the nearest neighbor of many of its instances. Theoretical and methodological implications of nearest neighbor analysis are discussed."
            },
            "slug": "Nearest-neighbor-analysis-of-psychological-spaces.-Tversky-Hutchinson",
            "title": {
                "fragments": [],
                "text": "Nearest neighbor analysis of psychological spaces."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The analysis of 100 data sets shows that most perceptual data satisfy the geometric-statistical bound whereas many conceptual data sets exceed it, and the most striking discrepancies between the data and their multidimensional representations arise in semantic fields."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1704635"
                        ],
                        "name": "D. Lenat",
                        "slug": "D.-Lenat",
                        "structuredName": {
                            "firstName": "Douglas",
                            "lastName": "Lenat",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Lenat"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145615125"
                        ],
                        "name": "R. Guha",
                        "slug": "R.-Guha",
                        "structuredName": {
                            "firstName": "Ramanathan",
                            "lastName": "Guha",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Guha"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 148,
                                "start": 130
                            }
                        ],
                        "text": "Hand-coding word meanings, as in WordNet (Miller, 1996), or hand-coding a complete lexical knowledge base, as in the CYC project (Lenat & Guha, 1990), has been the traditional approach."
                    },
                    "intents": []
                }
            ],
            "corpusId": 60749409,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bdc4771b217252c2460281d19fc01d3e63888f4d",
            "isKey": false,
            "numCitedBy": 784,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "In this age of modern era, the use of internet must be maximized. Yeah, internet will help us very much not only for important thing but also for daily activities. Many people now, from any level can use internet. The sources of internet connection can also be enjoyed in many places. As one of the benefits is to get the on-line building large knowledge based systems book, as the world window, as many people suggest."
            },
            "slug": "Building-large-knowledge-based-systems-Lenat-Guha",
            "title": {
                "fragments": [],
                "text": "Building large knowledge-based systems"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "In this age of modern era, the use of internet must be maximized as one of the benefits is to get the on-line building large knowledge based systems book, as the world window, as many people suggest."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3163130"
                        ],
                        "name": "E. Kintsch",
                        "slug": "E.-Kintsch",
                        "structuredName": {
                            "firstName": "Eileen",
                            "lastName": "Kintsch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Kintsch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94717536"
                        ],
                        "name": "D. Steinhart",
                        "slug": "D.-Steinhart",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Steinhart",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Steinhart"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1708842"
                        ],
                        "name": "G. Stahl",
                        "slug": "G.-Stahl",
                        "structuredName": {
                            "firstName": "Gerry",
                            "lastName": "Stahl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Stahl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "24311617"
                        ],
                        "name": "C. Matthews",
                        "slug": "C.-Matthews",
                        "structuredName": {
                            "firstName": "Cindy",
                            "lastName": "Matthews",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Matthews"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117334701"
                        ],
                        "name": "Ronald Lamb",
                        "slug": "Ronald-Lamb",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Lamb",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ronald Lamb"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1455573,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "1edb7a1087a033edde84d0b841100d705de692c1",
            "isKey": false,
            "numCitedBy": 160,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a series of classroom trials during which we developed Summary Street, an educational software system that uses Latent Semantic Analysis to support writing and revision activities. Summary Street provides various kinds of feedback, primarily about whether a student summary adequately covers important source content and fulfills other requirements, such as length. The feedback allows students to engage in extensive, independent practice in writing and revising without placing excessive demands on teachers for feedback. We first discuss the underlying educational rationale, then present some results of the trials conducted with the system. We describe the collaborative process among researchers and teachers which enabled the development of a viable and supportive educational tool and its integration into classroom instruction."
            },
            "slug": "Developing-Summarization-Skills-through-the-Use-of-Kintsch-Steinhart",
            "title": {
                "fragments": [],
                "text": "Developing Summarization Skills through the Use of LSA-Based Feedback"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The collaborative process among researchers and teachers which enabled the development of a viable and supportive educational tool and its integration into classroom instruction are described."
            },
            "venue": {
                "fragments": [],
                "text": "Interact. Learn. Environ."
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2114422872"
                        ],
                        "name": "G. Miller",
                        "slug": "G.-Miller",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Miller",
                            "middleNames": [
                                "Abram"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Miller"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9311196,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "9d81ed652828fd536d86cc371278efcb502572cd",
            "isKey": false,
            "numCitedBy": 1518,
            "numCiting": 190,
            "paperAbstract": {
                "fragments": [],
                "text": "There are many reasons why a budding academic might want to avoid interdisciplinary research. It is diffi cult enough to acquire expertise in one fi eld of research, let alone two or more. The time required to read the literature in a fi eld outside your own main area can be hard to fi nd, and the additional time investment to learn novel methods from another fi eld can be huge. Moreover, the hiring and reward systems in academia still run strongly along disciplinary lines, so that work that draws on or contributes to other fi elds may not be fully valued in one’s own fi eld. Interdisciplinary research may not be appreciated by narrow-minded colleagues. Some interdisciplinary projects have a bogus air about them, looking like they were designed more to bring in big research grants than to accomplish intellectual goals. The interdisciplinary scholar can look a bit like a dilettante, dabbling in multiple fi elds in order to avoid tackling the diffi cult problems in an established fi eld. Grants for interdisciplinary research can be diffi cult to get, because most granting agencies are organized along disciplinary lines. Despite these deterrents to interdisciplinary research, there are powerful intellectual reasons why work that oversteps the ossifi ed boundaries of established fi elds can have great intellectual benefi ts. Such benefi ts are vividly apparent in the interdisciplinary fi eld of cognitive science, which attempts to understand the mind by combining insights from the fi elds of psychology, philosophy, linguistics, neuroscience, anthropology, and artifi cial intelligence. After a brief review of the history of the fi eld and its contributing disciplines, this chapter will examine some of the main theoretical and experimental advances that cognitive science has accomplished over the past half century, deriving lessons that might be useful for researchers in any emerging interdisciplinary area."
            },
            "slug": "Cognitive-science.-Miller",
            "title": {
                "fragments": [],
                "text": "Cognitive science."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This chapter will examine some of the main theoretical and experimental advances that cognitive science has accomplished over the past half century, deriving lessons that might be useful for researchers in any emerging interdisciplinary area."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48890461"
                        ],
                        "name": "G. A. Miller",
                        "slug": "G.-A.-Miller",
                        "structuredName": {
                            "firstName": "Geo.",
                            "lastName": "Miller",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. A. Miller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 6
                            }
                        ],
                        "text": "Thus, WordNet is an extremely ambitious enterprise, hand-crafted with great care."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 230,
                                "start": 218
                            }
                        ],
                        "text": "However, George A. Miller and his colleagues, with WordNet, have made an explicit attempt to catalogue word senses for use in linguistic and psychological research, as well as for artificial intelligence applications (Miller, 1996; Fellbaum, 1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 13
                            }
                        ],
                        "text": "According to WordNet, mint has four meanings as a noun, one as a verb, and one as an adjective."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 142
                            }
                        ],
                        "text": "Gallop was chosen as a landmark that should be closer to horse ran than color ran, and dissolve (a synonym for this sense of run according to WordNet) was chosen to be closer to color ran than to horse ran."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 33
                            }
                        ],
                        "text": "In one case the category name in WordNet was unknown to LSA and in another case it was barely familiar to LSA; the next word listed in the WordNet entry was used as a substitute."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 141,
                                "start": 134
                            }
                        ],
                        "text": "For each homonym noun, two different disambiguating phrases were constructed, using as predicates\nwords from the definitions given in WordNet."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 42
                            }
                        ],
                        "text": "Hand-coding word meanings, as in WordNet (Miller, 1996), or hand-coding a complete lexical knowledge base, as in the CYC project (Lenat & Guha, 1990), has been the traditional approach."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 51,
                                "start": 44
                            }
                        ],
                        "text": "For instance, the verb run has 42 senses in WordNet; in addition, 11 senses are listed for the noun run."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 62
                            }
                        ],
                        "text": "This vector was then compared to landmarks also selected from WordNet—the category names to which each meaning was assigned in WordNet."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 0
                            }
                        ],
                        "text": "WordNet includes over 160,000 words and over 300,000 relations among them."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 228,
                                "start": 198
                            }
                        ],
                        "text": "Miller and his colleagues, with WordNet, have made an explicit attempt to catalogue word senses for use in linguistic and psychological research, as well as for artificial intelligence applications (Miller, 1996; Fellbaum, 1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 62554685,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "91a40a247457286f979b470d5bae5e680447270e",
            "isKey": true,
            "numCitedBy": 249,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This text entertains and enlightens readers about the relations between words, languages, thought, and the human brain."
            },
            "slug": "The-science-of-words-Miller",
            "title": {
                "fragments": [],
                "text": "The science of words"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This text entertains and enlightens readers about the relations between words, languages, thought, and the human brain."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2064552988"
                        ],
                        "name": "David M. Gillies",
                        "slug": "David-M.-Gillies",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Gillies",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David M. Gillies"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2193113"
                        ],
                        "name": "R. Ju",
                        "slug": "R.-Ju",
                        "structuredName": {
                            "firstName": "Roy",
                            "lastName": "Ju",
                            "middleNames": [
                                "Dz-Ching"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Ju"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2157207880"
                        ],
                        "name": "Richard Johnson",
                        "slug": "Richard-Johnson",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Johnson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Richard Johnson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1904901"
                        ],
                        "name": "M. Schlansker",
                        "slug": "M.-Schlansker",
                        "structuredName": {
                            "firstName": "Mike",
                            "lastName": "Schlansker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Schlansker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2622557,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "adf32ba13b89db34408066572255e30ffe7e994f",
            "isKey": false,
            "numCitedBy": 46,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "To fully utilize the wide machine resources in modern high-performance microprocessors it is necessary to exploit parallelism beyond individual basic blocks. Architectural support for predicated execution increases the degree of instruction level parallelism by allowing instructions from different basic blocks to be converted to straight-line code guarded by boolean predicates. However predicated execution also presents significant challenges to an optimizing compiler. For example, in live range analysis, a predicated definition does not necessarily end the live range of a virtual register. This paper describes techniques to analyze the relations among predicates in order to improve the precision and effectiveness of various compiler analysis and transformation phases in the presence of predicated code. Our predicate analysis operates globally to obtain relations among predicates. Moreover, we analyze control flow and predication in a single unified framework. The result can be queried by subsequent optimization and analysis phases. Based on this framework, we extend a traditional method to a predicate-aware register allocator which takes global predicate relations into account. We have implemented the proposed algorithms to effectively reduce register pressure. Our experimental results show 24.6% of a large test suite obtain, on average, 20.71% and better register allocation due to the algorithms presented in this paper."
            },
            "slug": "Global-predicate-analysis-and-its-application-to-Gillies-Ju",
            "title": {
                "fragments": [],
                "text": "Global predicate analysis and its application to register allocation"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Techniques to analyze the relations among predicates are described in order to improve the precision and effectiveness of various compiler analysis and transformation phases in the presence of predicated code."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 29th Annual IEEE/ACM International Symposium on Microarchitecture. MICRO 29"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1959209"
                        ],
                        "name": "V. Sreedhar",
                        "slug": "V.-Sreedhar",
                        "structuredName": {
                            "firstName": "Vugranam",
                            "lastName": "Sreedhar",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Sreedhar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2193113"
                        ],
                        "name": "R. Ju",
                        "slug": "R.-Ju",
                        "structuredName": {
                            "firstName": "Roy",
                            "lastName": "Ju",
                            "middleNames": [
                                "Dz-Ching"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Ju"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2064552988"
                        ],
                        "name": "David M. Gillies",
                        "slug": "David-M.-Gillies",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Gillies",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David M. Gillies"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34724239"
                        ],
                        "name": "Vatsa Santhanam",
                        "slug": "Vatsa-Santhanam",
                        "structuredName": {
                            "firstName": "Vatsa",
                            "lastName": "Santhanam",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Vatsa Santhanam"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17521318,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b4e0f3301cffb358e836ee2964a0316e1b263974",
            "isKey": false,
            "numCitedBy": 96,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Programs represented in Static Single Assignment (SSA) form contain phi instructions (or functions) whose operational semantics are to merge values coming from distinct control flow paths. However, translating phi instructions into native instructions is nontrivial when transformations such as copy propagation and code motion have been performed. In this paper we present a new framework for translating out of SSA form. By appropriately placing copy instructions, we ensure that none of the resources in a phi congruence class interfere. Within our framework, we propose three methods for copy placement. The first method pessimistically places copies for all operands of phi instructions. The second method uses an interference graph to guide copy placement. The third method uses both data flow liveness sets and an interference graph to guide copy placement. We also present a new SSA-based coalescing method that can selectively remove redundant copy instructions with interfering operands. Our experimental results indicate that the third method results in 35% fewer copy instructions than the second method. Compared to the first method, the third method, on average, inserts 89.9% fewer copies during copy placement and runs 15% faster, which are significant reductions in compilation time and space."
            },
            "slug": "Translating-Out-of-Static-Single-Assignment-Form-Sreedhar-Ju",
            "title": {
                "fragments": [],
                "text": "Translating Out of Static Single Assignment Form"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "A new framework for translating out of SSA form that places copies for all operands of phi instructions and presents a new SSA-based coalescing method that can selectively remove redundant copy instructions with interfering operands."
            },
            "venue": {
                "fragments": [],
                "text": "SAS"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2193113"
                        ],
                        "name": "R. Ju",
                        "slug": "R.-Ju",
                        "structuredName": {
                            "firstName": "Roy",
                            "lastName": "Ju",
                            "middleNames": [
                                "Dz-Ching"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Ju"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2289657"
                        ],
                        "name": "K. Nomura",
                        "slug": "K.-Nomura",
                        "structuredName": {
                            "firstName": "Kevin",
                            "lastName": "Nomura",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Nomura"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2075612909"
                        ],
                        "name": "Uma Mahadevan",
                        "slug": "Uma-Mahadevan",
                        "structuredName": {
                            "firstName": "Uma",
                            "lastName": "Mahadevan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Uma Mahadevan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1899034"
                        ],
                        "name": "Le-Chun Wu",
                        "slug": "Le-Chun-Wu",
                        "structuredName": {
                            "firstName": "Le-Chun",
                            "lastName": "Wu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Le-Chun Wu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 19426402,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2e61f79466bb370d22ff2d826c1a3655f5ac8e96",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "Control speculation refers to the execution of instructions before it has been determined that they would be executed in the normal flow of execution. Data speculation refers to the execution of instructions with potentially incorrect operand values, and a typical example is to execute a load before its preceding aliasing stores. Both types of speculation are effective techniques to enrich instruction level parallelism, but the research work for these two types of speculation have remained largely independent so far and the required compiler support has not been well studied. This paper proposes a unified compiler framework to exploit both control and data speculation and provides an in-depth discussion of various compilation issues. The adopted recovery mechanism guarantees the original program semantics including exceptions fully recoverable from a mis-speculation. Cascaded speculation and predication are also addressed. We demonstrate the effectiveness of the compiler optimization techniques for control and data speculation in terms of run-time performance improvements and code size increases through experimental results."
            },
            "slug": "A-unified-compiler-framework-for-control-and-data-Ju-Nomura",
            "title": {
                "fragments": [],
                "text": "A unified compiler framework for control and data speculation"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A unified compiler framework to exploit both control and data speculation is proposed and an in-depth discussion of various compilation issues is provided and the adopted recovery mechanism guarantees the original program semantics including exceptions fully recoverable from a mis-speculation."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings 2000 International Conference on Parallel Architectures and Compilation Techniques (Cat. No.PR00622)"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1806659"
                        ],
                        "name": "Karl Pettis",
                        "slug": "Karl-Pettis",
                        "structuredName": {
                            "firstName": "Karl",
                            "lastName": "Pettis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Karl Pettis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2059307145"
                        ],
                        "name": "R. C. Hansen",
                        "slug": "R.-C.-Hansen",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Hansen",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. C. Hansen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 67447,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0e0a7a50be7de580a38e7c0137ee905a521de261",
            "isKey": false,
            "numCitedBy": 356,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents the results of our investigation of code positioning techniques using execution profile data as input into the compilation process. The primary objective of the positioning is to reduce the overhead of the instruction memory hierarchy.\nAfter initial investigation in the literature, we decided to implement two prototypes for the Hewlett-Packard Precision Architecture (PA-RISC). The first, built on top of the linker, positions code based on whole procedures. This prototype has the ability to move procedures into an order that is determined by a “closest is best” strategy.\nThe second prototype, built on top of an existing optimizer package, positions code based on basic blocks within procedures. Groups of basic blocks that would be better as straight-line sequences are identified as chains. These chains are then ordered according to branch heuristics. Code that is never executed during the data collection runs can be physically separated from the primary code of a procedure by a technique we devised called procedure splitting.\nThe algorithms we implemented are described through examples in this paper. The performance improvements from our work are also summarized in various tables and charts."
            },
            "slug": "Profile-guided-code-positioning-Pettis-Hansen",
            "title": {
                "fragments": [],
                "text": "Profile guided code positioning"
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "This paper presents the results of the investigation of code positioning techniques using execution profile data as input into the compilation process to reduce the overhead of the instruction memory hierarchy."
            },
            "venue": {
                "fragments": [],
                "text": "PLDI '90"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38382205"
                        ],
                        "name": "A. V. S. Sastry",
                        "slug": "A.-V.-S.-Sastry",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Sastry",
                            "middleNames": [
                                "V.",
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. V. S. Sastry"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2193113"
                        ],
                        "name": "R. Ju",
                        "slug": "R.-Ju",
                        "structuredName": {
                            "firstName": "Roy",
                            "lastName": "Ju",
                            "middleNames": [
                                "Dz-Ching"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Ju"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 16967638,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9c21125d59edfae53432aec7f767d37f9c4ba7c7",
            "isKey": false,
            "numCitedBy": 48,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new register promotion algorithm based on Static Single Assignment (SSA) form. Register promotion is aimed at promoting program names from memory locations to registers. Our algorithm is profile-driven and is based on the scope of intervals. In cases where a complete promotion is not possible because of the presence of function calls or pointer references, the proposed algorithm is capable of eliminating loads and stores on frequently executed paths by placing loads and stores on less frequently executed paths. We also describe an efficient method to incrementally update SSA form when new definitions are cloned from an existing name during register promotion. On SPECInt95 benchmarks, our algorithm removes about ~12% of memory operations which access scalar variables."
            },
            "slug": "A-new-algorithm-for-scalar-register-promotion-based-Sastry-Ju",
            "title": {
                "fragments": [],
                "text": "A new algorithm for scalar register promotion based on SSA form"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "This work presents a new register promotion algorithm based on Static Single Assignment (SSA) form that is profile-driven and based on the scope of intervals, and describes an efficient method to incrementally update SSA form when new definitions are cloned from an existing name during register promotion."
            },
            "venue": {
                "fragments": [],
                "text": "PLDI 1998"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2075612909"
                        ],
                        "name": "Uma Mahadevan",
                        "slug": "Uma-Mahadevan",
                        "structuredName": {
                            "firstName": "Uma",
                            "lastName": "Mahadevan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Uma Mahadevan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2289657"
                        ],
                        "name": "K. Nomura",
                        "slug": "K.-Nomura",
                        "structuredName": {
                            "firstName": "Kevin",
                            "lastName": "Nomura",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Nomura"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2193113"
                        ],
                        "name": "R. Ju",
                        "slug": "R.-Ju",
                        "structuredName": {
                            "firstName": "Roy",
                            "lastName": "Ju",
                            "middleNames": [
                                "Dz-Ching"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Ju"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2439929"
                        ],
                        "name": "R. Hank",
                        "slug": "R.-Hank",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Hank",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hank"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 20540078,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9e9d1287f5f2b00efacd68f87dab224a9e10e010",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Modulo scheduling is an effective instruction scheduling technique for exploiting ILP in modern microprocessors with wide machine resources. As with any instruction scheduling technique, its effectiveness is constrained by both the source program dependencies as deduced by the compiler and the resources available in the target machine. Data speculation is a technique for eliminating memory dependencies in the instruction dependence graph with demonstrated benefits in acyclic scheduling. Therefore, by applying data speculation in modulo scheduled loops we are able to achieve higher degrees of instruction level parallelism. This paper addresses a number of key issues in applying data speculation to modulo scheduling: effectively identifying the additional instructions required to recover from misspeculation, ensuring full recoverability of instructions speculated across multiple stages and possibly executed speculatively multiple times on-the-fly, and coloring rotating registers for speculated instructions and instructions in recovery blocks. We implemented the framework proposed in this paper and demonstrated its effectiveness through experimental results."
            },
            "slug": "Applying-data-speculation-in-modulo-scheduled-loops-Mahadevan-Nomura",
            "title": {
                "fragments": [],
                "text": "Applying data speculation in modulo scheduled loops"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This paper addresses a number of key issues in applying data speculation to modulo scheduling: effectively identifying the additional instructions required to recover from misspeculation, ensuring full recoverability of instructions speculated across multiple stages and possibly executed speculatively multiple times on-the-fly, and coloring rotating registers for speculated instructions and instructions in recovery blocks."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings 2000 International Conference on Parallel Architectures and Compilation Techniques (Cat. No.PR00622)"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144226633"
                        ],
                        "name": "A. Ayers",
                        "slug": "A.-Ayers",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Ayers",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Ayers"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2070461162"
                        ],
                        "name": "R. Gottlieb",
                        "slug": "R.-Gottlieb",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Gottlieb",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gottlieb"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2256275"
                        ],
                        "name": "R. Schooler",
                        "slug": "R.-Schooler",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Schooler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Schooler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1315454,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "70482aef7e6b2b379a5b26a0abc89a79035a59da",
            "isKey": false,
            "numCitedBy": 99,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Existing research understates the benefits that can be obtained from inlining and cloning, especially when guided by profile information. Our implementation of inlining and cloning yields excellent results on average and very rarely lowers performance. We believe our good results can be explained by a number of factors: inlining at the intermediate-code level removes most technical restrictions on what can be inlined; the ability to inline across files and incorporate profile information enables us to choose better inline candidates; a high-quality back end can exploit the scheduling and register allocation opportunities presented by larger subroutines; an aggressive processor architecture benefits from more predictable branch behavior; and a large instruction cache mitigates the impact of code expansion. We describe the often dramatic impact of our inlining and cloning on performance: for example, the implementations of our inlining and cloning algorithms in the HP-UX 10.20 compilers boost SPECint95 performance on a PA8000-based workstation by a factor of 1.32."
            },
            "slug": "Aggressive-inlining-Ayers-Gottlieb",
            "title": {
                "fragments": [],
                "text": "Aggressive inlining"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The often dramatic impact of the inlining and cloning algorithms in the HP-UX 10.20 compilers boost SPECint95 performance on a PA8000-based workstation by a factor of 1.32."
            },
            "venue": {
                "fragments": [],
                "text": "PLDI '97"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144226633"
                        ],
                        "name": "A. Ayers",
                        "slug": "A.-Ayers",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Ayers",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Ayers"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2171969195"
                        ],
                        "name": "Stuart de Jong",
                        "slug": "Stuart-de-Jong",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Jong",
                            "middleNames": [
                                "de"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Stuart de Jong"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144309692"
                        ],
                        "name": "John Peyton",
                        "slug": "John-Peyton",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Peyton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John Peyton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2256275"
                        ],
                        "name": "R. Schooler",
                        "slug": "R.-Schooler",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Schooler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Schooler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10794393,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b4cb3217d77b28623da535563d23f913e1aa55c3",
            "isKey": false,
            "numCitedBy": 40,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "Large applications are typically partitioned into separately compiled modules. Large performance gains in these applications are available by optimizing across module boundaries. One barrier to applying crossmodule optimization (CMO) to large applications is the potentially enormous amount of time and space consumed by the optimization process.We describe a framework for scalable CMO that provides large gains in performance on applications that contain millions of lines of code. Two major techniques are described. First, careful management of in-memory data structures results in sub-linear memory occupancy when compared to the number of lines of code being optimized. Second, profile data is used to focus optimization effort on the performance-critical portions of applications. We also present practical issues that arise in deploying this framework in a production environment. These issues include debuggability and compatibility with existing development tools, such as make. Our framework is deployed in Hewlett-Packard's (HP) UNIX compiler products and speeds up shipped independent software vendors' applications by as much as 71%."
            },
            "slug": "Scalable-cross-module-optimization-Ayers-Jong",
            "title": {
                "fragments": [],
                "text": "Scalable cross-module optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A framework for scalable CMO that provides large gains in performance on applications that contain millions of lines of code and is deployed in Hewlett-Packard's UNIX compiler products and speeds up shipped independent software vendors' applications by as much as 71%."
            },
            "venue": {
                "fragments": [],
                "text": "PLDI"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701671"
                        ],
                        "name": "R. Hundt",
                        "slug": "R.-Hundt",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Hundt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hundt"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16074293,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6247d2bf8d34344e7df2c2f9f7e4e870c251c3e7",
            "isKey": false,
            "numCitedBy": 31,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "HP Caliper, a framework for building dynamic instrumentation tools, lets you change program instructions on-the-fly with instrumentation probes. It offers a common framework for building performance analysis tools that can integrate hardware-supported performance measurement unit (PMU) sampling with dynamic instrumentation. This article describes Caliper's architecture, its public interfaces and its dynamic instrumentation algorithm."
            },
            "slug": "HP-Caliper:-a-framework-for-performance-analysis-Hundt",
            "title": {
                "fragments": [],
                "text": "HP Caliper: a framework for performance analysis tools"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "The architecture, its public interfaces and its dynamic instrumentation algorithm are described, which offers a common framework for building performance analysis tools that can integrate hardware-supported performance measurement unit (PMU) sampling withynamic instrumentation."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Concurr."
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1904554"
                        ],
                        "name": "B. Indurkhya",
                        "slug": "B.-Indurkhya",
                        "structuredName": {
                            "firstName": "Bipin",
                            "lastName": "Indurkhya",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Indurkhya"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 78,
                                "start": 64
                            }
                        ],
                        "text": "In order to assess the generality of the predication algorithm, Kintsch (2000) analyzed the first seven examples of nominal metaphors cited in Glucksberg, Gildea & Bookin (1982)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 38
                            }
                        ],
                        "text": "This topic is discussed more fully in Kintsch (2000)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 0
                            }
                        ],
                        "text": "Kintsch (2000) has shown that the predication algorithm yields results in agreement with these intuitions."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 0
                            }
                        ],
                        "text": "Kintsch (2000) did just that."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 110,
                                "start": 96
                            }
                        ],
                        "text": "Two interesting phenomena about the time course of metaphor comprehension are also discussed in Kintsch (2000)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 6
                            }
                        ],
                        "text": "Thus, Kintsch (2000) goes beyond demonstrating that the predication model yields intuitively sensible interpretations of metaphors."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 64190251,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2a2a696661cd2f09901173309e0496ba4f2bf92c",
            "isKey": true,
            "numCitedBy": 19,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-computational-theory-of-metaphor-comprehension-Indurkhya",
            "title": {
                "fragments": [],
                "text": "A computational theory of metaphor comprehension and analogical reasoning (semantics, predicate-calculus, cognitive, artificial intelligence, natural language processing)"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 276,
                                "start": 247
                            }
                        ],
                        "text": "Among the former are Landauer and Dumais (1997), who have discussed vocabulary acquisition as the construction of a semantic space, modeled by LSA; Laham’s (1997) investigation of the emergence of natural categories from the LSA space; and Foltz, Kintsch, & Landauer’s (1998) work on textual coherence."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 219,
                                "start": 213
                            }
                        ],
                        "text": "To mention just three of the practical applications, there is first, the use of LSA to select instructional texts that are appropriate to a student’s level of background knowledge (Wolfe, Schreiner, Rehder, Laham, Foltz, Landauer, & Kintsch, 1998)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 95,
                                "start": 80
                            }
                        ],
                        "text": "Usually, these are described as causal inferences, though some authors, such as Kintsch (1998), argue that the term inference is misleading in this context."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 255,
                                "start": 249
                            }
                        ],
                        "text": "The technique was originally developed in the context of information retrieval (Deerwester, Dumais, Furnas, Landauer, & Harshman, 1990) and was adapted for psycholinguistic analyses by Landauer and his colleagues (Landauer & Dumais, 1997; Landauer, Foltz, & Laham, 1998; Landauer, 1999)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 690,
                                "start": 80
                            }
                        ],
                        "text": "Usually, these are described as causal inferences, though some authors, such as Kintsch (1998), argue that the term inference is misleading in this context. When we read The student washed the table we do not usually, in addition, draw an inference that the table is clean. Rather, comprehending that sentence automatically makes available this information, without any extra processing. Long-term working memory assures that there will be a link between the sentence The student washed the table and its anticipated causal consequence, the table was clean. LSA provides a computational model of how long-term working memory functions in cases like these. Kintsch, Patel, & Ericsson (1999) have argued that the semantic space functions as the retrieval mechanism for working memory."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 0
                            }
                        ],
                        "text": "Kintsch (1988, 1998) has argued that such a theory is required for discourse understanding in general; here, this argument is extended to the mental lexicon, and made precise through the computational power of LSA."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 116,
                                "start": 97
                            }
                        ],
                        "text": "This is achieved by combining LSA with the construction-integration model of text comprehension (Kintsch, 1988, 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 245,
                                "start": 239
                            }
                        ],
                        "text": "Among the former are Landauer and Dumais (1997), who have discussed vocab-\nulary acquisition as the construction of a semantic space, modeled by LSA; Laham’s (1997) investigation of the emergence of natural categories from the LSA space; and Foltz, Kintsch, & Landauer’s (1998) work on textual coherence."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 110,
                                "start": 96
                            }
                        ],
                        "text": "The mint-example comes, in somewhat different form, from a priming experiment by Till, Mross, & Kintsch (1988), where it was the first item in their list of experimental materials."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 78
                            }
                        ],
                        "text": "In order to compute the vector for P(A), the constructionintegration model of Kintsch (1988, 1998) will be used."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The use of knowledge in discourse processing: A constructionintegration model"
            },
            "venue": {
                "fragments": [],
                "text": "Psychological Review, 95, 163-182."
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 6
                            }
                        ],
                        "text": "Thus, WordNet is an extremely ambitious enterprise, hand-crafted with great care."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 230,
                                "start": 218
                            }
                        ],
                        "text": "However, George A. Miller and his colleagues, with WordNet, have made an explicit attempt to catalogue word senses for use in linguistic and psychological research, as well as for artificial intelligence applications (Miller, 1996; Fellbaum, 1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 13
                            }
                        ],
                        "text": "According to WordNet, mint has four meanings as a noun, one as a verb, and one as an adjective."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 142
                            }
                        ],
                        "text": "Gallop was chosen as a landmark that should be closer to horse ran than color ran, and dissolve (a synonym for this sense of run according to WordNet) was chosen to be closer to color ran than to horse ran."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 33
                            }
                        ],
                        "text": "In one case the category name in WordNet was unknown to LSA and in another case it was barely familiar to LSA; the next word listed in the WordNet entry was used as a substitute."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 141,
                                "start": 134
                            }
                        ],
                        "text": "For each homonym noun, two different disambiguating phrases were constructed, using as predicates\nwords from the definitions given in WordNet."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 42
                            }
                        ],
                        "text": "Hand-coding word meanings, as in WordNet (Miller, 1996), or hand-coding a complete lexical knowledge base, as in the CYC project (Lenat & Guha, 1990), has been the traditional approach."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 51,
                                "start": 44
                            }
                        ],
                        "text": "For instance, the verb run has 42 senses in WordNet; in addition, 11 senses are listed for the noun run."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 62
                            }
                        ],
                        "text": "This vector was then compared to landmarks also selected from WordNet—the category names to which each meaning was assigned in WordNet."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 0
                            }
                        ],
                        "text": "WordNet includes over 160,000 words and over 300,000 relations among them."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The science of words. NY: Freeman"
            },
            "venue": {
                "fragments": [],
                "text": "The science of words. NY: Freeman"
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 57,
                                "start": 44
                            }
                        ],
                        "text": "Why was this particular document included in the corpus rather than some other one?"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 0
                            }
                        ],
                        "text": "Kintsch (1988, 1998) has argued that such a theory is required for discourse understanding in general; here, this argument is extended to the mental lexicon, and made precise through the computational power of LSA."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 116,
                                "start": 97
                            }
                        ],
                        "text": "This is achieved by combining LSA with the construction-integration model of text comprehension (Kintsch, 1988, 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 110,
                                "start": 96
                            }
                        ],
                        "text": "The mint-example comes, in somewhat different form, from a priming experiment by Till, Mross, & Kintsch (1988), where it was the first item in their list of experimental materials."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 27
                            }
                        ],
                        "text": "And new documents—sentences, paragraphs, essays, whole book chapters—can also be represented as vectors in this same space."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 78
                            }
                        ],
                        "text": "In order to compute the vector for P(A), the constructionintegration model of Kintsch (1988, 1998) will be used."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The use of knowledge in discourse processing: A construction-integration model"
            },
            "venue": {
                "fragments": [],
                "text": "Psychological Review"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3594249"
                        ],
                        "name": "S. Glucksberg",
                        "slug": "S.-Glucksberg",
                        "structuredName": {
                            "firstName": "Sam",
                            "lastName": "Glucksberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Glucksberg"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 0
                            }
                        ],
                        "text": "Glucksberg (1998) discusses in some detail the metaphor My lawyer is a shark."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 219,
                                "start": 203
                            }
                        ],
                        "text": "Experimental psycholinguistic evidence implies that metaphoric predication is just like any other predication in terms of the psychological processes involved (for reviews see Glucksberg & Keysar, 1994; Glucksberg, 1998; Gibbs, 1994)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 220533118,
            "fieldsOfStudy": [],
            "id": "9d26de22355810b27a6d8d4e77f3ffc8e084d13b",
            "isKey": false,
            "numCitedBy": 65,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Understanding-Metaphors-Glucksberg",
            "title": {
                "fragments": [],
                "text": "Understanding Metaphors"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144263847"
                        ],
                        "name": "J. Deese",
                        "slug": "J.-Deese",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Deese",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Deese"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 105,
                                "start": 94
                            }
                        ],
                        "text": "For instance, r 5\n.38 for the frequency of responses to a list of words related to butterfly (Deese, 1961) and the cosines between the respective words."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 151678639,
            "fieldsOfStudy": [
                "Sociology"
            ],
            "id": "2df91861f99a19fa50a7e00d5694fe5c52dda3cc",
            "isKey": false,
            "numCitedBy": 54,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "From-the-Isolated-Verbal-Unit-to-Connected-Deese",
            "title": {
                "fragments": [],
                "text": "From the Isolated Verbal Unit to Connected Discourse."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "87482741"
                        ],
                        "name": "Gibbs",
                        "slug": "Gibbs",
                        "structuredName": {
                            "firstName": "",
                            "lastName": "Gibbs",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gibbs"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152831719"
                        ],
                        "name": "W. Raymond",
                        "slug": "W.-Raymond",
                        "structuredName": {
                            "firstName": "W",
                            "lastName": "Raymond",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Raymond"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 145289737,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "181558e37b66a5cabaccd833aa0cee9c54175d24",
            "isKey": false,
            "numCitedBy": 173,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Figurative-thought-and-figurative-language.-Gibbs-Raymond",
            "title": {
                "fragments": [],
                "text": "Figurative thought and figurative language."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "114531657"
                        ],
                        "name": "Noam Chomsky",
                        "slug": "Noam-Chomsky",
                        "structuredName": {
                            "firstName": "Noam",
                            "lastName": "Chomsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Noam Chomsky"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 142773619,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "2c78b2262e0009869de3a391add972ecef03c6b9",
            "isKey": false,
            "numCitedBy": 42,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Language-in-a-psychological-setting-Chomsky",
            "title": {
                "fragments": [],
                "text": "Language in a psychological setting"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The role of Long-Term Working Memory in text"
            },
            "venue": {
                "fragments": [],
                "text": "comprehension. Psychologia,"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The role of suppression in metaphor interpretation. Paper presented at the annual meeting of the Psychonomic Society, Los Angeles"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Relatedness of concepts"
            },
            "venue": {
                "fragments": [],
                "text": "Relatedness of concepts"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 219,
                                "start": 209
                            }
                        ],
                        "text": "A long-standing tradition, with roots in the practice of logicians, seeks to generate complex semantic concepts from a set of atomic elements, much as chemical substances are made up of the chemical elements (Katz, 1972; Schank, 1975)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Semantic theory"
            },
            "venue": {
                "fragments": [],
                "text": "Semantic theory"
            },
            "year": 1972
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On understandig nonliteral speech"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Itanium processor family and Elementary Functions, Speed and Precision, Hewlett-Packard Professional Books"
            },
            "venue": {
                "fragments": [],
                "text": "Itanium processor family and Elementary Functions, Speed and Precision, Hewlett-Packard Professional Books"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Compiler for Reducing Number of Indirect Calls in an Executable Code"
            },
            "venue": {
                "fragments": [],
                "text": "U.S. Patent"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The role of suppression in metaphor interpretation"
            },
            "venue": {
                "fragments": [],
                "text": "Paper presented at the annual meeting of the Psychonomic Society"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "IA-64 Software Conventions and Runtime Architecture"
            },
            "venue": {
                "fragments": [],
                "text": "IA-64 Software Conventions and Runtime Architecture"
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Intelligent Loop Unrolling U.S. patent 5,797,013 to Hewlett-Packard Co., Patent and Trademark Office"
            },
            "venue": {
                "fragments": [],
                "text": "Intelligent Loop Unrolling U.S. patent 5,797,013 to Hewlett-Packard Co., Patent and Trademark Office"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 93
                            }
                        ],
                        "text": "Together with the examples presented in Table 3, the analysis of the stimulus materials from Singer et al. (1992) suggests that predication can give a satisfactory account of causal inferences in comprehension."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 26
                            }
                        ],
                        "text": "In this well-known study, Singer et al. (1992) provided evidence that causal bridging inferences were made during reading."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Validation of causal"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Method of Prefetching Data for References with Multiple Stride Directions, U.S. patent 5,752,037 to Hewlett-Packard Co., Patent and Trademark Office"
            },
            "venue": {
                "fragments": [],
                "text": "Method of Prefetching Data for References with Multiple Stride Directions, U.S. patent 5,752,037 to Hewlett-Packard Co., Patent and Trademark Office"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Libm Library and Floating Point Arithmetic in HP-UX for Itanium-Based Systems"
            },
            "venue": {
                "fragments": [],
                "text": "The Libm Library and Floating Point Arithmetic in HP-UX for Itanium-Based Systems"
            },
            "year": 2003
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Global Control Flow Treatment of Predicated Code"
            },
            "venue": {
                "fragments": [],
                "text": "195 to Hewlett-Packard Co., Patent and Trademark Office"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Efficient Explicit Data Prefetching Analysis and Code Generation in a Low-level Optimizer for Inserting Prefetch Instructions into Loops of Applications"
            },
            "venue": {
                "fragments": [],
                "text": "Patent and Trademark Office"
            },
            "year": 1999
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 18,
            "methodology": 7,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 57,
        "totalPages": 6
    },
    "page_url": "https://www.semanticscholar.org/paper/Predication-Kintsch/040a6d4542111c1b6161533aa0818c0b025505a0?sort=total-citations"
}