{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144592244"
                        ],
                        "name": "J. Tenenbaum",
                        "slug": "J.-Tenenbaum",
                        "structuredName": {
                            "firstName": "Jay",
                            "lastName": "Tenenbaum",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tenenbaum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696931"
                        ],
                        "name": "H. Barrow",
                        "slug": "H.-Barrow",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Barrow",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barrow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60510746,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d625945e6c7dc923d98feeeab91de19107130c83",
            "isKey": false,
            "numCitedBy": 87,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : MSYS is a system for reasoning with uncertain information and inexact rules of inference. Its major application, to date, has been to the interpretation of visual features (such as regions) in scene analysis. In this application, features are assigned sets of possible interpretations with associated likelihoods based on local attributes (e.g., color, size, and shape). Interpretations are related by rules of inference that adjust the likelihoods up or down in accordance with the interpretation likelihoods of related features. An asynchronous relaxation process repeatedly applies the rules until a consistent set of likelihood values is attained. At this point, several alternative interpretations still exist for each feature. One feature is chosen and the most likely of its alternatives is assumed. The rules are then used in this more precise context to determine likelihoods for the interpretations of remaining features by a further round of relaxation. The selection and relaxation steps are repeated until all features have been interpreted."
            },
            "slug": "MSYS:-A-System-for-Reasoning-About-Scenes.-Tenenbaum-Barrow",
            "title": {
                "fragments": [],
                "text": "MSYS: A System for Reasoning About Scenes."
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "MSYS is a system for reasoning with uncertain information and inexact rules of inference that contributes to the interpretation of visual features in scene analysis by repeatedly applying rules until a consistent set of likelihood values is attained."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144592244"
                        ],
                        "name": "J. Tenenbaum",
                        "slug": "J.-Tenenbaum",
                        "structuredName": {
                            "firstName": "Jay",
                            "lastName": "Tenenbaum",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tenenbaum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145440080"
                        ],
                        "name": "S. Weyl",
                        "slug": "S.-Weyl",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Weyl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Weyl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7835587,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "25a53745f7e6d39d223ccfae0099dc3efbbf0a26",
            "isKey": false,
            "numCitedBy": 20,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "An Interactive Scene Interpretation System (ISIS) is being developed by Stanford Research Institute's Artificial Intelligence Center as a tool for constructing and experimenting with man-achine and automatic scene analysis methods tailored for particular image domains. A region analysis subsystem was developed recently based on the work of Brice and Fennema, and Yaklmovsky. Using this subsystem a series of experiments was conducted to determine good criteria for initially partitioning a scene into atomic regions and merging these regions into a final partition of the scene along object boundaries. Semantic (problem-dependent) knowledge is essential for complete, correct partitionis of complex real-world scenes. An interactive approach to semantic scene segmentation was developed and demonstrated on both landscape and indoor scenes. This approach provides a reasonable methodology for segmenting scenes that cannot be processed completely automatically at present and Is a promising basis for a future fully automatic system."
            },
            "slug": "A-Region-Analysis-Subsystem-For-Interactive-Scene-Tenenbaum-Weyl",
            "title": {
                "fragments": [],
                "text": "A Region-Analysis Subsystem For Interactive Scene Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "An interactive approach to semantic scene segmentation was developed and demonstrated on both landscape and indoor scenes and provides a reasonable methodology for segmenting scenes that cannot be processed completely automatically at present and is a promising basis for a future fully automatic system."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 40175393,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aa4b60b5847999c2f778e3e67ca1f2201e396abb",
            "isKey": false,
            "numCitedBy": 1004,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "An introduction is given to a theory of early visual information processing. The theory has been implemented, and examples are given of images at various stages of analysis. It is argued that the first step of consequence is to compute a primitive but rich description of the grey-level changes present in an image. The description is expressed in a vocabulary of kinds of intensity change (EDGE, SHADING-EDGE, EXTENDED-EDGE, LINE, BLOB etc.). Modifying parameters are bound to the elements in the description, specifying their POSITION, ORIENTATION, TERMINATION points, CONTRAST, SIZE and FUZZINESS. This description is obtained from the intensity array by fixed techniques, and it is called the primal sketch. For most images, the primal sketch is large and unwieldy. The second important step in visual information processing is to group its contents in a way that is appropriate for later recognition. From our ability to interpret drawings with little semantic content, one may infer the presence in our perceptual equipment of symbolic processes that can define \"place-tokens\" in an image in various ways, and can group them according to certain rules. Homomorphic techniques fail to account for many of these grouping phenomena, whose explanations require mechanisms of construction rather than mechanisms of detection. The necessary grouping of elements in the primal sketch may be achieved by a mechanism that has available the processes inferred from above, together with the ability to select items by first order discriminations acting on the elements' parameters. Only occasionally do these mechanisms use downward-flowing information about the contents of the particular image being processed. It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch. The class of computations so obtained differs slightly from the class of second order operations on the intensity array. The extraction of a form from the primal sketch using these techniques amounts to the separation of figure from ground. It is concluded that most of the separation can be carried out by using techniques that do not depend upon the particular image in question. Therefore, figure-ground separation can normally precede the description of the shape of the extracted form. Up to this point, higher-level knowledge and purpose are brought to bear on only a few of the decisions taken during the processing. This relegates the widespread use of downward-flowing information to a later stage than is found in current machine-vision programs, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "slug": "Early-processing-of-visual-information.-Marr",
            "title": {
                "fragments": [],
                "text": "Early processing of visual information."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2739823"
                        ],
                        "name": "T. Garvey",
                        "slug": "T.-Garvey",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Garvey",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Garvey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144592244"
                        ],
                        "name": "J. Tenenbaum",
                        "slug": "J.-Tenenbaum",
                        "structuredName": {
                            "firstName": "Jay",
                            "lastName": "Tenenbaum",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tenenbaum"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58883556,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c9291961be71c864fe8b49613e71758e76be2209",
            "isKey": false,
            "numCitedBy": 4,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : One of the most time-consuming and labor-intensive steps in map production involves the delineation of cartographic and cultural features such as lakes, rivers, roads, and drainage areas in aerial photographs. These features are usually traced manually on a digitizing table in painstaking detail. This paper investigates an alternative approach, an interactive system that eliminates the need for detailed tracing. A human operator graphically designates a feature of interest by pointing at it or crudely tracing it with a display cursor. Using this input as a guide, the system employs context-dependent, scene-analysis techniques to extract a detailed outline of the feature. The results are displayed so that errors can be corrected by further interaction, for example, by tracing small sections of the boundary in detail. This interactive approach appears applicable to many other problem domains involving large quantities of graphic or pictorial data, which are difficult to extract in digital form by either strictly manual or strictly automatic means."
            },
            "slug": "Application-of-Interactive-Scene-Analysis-to-Garvey-Tenenbaum",
            "title": {
                "fragments": [],
                "text": "Application of Interactive Scene Analysis Techniques to Cartography"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "This paper investigates an alternative approach, an interactive system that eliminates the need for detailed tracing of cartographic and cultural features in aerial photographs, and appears applicable to many other problem domains involving large quantities of graphic or pictorial data."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30489560"
                        ],
                        "name": "R. Hummel",
                        "slug": "R.-Hummel",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Hummel",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hummel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18603445,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5df9cdc54c8085781c4199a95576a14cb7198b9d",
            "isKey": false,
            "numCitedBy": 1518,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Given a set of objects in a scene whose identifications are ambiguous, it is often possible to use relationships among the objects to reduce or eliminate the ambiguity. A striking example of this approach was given by Waltz [13]. This paper formulates the ambiguity-reduction process in terms of iterated parallel operations (i.e., relaxation operations) performed on an array of (object, identification) data. Several different models of the process are developed, convergence properties of these models are established, and simple examples are given."
            },
            "slug": "Scene-Labeling-by-Relaxation-Operations-Rosenfeld-Hummel",
            "title": {
                "fragments": [],
                "text": "Scene Labeling by Relaxation Operations"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper formulates the ambiguity-reduction process in terms of iterated parallel operations (i.e., relaxation operations) performed on an array of object, identification data."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Systems, Man, and Cybernetics"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34622292"
                        ],
                        "name": "F. Tomita",
                        "slug": "F.-Tomita",
                        "structuredName": {
                            "firstName": "Fumiaki",
                            "lastName": "Tomita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Tomita"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1735941"
                        ],
                        "name": "M. Yachida",
                        "slug": "M.-Yachida",
                        "structuredName": {
                            "firstName": "Masahiko",
                            "lastName": "Yachida",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Yachida"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143873014"
                        ],
                        "name": "S. Tsuji",
                        "slug": "S.-Tsuji",
                        "structuredName": {
                            "firstName": "Saburo",
                            "lastName": "Tsuji",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Tsuji"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2053871,
            "fieldsOfStudy": [
                "Sociology"
            ],
            "id": "634c1d31dac28287b4968130ee6b7d289020e090",
            "isKey": false,
            "numCitedBy": 34,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "A method is proposed for partitioning input scenes into regions in which selected picture properties are regarded as uniform. In this procedure, usual statistical methods of inspecting average gray levels are not used, but the uniformity of complex picture properties such as shapes, sizes or arrangements of subpatterns in the pictures is examined by a structural analysis. The analyzing process is controlled by a supervisor which gives the order of changing the depth of interest in each picture property, and successive partitioning of the pictures is made toward an interpretable goal partition."
            },
            "slug": "Detection-of-Homogeneous-Regions-by-Structural-Tomita-Yachida",
            "title": {
                "fragments": [],
                "text": "Detection of Homogeneous Regions by Structural Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "A method is proposed for partitioning input scenes into regions in which selected picture properties are regarded as uniform, and the uniformity of complex picture properties such as shapes, sizes or arrangements of subpatterns in the pictures is examined by a structural analysis."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2289828"
                        ],
                        "name": "C. Harlow",
                        "slug": "C.-Harlow",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Harlow",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Harlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "17067783"
                        ],
                        "name": "S. Eisenbeis",
                        "slug": "S.-Eisenbeis",
                        "structuredName": {
                            "firstName": "Sharon",
                            "lastName": "Eisenbeis",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Eisenbeis"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1634929,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "68d544cae4b21c3a17ef8bcd141d46c7ea92c04e",
            "isKey": false,
            "numCitedBy": 72,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem considered is the development of a method of scene analysis that employs a descriptive approach in the analysis of pictures. In an effort to facilitate implementation of the algorithm to a wide range of picture classes, a description of the scene is read in as data in the form of a tree structure that guides the search for objects from the largest to the smallest. The algorithm has the following features: the analysis of the scene is top-down; feature extraction and pattern recognition are combined in a reinforcing system; the algorithm contains a description of the class of scenes to be analyzed; region enumeration techniques are used in primitive object identification; principal parameters in the program are self-adjusting; and the concept of ``field of vision'' is used to locate the boundaries of objects. The algorithm has been implemented and tested on posteroanterior (PA) chest radiograms, anteroposterior (AP) knee radiograms, and lateral brain scans. The analysis of PA chest radiograms is used to describe the implementation of the program. To date, the algorithm has been tested only on radiographic images; however, the method should also be applicable to other image classes."
            },
            "slug": "The-Analysis-of-Radiographic-Images-Harlow-Eisenbeis",
            "title": {
                "fragments": [],
                "text": "The Analysis of Radiographic Images"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "The problem considered is the development of a method of scene analysis that employs a descriptive approach in the analysis of pictures, and a description of the scene is read in as data in the form of a tree structure that guides the search for objects from the largest to the smallest."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16870859"
                        ],
                        "name": "Claude R. Brice",
                        "slug": "Claude-R.-Brice",
                        "structuredName": {
                            "firstName": "Claude",
                            "lastName": "Brice",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Claude R. Brice"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2489024"
                        ],
                        "name": "C. Fennema",
                        "slug": "C.-Fennema",
                        "structuredName": {
                            "firstName": "Claude",
                            "lastName": "Fennema",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Fennema"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32106281,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e4849a436ae52d69fcf8df14d62aa7dd15a636a5",
            "isKey": false,
            "numCitedBy": 451,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Scene-Analysis-Using-Regions-Brice-Fennema",
            "title": {
                "fragments": [],
                "text": "Scene Analysis Using Regions"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696931"
                        ],
                        "name": "H. Barrow",
                        "slug": "H.-Barrow",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Barrow",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barrow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144592244"
                        ],
                        "name": "J. Tenenbaum",
                        "slug": "J.-Tenenbaum",
                        "structuredName": {
                            "firstName": "Jay",
                            "lastName": "Tenenbaum",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tenenbaum"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 18160484,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c21db7f8ddc1f6fec26601012fa50b82aaf96b03",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper summarizes the present state of research in scene analysis. It identifies fundamental information processing principles relevant to representation and Use of knowledge in vision and traces limitations of existing progams to compromises of these principles necessitated by extant processors Some specific and general recommendations are offered regarding a productive course of research for the next decade."
            },
            "slug": "Representation-and-use-of-knowledge-in-vision-Barrow-Tenenbaum",
            "title": {
                "fragments": [],
                "text": "Representation and use of knowledge in vision"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "This paper summarizes the present state of research in scene analysis and identifies fundamental information processing principles relevant to representation and Use of knowledge in vision and traces limitations of existing progams to compromises of these principles necessitated by extant processors."
            },
            "venue": {
                "fragments": [],
                "text": "SGAR"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733922"
                        ],
                        "name": "A. Hanson",
                        "slug": "A.-Hanson",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Hanson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Hanson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31338632"
                        ],
                        "name": "E. Riseman",
                        "slug": "E.-Riseman",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Riseman",
                            "middleNames": [
                                "M."
                            ],
                            "suffix": ""
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Riseman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3231529"
                        ],
                        "name": "P. Nagin",
                        "slug": "P.-Nagin",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Nagin",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Nagin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 126749046,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "077dc845fa51fd105d694f458a7c6d59f48044f6",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Some progress has been made in scene analysis in finding boundaries between textured objects. However, standard line-finding and region growing algorithms have not been able to deal with strong local variations of intensity and color that repeat themselves more globally in images of natural scenes. These problems are significant with respect to both micro-texture, say the leaves of a tree, as well as macro-texture, the light green of leafy branches vs. dark green or black shadows between branches in a tree. How can local variations be globally bound together into a cohesive region for perceptual identification. The approach that is being examined involves the reduction in size of the image while extracting features such as intensity, color, and color variation in local windows across the image."
            },
            "slug": "Region-Growing-in-Textured-Outdoor-Scenes.-Hanson-Riseman",
            "title": {
                "fragments": [],
                "text": "Region Growing in Textured Outdoor Scenes."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46720503"
                        ],
                        "name": "M. Thurston",
                        "slug": "M.-Thurston",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Thurston",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Thurston"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 206618628,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c901dd790abcb04f258ea29655a8a8401c715fca",
            "isKey": false,
            "numCitedBy": 770,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Simple sets of parallel operations are described which can be used to detect texture edges, \"spots,\" and \"streaks\" in digitized pictures. It is shown that, by comparing the outputs of the operations corresponding to (e.g.,) edges of different sizes, one can construct a composite output in which edges between differently textured regions are detected, and isolated objects are also detected, but the objects composing the textures are ignored. Relationships between this class of picture processing operations and the Gestalt psychologists' laws of pictorial pattern organization are also discussed."
            },
            "slug": "Edge-and-Curve-Detection-for-Visual-Scene-Analysis-Rosenfeld-Thurston",
            "title": {
                "fragments": [],
                "text": "Edge and Curve Detection for Visual Scene Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "Simple sets of parallel operations are described which can be used to detect texture edges, \"spots,\" and \"streaks\" in digitized pictures and it is shown that a composite output is constructed in which edges between differently textured regions are detected, and isolated objects are also detected, but the objects composing the textures are ignored."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1735941"
                        ],
                        "name": "M. Yachida",
                        "slug": "M.-Yachida",
                        "structuredName": {
                            "firstName": "Masahiko",
                            "lastName": "Yachida",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Yachida"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143873014"
                        ],
                        "name": "S. Tsuji",
                        "slug": "S.-Tsuji",
                        "structuredName": {
                            "firstName": "Saburo",
                            "lastName": "Tsuji",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Tsuji"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 13563242,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c92cdc457f675b3856f2c4244baf1aa64b24134b",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Application-of-color-information-to-visual-Yachida-Tsuji",
            "title": {
                "fragments": [],
                "text": "Application of color information to visual perception"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1788375"
                        ],
                        "name": "D. Waltz",
                        "slug": "D.-Waltz",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Waltz",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Waltz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60864834,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e1596adff54c958816e5a10d33e69f13a4d8afc5",
            "isKey": false,
            "numCitedBy": 546,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "This report reproduces a thesis of the same title submitted to the Department of Electrical Engineering, Massachusetts Institute of Technology, in partial fulfillment of the requirements for the degree of Doctor of Philosophy, September 1972."
            },
            "slug": "Generating-Semantic-Descriptions-From-Drawings-of-Waltz",
            "title": {
                "fragments": [],
                "text": "Generating Semantic Descriptions From Drawings of Scenes With Shadows"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This report reproduces a thesis of the same title submitted to the Department of Electrical Engineering, Massachusetts Institute of Technology, in partial fulfillment of the requirements for the degree of Doctor of Philosophy, September 1972."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3071950"
                        ],
                        "name": "Y. Yakimovsky",
                        "slug": "Y.-Yakimovsky",
                        "structuredName": {
                            "firstName": "Yoram",
                            "lastName": "Yakimovsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Yakimovsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2165973"
                        ],
                        "name": "J. Feldman",
                        "slug": "J.-Feldman",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Feldman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Feldman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18074297,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4178fe9655963e9b361fed0a27b497b04cc480d5",
            "isKey": false,
            "numCitedBy": 86,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of breaking an image into meaningful regions is considered. Bayesian decision theory is seen to provide a mechanism for including problem dependent (semantic) information in a general system. Some results are presented which make the computation feasible. A programming system based on these ideas and their application to road scenes is described."
            },
            "slug": "A-Semantics-Based-Decision-Theory-Region-Analyser-Yakimovsky-Feldman",
            "title": {
                "fragments": [],
                "text": "A Semantics-Based Decision Theory Region Analyser"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "Bayesian decision theory is seen to provide a mechanism for including problem dependent (semantic) information in a general system and a programming system based on these ideas and their application to road scenes is described."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153744594"
                        ],
                        "name": "K. Paton",
                        "slug": "K.-Paton",
                        "structuredName": {
                            "firstName": "Keith",
                            "lastName": "Paton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Paton"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121184991,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4f924a05679419b34d175a19fa49c1fac10c49f3",
            "isKey": false,
            "numCitedBy": 35,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Picture-Description-Using-Legendre-Polynomials-Paton",
            "title": {
                "fragments": [],
                "text": "Picture Description Using Legendre Polynomials"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144497046"
                        ],
                        "name": "N. Nilsson",
                        "slug": "N.-Nilsson",
                        "structuredName": {
                            "firstName": "Nils",
                            "lastName": "Nilsson",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Nilsson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 109459767,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1637740dab9d473f97c9aa5dccd59f4cb99ee802",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : This report describes the work to develop a computer based consultant (CBC) system. The system is being designed to talk (in ordinary English) with a human user to help him perform tasks entailing maintenance and troubleshooting of electromechanical equipment. Our current (April 1975) demonstration system is a base for future systems and already illustrates abilities to interact with an apprentice to help him assemble a small air compressor. The body of the report is divided into two major sections. One of these describes the technology behind the April 1975 demonstration system. The other describes work in progress that will contribute to the power and versatility of future demonstration systems. Our 1975 system has the following specific abilities: It can generate and execute plans for assembly/disassembly at several levels of detail. It can answer queries from the apprentice about the status of the equipment. It can point at parts of the compressor and can name parts pointed to by the apprentice. It has a rudimentary ability for two-way communication using speech. The basis for each of these is described in detail. Work supporting subsequent systems has been in the area of natural language understanding, modeling, troubleshooting, and vision. The report also describes progress on some supporting activities including the SRI Artificial Intelligence Center Computer Facility, the language QLISP, hardware interface work, and a scanning laser range finder."
            },
            "slug": "Artificial-Intelligence-Research-and-Applications-Nilsson",
            "title": {
                "fragments": [],
                "text": "Artificial Intelligence - Research and Applications"
            },
            "tldr": {
                "abstractSimilarityScore": 81,
                "text": "The work to develop a computer based consultant (CBC) system is being designed to talk (in ordinary English) with a human user to help him perform tasks entailing maintenance and troubleshooting of electromechanical equipment."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3071950"
                        ],
                        "name": "Y. Yakimovsky",
                        "slug": "Y.-Yakimovsky",
                        "structuredName": {
                            "firstName": "Yoram",
                            "lastName": "Yakimovsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Yakimovsky"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 207928918,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5e14ce53553dcd8c3d6ea84ef161484c5cf51b95",
            "isKey": false,
            "numCitedBy": 5,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "An approach to simultaneous interpretation of objects in complex structures so as to maximize a combined utility function is presented. Results of the application of a computer software system to assign meaning to regions in a segmented image based on the principles described in this paper and on a special interactive sequential classification learning system, which is referenced, are demonstrated."
            },
            "slug": "On-the-recognition-of-complex-structures:-Computer-Yakimovsky",
            "title": {
                "fragments": [],
                "text": "On the recognition of complex structures: Computer software using artificial intelligence applied to pattern recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "Results of the application of a computer software system to assign meaning to regions in a segmented image based on the principles described in this paper and on a special interactive sequential classification learning system, which is referenced, are demonstrated."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784213"
                        ],
                        "name": "R. Bajcsy",
                        "slug": "R.-Bajcsy",
                        "structuredName": {
                            "firstName": "Ruzena",
                            "lastName": "Bajcsy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bajcsy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6771929,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5fe2197c211d5f8c52e0039e047be5fd249f7e3b",
            "isKey": false,
            "numCitedBy": 121,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "This work deals with computer analysis of textured surfaces. Descriptions of textures are formalized from natural language descriptions. Local texture descriptions are obtained from the directional and non-directional components of the Fourier transform power spectrum. Analytic expressions are derived for orientation, contrast, size, spacing, and in periodic cases, the locations of texture elements. The local descriptions are defined over windows of varying sizes."
            },
            "slug": "Computer-Description-of-Textured-Surfaces-Bajcsy",
            "title": {
                "fragments": [],
                "text": "Computer Description of Textured Surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 85,
                "text": "This work deals with computer analysis of textured surfaces with descriptions of textures formalized from natural language descriptions obtained from the directional and non-directional components of the Fourier transform power spectrum."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46720503"
                        ],
                        "name": "M. Thurston",
                        "slug": "M.-Thurston",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Thurston",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Thurston"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16569498"
                        ],
                        "name": "Yung-Han Lee",
                        "slug": "Yung-Han-Lee",
                        "structuredName": {
                            "firstName": "Yung-Han",
                            "lastName": "Lee",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yung-Han Lee"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41189233,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6235e43ee4df4b329befa54eddf8a4b76aa1a83b",
            "isKey": false,
            "numCitedBy": 120,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "Further work is described on simple sets of parallel operations that detect \"texture edges\" (abrupt discontinuities in the average values of local picture properties), as well as spots or streaks that are texturally different from their surrounds."
            },
            "slug": "Edge-and-Curve-Detection:-Further-Experiments-Rosenfeld-Thurston",
            "title": {
                "fragments": [],
                "text": "Edge and Curve Detection: Further Experiments"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Further work is described on simple sets of parallel operations that detect \"texture edges\" (abrupt discontinuities in the average values of local picture properties), as well as spots or streaks that are texturally different from their surrounds."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3286763"
                        ],
                        "name": "A. G. Wacker",
                        "slug": "A.-G.-Wacker",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Wacker",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. G. Wacker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1773449"
                        ],
                        "name": "D. Landgrebe",
                        "slug": "D.-Landgrebe",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Landgrebe",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Landgrebe"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62194858,
            "fieldsOfStudy": [
                "Environmental Science",
                "Mathematics"
            ],
            "id": "79fd02577bf438a61cf7f1fa5a719561f569f335",
            "isKey": false,
            "numCitedBy": 12,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "In classifying multispectral, digitized, pictorial data it is necessary to locate spatial boundaries in the data to assist the researcher in the selection of training and test samples. Applications also exist in the areas of data compression, information storage and retrieval, sample classification schemes and image registration."
            },
            "slug": "Boundaries-in-multispectral-imagery-by-clustering-Wacker-Landgrebe",
            "title": {
                "fragments": [],
                "text": "Boundaries in multispectral imagery by clustering"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "In classifying multispectral, digitized, pictorial data it is necessary to locate spatial boundaries in the data to assist the researcher in the selection of training and test samples."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1995602019"
                        ],
                        "name": "J. Gupta",
                        "slug": "J.-Gupta",
                        "structuredName": {
                            "firstName": "Jai",
                            "lastName": "Gupta",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gupta"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 222363292,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "58c456a854fcf3dfc651d91f1828ab11496e5928",
            "isKey": false,
            "numCitedBy": 4,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "MULTI-IMAGE-MODELING.-Gupta",
            "title": {
                "fragments": [],
                "text": "MULTI-IMAGE MODELING."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Artificial Intelligence--Research and Applications Artificial Intelligence Center"
            },
            "venue": {
                "fragments": [],
                "text": "Artificial Intelligence--Research and Applications Artificial Intelligence Center"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Analysis of Curved Line Drawings Using Context and Global Information"
            },
            "venue": {
                "fragments": [],
                "text": "Machine Intelligence"
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Some Current Techniques for Scene Analysis"
            },
            "venue": {
                "fragments": [],
                "text": "Technical Note Artificial Intelligence Center"
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Analysis of Natural Images"
            },
            "venue": {
                "fragments": [],
                "text": "Analysis of Natural Images"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Multispectral Image Partitioning, 'I Information Note 071373, Laboratory for Application of Remote SenSing"
            },
            "venue": {
                "fragments": [],
                "text": "Multispectral Image Partitioning, 'I Information Note 071373, Laboratory for Application of Remote SenSing"
            },
            "year": 1973
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Experimental Evaluation of Techniques for Automatic Segmentation of Objects in a Complex Scene"
            },
            "venue": {
                "fragments": [],
                "text": "Pictorial Pattern Recognition, Cheng et a1"
            },
            "year": 1968
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 27,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/Experiments-in-Interpretation-Guided-Segmentation-Tenenbaum-Barrow/9c3568f321c91c405a0805db26e89ceaa7252b43?sort=total-citations"
}