{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2558670"
                        ],
                        "name": "J. Lambek",
                        "slug": "J.-Lambek",
                        "structuredName": {
                            "firstName": "Joachim",
                            "lastName": "Lambek",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lambek"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 123801856,
            "fieldsOfStudy": [
                "Computer Science",
                "Linguistics"
            ],
            "id": "069ca4d3ce5fdcdad511ec6cb1a6bb5fccf1f298",
            "isKey": false,
            "numCitedBy": 1512,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "The aim of this paper is to obtain an effective rule (or algorithm) for distinguishing sentences from nonsentences, which works not only for the formal languages of interest to the mathematical logician, but also for natural languages such as English, or at least for fragments of such languages. An attempt to formulate such an algorithm is implicit in the work of Ajdukiewicz (1935). His method, later elaborated by Bar-Hillel (1953), depends on a kind of arithmetization of the so-called parts of speech, here called syntactic types."
            },
            "slug": "The-Mathematics-of-Sentence-Structure-Lambek",
            "title": {
                "fragments": [],
                "text": "The Mathematics of Sentence Structure"
            },
            "tldr": {
                "abstractSimilarityScore": 88,
                "text": "An effective rule (or algorithm) for distinguishing sentences from nonsentences is obtained, which works not only for the formal languages of interest to the mathematical logician, but also for natural languages such as English, or at least for fragments of such languages."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2059549445"
                        ],
                        "name": "G. B. M.",
                        "slug": "G.-B.-M.",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "M.",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. B. M."
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 16
                            }
                        ],
                        "text": "Toba Batak (see Schachter (1984), Cole and Hermon (2008), Keenan (2009)) is a simple example of a structure type characteristic of West Austronesian languages (Tagalog in the Philippines, Malagasy in Madagascar)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 3968592,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "aae199b92e0863fd6c78351fdad2f0f0b2dd7ff8",
            "isKey": false,
            "numCitedBy": 551,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "THIS work contains some thousands of propositions, each, with its proof, expressed in a shorthand so concise that if they were all expanded into ordinary language, the room taken up would be ten times as large at least; space, time, and mass are not considered at all, and arithmetic is merely foreshadowed by the introduction of the symbols o, 1, 2, and 2, How then, it may be asked, can the authors pretend to be writing about mathematics? The answer amounts to saying that for every branch of the tree of knowledge there is a corresponding root, and every advance in climbing seems to compel a similar advance in delving. Just as the discovery of non-Euclidean geometries led to the reconsideration of geometrical axioms, so Cantor's invention of transfinite numbers has reacted upon the theory of elementary arithmetic, and hence upon the whole of analysis and all its applications.Principia Mathematica.By Dr. A. N. Whitehead B. Russell. Vol. i. Pp. xv + 666. (Cambridge: University Press, 1910.) Price 25s. net."
            },
            "slug": "Principia-Mathematica-G.B.",
            "title": {
                "fragments": [],
                "text": "Principia Mathematica"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1911
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "73507582"
                        ],
                        "name": "D. Gabby",
                        "slug": "D.-Gabby",
                        "structuredName": {
                            "firstName": "Dov",
                            "lastName": "Gabby",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gabby"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145340450"
                        ],
                        "name": "R. Owens",
                        "slug": "R.-Owens",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Owens",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Owens"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 3979050,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "14b59ec3d034de8aa32297713ffbec3f957001c8",
            "isKey": false,
            "numCitedBy": 63,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "AN excellent manual, combining an adequate account of the old logic with a good exposition of modern developments. As becomes a logician, Mr. Sidgwick divides his hook into parts and smaller sections, with admirable system and sequence. Part i. deals with the syllogism in all its forms, also with induction and fallacies, in which matters the author follows Mill for the most part. Interesting illustrations are chosen, and the treatment renders the text as readable as circumstances allow. It is admittedly impossible to make “Barbara” and her associates look anything but dull, however they are dressed up; but logic (as Browning said of his own poetry) is “not a substitute for dominoes”, so the student will no doubt struggle through. Mr. Sidgwick gets the dull part disposed of as quickly as thoroughness will allow. In Part ii. we reach the more interesting and “live” part. The modern point of view is adopted, and formal logic is shown to establish only validity and not truth, because there is always something assumed. Further, classes are man-made, not nature-made; and, as we cannot say all that can be said about S, S may be in one class in certain of its relations, and in another when others of its aspects are being considered. Briefly, truth is relative to purpose. And proof is never coercive. The new logical method is modest. It looks forward with confidence, however, to a “great increase in the effectiveness of an appeal to facts against the verbalism which springs from uncritical acceptance of the abstract laws of thought”.Elementary Logic.By A. Sidgwick. Pp. x + 250. (Cambridge University Press, 1914.) Price 3s. 6d. net."
            },
            "slug": "Elementary-Logic-Gabby-Owens",
            "title": {
                "fragments": [],
                "text": "Elementary Logic"
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "An excellent manual, combining an adequate account of the old logic with a good exposition of modern developments, and looks forward with confidence to a “great increase in the effectiveness of an appeal to facts against the verbalism which springs from uncritical acceptance of the abstract laws of thought”."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1914
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2066231464"
                        ],
                        "name": "Sidneyf Elder",
                        "slug": "Sidneyf-Elder",
                        "structuredName": {
                            "firstName": "Sidneyf",
                            "lastName": "Elder",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sidneyf Elder"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13826462,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "95bae20554a0cb6f27930f83c748df598cac8dbd",
            "isKey": false,
            "numCitedBy": 156,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Elements-of-Set-Theory-Elder",
            "title": {
                "fragments": [],
                "text": "Elements of Set Theory"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2079681794"
                        ],
                        "name": "A. Turing",
                        "slug": "A.-Turing",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Turing",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Turing"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 73712,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ab7790485f26ce65f9d83dd700c43e49058bdd2b",
            "isKey": false,
            "numCitedBy": 8056,
            "numCiting": 139,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Computing machines. 2. Definitions. Automatic machines. Computing machines. Circle and circle-free numbers. Computable sequences and numbers. 3. Examples of computing machines. 4. Abbreviated tables Further examples. 5. Enumeration of computable sequences. 6. The universal computing machine. 7. Detailed description of the universal machine. 8. Application of the diagonal process. Pagina 1 di 38 On computable numbers, with an application to the Entscheidungsproblem A. M. ..."
            },
            "slug": "On-computable-numbers,-with-an-application-to-the-Turing",
            "title": {
                "fragments": [],
                "text": "On computable numbers, with an application to the Entscheidungsproblem"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This chapter discusses the application of the diagonal process of the universal computing machine, which automates the calculation of circle and circle-free numbers."
            },
            "venue": {
                "fragments": [],
                "text": "Proc. London Math. Soc."
            },
            "year": 1937
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49746664"
                        ],
                        "name": "W. Craig",
                        "slug": "W.-Craig",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Craig",
                            "middleNames": [
                                "Lane"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Craig"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28758306,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c45877ff654f6dc3a2e3b9381a7c50669195e592",
            "isKey": false,
            "numCitedBy": 608,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "One task of metamathematics is to relate suggestive but nonelementary modeltheoretic concepts to more elementary proof-theoretic concepts, thereby opening up modeltheoretic problems to proof-theoretic methods of attack. Herbrand's Theorem (see [8] or also [9], vol. 2) or Gentzen's Extended Hauptsatz (see [5] or also [10]) was first used along these lines by Beth [1]. Using a modified version he showed that for all first-order systems a certain modeltheoretic notion of definability coincides with a certain proof theoretic notion. In the present paper the Herbrand-Gentzen Theorem will be applied to generalize Beth's results from primitive predicate symbols to arbitrary formulas and terms. This may be interpreted as showing that (apart from some relatively minor exceptions which will be made apparent below) the expressive power of each first-order system is rounded out, or the system is functionally complete , in the following sense: Any functional relationship which obtains between concepts that are expressible in the system is itself expressible and provable in the system. A second application is concerned with the hierarchy of second-order formulas. A certain relationship is shown to hold between first-order formulas and those second-order formulas which are of the form (∃T 1 )…(∃T k )A or (T 1 )…(T k )A with A being a first-order formula. Modeltheoretically this can be regarded as a relationship between the class AC and the class PC ⊿ of sets of models, investigated by Tarski in [12] and [13]."
            },
            "slug": "Three-Uses-of-the-Herbrand-Gentzen-Theorem-in-Model-Craig",
            "title": {
                "fragments": [],
                "text": "Three Uses of the Herbrand-Gentzen Theorem in Relating Model Theory and Proof Theory"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The Herbrand-Gentzen Theorem will be applied to generalize Beth's results from primitive predicate symbols to arbitrary formulas and terms, showing that the expressive power of each first-order system is rounded out, or the system is functionally complete."
            },
            "venue": {
                "fragments": [],
                "text": "J. Symb. Log."
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144144981"
                        ],
                        "name": "A. Church",
                        "slug": "A.-Church",
                        "structuredName": {
                            "firstName": "Alonzo",
                            "lastName": "Church",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Church"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 42323521,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "00f3bc14bc3662558b677549ee6cc46ca66e5227",
            "isKey": false,
            "numCitedBy": 680,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "In a recent paper the author has proposed a definition of the commonly used term “effectively calculable” and has shown on the basis of this definition that the general case of the Entscheidungsproblem is unsolvable in any system of symbolic logic which is adequate to a certain portion of arithmetic and is ω-consistent. The purpose of the present note is to outline an extension of this result to the engere Funktionenkalkul of Hilbert and Ackermann. In the author's cited paper it is pointed out that there can be associated recursively with every well-formed formula a recursive enumeration of the formulas into which it is convertible. This means the existence of a recursively defined function a of two positive integers such that, if y is the Godel representation of a well-formed formula Y then a(x, y) is the Godel representation of the x th formula in the enumeration of the formulas into which Y is convertible. Consider the system L of symbolic logic which arises from the engere Funktionenkalkul by adding to it: as additional undefined symbols, a symbol 1 for the number 1 (regarded as an individual), a symbol = for the propositional function = (equality of individuals), a symbol s for the arithmetic function x +1, a symbol a for the arithmetic function a described in the preceding paragraph, and symbols b 1 , b 2 , …, b k for the auxiliary arithmetic functions which are employed in the recursive definition of a ; and as additional axioms, the recursion equations for the functions a , b 1 , b 2 , …, b k (expressed with free individual variables, the class of individuals being taken as identical with the class of positive integers), and two axioms of equality, x = x , and x = y →[F(x)→F(y)] ."
            },
            "slug": "A-Note-on-the-Entscheidungsproblem-Church",
            "title": {
                "fragments": [],
                "text": "A Note on the Entscheidungsproblem"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is shown that the general case of the Entscheidungsproblem is unsolvable in any system of symbolic logic which is adequate to a certain portion of arithmetic and is ω-consistent."
            },
            "venue": {
                "fragments": [],
                "text": "J. Symb. Log."
            },
            "year": 1936
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2114422629"
                        ],
                        "name": "G. A. Miller",
                        "slug": "G.-A.-Miller",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Miller",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. A. Miller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1901024"
                        ],
                        "name": "S. Isard",
                        "slug": "S.-Isard",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Isard",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Isard"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2694302,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "414aad0223595e32cad0758f23cdf98a2520fb14",
            "isKey": false,
            "numCitedBy": 188,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Free-Recall-of-Self-Embedded-English-Sentences-Miller-Isard",
            "title": {
                "fragments": [],
                "text": "Free Recall of Self-Embedded English Sentences"
            },
            "venue": {
                "fragments": [],
                "text": "Inf. Control."
            },
            "year": 1964
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 124
                            }
                        ],
                        "text": "Early foundational works in this style of grammar, called Categorial Grammar, are Lambek (1958) and Bar-Hillel, Gaifman and Bar-Hillel et al. (1960). Wood (1993) is an introductory book on it."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 313,
                                "start": 124
                            }
                        ],
                        "text": "Early foundational works in this style of grammar, called Categorial Grammar, are Lambek (1958) and Bar-Hillel, Gaifman and Bar-Hillel et al. (1960). Wood (1993) is an introductory book on it. A linguistically useful collection of articles on various aspects of categorial grammar is Oehrle, Oehrle et al. (1988). A more recent overview is Chapter 1 in Bernardi (2002)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 369,
                                "start": 124
                            }
                        ],
                        "text": "Early foundational works in this style of grammar, called Categorial Grammar, are Lambek (1958) and Bar-Hillel, Gaifman and Bar-Hillel et al. (1960). Wood (1993) is an introductory book on it. A linguistically useful collection of articles on various aspects of categorial grammar is Oehrle, Oehrle et al. (1988). A more recent overview is Chapter 1 in Bernardi (2002). A technically more advanced work is Moortgat (1996)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On categorial and phrase structure grammars"
            },
            "venue": {
                "fragments": [],
                "text": "Bulletin of the Research Council of Israel"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "134612474"
                        ],
                        "name": "Perlindström",
                        "slug": "Perlindström",
                        "structuredName": {
                            "firstName": "",
                            "lastName": "Perlindström",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Perlindström"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 49,
                                "start": 32
                            }
                        ],
                        "text": "This type notation derives from Lindström (1966). The interpretation of (2a) below is now given as (2b):"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 171902408,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "18ff4f131fd5f6b4dcc8e0a6504bd64496f7dbe8",
            "isKey": false,
            "numCitedBy": 409,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "First-Order-Predicate-Logic-with-Generalized-Perlindström",
            "title": {
                "fragments": [],
                "text": "First Order Predicate Logic with Generalized Quantifiers"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50064122"
                        ],
                        "name": "Jack Kaminsky",
                        "slug": "Jack-Kaminsky",
                        "structuredName": {
                            "firstName": "Jack",
                            "lastName": "Kaminsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jack Kaminsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "17001958"
                        ],
                        "name": "P. Geach",
                        "slug": "P.-Geach",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Geach",
                            "middleNames": [
                                "Thomas"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Geach"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124054322,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8aaf006cb46730dec9bd02817766adf081fc01af",
            "isKey": false,
            "numCitedBy": 527,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Reference-And-Generality-Kaminsky-Geach",
            "title": {
                "fragments": [],
                "text": "Reference And Generality"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "114531657"
                        ],
                        "name": "Noam Chomsky",
                        "slug": "Noam-Chomsky",
                        "structuredName": {
                            "firstName": "Noam",
                            "lastName": "Chomsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Noam Chomsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2114422629"
                        ],
                        "name": "G. A. Miller",
                        "slug": "G.-A.-Miller",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Miller",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. A. Miller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 57162210,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "1e2604c6ed13092f459201a87242714df5784598",
            "isKey": false,
            "numCitedBy": 509,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Introduction-to-the-Formal-Analysis-of-Natural-Chomsky-Miller",
            "title": {
                "fragments": [],
                "text": "Introduction to the Formal Analysis of Natural Languages"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70062325"
                        ],
                        "name": "A. S. Kahr",
                        "slug": "A.-S.-Kahr",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Kahr",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. S. Kahr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34166566"
                        ],
                        "name": "E. F. Moore",
                        "slug": "E.-F.-Moore",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Moore",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. F. Moore"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102402014"
                        ],
                        "name": "H. Wang",
                        "slug": "H.-Wang",
                        "structuredName": {
                            "firstName": "H",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wang"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 35439287,
            "fieldsOfStudy": [
                "Computer Science",
                "Medicine"
            ],
            "id": "b6a7d807136b42376dce54db3c66d18d8db9e7cf",
            "isKey": false,
            "numCitedBy": 87,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "ENTSCHEIDUNGSPROBLEM-REDUCED-TO-THE-AEA-CASE.-Kahr-Moore",
            "title": {
                "fragments": [],
                "text": "ENTSCHEIDUNGSPROBLEM REDUCED TO THE AEA CASE."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the National Academy of Sciences of the United States of America"
            },
            "year": 1962
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Syntactic connexion in English"
            },
            "venue": {
                "fragments": [],
                "text": "S. McCall, ed., Polish Logic 1920–1939 , pages 207–231. Oxford, UK: Oxford University Press."
            },
            "year": 1967
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The impossibility of an algorithm for the decision problem for finite domains (Russian)"
            },
            "venue": {
                "fragments": [],
                "text": "Doklady Akademii Nauk SSSR 70:569–572. English translation in AMS Transl. Ser. 2 vol 23, 1963:1–6."
            },
            "year": 1950
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 2,
            "methodology": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 15,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Mathematical-structures-of-language-Harris/99eadd5e29a85f30cafef7f2c915f384715e3b89?sort=total-citations"
}