{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143753639"
                        ],
                        "name": "A. McCallum",
                        "slug": "A.-McCallum",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "McCallum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. McCallum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145903504"
                        ],
                        "name": "R. Rosenfeld",
                        "slug": "R.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40975594"
                        ],
                        "name": "Tom Michael Mitchell",
                        "slug": "Tom-Michael-Mitchell",
                        "structuredName": {
                            "firstName": "Tom",
                            "lastName": "Mitchell",
                            "middleNames": [
                                "Michael"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tom Michael Mitchell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2067947117"
                        ],
                        "name": "Andrew Y. Ng",
                        "slug": "Andrew-Y.-Ng",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Ng",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Andrew Y. Ng"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 104,
                                "start": 84
                            }
                        ],
                        "text": "Multinomial achieves 85% accuracy and\n4Accuracies are higher here than reported in (McCallum et al. 1998) because here more training data was provided to this classifier (70% of the data used for training here, versus only 50% in the other work).\nmulti-variate Bernoulli achieves 74% accuracy."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 236,
                                "start": 216
                            }
                        ],
                        "text": "This approach has also been used for text classification by numerous people (Lewis and Gale 1994; Kalt and Croft 1996; Joachims 1997; Guthrie and Walker 1994; Li and Yamanishi 1997; Mitchell 1997; Nigam et al. 1998; McCallum et al. 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 186,
                                "start": 166
                            }
                        ],
                        "text": "The Industry Sector hierarchy, made available by Market Guide Inc. (www.marketguide.com) consists of company web pages classified in a hierarchy of industry sectors (McCallum et al. 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 180,
                                "start": 177
                            }
                        ],
                        "text": "Note that the multivariate Bernoulli shows its best results at a smaller vocabulary than the multinomial, and that the multinomial has best performance at a larger vocabulary size."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 144,
                                "start": 124
                            }
                        ],
                        "text": "After tokenizing as above and removing stopwords and words that occur only once, the corpus has a vocabulary size of 44383 (McCallum et al. 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 9086884,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f2671b151fad7e176176b35d425b2b6356ff4595",
            "isKey": false,
            "numCitedBy": 621,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "When documents are organized in a large number of topic categories, the categories are often arranged in a hierarchy. The U.S. patent database and Yahoo are two examples. This paper shows that the accuracy of a naive Bayes text classi er can be signi cantly improved by taking advantage of a hierarchy of classes. We adopt an established statistical technique called shrinkage that smoothes parameter estimates of a data-sparse child with its parent in order to obtain more robust parameter estimates. The approach is also employed in deleted interpolation, a technique for smoothing n-grams in language modeling for speech recognition. Our method scales well to large data sets, with numerous categories in large hierarchies. Experimental results on three real-world data sets from UseNet, Yahoo, and corporate web pages show improved performance, with a reduction in error up to 29% over the traditional at classi er."
            },
            "slug": "Improving-Text-Classification-by-Shrinkage-in-a-of-McCallum-Rosenfeld",
            "title": {
                "fragments": [],
                "text": "Improving Text Classification by Shrinkage in a Hierarchy of Classes"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This paper shows that the accuracy of a naive Bayes text classi er can be improved by taking advantage of a hierarchy of classes, and adopts an established statistical technique called shrinkage that smoothes parameter estimates of a data-sparse child with its parent in order to obtain more robust parameter estimates."
            },
            "venue": {
                "fragments": [],
                "text": "ICML"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1736370"
                        ],
                        "name": "D. Koller",
                        "slug": "D.-Koller",
                        "structuredName": {
                            "firstName": "Daphne",
                            "lastName": "Koller",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Koller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764547"
                        ],
                        "name": "M. Sahami",
                        "slug": "M.-Sahami",
                        "structuredName": {
                            "firstName": "Mehran",
                            "lastName": "Sahami",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Sahami"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 182,
                                "start": 160
                            }
                        ],
                        "text": "The approach has been used for text classification by numerous people (Robertson and Sparck-Jones 1976; Lewis 1992; Kalt and Croft 1996; Larkey and Croft 1996; Koller and Sahami 1997; Sahami 1996)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2112467,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "23354987095a8a9a283ce4c9a690522d6b11e2dd",
            "isKey": false,
            "numCitedBy": 1089,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "The proliferation of topic hierarchies for text documents has resulted in a need for tools that automatically classify new documents within such hierarchies. One can use existing classifiers by ignoring the hierarchical structure, treating the topics as separate classes. Unfortunately, in the context of text categorization, we are faced with a large number of classes and a huge number of relevant features needed to distinguish between them. Consequently, we are restricted to using only very simple classifiers, both because of computational cost and the tendency of complex models to overfit. We propose an approach that utilizes the hierarchical topic structure to decompose the classification task into a set of simpler problems, one at each node in the classification tree. As we show, each of these smaller problems can be solved accurately by focusing only on a very small set of features, those relevant to the task at hand. This set of relevant features varies widely throughout the hierarchy, so that, while the overall relevant feature set may be large, each classifier only examines a small subset. The use of reduced feature sets allows us to utilize more complex (probabilistic) models, without encountering the computational and robustness difficulties described above."
            },
            "slug": "Hierarchically-Classifying-Documents-Using-Very-Few-Koller-Sahami",
            "title": {
                "fragments": [],
                "text": "Hierarchically Classifying Documents Using Very Few Words"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This work proposes an approach that utilizes the hierarchical topic structure to decompose the classification task into a set of simpler problems, one at each node in the classification tree, which can be solved accurately by focusing only on a very small set of features, those relevant to the task at hand."
            },
            "venue": {
                "fragments": [],
                "text": "ICML"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32299678"
                        ],
                        "name": "T. Kalt",
                        "slug": "T.-Kalt",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Kalt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kalt"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 98
                            }
                        ],
                        "text": "This approach has also been used for text classification by numerous people (Lewis and Gale 1994; Kalt and Croft 1996; Joachims 1997; Guthrie and Walker 1994; Li and Yamanishi 1997; Mitchell 1997; Nigam et al. 1998; McCallum et al. 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 116
                            }
                        ],
                        "text": "The approach has been used for text classification by numerous people (Robertson and Sparck-Jones 1976; Lewis 1992; Kalt and Croft 1996; Larkey and Croft 1996; Koller and Sahami 1997; Sahami 1996)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 0
                            }
                        ],
                        "text": "Kalt and Croft (1996) previously compared the multinomial model to the “binary independence model,” the information retrieval terminology for our multi-variate Bernoulli model."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 14607326,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b7aa2197adb6261b7848b04c343f5dbb15c85fc6",
            "isKey": false,
            "numCitedBy": 60,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper introduces the multinomial model of text classification and retrieval. One important feature of the model is that the tf statistic, which usually appears in probabilistic IR models as a heuristic, is an integral part of the model. Another is that the variable length of documents is accounted for, without either making a uniform length assumption or using length normalization. The multinomial model employs independence assumptions which are similar to assumptions made in previous probabilistic models, particularly the binary independence model and the 2-Poisson model. The use of simulation to study the model is described. Performance of the model is evaluated on the TREC-3 routing task. Results are compared with the binary independence model and with the simulation studies."
            },
            "slug": "A-New-Probabilistic-Model-of-Text-Classification-Kalt",
            "title": {
                "fragments": [],
                "text": "A New Probabilistic Model of Text Classification and Retrieval"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "The multinomial model of text classification and retrieval employs independence assumptions which are similar to assumptions made in previous probabilistic models, particularly the binary independence model and the 2-Poisson model."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1742457"
                        ],
                        "name": "L. Larkey",
                        "slug": "L.-Larkey",
                        "structuredName": {
                            "firstName": "Leah",
                            "lastName": "Larkey",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Larkey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 214792470,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4b8484b179a392b294b755289a439b09b15a7743",
            "isKey": false,
            "numCitedBy": 51,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The classification of U.S. patents poses some special problems due to the enormous size of the corpus, the size and complex hierarchical structure of the classification system, and the size and structure of patent documents. The representation of the complex structure of documents has not received a great deal of previous attention, but we have found it to be an important factor in our work. We are exploring ways to use this structure and the hierarchical relations among patent subclasses to facilitate the classification of patents. Our approach is to derive a vector of terms and phrases from the most important parts of the patent to represent each document. We use both k-nearest-neighbor classifiers and Bayesian classifiers. The k-nearest-neighbor classifier allows us to represent the document structure using the query operators in the Inquery information retrieval system. The Bayesian classifiers can use the hierarchical relations among patent subclasses to select closely related negative examples to train more discriminating classifiers."
            },
            "slug": "Some-Issues-in-the-Automatic-Classification-of-U.S.-Larkey",
            "title": {
                "fragments": [],
                "text": "Some Issues in the Automatic Classification of U.S. Patents Working Notes for the AAAI-98 Workshop on Learning for Text Categorization"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This work uses both k-nearest-neighbor classifiers and Bayesian classifiers to derive a vector of terms and phrases from the most important parts of the patent to represent each document."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145172877"
                        ],
                        "name": "K. Nigam",
                        "slug": "K.-Nigam",
                        "structuredName": {
                            "firstName": "Kamal",
                            "lastName": "Nigam",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Nigam"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143753639"
                        ],
                        "name": "A. McCallum",
                        "slug": "A.-McCallum",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "McCallum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. McCallum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144867807"
                        ],
                        "name": "S. Thrun",
                        "slug": "S.-Thrun",
                        "structuredName": {
                            "firstName": "Sebastian",
                            "lastName": "Thrun",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Thrun"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40975594"
                        ],
                        "name": "Tom Michael Mitchell",
                        "slug": "Tom-Michael-Mitchell",
                        "structuredName": {
                            "firstName": "Tom",
                            "lastName": "Mitchell",
                            "middleNames": [
                                "Michael"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tom Michael Mitchell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1460876,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "63287d3220fe96d5cbf73067545abbb88cc180a6",
            "isKey": false,
            "numCitedBy": 426,
            "numCiting": 84,
            "paperAbstract": {
                "fragments": [],
                "text": "In many important text classification problems, acquiring class labels for training documents is costly, while gathering large quantities of unlabeled data is cheap. This paper shows that the accuracy of text classifiers trained with a small number of labeled documents can be improved by augmenting this small training set with a large pool of unlabeled documents. We present a theoretical argument showing that, under common assumptions, unlabeled data contain information about the target function. We then introduce an algorithm for learning from labeled and unlabeled text based on the combination of Expectation-Maximization with a naive Bayes classifier. The algorithm first trains a classifier using the available labeled documents, and probabilistically labels the unlabeled documents; it then trains a new classifier using the labels for all the documents, and iterates to convergence. Experimental results, obtained using text from three different realworld tasks, show that the use of unlabeled data reduces classification error by up to 33%."
            },
            "slug": "Learning-to-Classify-Text-from-Labeled-and-Nigam-McCallum",
            "title": {
                "fragments": [],
                "text": "Learning to Classify Text from Labeled and Unlabeled Documents"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is shown that the accuracy of text classifiers trained with a small number of labeled documents can be improved by augmenting this small training set with a large pool of unlabeled documents, and an algorithm is introduced based on the combination of Expectation-Maximization with a naive Bayes classifier."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI/IAAI"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35153517"
                        ],
                        "name": "D. Lewis",
                        "slug": "D.-Lewis",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Lewis",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Lewis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34938639"
                        ],
                        "name": "W. Gale",
                        "slug": "W.-Gale",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Gale",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Gale"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 77
                            }
                        ],
                        "text": "This approach has also been used for text classification by numerous people (Lewis and Gale 1994; Kalt and Croft 1996; Joachims 1997; Guthrie and Walker 1994; Li and Yamanishi 1997; Mitchell 1997; Nigam et al. 1998; McCallum et al. 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 915058,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5194b668c67aa83c037e71599a087f63c98eb713",
            "isKey": false,
            "numCitedBy": 2404,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "The ability to cheaply train text classifiers is critical to their use in information retrieval, content analysis, natural language processing, and other tasks involving data which is partly or fully textual. An algorithm for sequential sampling during machine learning of statistical classifiers was developed and tested on a newswire text categorization task. This method, which we call uncertainty sampling, reduced by as much as 500-fold the amount of training data that would have to be manually classified to achieve a given level of effectiveness."
            },
            "slug": "A-sequential-algorithm-for-training-text-Lewis-Gale",
            "title": {
                "fragments": [],
                "text": "A sequential algorithm for training text classifiers"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "An algorithm for sequential sampling during machine learning of statistical classifiers was developed and tested on a newswire text categorization task and reduced by as much as 500-fold the amount of training data that would have to be manually classified to achieve a given level of effectiveness."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR '94"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713919"
                        ],
                        "name": "P. Langley",
                        "slug": "P.-Langley",
                        "structuredName": {
                            "firstName": "Pat",
                            "lastName": "Langley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Langley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2706719"
                        ],
                        "name": "Wayne Iba",
                        "slug": "Wayne-Iba",
                        "structuredName": {
                            "firstName": "Wayne",
                            "lastName": "Iba",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Wayne Iba"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "123928894"
                        ],
                        "name": "K. Thompson",
                        "slug": "K.-Thompson",
                        "structuredName": {
                            "firstName": "Kevin",
                            "lastName": "Thompson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Thompson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 184,
                                "start": 165
                            }
                        ],
                        "text": "Simple Bayesian classifiers have been gaining popularity lately, and have been found to perform surprisingly well (Friedman 1997; Friedman et al. 1997; Sahami 1996; Langley et al. 1992)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15383317,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1925bacaa10b4ec83a0509132091bb79243b41b6",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we present an average-case analysis of the Bayesian classiier, a simple probabilistic induction algorithm that fares remarkably well on many learning tasks. Our analysis assumes a monotone conjunctive target concept, Boolean attributes that are independent of each other and that follow a single distribution, and the absence of attribute noise. We rst calculate the probability that the algorithm will induce an arbitrary pair of concept descriptions ; we then use this expression to compute the probability of correct classiication over the space of instances. The analysis takes into account the number of training instances, the number of relevant and irrelevant attributes, the distribution of these attributes, and the level of class noise. In addition, we explore the behavioral implications of the analysis by presenting predicted learning curves for a number of artiicial domains. We also give experimental results on these domains as a check on our reasoning. Finally, we discuss some unresolved questions about the behavior of Bayesian classiiers and outline directions for future research. we nd the current format more desirable. We have not submitted the paper to any other conference or journal."
            },
            "slug": "An-Analysis-of-Bayesian-Classiiers-Langley-Iba",
            "title": {
                "fragments": [],
                "text": "An Analysis of Bayesian Classiiers"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "An average-case analysis of the Bayesian classiier is presented, a simple probabilistic induction algorithm that fares remarkably well on many learning tasks and explores the behavioral implications by presenting predicted learning curves for a number of artiicial domains."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69417275"
                        ],
                        "name": "W. B. CroftCenter",
                        "slug": "W.-B.-CroftCenter",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "CroftCenter",
                            "middleNames": [
                                "Bruce"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. B. CroftCenter"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 118
                            }
                        ],
                        "text": "The approach has been used for text classification by numerous people (Robertson and Sparck-Jones 1976; Lewis 1992; Kalt and Croft 1996; Larkey and Croft 1996; Koller and Sahami 1997; Sahami 1996)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 15151640,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "755233dc6921fd1dd178a39817daec39a05ca81f",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "Three diierent types of classiiers were investigated in the context of a text categorization problem in the medical domain: the automatic assignment of ICD9 codes to dictated inpatient discharge summaries. K-nearest-neighbor, relevance feedback, and Bayesian independence classifers were applied individually and in combination. A combination of diierent classiiers produced better results than any single type of classiier. For this speciic medical categoriza-tion problem, new query formulation and weighting methods used in the k-nearest-neighbor classiier improved performance. 1 Introduction Past research in information retrieval has shown that one can improve retrieval eeectiveness by using multiple representations in indexing and query formulation 27] 19] 3] 11] and by using multiple search strategies 5] 24] 7]. In this work, we investigate whether we can attain similar improvements in the domain of text categorization by combining diierent representations and classiication methods. Our domain is the automatic assignment of ICD9 codes to dictated inpatient discharge summaries. There is a great deal of interest in automating the assignment of categories such as ICD9-CM and other codes to patient medical records. Many hours of human eeort go into this task. Because this coding determines reimbursement, it is important to accomplish this task as easily and as accurately as possible. The most common approaches use a large corpus of previously coded documents to infer codes for new documents. Many diierent algorithms have been used for text cate-gorization, including k-nearest-neighbor algorithms 6, 26, 18], Bayesian independence classiiers 13], relevance feedback 21], and rule-induction algorithms from machine learning , like decision trees 2, 16]. These categorization algorithms have been applied to many diierent subject domains, usually news stories, but also physics abstracts 9], and medical text 29]. We are following several of these approaches to automatic"
            },
            "slug": "Combining-Classiiers-in-Text-Categorization-CroftCenter",
            "title": {
                "fragments": [],
                "text": "Combining Classiiers in Text Categorization"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Three diierent types of classiiers were investigated in the context of a text categorization problem in the medical domain: the automatic assignment of ICD9 codes to dictated inpatient discharge summaries, k-nearest-neighbor, relevance feedback, and Bayesian independence classifers were applied individually and in combination."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35153517"
                        ],
                        "name": "D. Lewis",
                        "slug": "D.-Lewis",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Lewis",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Lewis"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 16644750,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b07f0f4553cfb42c0ed2bd6b07c9b22777b313d8",
            "isKey": false,
            "numCitedBy": 693,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "Syntactic phrase indexing and term clustering have been widely explored as text representation techniques for text retrieval. In this paper we study the properties of phrasal and clustered indexing languages on a text categorization task, enabling us to study their properties in isolation from query interpretation issues. We show that optimal effectiveness occurs when using only a small proportion of the indexing terms available, and that effectiveness peaks at a higher feature set size and lower effectiveness level for a syntactic phrase indexing than for word-based indexing. We also present results suggesting that traditional term clustering method are unlikely to provide significantly improved text representations. An improved probabilistic text categorization method is also presented."
            },
            "slug": "An-evaluation-of-phrasal-and-clustered-on-a-text-Lewis",
            "title": {
                "fragments": [],
                "text": "An evaluation of phrasal and clustered representations on a text categorization task"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It is shown that optimal effectiveness occurs when using only a small proportion of the indexing terms available, and that effectiveness peaks at a higher feature set size and lower effectiveness level for a syntactic phrase indexing than for word-based indexing."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR '92"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35153517"
                        ],
                        "name": "D. Lewis",
                        "slug": "D.-Lewis",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Lewis",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Lewis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 32800624,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "44e915a220ce74badf755aae870fa0b69ee2b82a",
            "isKey": false,
            "numCitedBy": 2252,
            "numCiting": 65,
            "paperAbstract": {
                "fragments": [],
                "text": "The naive Bayes classifier, currently experiencing a renaissance in machine learning, has long been a core technique in information retrieval. We review some of the variations of naive Bayes models used for text retrieval and classification, focusing on the distributional assumptions made about word occurrences in documents."
            },
            "slug": "Naive-(Bayes)-at-Forty:-The-Independence-Assumption-Lewis",
            "title": {
                "fragments": [],
                "text": "Naive (Bayes) at Forty: The Independence Assumption in Information Retrieval"
            },
            "tldr": {
                "abstractSimilarityScore": 86,
                "text": "The naive Bayes classifier, currently experiencing a renaissance in machine learning, has long been a core technique in information retrieval, and some of the variations used for text retrieval and classification are reviewed."
            },
            "venue": {
                "fragments": [],
                "text": "ECML"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2255318"
                        ],
                        "name": "R. Liere",
                        "slug": "R.-Liere",
                        "structuredName": {
                            "firstName": "Ray",
                            "lastName": "Liere",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Liere"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729906"
                        ],
                        "name": "Prasad Tadepalli",
                        "slug": "Prasad-Tadepalli",
                        "structuredName": {
                            "firstName": "Prasad",
                            "lastName": "Tadepalli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Prasad Tadepalli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 72,
                                "start": 48
                            }
                        ],
                        "text": "Following several other studies (Joachims 1998; Liere and Tadepalli 1997) we build binary classifiers for each of the 10 most populous classes."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 7530337,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "80ef14d2a1b8c7efbf45bedae9d001fe5446c7de",
            "isKey": false,
            "numCitedBy": 183,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "In many real-world domains, supervised learning requires a large number of training examples. In this paper, we describe an active learning method that uses a committee of learners to reduce the number of training examples required for learning. Our approach is similar to the Query by Committee framework, where disagreement among the committee members on the predicted label for the input part of the example is used to signal the need for knowing the actual value of the label. Our experiments are conducted in the text categorization domain, which is characterized by a large number of features, many of which are irrelevant. We report here on experiments using a committee of Winnowbased learners and demonstrate that this approach can reduce the number of labeled training examples required over that used by a single Winnow learner by l-2 orders of magnitude. 1. Hntroduction"
            },
            "slug": "Active-Learning-with-Committees-for-Text-Liere-Tadepalli",
            "title": {
                "fragments": [],
                "text": "Active Learning with Committees for Text Categorization"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "This paper reports on experiments using a committee of Winnowbased learners and demonstrates that this approach can reduce the number of labeled training examples required over that used by a single Winnow learner by l-2 orders of magnitude."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI/IAAI"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680188"
                        ],
                        "name": "T. Joachims",
                        "slug": "T.-Joachims",
                        "structuredName": {
                            "firstName": "Thorsten",
                            "lastName": "Joachims",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Joachims"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5842708,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "094fc15bc058b0d62a661a1460885a9490bdb1bd",
            "isKey": false,
            "numCitedBy": 1533,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : A probabilistic analysis of the Rocchio relevance feedback algorithm, one of the most popular learning methods from information retrieval, is presented in a text categorization framework. The analysis results in a probabilistic version of the Rocchio classifier and offers an explanation for the TFIDF word weighting heuristic. The Rocchio classifier, its probabilistic variant and a standard naive Bayes classifier are compared on three text categorization tasks. The results suggest that the probabilistic algorithms are preferable to the heuristic Rocchio classifier."
            },
            "slug": "A-Probabilistic-Analysis-of-the-Rocchio-Algorithm-Joachims",
            "title": {
                "fragments": [],
                "text": "A Probabilistic Analysis of the Rocchio Algorithm with TFIDF for Text Categorization"
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "A Probabilistic analysis of the Rocchio relevance feedback algorithm, one of the most popular learning methods from information retrieval, is presented in a text categorization framework and suggests that the probabilistic algorithms are preferable to the heuristic Rocchio classifier."
            },
            "venue": {
                "fragments": [],
                "text": "ICML"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713919"
                        ],
                        "name": "P. Langley",
                        "slug": "P.-Langley",
                        "structuredName": {
                            "firstName": "Pat",
                            "lastName": "Langley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Langley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2706719"
                        ],
                        "name": "Wayne Iba",
                        "slug": "Wayne-Iba",
                        "structuredName": {
                            "firstName": "Wayne",
                            "lastName": "Iba",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Wayne Iba"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "123928894"
                        ],
                        "name": "K. Thompson",
                        "slug": "K.-Thompson",
                        "structuredName": {
                            "firstName": "Kevin",
                            "lastName": "Thompson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Thompson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 184,
                                "start": 165
                            }
                        ],
                        "text": "Simple Bayesian classifiers have been gaining popularity lately, and have been found to perform surprisingly well (Friedman 1997; Friedman et al. 1997; Sahami 1996; Langley et al. 1992)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 21634132,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5e40ea249dfad6d8d133b7917ca031c0b32410a5",
            "isKey": false,
            "numCitedBy": 1356,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we present an average-case analysis of the Bayesian classifier, a simple induction algorithm that fares remarkably well on many learning tasks. Our analysis assumes a monotone conjunctive target concept, and independent, noise-free Boolean attributes. We calculate the probability that the algorithm will induce an arbitrary pair of concept descriptions and then use this to compute the probability of correct classification over the instance space. The analysis takes into account the number of training instances, the number of attributes, the distribution of these attributes, and the level of class noise. We also explore the behavioral implications of the analysis by presenting predicted learning curves for artificial domains, and give experimental results on these domains as a check on our reasoning."
            },
            "slug": "An-Analysis-of-Bayesian-Classifiers-Langley-Iba",
            "title": {
                "fragments": [],
                "text": "An Analysis of Bayesian Classifiers"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "An average-case analysis of the Bayesian classifier, a simple induction algorithm that fares remarkably well on many learning tasks, and explores the behavioral implications of the analysis by presenting predicted learning curves for artificial domains."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764547"
                        ],
                        "name": "M. Sahami",
                        "slug": "M.-Sahami",
                        "structuredName": {
                            "firstName": "Mehran",
                            "lastName": "Sahami",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Sahami"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 179,
                                "start": 168
                            }
                        ],
                        "text": "It is also more clear in the multi-variate Bernoulli model how to relax the independence assumption by adding a limited number of dependencies to the Bayesian network (Sahami 1996; Friedman et al. 1997)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 163,
                                "start": 152
                            }
                        ],
                        "text": "Simple Bayesian classifiers have been gaining popularity lately, and have been found to perform surprisingly well (Friedman 1997; Friedman et al. 1997; Sahami 1996; Langley et al. 1992)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 195,
                                "start": 184
                            }
                        ],
                        "text": "The approach has been used for text classification by numerous people (Robertson and Sparck-Jones 1976; Lewis 1992; Kalt and Croft 1996; Larkey and Croft 1996; Koller and Sahami 1997; Sahami 1996)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 5680462,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0d136cd362fb9d38cec1b6dbbf41c3d693c2cec1",
            "isKey": false,
            "numCitedBy": 428,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a framework for characterizing Bayesian classification methods. This framework can be thought of as a spectrum of allowable dependence in a given probabilistic model with the Naive Bayes algorithm at the most restrictive end and the learning of full Bayesian networks at the most general extreme. While much work has been carried out along the two ends of this spectrum, there has been surprising little done along the middle. We analyze the assumptions made as one moves along this spectrum and show the tradeoffs between model accuracy and learning speed which become critical to consider in a variety of data mining domains. We then present a general induction algorithm that allows for traversal of this spectrum depending on the available computational power for carrying out induction and show its application in a number of domains with different properties."
            },
            "slug": "Learning-Limited-Dependence-Bayesian-Classifiers-Sahami",
            "title": {
                "fragments": [],
                "text": "Learning Limited Dependence Bayesian Classifiers"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "A framework for characterizing Bayesian classification methods is presented and a general induction algorithm is presented that allows for traversal of this spectrum depending on the available computational power for carrying out induction and its application in a number of domains with different properties."
            },
            "venue": {
                "fragments": [],
                "text": "KDD"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2118384802"
                        ],
                        "name": "Hang Li",
                        "slug": "Hang-Li",
                        "structuredName": {
                            "firstName": "Hang",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hang Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34755863"
                        ],
                        "name": "K. Yamanishi",
                        "slug": "K.-Yamanishi",
                        "structuredName": {
                            "firstName": "Kenji",
                            "lastName": "Yamanishi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Yamanishi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 180,
                                "start": 159
                            }
                        ],
                        "text": "This approach has also been used for text classification by numerous people (Lewis and Gale 1994; Kalt and Croft 1996; Joachims 1997; Guthrie and Walker 1994; Li and Yamanishi 1997; Mitchell 1997; Nigam et al. 1998; McCallum et al. 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 79
                            }
                        ],
                        "text": "(3)\n1In a more general setting, this one-to-one correspondence can be avoided (Li and Yamanishi 1997; Nigam et al. 1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 870921,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0b23eebc89f4da28e44fadac779ae334a019db80",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a new method of classifying documents into categories. We define for each category a finite mixture model based on soft clustering of words. We treat the problem of classifying documents as that of conducting statistical hypothesis testing over finite mixture models, and employ the EM algorithm to efficiently estimate parameters in a finite mixture model. Experimental results indicate that our method outperforms existing methods."
            },
            "slug": "Document-Classification-Using-a-Finite-Mixture-Li-Yamanishi",
            "title": {
                "fragments": [],
                "text": "Document Classification Using a Finite Mixture Model"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "This work treats the problem of classifying documents as that of conducting statistical hypothesis testing over finite mixture models, and employs the EM algorithm to efficiently estimate parameters in a finite mixture model."
            },
            "venue": {
                "fragments": [],
                "text": "ACL"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680188"
                        ],
                        "name": "T. Joachims",
                        "slug": "T.-Joachims",
                        "structuredName": {
                            "firstName": "Thorsten",
                            "lastName": "Joachims",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Joachims"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 245,
                                "start": 232
                            }
                        ],
                        "text": "The Reuters categorization tasks are examples of these—it is well-known that in several of the categories, high accuracy can be obtained with only a handful of words, sometimes even the single word that is the title of the category (Joachims 1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 11
                            }
                        ],
                        "text": "Results by\nJoachims (1998) found performance was highest in this domain with the full vocabulary (no feature selection)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 46,
                                "start": 33
                            }
                        ],
                        "text": "Following several other studies (Joachims 1998; Liere and Tadepalli 1997) we build binary classifiers for each of the 10 most populous classes."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 288,
                                "start": 275
                            }
                        ],
                        "text": "Recall and Precision are defined as:\nRecall = # of correct positive predictions\n# of positive examples (9)\nPrecision = # of correct positive predictions\n# of positive predictions (10)\nThe precision-recall breakeven point is the value at which precision and recall are equal (Joachims 1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2427083,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "40212e9474c3ddf3d8c6ffd13dd3211ec9406c49",
            "isKey": true,
            "numCitedBy": 8601,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper explores the use of Support Vector Machines (SVMs) for learning text classifiers from examples. It analyzes the particular properties of learning with text data and identifies why SVMs are appropriate for this task. Empirical results support the theoretical findings. SVMs achieve substantial improvements over the currently best performing methods and behave robustly over a variety of different learning tasks. Furthermore they are fully automatic, eliminating the need for manual parameter tuning."
            },
            "slug": "Text-Categorization-with-Support-Vector-Machines:-Joachims",
            "title": {
                "fragments": [],
                "text": "Text Categorization with Support Vector Machines: Learning with Many Relevant Features"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "This paper explores the use of Support Vector Machines for learning text classifiers from examples and analyzes the particular properties of learning with text data and identifies why SVMs are appropriate for this task."
            },
            "venue": {
                "fragments": [],
                "text": "ECML"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1742457"
                        ],
                        "name": "L. Larkey",
                        "slug": "L.-Larkey",
                        "structuredName": {
                            "firstName": "Leah",
                            "lastName": "Larkey",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Larkey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144456145"
                        ],
                        "name": "W. Bruce Croft",
                        "slug": "W.-Bruce-Croft",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Croft",
                            "middleNames": [
                                "Bruce"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Bruce Croft"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 167,
                                "start": 146
                            }
                        ],
                        "text": "The approach has been used for text classification by numerous people (Robertson and Sparck-Jones 1976; Lewis 1992; Kalt and Croft 1996; Larkey and Croft 1996; Koller and Sahami 1997; Sahami 1996)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 17791727,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "70dad986b772b92b19b8cd5e4043f1fa23e69348",
            "isKey": false,
            "numCitedBy": 456,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "Three different types of classifiers were investigatedin the context of a text categorization problem in the medical domain: the automatic assignment of ICD9 codes to dictated inpatient discharge summaries. K-nearest-neighbor, relevance feedback, and Bayesian independence classifiers were applied individually and in combination. A coknbination of different classifiers produced better results than any single type of classifier. For this specific medical categorization problem, new query formulation and weighting methods used in the k-nearest-neighbor classifier improved performance."
            },
            "slug": "Combining-classifiers-in-text-categorization-Larkey-Croft",
            "title": {
                "fragments": [],
                "text": "Combining classifiers in text categorization"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "For this specific medical categorization problem, new query formulation and weighting methods used in the k-nearest-neighbor classifier improved performance."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR '96"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144850246"
                        ],
                        "name": "Louise Guthrie",
                        "slug": "Louise-Guthrie",
                        "structuredName": {
                            "firstName": "Louise",
                            "lastName": "Guthrie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Louise Guthrie"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2967060"
                        ],
                        "name": "E. Walker",
                        "slug": "E.-Walker",
                        "structuredName": {
                            "firstName": "Elbert",
                            "lastName": "Walker",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Walker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9108563,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "171592f09aeb1e8720154e4f0b5d59b81b5f9a10",
            "isKey": false,
            "numCitedBy": 41,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "In this note, we present results concerning the theory and practice of determining for a given document which of several categories it best fits. We describe a mathematical model of classification schemes and the one scheme which can be proved optimal among all those based on word frequencies. Finally, we report the results of an experiment which illustrates the efficacy of this classification method."
            },
            "slug": "Document-Classification-by-Machine:Theory-and-Guthrie-Walker",
            "title": {
                "fragments": [],
                "text": "Document Classification by Machine:Theory and Practice"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A mathematical model of classification schemes and the one scheme which can be proved optimal among all those based on word frequencies is described and an experiment illustrates the efficacy of this classification method."
            },
            "venue": {
                "fragments": [],
                "text": "COLING"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144557047"
                        ],
                        "name": "M. Craven",
                        "slug": "M.-Craven",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Craven",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Craven"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2922396"
                        ],
                        "name": "Dan DiPasquo",
                        "slug": "Dan-DiPasquo",
                        "structuredName": {
                            "firstName": "Dan",
                            "lastName": "DiPasquo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dan DiPasquo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1758106"
                        ],
                        "name": "Dayne Freitag",
                        "slug": "Dayne-Freitag",
                        "structuredName": {
                            "firstName": "Dayne",
                            "lastName": "Freitag",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dayne Freitag"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143753639"
                        ],
                        "name": "A. McCallum",
                        "slug": "A.-McCallum",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "McCallum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. McCallum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40975594"
                        ],
                        "name": "Tom Michael Mitchell",
                        "slug": "Tom-Michael-Mitchell",
                        "structuredName": {
                            "firstName": "Tom",
                            "lastName": "Mitchell",
                            "middleNames": [
                                "Michael"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tom Michael Mitchell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145172877"
                        ],
                        "name": "K. Nigam",
                        "slug": "K.-Nigam",
                        "structuredName": {
                            "firstName": "Kamal",
                            "lastName": "Nigam",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Nigam"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1682522"
                        ],
                        "name": "Seán Slattery",
                        "slug": "Seán-Slattery",
                        "structuredName": {
                            "firstName": "Seán",
                            "lastName": "Slattery",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Seán Slattery"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2312137,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8446830f3c05b97c4d12a0751c022d1ae6a5115b",
            "isKey": false,
            "numCitedBy": 799,
            "numCiting": 89,
            "paperAbstract": {
                "fragments": [],
                "text": "The World Wide Web is a vast source of information accessible to computers, but understandable only to humans. The goal of the research described here is to automatically create a computer understandable world wide knowledge base whose content mirrors that of the World Wide Web. Such a knowledge base would enable much more effective retrieval of Web information, and promote new uses of the Web to support knowledge-based inference and problem solving. Our approach is to develop a trainable information extraction system that takes two inputs: an ontology defining the classes and relations of interest, and a set of training data consisting of labeled regions of hypertext representing instances of these classes and relations. Given these inputs, the system learns to extract information from other pages and hyperlinks on the Web. This paper describes our general approach, several machine learning algorithms for this task, and promising initial results with a prototype system."
            },
            "slug": "Learning-to-Extract-Symbolic-Knowledge-from-the-Web-Craven-DiPasquo",
            "title": {
                "fragments": [],
                "text": "Learning to Extract Symbolic Knowledge from the World Wide Web"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "The goal of the research described here is to automatically create a computer understandable world wide knowledge base whose content mirrors that of the World Wide Web, and several machine learning algorithms for this task are described."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI/IAAI"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764547"
                        ],
                        "name": "M. Sahami",
                        "slug": "M.-Sahami",
                        "structuredName": {
                            "firstName": "Mehran",
                            "lastName": "Sahami",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Sahami"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728602"
                        ],
                        "name": "S. Dumais",
                        "slug": "S.-Dumais",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Dumais",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Dumais"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48099028"
                        ],
                        "name": "D. Heckerman",
                        "slug": "D.-Heckerman",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Heckerman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Heckerman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145479841"
                        ],
                        "name": "E. Horvitz",
                        "slug": "E.-Horvitz",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Horvitz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Horvitz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 247,
                                "start": 229
                            }
                        ],
                        "text": "When adding non-text features to the classifier, (such as whether or not an email message has more than one recipient), such features can be included exactly as the word features are when using the multi-variate Bernoulli model (Sahami et al. 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 5301578,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "916177807ecbf0d78f2f64d756d4cecbaa3102a3",
            "isKey": false,
            "numCitedBy": 1598,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "In addressing the growing problem of junk E-mail on the Internet, we examine methods for the automated construction of filters to eliminate such unwanted messages from a user’s mail stream. By casting this problem in a decision theoretic framework, we are able to make use of probabilistic learning methods in conjunction with a notion of differential misclassification cost to produce filters Which are especially appropriate for the nuances of this task. While this may appear, at first, to be a straight-forward text classification problem, we show that by considering domain-specific features of this problem in addition to the raw text of E-mail messages, we can produce much more accurate filters. Finally, we show the efficacy of such filters in a real world usage scenario, arguing that this technology is mature enough for deployment."
            },
            "slug": "A-Bayesian-Approach-to-Filtering-Junk-E-Mail-Sahami-Dumais",
            "title": {
                "fragments": [],
                "text": "A Bayesian Approach to Filtering Junk E-Mail"
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "This work examines methods for the automated construction of filters to eliminate such unwanted messages from a user’s mail stream, and shows the efficacy of such filters in a real world usage scenario, arguing that this technology is mature enough for deployment."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI 1998"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144430625"
                        ],
                        "name": "S. Robertson",
                        "slug": "S.-Robertson",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Robertson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Robertson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145848824"
                        ],
                        "name": "Karen Spärck Jones",
                        "slug": "Karen-Spärck-Jones",
                        "structuredName": {
                            "firstName": "Karen",
                            "lastName": "Spärck Jones",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Karen Spärck Jones"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 102,
                                "start": 71
                            }
                        ],
                        "text": "The approach has been used for text classification by numerous people (Robertson and Sparck-Jones 1976; Lewis 1992; Kalt and Croft 1996; Larkey and Croft 1996; Koller and Sahami 1997; Sahami 1996)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 45186038,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f6e3e57567e9803718623ec088cd7fea65cfbc9d",
            "isKey": false,
            "numCitedBy": 2372,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper examines statistical techniques for exploiting relevance information to weight search terms. These techniques are presented as a natural extension of weighting methods using information about the distribution of index terms in documents in general. A series of relevance weighting functions is derived and is justified by theoretical considerations. In particular, it is shown that specific weighted search methods are implied by a general probabilistic theory of retrieval. Different applications of relevance weighting are illustrated by experimental results for test collections."
            },
            "slug": "Relevance-weighting-of-search-terms-Robertson-Jones",
            "title": {
                "fragments": [],
                "text": "Relevance weighting of search terms"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "This paper examines statistical techniques for exploiting relevance information to weight search terms using information about the distribution of index terms in documents in general and shows that specific weighted search methods are implied by a general probabilistic theory of retrieval."
            },
            "venue": {
                "fragments": [],
                "text": "J. Am. Soc. Inf. Sci."
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1752732"
                        ],
                        "name": "T. Cover",
                        "slug": "T.-Cover",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Cover",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Cover"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115282352"
                        ],
                        "name": "Joy A. Thomas",
                        "slug": "Joy-A.-Thomas",
                        "structuredName": {
                            "firstName": "Joy",
                            "lastName": "Thomas",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Joy A. Thomas"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 150
                            }
                        ],
                        "text": "When reducing the vocabulary size, feature selection is done by selecting words that have highest average mutual information with the class variable (Cover and Thomas 1991)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 168,
                                "start": 147
                            }
                        ],
                        "text": "…between the entropy of the class variable, H(C), and the entropy of the class variable conditioned on the absence or presence of the word, H(C|Wt) (Cover and Thomas 1991):\nI(C;Wt) = H(C)−H(C|Wt) (8) = − ∑ c∈C P(c) log(P(c))\n+ ∑\nft∈{0,1} P(ft) ∑ c∈C P(c|ft) log(P(c|ft))\n= ∑ c∈C ∑ ft∈{0,1} P(c,…"
                    },
                    "intents": []
                }
            ],
            "corpusId": 190432,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7dbdb4209626fd92d2436a058663206216036e68",
            "isKey": false,
            "numCitedBy": 42794,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Preface to the Second Edition. Preface to the First Edition. Acknowledgments for the Second Edition. Acknowledgments for the First Edition. 1. Introduction and Preview. 1.1 Preview of the Book. 2. Entropy, Relative Entropy, and Mutual Information. 2.1 Entropy. 2.2 Joint Entropy and Conditional Entropy. 2.3 Relative Entropy and Mutual Information. 2.4 Relationship Between Entropy and Mutual Information. 2.5 Chain Rules for Entropy, Relative Entropy, and Mutual Information. 2.6 Jensen's Inequality and Its Consequences. 2.7 Log Sum Inequality and Its Applications. 2.8 Data-Processing Inequality. 2.9 Sufficient Statistics. 2.10 Fano's Inequality. Summary. Problems. Historical Notes. 3. Asymptotic Equipartition Property. 3.1 Asymptotic Equipartition Property Theorem. 3.2 Consequences of the AEP: Data Compression. 3.3 High-Probability Sets and the Typical Set. Summary. Problems. Historical Notes. 4. Entropy Rates of a Stochastic Process. 4.1 Markov Chains. 4.2 Entropy Rate. 4.3 Example: Entropy Rate of a Random Walk on a Weighted Graph. 4.4 Second Law of Thermodynamics. 4.5 Functions of Markov Chains. Summary. Problems. Historical Notes. 5. Data Compression. 5.1 Examples of Codes. 5.2 Kraft Inequality. 5.3 Optimal Codes. 5.4 Bounds on the Optimal Code Length. 5.5 Kraft Inequality for Uniquely Decodable Codes. 5.6 Huffman Codes. 5.7 Some Comments on Huffman Codes. 5.8 Optimality of Huffman Codes. 5.9 Shannon-Fano-Elias Coding. 5.10 Competitive Optimality of the Shannon Code. 5.11 Generation of Discrete Distributions from Fair Coins. Summary. Problems. Historical Notes. 6. Gambling and Data Compression. 6.1 The Horse Race. 6.2 Gambling and Side Information. 6.3 Dependent Horse Races and Entropy Rate. 6.4 The Entropy of English. 6.5 Data Compression and Gambling. 6.6 Gambling Estimate of the Entropy of English. Summary. Problems. Historical Notes. 7. Channel Capacity. 7.1 Examples of Channel Capacity. 7.2 Symmetric Channels. 7.3 Properties of Channel Capacity. 7.4 Preview of the Channel Coding Theorem. 7.5 Definitions. 7.6 Jointly Typical Sequences. 7.7 Channel Coding Theorem. 7.8 Zero-Error Codes. 7.9 Fano's Inequality and the Converse to the Coding Theorem. 7.10 Equality in the Converse to the Channel Coding Theorem. 7.11 Hamming Codes. 7.12 Feedback Capacity. 7.13 Source-Channel Separation Theorem. Summary. Problems. Historical Notes. 8. Differential Entropy. 8.1 Definitions. 8.2 AEP for Continuous Random Variables. 8.3 Relation of Differential Entropy to Discrete Entropy. 8.4 Joint and Conditional Differential Entropy. 8.5 Relative Entropy and Mutual Information. 8.6 Properties of Differential Entropy, Relative Entropy, and Mutual Information. Summary. Problems. Historical Notes. 9. Gaussian Channel. 9.1 Gaussian Channel: Definitions. 9.2 Converse to the Coding Theorem for Gaussian Channels. 9.3 Bandlimited Channels. 9.4 Parallel Gaussian Channels. 9.5 Channels with Colored Gaussian Noise. 9.6 Gaussian Channels with Feedback. Summary. Problems. Historical Notes. 10. Rate Distortion Theory. 10.1 Quantization. 10.2 Definitions. 10.3 Calculation of the Rate Distortion Function. 10.4 Converse to the Rate Distortion Theorem. 10.5 Achievability of the Rate Distortion Function. 10.6 Strongly Typical Sequences and Rate Distortion. 10.7 Characterization of the Rate Distortion Function. 10.8 Computation of Channel Capacity and the Rate Distortion Function. Summary. Problems. Historical Notes. 11. Information Theory and Statistics. 11.1 Method of Types. 11.2 Law of Large Numbers. 11.3 Universal Source Coding. 11.4 Large Deviation Theory. 11.5 Examples of Sanov's Theorem. 11.6 Conditional Limit Theorem. 11.7 Hypothesis Testing. 11.8 Chernoff-Stein Lemma. 11.9 Chernoff Information. 11.10 Fisher Information and the Cram-er-Rao Inequality. Summary. Problems. Historical Notes. 12. Maximum Entropy. 12.1 Maximum Entropy Distributions. 12.2 Examples. 12.3 Anomalous Maximum Entropy Problem. 12.4 Spectrum Estimation. 12.5 Entropy Rates of a Gaussian Process. 12.6 Burg's Maximum Entropy Theorem. Summary. Problems. Historical Notes. 13. Universal Source Coding. 13.1 Universal Codes and Channel Capacity. 13.2 Universal Coding for Binary Sequences. 13.3 Arithmetic Coding. 13.4 Lempel-Ziv Coding. 13.5 Optimality of Lempel-Ziv Algorithms. Compression. Summary. Problems. Historical Notes. 14. Kolmogorov Complexity. 14.1 Models of Computation. 14.2 Kolmogorov Complexity: Definitions and Examples. 14.3 Kolmogorov Complexity and Entropy. 14.4 Kolmogorov Complexity of Integers. 14.5 Algorithmically Random and Incompressible Sequences. 14.6 Universal Probability. 14.7 Kolmogorov complexity. 14.9 Universal Gambling. 14.10 Occam's Razor. 14.11 Kolmogorov Complexity and Universal Probability. 14.12 Kolmogorov Sufficient Statistic. 14.13 Minimum Description Length Principle. Summary. Problems. Historical Notes. 15. Network Information Theory. 15.1 Gaussian Multiple-User Channels. 15.2 Jointly Typical Sequences. 15.3 Multiple-Access Channel. 15.4 Encoding of Correlated Sources. 15.5 Duality Between Slepian-Wolf Encoding and Multiple-Access Channels. 15.6 Broadcast Channel. 15.7 Relay Channel. 15.8 Source Coding with Side Information. 15.9 Rate Distortion with Side Information. 15.10 General Multiterminal Networks. Summary. Problems. Historical Notes. 16. Information Theory and Portfolio Theory. 16.1 The Stock Market: Some Definitions. 16.2 Kuhn-Tucker Characterization of the Log-Optimal Portfolio. 16.3 Asymptotic Optimality of the Log-Optimal Portfolio. 16.4 Side Information and the Growth Rate. 16.5 Investment in Stationary Markets. 16.6 Competitive Optimality of the Log-Optimal Portfolio. 16.7 Universal Portfolios. 16.8 Shannon-McMillan-Breiman Theorem (General AEP). Summary. Problems. Historical Notes. 17. Inequalities in Information Theory. 17.1 Basic Inequalities of Information Theory. 17.2 Differential Entropy. 17.3 Bounds on Entropy and Relative Entropy. 17.4 Inequalities for Types. 17.5 Combinatorial Bounds on Entropy. 17.6 Entropy Rates of Subsets. 17.7 Entropy and Fisher Information. 17.8 Entropy Power Inequality and Brunn-Minkowski Inequality. 17.9 Inequalities for Determinants. 17.10 Inequalities for Ratios of Determinants. Summary. Problems. Historical Notes. Bibliography. List of Symbols. Index."
            },
            "slug": "Elements-of-Information-Theory-Cover-Thomas",
            "title": {
                "fragments": [],
                "text": "Elements of Information Theory"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The author examines the role of entropy, inequality, and randomness in the design of codes and the construction of codes in the rapidly changing environment."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3477803"
                        ],
                        "name": "I. Pastan",
                        "slug": "I.-Pastan",
                        "structuredName": {
                            "firstName": "Ira",
                            "lastName": "Pastan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Pastan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3502026"
                        ],
                        "name": "M. Willingham",
                        "slug": "M.-Willingham",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Willingham",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Willingham"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2181038"
                        ],
                        "name": "M. Gottesman",
                        "slug": "M.-Gottesman",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Gottesman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Gottesman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 22215578,
            "fieldsOfStudy": [
                "Biology",
                "Chemistry",
                "Medicine"
            ],
            "id": "1a80b684c386608e0a2c0a8005801ffeb8f0c64b",
            "isKey": false,
            "numCitedBy": 48,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Multidrug resistance in human cancer is associated with overexpression of the MDR1 gene which encodes a 170,000 molecular weight membrane glycoprotein that transports cytotoxic drugs out of cancer cells. The MDR1 gene is normally expressed in intestine, kidney, liver, and adrenal glands, and in tumors derived from these tissues, but it is not expressed in normal bone marrow. Transgenic mice that express the MDR1 gene in their bone marrow have been developed, and because of this expression these mice are resistant to the bone marrow‐suppressive effects of daunomycin, doxorubicin, taxol, and several other anticancer drugs. These mice can be used in several different ways to develop new types of drugs to treat human cancer.—Pastan, I.; Willingham, M. C.; Gottesman, M. Molecular manipulations of the multidrug transporter: a new role for transgenic mice. FASEB J. 5: 2523‐2528; 1991."
            },
            "slug": "Molecular-manipulations-of-the-multidrug-a-new-role-Pastan-Willingham",
            "title": {
                "fragments": [],
                "text": "Molecular manipulations of the multidrug transporter: a new role for transgenic mice 1"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Transgenic mice that express the MDR1 gene in their bone marrow have been developed, and because of this expression these mice are resistant to the bone marrow‐suppressive effects of daunomycin, doxorubicin, taxol, and several other anticancer drugs."
            },
            "venue": {
                "fragments": [],
                "text": "FASEB journal : official publication of the Federation of American Societies for Experimental Biology"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3720463"
                        ],
                        "name": "B. Dreiseikelmann",
                        "slug": "B.-Dreiseikelmann",
                        "structuredName": {
                            "firstName": "Brigitte",
                            "lastName": "Dreiseikelmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Dreiseikelmann"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 25752031,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "49410772cb211102dc00ee9d65229c88d2cad664",
            "isKey": false,
            "numCitedBy": 153,
            "numCiting": 105,
            "paperAbstract": {
                "fragments": [],
                "text": "DNA translocation across bacterial membranes occurs during the biological processes of infection by bacteriophages, conjugative DNA transfer of plasmids, T-DNA transfer, and genetic transformation. The mechanism of DNA translocation in these systems is not fully understood, but during the last few years extensive data about genes and gene products involved in the translocation processes have accumulated. One reason for the increasing interest in this topic is the discussion about horizontal gene transfer and transkingdom sex. Analyses of genes and gene products involved in DNA transfer suggest that DNA is transferred through a protein channel spanning the bacterial envelope. No common model exists for DNA translocation during phage infection. Perhaps various mechanisms are necessary as a result of the different morphologies of bacteriophages. The DNA translocation processes during conjugation, T-DNA transfer, and transformation are more consistent and may even be compared to the excretion of some proteins. On the basis of analogies and homologies between the proteins involved in DNA translocation and protein secretion, a common basic model for these processes is presented."
            },
            "slug": "Translocation-of-DNA-across-bacterial-membranes.-Dreiseikelmann",
            "title": {
                "fragments": [],
                "text": "Translocation of DNA across bacterial membranes."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "On the basis of analogies and homologies between the proteins involved in DNA translocation and protein secretion, a common basic model for these processes is presented."
            },
            "venue": {
                "fragments": [],
                "text": "Microbiological reviews"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144011539"
                        ],
                        "name": "A. Goffeau",
                        "slug": "A.-Goffeau",
                        "structuredName": {
                            "firstName": "André",
                            "lastName": "Goffeau",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Goffeau"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38863172"
                        ],
                        "name": "B. Barrell",
                        "slug": "B.-Barrell",
                        "structuredName": {
                            "firstName": "Bart",
                            "lastName": "Barrell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Barrell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3264923"
                        ],
                        "name": "H. Bussey",
                        "slug": "H.-Bussey",
                        "structuredName": {
                            "firstName": "Howard",
                            "lastName": "Bussey",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Bussey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1491938494"
                        ],
                        "name": "R. W. Davis",
                        "slug": "R.-W.-Davis",
                        "structuredName": {
                            "firstName": "R",
                            "lastName": "Davis",
                            "middleNames": [
                                "W"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. W. Davis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7144144"
                        ],
                        "name": "B. Dujon",
                        "slug": "B.-Dujon",
                        "structuredName": {
                            "firstName": "Bernard",
                            "lastName": "Dujon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Dujon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143930360"
                        ],
                        "name": "H. Feldmann",
                        "slug": "H.-Feldmann",
                        "structuredName": {
                            "firstName": "Horst",
                            "lastName": "Feldmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Feldmann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2261447"
                        ],
                        "name": "F. Galibert",
                        "slug": "F.-Galibert",
                        "structuredName": {
                            "firstName": "Francis",
                            "lastName": "Galibert",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Galibert"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144029549"
                        ],
                        "name": "J. Hoheisel",
                        "slug": "J.-Hoheisel",
                        "structuredName": {
                            "firstName": "Jörg",
                            "lastName": "Hoheisel",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hoheisel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2445770"
                        ],
                        "name": "C. Jacq",
                        "slug": "C.-Jacq",
                        "structuredName": {
                            "firstName": "Claude",
                            "lastName": "Jacq",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Jacq"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145960136"
                        ],
                        "name": "M. Johnston",
                        "slug": "M.-Johnston",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Johnston",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Johnston"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35633102"
                        ],
                        "name": "E. Louis",
                        "slug": "E.-Louis",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Louis",
                            "middleNames": [
                                "J"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Louis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680812"
                        ],
                        "name": "H. Mewes",
                        "slug": "H.-Mewes",
                        "structuredName": {
                            "firstName": "Hans-Werner",
                            "lastName": "Mewes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Mewes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2072780018"
                        ],
                        "name": "Y. Murakami",
                        "slug": "Y.-Murakami",
                        "structuredName": {
                            "firstName": "Yoko",
                            "lastName": "Murakami",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Murakami"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1816027"
                        ],
                        "name": "P. Philippsen",
                        "slug": "P.-Philippsen",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Philippsen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Philippsen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3161087"
                        ],
                        "name": "H. Tettelin",
                        "slug": "H.-Tettelin",
                        "structuredName": {
                            "firstName": "Hervé",
                            "lastName": "Tettelin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Tettelin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2409818"
                        ],
                        "name": "S. Oliver",
                        "slug": "S.-Oliver",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Oliver",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Oliver"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16763139,
            "fieldsOfStudy": [
                "Biology",
                "Engineering"
            ],
            "id": "0635d3f7ac72619a11f5b5d1ad55577588344852",
            "isKey": false,
            "numCitedBy": 4033,
            "numCiting": 121,
            "paperAbstract": {
                "fragments": [],
                "text": "The genome of the yeast Saccharomyces cerevisiae has been completely sequenced through a worldwide collaboration. The sequence of 12,068 kilobases defines 5885 potential protein-encoding genes, approximately 140 genes specifying ribosomal RNA, 40 genes for small nuclear RNA molecules, and 275 transfer RNA genes. In addition, the complete sequence provides information about the higher order organization of yeast's 16 chromosomes and allows some insight into their evolutionary history. The genome shows a considerable amount of apparent genetic redundancy, and one of the major problems to be tackled during the next stage of the yeast genome project is to elucidate the biological functions of all of these genes."
            },
            "slug": "Life-with-6000-Genes-Goffeau-Barrell",
            "title": {
                "fragments": [],
                "text": "Life with 6000 Genes"
            },
            "tldr": {
                "abstractSimilarityScore": 64,
                "text": "The genome of the yeast Saccharomyces cerevisiae has been completely sequenced through a worldwide collaboration and provides information about the higher order organization of yeast's 16 chromosomes and allows some insight into their evolutionary history."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145956042"
                        ],
                        "name": "M. G. Lorenz",
                        "slug": "M.-G.-Lorenz",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Lorenz",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. G. Lorenz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4088269"
                        ],
                        "name": "W. Wackernagel",
                        "slug": "W.-Wackernagel",
                        "structuredName": {
                            "firstName": "Wilfried",
                            "lastName": "Wackernagel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Wackernagel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 25747689,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "98e0073f9a0778c26584cc90ba873b014ef237ec",
            "isKey": false,
            "numCitedBy": 1246,
            "numCiting": 360,
            "paperAbstract": {
                "fragments": [],
                "text": "Natural genetic transformation is the active uptake of free DNA by bacterial cells and the heritable incorporation of its genetic information. Since the famous discovery of transformation in Streptococcus pneumoniae by Griffith in 1928 and the demonstration of DNA as the transforming principle by Avery and coworkers in 1944, cellular processes involved in transformation have been studied extensively by in vitro experimentation with a few transformable species. Only more recently has it been considered that transformation may be a powerful mechanism of horizontal gene transfer in natural bacterial populations. In this review the current understanding of the biology of transformation is summarized to provide the platform on which aspects of bacterial transformation in water, soil, and sediments and the habitat of pathogens are discussed. Direct and indirect evidence for gene transfer routes by transformation within species and between different species will be presented, along with data suggesting that plasmids as well as chromosomal DNA are subject to genetic exchange via transformation. Experiments exploring the prerequisites for transformation in the environment, including the production and persistence of free DNA and factors important for the uptake of DNA by cells, will be compiled, as well as possible natural barriers to transformation. The efficiency of gene transfer by transformation in bacterial habitats is possibly genetically adjusted to submaximal levels. The fact that natural transformation has been detected among bacteria from all trophic and taxonomic groups including archaebacteria suggests that transformability evolved early in phylogeny. Probable functions of DNA uptake other than gene acquisition will be discussed. The body of information presently available suggests that transformation has a great impact on bacterial population dynamics as well as on bacterial evolution and speciation."
            },
            "slug": "Bacterial-gene-transfer-by-natural-genetic-in-the-Lorenz-Wackernagel",
            "title": {
                "fragments": [],
                "text": "Bacterial gene transfer by natural genetic transformation in the environment."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The current understanding of the biology of transformation is summarized to provide the platform on which aspects of bacterial transformation in water, soil, and sediments and the habitat of pathogens are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Microbiological reviews"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5386190"
                        ],
                        "name": "D. Dubnau",
                        "slug": "D.-Dubnau",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Dubnau",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Dubnau"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 33063329,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6401f54c3230e85a38005c275c107985bcc6fa38",
            "isKey": false,
            "numCitedBy": 111,
            "numCiting": 53,
            "paperAbstract": {
                "fragments": [],
                "text": "Genetic competence develops as a global response of Bacillus subtilis to the onset of stationary phase, in glucose‐minimal salts‐based media. The onset of competence is accompanied by the expression of several late gene products that are required for the binding, processing and uptake of transforming DNA. A number of regulatory genes have been identified that are needed for the appropriate synthesis of the late gene products. The regulatory gene products include a number of known transcription factors, as well as several members of the bacterial two‐component regulatory system. Genetic analysis has suggested a scheme for the flow of regulatory information signaling the onset of competence. Most of these regulatory products appear to be involved in the response to nutritional status, while the components responsible for growth stage and cell‐type‐specific control remain unknown. The general implications of this scheme for post‐exponential expression are discussed."
            },
            "slug": "The-regulation-of-genetic-competence-in-Bacillus-Dubnau",
            "title": {
                "fragments": [],
                "text": "The regulation of genetic competence in Bacillus subtilis"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Genetic analysis has suggested a scheme for the flow of regulatory information signaling the onset of competence of Bacillus subtilis, and the general implications of this scheme for post‐exponential expression are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Molecular microbiology"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47736940"
                        ],
                        "name": "R. Palmen",
                        "slug": "R.-Palmen",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Palmen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Palmen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1990158584"
                        ],
                        "name": "A. Driessen",
                        "slug": "A.-Driessen",
                        "structuredName": {
                            "firstName": "Arnold J.M.",
                            "lastName": "Driessen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Driessen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4323974"
                        ],
                        "name": "K. Hellingwerf",
                        "slug": "K.-Hellingwerf",
                        "structuredName": {
                            "firstName": "Klaas",
                            "lastName": "Hellingwerf",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Hellingwerf"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 21920786,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d6f0c07b0ad32fd5572147e7f28b2ffa89978a88",
            "isKey": false,
            "numCitedBy": 34,
            "numCiting": 333,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Bioenergetic-aspects-of-the-translocation-of-across-Palmen-Driessen",
            "title": {
                "fragments": [],
                "text": "Bioenergetic aspects of the translocation of macromolecules across bacterial membranes."
            },
            "venue": {
                "fragments": [],
                "text": "Biochimica et biophysica acta"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52211576"
                        ],
                        "name": "G. F. Ames",
                        "slug": "G.-F.-Ames",
                        "structuredName": {
                            "firstName": "G",
                            "lastName": "Ames",
                            "middleNames": [
                                "F"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. F. Ames"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 8499820,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e7974404c9e476b3a4ccd3d7ef940345f590de40",
            "isKey": false,
            "numCitedBy": 645,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "RAHAL J1. Effect of combined therapy with ansamycin, clofazimine, ethambutol, and isoniazid for Mycobacterium avium infection in patients with AIDS. Characterization of the drug-stimulatable A TP hydrolysis. ANDERSON R, ZEIS BM, ANDERSON IF. Clofazimine-mediated enhancement of reactive oxidant production by human phagocytes as a possible therapeutic mechanism. ANDERSON R, SMIT M1. Clofazimine and B669 inhibit the proliferative responses and Na+,K+ adenosine triphosphatase activity of human lymphocytes by a lysophospholipid­ dependent mechanism."
            },
            "slug": "Bacterial-periplasmic-transport-systems:-structure,-Ames",
            "title": {
                "fragments": [],
                "text": "Bacterial periplasmic transport systems: structure, mechanism, and evolution."
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "Clofazimine-mediated enhancement of reactive oxidant production by human phagocytes as a possible therapeutic mechanism and characterization of the drug-stimulatable A TP hydrolysis."
            },
            "venue": {
                "fragments": [],
                "text": "Annual review of biochemistry"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49482724"
                        ],
                        "name": "M. Mergeay",
                        "slug": "M.-Mergeay",
                        "structuredName": {
                            "firstName": "Max",
                            "lastName": "Mergeay",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Mergeay"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40615497,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "862ff0bb005327b833294351b7ff8cbb7082c829",
            "isKey": false,
            "numCitedBy": 96,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Towards-an-understanding-of-the-genetics-of-metal-Mergeay",
            "title": {
                "fragments": [],
                "text": "Towards an understanding of the genetics of bacterial metal resistance."
            },
            "venue": {
                "fragments": [],
                "text": "Trends in biotechnology"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145695671"
                        ],
                        "name": "R. Prasad",
                        "slug": "R.-Prasad",
                        "structuredName": {
                            "firstName": "Rajendra",
                            "lastName": "Prasad",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Prasad"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3498210"
                        ],
                        "name": "S. K. Murthy",
                        "slug": "S.-K.-Murthy",
                        "structuredName": {
                            "firstName": "Sheela",
                            "lastName": "Murthy",
                            "middleNames": [
                                "Krishna"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. K. Murthy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110651875"
                        ],
                        "name": "V. Gupta",
                        "slug": "V.-Gupta",
                        "structuredName": {
                            "firstName": "Vinita",
                            "lastName": "Gupta",
                            "middleNames": [
                                "Kumari"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Gupta"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49814949"
                        ],
                        "name": "S. Lata",
                        "slug": "S.-Lata",
                        "structuredName": {
                            "firstName": "Suman",
                            "lastName": "Lata",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Lata"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 88939306,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "90ff92389fb4ad76c9ad69c48f959a59904cb3d4",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "MULTIDRUG-RESISTANCE-:-AN-EMERGING-THREAT-Prasad-Murthy",
            "title": {
                "fragments": [],
                "text": "MULTIDRUG RESISTANCE : AN EMERGING THREAT"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2876408"
                        ],
                        "name": "F. Opperdoes",
                        "slug": "F.-Opperdoes",
                        "structuredName": {
                            "firstName": "Fred",
                            "lastName": "Opperdoes",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Opperdoes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36773494,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3a1930b6d40ad064104f7f595c35c39949a5230a",
            "isKey": false,
            "numCitedBy": 469,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Compartmentation-of-carbohydrate-metabolism-in-Opperdoes",
            "title": {
                "fragments": [],
                "text": "Compartmentation of carbohydrate metabolism in trypanosomes."
            },
            "venue": {
                "fragments": [],
                "text": "Annual review of microbiology"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2181038"
                        ],
                        "name": "M. Gottesman",
                        "slug": "M.-Gottesman",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Gottesman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Gottesman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3477803"
                        ],
                        "name": "I. Pastan",
                        "slug": "I.-Pastan",
                        "structuredName": {
                            "firstName": "Ira",
                            "lastName": "Pastan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Pastan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34517429,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bab485ff4ae7dd15e1b0dc09e0df4b20e2ad00f5",
            "isKey": false,
            "numCitedBy": 3522,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Biochemistry-of-multidrug-resistance-mediated-by-Gottesman-Pastan",
            "title": {
                "fragments": [],
                "text": "Biochemistry of multidrug resistance mediated by the multidrug transporter."
            },
            "venue": {
                "fragments": [],
                "text": "Annual review of biochemistry"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 80,
                                "start": 58
                            }
                        ],
                        "text": "This method works well with text and has been used often (Yang and Pederson 1997; Joachims 1997; Craven et al. 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Feature selection in statistical learning of text categorization"
            },
            "venue": {
                "fragments": [],
                "text": "ICML-97"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 201,
                                "start": 181
                            }
                        ],
                        "text": "It is also more clear in the multi-variate Bernoulli model how to relax the independence assumption by adding a limited number of dependencies to the Bayesian network (Sahami 1996; Friedman et al. 1997)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 150,
                                "start": 130
                            }
                        ],
                        "text": "Simple Bayesian classifiers have been gaining popularity lately, and have been found to perform surprisingly well (Friedman 1997; Friedman et al. 1997; Sahami 1996; Langley et al. 1992)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 244,
                                "start": 231
                            }
                        ],
                        "text": "This paradox is explained by the fact that classification estimation is only a function of the sign (in binary cases) of the function estimation; the function approximation can still be poor while classification accuracy remains high (Friedman 1997; Domingos and Pazzani 1997)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Bayesian network classiiers"
            },
            "venue": {
                "fragments": [],
                "text": "Machine Learning"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Combining classi ersin text categorization"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Sparck-Jones. Relevance weighting of search terms"
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the American Society for Information Science,"
            },
            "year": 1976
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 195,
                                "start": 182
                            }
                        ],
                        "text": "This approach has also been used for text classification by numerous people (Lewis and Gale 1994; Kalt and Croft 1996; Joachims 1997; Guthrie and Walker 1994; Li and Yamanishi 1997; Mitchell 1997; Nigam et al. 1998; McCallum et al. 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Machine Learning. WCB/McGraw-Hill"
            },
            "venue": {
                "fragments": [],
                "text": "Machine Learning. WCB/McGraw-Hill"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Document classi cation by machine : Theory and practice"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Cover and"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 157,
                                "start": 134
                            }
                        ],
                        "text": "This approach has also been used for text classification by numerous people (Lewis and Gale 1994; Kalt and Croft 1996; Joachims 1997; Guthrie and Walker 1994; Li and Yamanishi 1997; Mitchell 1997; Nigam et al. 1998; McCallum et al. 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Document classiication by machine: Theory and practice"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of COLING-94"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 140,
                                "start": 129
                            }
                        ],
                        "text": "We can calculate Bayes-optimal estimates for these probabilities by straightforward counting of events, supplemented by a prior (Vapnik 1982)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Estimations of dependences based on statistical data"
            },
            "venue": {
                "fragments": [],
                "text": "Estimations of dependences based on statistical data"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Improving text clasi cation by shrinkage in ahierarchy of classes"
            },
            "venue": {
                "fragments": [],
                "text": "Machine Learning"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Improving text clasi cation by shrinkage in ahierarchy of classes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Combining classi ersin text categorization"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 180,
                                "start": 159
                            }
                        ],
                        "text": "This approach has also been used for text classification by numerous people (Lewis and Gale 1994; Kalt and Croft 1996; Joachims 1997; Guthrie and Walker 1994; Li and Yamanishi 1997; Mitchell 1997; Nigam et al. 1998; McCallum et al. 1998)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 79
                            }
                        ],
                        "text": "(3)\n1In a more general setting, this one-to-one correspondence can be avoided (Li and Yamanishi 1997; Nigam et al. 1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Document classiication using a nite mixture model"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 35th Annual Meeting of the Association for Computational Linguistics"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Friedman . On bias , variance , 0 / 1loss , and the curseofdimensionality"
            },
            "venue": {
                "fragments": [],
                "text": "Data Mining and Knowledge Discovery"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 201,
                                "start": 181
                            }
                        ],
                        "text": "It is also more clear in the multi-variate Bernoulli model how to relax the independence assumption by adding a limited number of dependencies to the Bayesian network (Sahami 1996; Friedman et al. 1997)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 150,
                                "start": 130
                            }
                        ],
                        "text": "Simple Bayesian classifiers have been gaining popularity lately, and have been found to perform surprisingly well (Friedman 1997; Friedman et al. 1997; Sahami 1996; Langley et al. 1992)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Bayesian network classi ers"
            },
            "venue": {
                "fragments": [],
                "text": "Machine Learning"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Friedman . On bias , variance , 0 / 1loss , andthe curseofdimensionality"
            },
            "venue": {
                "fragments": [],
                "text": "Data Mining and KnowledgeDiscovery"
            },
            "year": 1997
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 9,
            "methodology": 18
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 49,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/A-comparison-of-event-models-for-naive-bayes-text-McCallum-Nigam/04ce064505b1635583fa0d9cc07cac7e9ea993cc?sort=total-citations"
}