{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14801990,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6f20e254e3993538c79e0ff2b9b8f198d3359cb3",
            "isKey": false,
            "numCitedBy": 4215,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "In the central nervous system the visual pathway from retina to striate cortex provides an opportunity to observe and compare single unit responses at several distinct levels. Patterns of light stimuli most effective in influencing units at one level may no longer be the most effective at the next. From differences in responses at successive stages in the pathway one may hope to gain some understanding of the part each stage plays in visual perception. By shining small spots of light on the light-adapted cat retina Kuffler (1953) showed that ganglion cells have concentric receptive fields, with an 'on' centre and an 'off ' periphery, or vice versa. The 'on' and 'off' areas within a receptive field were found to be mutually antagonistic, and a spot restricted to the centre of the field was more effective than one covering the whole receptive field (Barlow, FitzHugh & Kuffler, 1957). In the freely moving lightadapted cat it was found that the great majority of cortical cells studied gave little or no response to light stimuli covering most of the animal's visual field, whereas small spots shone in a restricted retinal region often evoked brisk responses (Hubel, 1959). A moving spot of light often produced stronger responses than a stationary one, and sometimes a moving spot gave more activation for one direction than for the opposite. The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex. Receptive fields of the cells considered in this paper were divided into separate excitatory and inhibitory ('on' and 'off') areas. In this respect they resembled retinal ganglion-cell receptive fields. However, the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinal ganglion cells. An attempt was made to correlate responses to moving stimuli"
            },
            "slug": "Receptive-fields-of-single-neurones-in-the-cat's-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields of single neurones in the cat's striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex, which resembled retinal ganglion-cell receptive fields, but the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinalganglion cells."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12432,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15771537,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5a0c4a618425328ba0bbb9737b02e2ac18f94646",
            "isKey": false,
            "numCitedBy": 413,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "A beginning has recently been made in recording single neurone activity from animals with chronically implanted electrodes (Hubel, 1957a; Gusel'nikov, 1957; Ricci, Doane & Jasper, 1957; Strumwasser, 1958). These methods eliminate anaesthetics, paralysing drugs, brain-stem lesions, and other acute experimental procedures. They make it possible to record electrical events in the higher central nervous system with the animal in a normal state, and to correlate these electrical events with such variables as waking state, attention, learning, and motor activity. The present paper describes a method for unit recording from the cortex of unanaesthetized, unrestrained cats, and presents some observations from the striate cortex. The objectives have been (1) to observe maintained unit activity under various conditions such as sleep and wakefulness, and (2) to find for each unit the natural stimuli which most effectively influence firing. Of 400 units observed, some 200 are presented here because of their common characteristics. Since there is reason to believe that the remainiing 200 units were afferent fibres from the lateral geniculate nucleus, these will be described in a separate paper. A preliminary account of some of this work has been given elsewhere (Hubel, 1958)."
            },
            "slug": "Single-unit-activity-in-striate-cortex-of-cats-Hubel",
            "title": {
                "fragments": [],
                "text": "Single unit activity in striate cortex of unrestrained cats"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "A method for unit recording from the cortex of unanaesthetized, unrestrained cats is described, some observations from the striate cortex are presented, and the objectives have been to observe maintained unit activity under various conditions such as sleep and wakefulness."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5647202"
                        ],
                        "name": "J. Lettvin",
                        "slug": "J.-Lettvin",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Lettvin",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lettvin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2701850"
                        ],
                        "name": "H. Maturana",
                        "slug": "H.-Maturana",
                        "structuredName": {
                            "firstName": "Humberto",
                            "lastName": "Maturana",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Maturana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4605464"
                        ],
                        "name": "W. McCulloch",
                        "slug": "W.-McCulloch",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "McCulloch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. McCulloch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50314979"
                        ],
                        "name": "W. Pitts",
                        "slug": "W.-Pitts",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Pitts",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pitts"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 95
                            }
                        ],
                        "text": "Examples of this are provided by the 'fly detectors' (Barlow, 1953) and 'convexity detectors' (Lettvin et al. 1959) of the frog's retina, the Jinear elements of the cat's cortex (Hubel & Wiesel, 32.2 H. B. BARLOW AND W. B. LEVICK 1959, 1962), the 'horizontal edge detectors' of the pigeon retina…"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8739509,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bc4e084831b9f987826b2cf184356e347ee155f8",
            "isKey": true,
            "numCitedBy": 1756,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we analyze the activity of single fibers in the optic nerve of a frog. Our method is to find what sort of stimulus causes the largest activity in one nerve fiber and then what is the exciting aspect of that stimulus such that variations in everything else cause little change in the response. It has been known for the past 20 years that each fiber is connected not to a few rods and cones in the retina but to very many over a fair area. Our results show that for the most part within that area, it is not the light intensity itself but rather the pattern of local variation of intensity that is the exciting factor. There are four types of fibers, each type concerned with a different sort of pattern. Each type is uniformly distributed over the whole retina of the frog. Thus, there are four distinct parallel distributed channels whereby the frog's eye informs his brain about the visual image in terms of local pattern independent of average illumination. We describe the patterns and show the functional and anatomical separation of the channels. This work has been done on the frog, and our interpretation applies only to the frog."
            },
            "slug": "What-the-Frog's-Eye-Tells-the-Frog's-Brain-Lettvin-Maturana",
            "title": {
                "fragments": [],
                "text": "What the Frog's Eye Tells the Frog's Brain"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The results show that for the most part within that area of the optic nerve of a frog, it is not the light intensity itself but rather the pattern of local variation of intensity that is the exciting factor."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IRE"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2701850"
                        ],
                        "name": "H. Maturana",
                        "slug": "H.-Maturana",
                        "structuredName": {
                            "firstName": "Humberto",
                            "lastName": "Maturana",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Maturana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5647202"
                        ],
                        "name": "J. Lettvin",
                        "slug": "J.-Lettvin",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Lettvin",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lettvin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4605464"
                        ],
                        "name": "W. McCulloch",
                        "slug": "W.-McCulloch",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "McCulloch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. McCulloch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50314979"
                        ],
                        "name": "W. Pitts",
                        "slug": "W.-Pitts",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Pitts",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pitts"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15069653,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "224f2779062888f436160e154999c232af3a2f17",
            "isKey": false,
            "numCitedBy": 772,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Anatomy-and-Physiology-of-Vision-in-the-Frog-(Rana-Maturana-Lettvin",
            "title": {
                "fragments": [],
                "text": "Anatomy and Physiology of Vision in the Frog (Rana pipiens)"
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of general physiology"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2701850"
                        ],
                        "name": "H. Maturana",
                        "slug": "H.-Maturana",
                        "structuredName": {
                            "firstName": "Humberto",
                            "lastName": "Maturana",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Maturana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144166210"
                        ],
                        "name": "S. Frenk",
                        "slug": "S.-Frenk",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Frenk",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Frenk"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 27111165,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1d0ccba7cdb8dd90c0f43dacc77201f02e276591",
            "isKey": false,
            "numCitedBy": 223,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "There are ganglion cells in the pigeon retina that respond selectively, some to any edge moving in a particcular direction only, others to any vertically moving horizontal edge. This selective response to a specific stimulus arises from the selective sensitivity of each neuron to a particular spatiotemporal configuration in its afferent influences, and is independent of specific pathways."
            },
            "slug": "Directional-Movement-and-Horizontal-Edge-Detectors-Maturana-Frenk",
            "title": {
                "fragments": [],
                "text": "Directional Movement and Horizontal Edge Detectors in the Pigeon Retina"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "There are ganglion cells in the pigeon retina that respond selectively, some to any edge moving in a particcular direction only, others to any vertically moving horizontal edge."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40393452"
                        ],
                        "name": "W. Reichardt",
                        "slug": "W.-Reichardt",
                        "structuredName": {
                            "firstName": "Werner",
                            "lastName": "Reichardt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Reichardt"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 92648801,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "34e15e07d6c93a4bee2e8e4182d6116894fbd552",
            "isKey": false,
            "numCitedBy": 205,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Like many other animals, the beetle Chlorophanus viridis responds to relative motions of its optical surroundings with optokinetic reactions. These follow not only from the movement of figures distinguishable against their backgrounds, but also from the movement of randomly constructed patterns of shades from white through black. In the latter case the evaluation by the beetle’s central nervous system is made in accordance with the principle of autocorrelation of a time function. The relation between stimuli of the movement and the strength of the reaction, as calculated from this principle, is plotted in Fig. 9."
            },
            "slug": "Autokorrelations-Auswertung-als-Funktionsprinzip-Reichardt",
            "title": {
                "fragments": [],
                "text": "Autokorrelations-Auswertung als Funktionsprinzip des Zentralnervensystems"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "Like many other animals, the beetle Chlorophanus viridis responds to relative motions of its optical surroundings with optokinetic reactions, and the relation between stimuli of the movement and the strength of the reaction, as calculated from this principle is plotted."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2026553"
                        ],
                        "name": "O. Selfridge",
                        "slug": "O.-Selfridge",
                        "structuredName": {
                            "firstName": "Oliver",
                            "lastName": "Selfridge",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Selfridge"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4907109"
                        ],
                        "name": "U. Neisser",
                        "slug": "U.-Neisser",
                        "structuredName": {
                            "firstName": "Ulric",
                            "lastName": "Neisser",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Neisser"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14956427,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8def1503d588f2dc413e0b3e769be5e033d9e737",
            "isKey": false,
            "numCitedBy": 263,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Can a machine think? The answer to this old chestnut is certainly \"yes\": Computers have been made to play chess and checkers, to prove theorems, to solve intricate problems of strategy. Yet the intelligence implied by such activities has an elusive, unnatural quality. It is not based on any orderly development of cognitive skills. In particular, the machines are not well equipped to select from their environment the things, or the relations, they are going to think about. In this they are sharply distinguished from intelligent living organisms. Every child learns to analyze speech into meaningful patterns long before he can prove any propositions. Computers can find proofs, but they cannot understand the simplest spoken instructions. Even the earliest computers could do arithmetic superbly, but only very recently have they begun to read the written digits that a child recognizes before he learns to add them. Understanding speech and reading print are examples of a basic intellectual skill that can variously be called cognition, abstraction or perception; perhaps the best general termfor it is patternrecognition. Except for their inability to recognize patterns, machines (or, more accurately, the programs that tell machines what to do) have now met most of the classic criteria of intelligence that skeptics have proposed. They can outperform their designers: The checker-playing program devised by Arthur L. Samuel of International Business Machines Corporation (1959a) usually beats him. They are original: The \"Logic Theorist,\" a creation of a group from the Carnegie Institute of Technology and the RAND Corporation [Newell, Simon, and Shaw (1956a, 19576)] has found proofs for many of the theorems in Principia Mathematica, the"
            },
            "slug": "Pattern-recognition-by-machine-Selfridge-Neisser",
            "title": {
                "fragments": [],
                "text": "Pattern recognition by machine"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Except for their inability to recognize patterns, machines have now met most of the classic criteria of intelligence that skeptics have proposed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691341"
                        ],
                        "name": "R. L. Grimsdale",
                        "slug": "R.-L.-Grimsdale",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Grimsdale",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. Grimsdale"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "24348125"
                        ],
                        "name": "F. Sumner",
                        "slug": "F.-Sumner",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Sumner",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Sumner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16929711"
                        ],
                        "name": "C. J. Tunis",
                        "slug": "C.-J.-Tunis",
                        "structuredName": {
                            "firstName": "Cyril",
                            "lastName": "Tunis",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. J. Tunis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34704748"
                        ],
                        "name": "T. Kilburn",
                        "slug": "T.-Kilburn",
                        "structuredName": {
                            "firstName": "Tom",
                            "lastName": "Kilburn",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kilburn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 57111671,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "726e2870e754dd2c3b30dfe9486ff23fceb01730",
            "isKey": false,
            "numCitedBy": 91,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "The paper describes a new method for the automatic recognition of patterns. The method may be applied to any form of spatial pattern, but in the present instance, patterns consisting of line figures are considered. The pattern is presented to a flying-spot scanner connected to a digital computer. The shape of the pattern is analysed and a statement is prepared describing the basic features of the pattern. The pattern is then recognized by comparing this statement with a number of others already stored in the computer which relate to named patterns. Patterns are recognized independently of the angle at which they are presented to the scanner, and may be of any size provided that limits imposed by the resolution of the scanner are not exceeded. The average time to recognize a character is 60 seconds with the system programmed on a medium-speed computer. Special-purpose equipment built to perform certain of the stages of the process, together with the use of higher-speed computers now envisaged, will reduce this time by at least a thousandfold. If a new pattern is presented to the machine it will indicate its inability to recognize the pattern, but by giving the machine the name of the pattern, it may become one of the standard patterns which it can subsequently recognize. All the patterns recognized by the machine are hand-drawn and consist of such symbols as the capital letters of the alphabet and numerals, although the system is in no way limited to any special set of characters. Using exactly the same method but with an increase in the degree of complexity, it will be possible for machines to read handwriting. Special allowances are made for imperfections in the patterns, including breaks and general ill-definition. Where there is some confusion and an unknown pattern resembles two or more of the standard patterns, the relative degrees of similarity of the unknown to each of these standard patterns is printed out by the machine."
            },
            "slug": "A-system-for-the-automatic-recognition-of-patterns-Grimsdale-Sumner",
            "title": {
                "fragments": [],
                "text": "A system for the automatic recognition of patterns"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "A new method for the automatic recognition of patterns consisting of line figures, using exactly the same method but with an increase in the degree of complexity, it will be possible for machines to read handwriting."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2977490"
                        ],
                        "name": "L. Uhr",
                        "slug": "L.-Uhr",
                        "structuredName": {
                            "firstName": "Leonard",
                            "lastName": "Uhr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Uhr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46797468"
                        ],
                        "name": "C. Vossler",
                        "slug": "C.-Vossler",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Vossler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Vossler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6440403,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "693e791966b333ad5bec096999cea2cce122cd38",
            "isKey": false,
            "numCitedBy": 121,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes an attempt to make use of machine learning or self-organizing processes in the design of a pattern-recognition program. The program starts not only without any knowledge of specific patterns to be input, but also without any operators for processing inputs. Operators are generated and refined by the program itself as a function of the problem space and of its own successes and failures in dealing with the problem space. Not only does the program learn information about different patterns, it also learns or constructs, in part at least, a secondary code appropriate for the analysis of the particular set of patterns input to it."
            },
            "slug": "A-pattern-recognition-program-that-generates,-and-Uhr-Vossler",
            "title": {
                "fragments": [],
                "text": "A pattern recognition program that generates, evaluates, and adjusts its own operators"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "This paper describes an attempt to make use of machine learning or self-organizing processes in the design of a pattern-recognition program that learns or constructs a secondary code appropriate for the analysis of the particular set of patterns input to it."
            },
            "venue": {
                "fragments": [],
                "text": "IRE-AIEE-ACM '61 (Western)"
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "15805169"
                        ],
                        "name": "L. Kamentsky",
                        "slug": "L.-Kamentsky",
                        "structuredName": {
                            "firstName": "Louis",
                            "lastName": "Kamentsky",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Kamentsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "123266344"
                        ],
                        "name": "Chao-Ning Liu",
                        "slug": "Chao-Ning-Liu",
                        "structuredName": {
                            "firstName": "Chao-Ning",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chao-Ning Liu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6188555,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2e9407b62dd34f68d9b60072e9be3f146ab111b6",
            "isKey": false,
            "numCitedBy": 85,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "A computer program has been written to design character recognition logic based on the processing of data samples. This program consists of two subroutines: (1) to search for logic circuits having certain constraints on hardware design, and (2) to evaluate these logics in terms of their discriminating ability over samples of the character set they are expected to recognize. An executive routine is used to apply these subroutines to select a complete logic with a given performance and complexity. This logic consists of 39 to 96 AND gates connected to a shift register and a table look-up or resistance network comparison system. \n \nThe methods were applied to the design of recognitionl ogics for the 52 upper and lower case characters of IBM Electric Modern Pica type font and lower case Cyrillic characters scanned from Russian text. In both cases when the logics were tested on data different from that used to design the logics, the substitution rate was about one error per thousand. A single logic was designed to read two different Cyrillic fonts. For this design, an error rate of one error per hundred characters was observed. \n \nSeveral experiments are reported ona number of logics designed for typewritten data, and single- and two-font Cyrillic data. The performances of different recognitionsy stems are compared as a function of the complexity of the recognition logics."
            },
            "slug": "Computer-Automated-Design-of-Multifont-Print-Logic-Kamentsky-Liu",
            "title": {
                "fragments": [],
                "text": "Computer-Automated Design of Multifont Print Recognition Logic"
            },
            "tldr": {
                "abstractSimilarityScore": 86,
                "text": "A computer program has been written to design character recognition logic based on the processing of data samples to search for logic circuits having certain constraints on hardware design and evaluate these logics in terms of their discriminating ability over samples of the character set they are expected to recognize."
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. Dev."
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152663867"
                        ],
                        "name": "R. M. Hill",
                        "slug": "R.-M.-Hill",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Hill",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. M. Hill"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3672557"
                        ],
                        "name": "W. Levick",
                        "slug": "W.-Levick",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Levick",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Levick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 189,
                                "start": 171
                            }
                        ],
                        "text": "It is certainly incomplete, for it does not specify the connexions of the concentric type of ganglion cell, nor of those selectively responsive to fast and slow movement (Barlow et al. 1964)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 5
                            }
                        ],
                        "text": "5 of Barlow et al. (1964) and Fig."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 166,
                                "start": 148
                            }
                        ],
                        "text": "Thomson's (1953) work on the rabbit's retina, together with our own findings on the different latencies of centre and surround in concentric units (Barlow et al. 1964) lent some plausibility to the suggestion that the latencies might vary with position, but the result shown in Fig."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 5
                            }
                        ],
                        "text": "5 of Barlow et al. (1964) , the thresholds for spots of various sizes moving in the preferred direction differ by small and inconstant amounts from those for the same spot turned on or off."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 23,
                                "start": 5
                            }
                        ],
                        "text": "5 of Barlow et al. 1964 ), or movement in the surround (Fig."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 12
                            }
                        ],
                        "text": "Figure 5 of Barlow et al. (1964) shows the effect of this inhibitory mechanism on the threshold."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 42,
                                "start": 24
                            }
                        ],
                        "text": "As described elsewhere (Barlow et al. 1964), it proved most effective to use fine tungsten electrodes, decerebrate or lightly anaesthetized (urethane and chloralose mixture) animals, and immobilization by continuous infusion of gallamine triethiodide (Flaxedil)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 40905952,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b6e2fea2fda15653ad67446d1a8ee91062714f5f",
            "isKey": false,
            "numCitedBy": 814,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Retinal-ganglion-cells-responding-selectively-to-of-Barlow-Hill",
            "title": {
                "fragments": [],
                "text": "Retinal ganglion cells responding selectively to direction and speed of image motion in the rabbit"
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1964
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 27,
                                "start": 15
                            }
                        ],
                        "text": "1964; see also Barlow, 1953)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 66,
                                "start": 54
                            }
                        ],
                        "text": "Examples of this are provided by the 'fly detectors' (Barlow, 1953) and 'convexity detectors' (Lettvin et al. 1959) of the frog's retina, the Jinear elements of the cat's cortex (Hubel & Wiesel, 32.2 H. B. BARLOW AND W. B. LEVICK 1959, 1962), the 'horizontal edge detectors' of the pigeon retina…"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 3240988,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5d977ee72fd0aaf8c2ac2808c9dd522cdef8b4b7",
            "isKey": false,
            "numCitedBy": 839,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Summation-and-inhibition-in-the-frog's-retina-Barlow",
            "title": {
                "fragments": [],
                "text": "Summation and inhibition in the frog's retina"
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48526970"
                        ],
                        "name": "W. Reichardt",
                        "slug": "W.-Reichardt",
                        "structuredName": {
                            "firstName": "Werner",
                            "lastName": "Reichardt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Reichardt"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60800063,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "f3f1a00064bddb0ff24ea19a87bbb0edf69b25e9",
            "isKey": false,
            "numCitedBy": 1014,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Autocorrelation,-a-principle-for-the-evaluation-of-Reichardt",
            "title": {
                "fragments": [],
                "text": "Autocorrelation, a principle for the evaluation of sensory information by the central nervous system"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5647202"
                        ],
                        "name": "J. Lettvin",
                        "slug": "J.-Lettvin",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Lettvin",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lettvin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2701850"
                        ],
                        "name": "H. Maturana",
                        "slug": "H.-Maturana",
                        "structuredName": {
                            "firstName": "Humberto",
                            "lastName": "Maturana",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Maturana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50314979"
                        ],
                        "name": "W. Pitts",
                        "slug": "W.-Pitts",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Pitts",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pitts"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4605464"
                        ],
                        "name": "W. McCulloch",
                        "slug": "W.-McCulloch",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "McCulloch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. McCulloch"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44812912,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "692c9af2c7965ae9df8988a6ccae094bfc0fd208",
            "isKey": false,
            "numCitedBy": 200,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Two-remarks-on-the-visual-system-of-the-frog.-Lettvin-Maturana",
            "title": {
                "fragments": [],
                "text": "Two remarks on the visual system of the frog."
            },
            "venue": {
                "fragments": [],
                "text": "AFOSR TR. United States. Air Force. Office of Scientific Research"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5569249"
                        ],
                        "name": "F. S. Sjostrand",
                        "slug": "F.-S.-Sjostrand",
                        "structuredName": {
                            "firstName": "F",
                            "lastName": "Sjostrand",
                            "middleNames": [
                                "S"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. S. Sjostrand"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 29789936,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "961c8394a339820bc07dd4cb41967390a226eb56",
            "isKey": false,
            "numCitedBy": 160,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Ultrastructure-of-retinal-rod-synapses-of-the-pig-Sjostrand",
            "title": {
                "fragments": [],
                "text": "Ultrastructure of retinal rod synapses of the guinea pig eye as revealed by three-dimensional reconstructions from serial sections."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of ultrastructure research"
            },
            "year": 1958
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Yber das optische"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The two steps-inhibition by associational neurones and selective pooling -may also play a part in these more complex feats"
            },
            "venue": {
                "fragments": [],
                "text": "The two steps-inhibition by associational neurones and selective pooling -may also play a part in these more complex feats"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "La r6tine des vert6bres"
            },
            "venue": {
                "fragments": [],
                "text": "J. van In and Co"
            },
            "year": 1893
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The localisation of function in the rabbit ' s retina"
            },
            "venue": {
                "fragments": [],
                "text": "J . Physiol"
            },
            "year": 1953
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Autokorrelationsauswertung als Funktionsprinzip des Zentral - nervensystems"
            },
            "venue": {
                "fragments": [],
                "text": "Z . Naturf ."
            },
            "year": 1957
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Unit responses in the frog's tectum to moving and non-moving stimuli"
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1964
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 49,
                                "start": 37
                            }
                        ],
                        "text": "The elements are freely adapted from Cajal (1893), and are assembled in accordance with the functional organization suggested in this paper."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "La r 6 tine des vert 6 bres"
            },
            "venue": {
                "fragments": [],
                "text": "In La Cellue"
            },
            "year": 1893
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Unit responses in the frog ' s tectum to moving and non - moving stimuli"
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1964
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 296,
                                "start": 277
                            }
                        ],
                        "text": "…of the cat's cortical neurons could be explained by the asymmetrical arrangement of on and off zones in the receptive field, and the simple interaction of effects summated over these zones, but the foregoing results rule out this explanation, at least in the rabbit's retina (Barlow & Hill, 1963)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 268,
                                "start": 249
                            }
                        ],
                        "text": "…single units have recently been found in the cerebral cortex of cats (Hubel, 1959; Hubel & Wiesel, 1959, 1962), the optic tectum of frogs and pigeons (Lettvin, Maturana, McCulloch & Pitts, 1959; Maturana & Frenk, 1963), and the retinae of rabbits (Barlow & Hill, 1963; Barlow, Hill & Levick, 1964)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Selective sensitivity to direction of motion in ganglion cells of the rabbit ' s retina"
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1963
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Machine reading of cursive script"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Unit responses"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1964
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The localisation of function in the rabbit's retina"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol"
            },
            "year": 1953
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Unit responses in the frog ' s tectum to moving and non - moving stimuli"
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1964
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 172,
                                "start": 148
                            }
                        ],
                        "text": "…successful systems for recognizing printed or handwritten characters make use of a similar scheme (Selfridge & Neisser, 1960; Uhr & Vossler, 1961; Frishkopf & Harmon, 1961; Kamentsky & Liu, 1963), and it is interesting to see why it is necessary for the computer to view its text through these…"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Machine reading of cursive script"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. 4th Lond. Symp. on Information Theory"
            },
            "year": 1961
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 3,
            "methodology": 4
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 30,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/The-mechanism-of-directionally-selective-units-in-Barlow-Levick/e11827caa9565f1b126f97865ebc1e28501dba01?sort=total-citations"
}