{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695917"
                        ],
                        "name": "I. Bloch",
                        "slug": "I.-Bloch",
                        "structuredName": {
                            "firstName": "Isabelle",
                            "lastName": "Bloch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Bloch"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10635100,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a369888559cc843e88061c648d19344934a9f03f",
            "isKey": false,
            "numCitedBy": 752,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "In most data fusion systems, the information extracted from each image or sensor (either numerical or symbolic) is represented as a degree of belief in an event with real values, generally in [0,1], taking in this way into account the imprecise, uncertain and incomplete nature of information. The combination of such degrees of belief is performed through numerical fusion operators. A very large variety of such operators has been proposed in the literature. We propose a classification of these operators issued from different data fusion theories (probabilities, fuzzy sets, possibilities, Dempster- Shafer, etc.) w.r.t. their behaviour. Three classes are thus defined: context independent constant behaviour operators, which have the same behaviour (compromise, disjunction or conjunction) whatever the values to be combined, context independent variable behaviour operators (whose behaviour depends on the combined values), and context dependent operators (where the result depends also on some global knowledge like conflict, reliability of sources). This classification provides a guide for choosing an operator in a given problem. This choice can then be refined from the desired properties of the operators, from their decisiveness, and by examining how they deal with conflictual situations. These aspects are illustrated on simple examples in multispectral satellite imaging. In particular, we stress the interest of the third class for classification problems."
            },
            "slug": "Information-combination-operators-for-data-fusion:-Bloch",
            "title": {
                "fragments": [],
                "text": "Information combination operators for data fusion: a comparative review with classification"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A classification of operators issued from the different data fusion theories with respect to their behavior provides a guide for choosing an operator in a given problem and can be refined from the desired properties of the operators, from their decisiveness, and by examining how they deal with conflictive situations."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Syst. Man Cybern. Part A"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784977"
                        ],
                        "name": "A. Stassopoulou",
                        "slug": "A.-Stassopoulou",
                        "structuredName": {
                            "firstName": "Athena",
                            "lastName": "Stassopoulou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Stassopoulou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144877016"
                        ],
                        "name": "M. Petrou",
                        "slug": "M.-Petrou",
                        "structuredName": {
                            "firstName": "Maria",
                            "lastName": "Petrou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Petrou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145801638"
                        ],
                        "name": "J. Kittler",
                        "slug": "J.-Kittler",
                        "structuredName": {
                            "firstName": "Josef",
                            "lastName": "Kittler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kittler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 884610,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "b70554f62b9570b618ca7dfa6b537cba6653534d",
            "isKey": false,
            "numCitedBy": 112,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we show how a Bayesian network of inference can be used with a GIS to combine information from different sources of data for classification. Data may include satellite sensor images, topographic maps, geological maps etc, each one with its own resolution and accuracy. We show how this uncertainty in the input data can be incorporated in the network and present various methods by which the conditional probability matrices used by the network can be constructed. We demonstrate our approach within the framework of the problem of assessing the risk of desertification of some burned forests in the Mediterranean region."
            },
            "slug": "Application-of-a-Bayesian-Network-in-a-GIS-Based-Stassopoulou-Petrou",
            "title": {
                "fragments": [],
                "text": "Application of a Bayesian Network in a GIS Based Decision Making System"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "This paper shows how a Bayesian network of inference can be used with a GIS to combine information from different sources of data for classification, and presents various methods by which the conditional probability matrices used by the network can be constructed."
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Geogr. Inf. Sci."
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144877016"
                        ],
                        "name": "M. Petrou",
                        "slug": "M.-Petrou",
                        "structuredName": {
                            "firstName": "Maria",
                            "lastName": "Petrou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Petrou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34990928"
                        ],
                        "name": "K. Sasikala",
                        "slug": "K.-Sasikala",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Sasikala",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Sasikala"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24042417,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a7c7121d4f17aeb5fdeb7891e8476b849b8a1cd5",
            "isKey": false,
            "numCitedBy": 3,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Fuzzy logic offers the option to try to model the non-linearity of the functioning of the human brain when several pieces of evidence are combined to make an inference. In the proposed scheme a Fuzzy reasoning system includes a training stage during which the most appropriate aggregation operators are selected. To allow for different importance to be given to different pieces of evidence, the Fuzzy membership functions used are allowed to take values in a range [0; w], with w ≠ 1. Then the need arises for the generalization of the aggregetion operators to cope with such membership functions. In this paper we examine the properties of such generalised operators, that make them appropriate for use in Fuzzy reasoning."
            },
            "slug": "Generalized-Fuzzy-Aggregation-Operators-Petrou-Sasikala",
            "title": {
                "fragments": [],
                "text": "Generalized Fuzzy Aggregation Operators"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This paper examines the properties of generalised aggregation operators, that make them appropriate for use in Fuzzy reasoning, and concludes that the most appropriate aggregation operators are selected during a training stage."
            },
            "venue": {
                "fragments": [],
                "text": "MLDM"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784977"
                        ],
                        "name": "A. Stassopoulou",
                        "slug": "A.-Stassopoulou",
                        "structuredName": {
                            "firstName": "Athena",
                            "lastName": "Stassopoulou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Stassopoulou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144877016"
                        ],
                        "name": "M. Petrou",
                        "slug": "M.-Petrou",
                        "structuredName": {
                            "firstName": "Maria",
                            "lastName": "Petrou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Petrou"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6916913,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3f6470db86ef45f1d07bd43f4815e4888e522ec6",
            "isKey": false,
            "numCitedBy": 8,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "We present in this paper a novel method for eliciting the conditional probability matrices needed for a Bayesian network with the help of a neural network. We demonstrate how we can obtain a correspondence between the two networks by deriving a closed-form solution so that the outputs of the two networks are similar in the least square error sense, not only when determining the discriminant function, but for the full range of their outputs. For this purpose we take into consideration the probability density functions of the independent variables of the problem when we compute the least square error approximation. Our methodoloy is demonstrated with the help of some real data concerning the problem of risk of desertification assessment for some burned forests in Attica, Greece where the parameters of the Bayesian network constructed for this task are successfully estimated given a neural network trained with a set of data."
            },
            "slug": "Obtaining-The-Correspondence-between-Bayesian-and-Stassopoulou-Petrou",
            "title": {
                "fragments": [],
                "text": "Obtaining The Correspondence between Bayesian and Neural Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "A novel method for eliciting the conditional probability matrices needed for a Bayesian network with the help of a neural network is presented and it is demonstrated how it can obtain a correspondence between the two networks by deriving a closed-form solution."
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Pattern Recognit. Artif. Intell."
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144456299"
                        ],
                        "name": "Adolfo Guzmán",
                        "slug": "Adolfo-Guzmán",
                        "structuredName": {
                            "firstName": "Adolfo",
                            "lastName": "Guzmán",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Adolfo Guzmán"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 195713074,
            "fieldsOfStudy": [
                "Mathematics",
                "Art"
            ],
            "id": "f3be4120894ba32a8c75d503d6c6687d93277c55",
            "isKey": false,
            "numCitedBy": 237,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "We consider visual scenes composed by the optical image of a group of bodies. When such a scene is \"seen\" by a computer through a film spot scanner, image dissector, or similar device, it can be treated as a two-dimensional array of numbers, or as a function of two variables."
            },
            "slug": "Decomposition-of-a-visual-scene-into-bodies-Guzmán",
            "title": {
                "fragments": [],
                "text": "Decomposition of a visual scene into three-dimensional bodies"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "This work considers visual scenes composed by the optical image of a group of bodies that can be treated as a two-dimensional array of numbers, or as a function of two variables."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1942955"
                        ],
                        "name": "W. Christmas",
                        "slug": "W.-Christmas",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Christmas",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Christmas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145801638"
                        ],
                        "name": "J. Kittler",
                        "slug": "J.-Kittler",
                        "structuredName": {
                            "firstName": "Josef",
                            "lastName": "Kittler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kittler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144877016"
                        ],
                        "name": "M. Petrou",
                        "slug": "M.-Petrou",
                        "structuredName": {
                            "firstName": "Maria",
                            "lastName": "Petrou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Petrou"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 517673,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b4835d963c44bd9c29ba52303b78875232b607f8",
            "isKey": false,
            "numCitedBy": 556,
            "numCiting": 68,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we develop the theory of probabilistic relaxation for matching features extracted from 2D images, derive as limiting cases the various heuristic formulae used by researchers in matching problems, and state the conditions under which they apply, We successfully apply our theory to the problem of matching and recognizing aerial road network images based on road network models and to the problem of edge matching in a stereo pair. For this purpose, each line network is represented by an attributed relational graph where each node is a straight line segment characterized by certain attributes and related with every other node via a set of binary relations. >"
            },
            "slug": "Structural-Matching-in-Computer-Vision-Using-Christmas-Kittler",
            "title": {
                "fragments": [],
                "text": "Structural Matching in Computer Vision Using Probabilistic Relaxation"
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "The theory of probabilistic relaxation for matching features extracted from 2D images is developed, derive as limiting cases the various heuristic formulae used by researchers in matching problems, and state the conditions under which they apply."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1942955"
                        ],
                        "name": "W. Christmas",
                        "slug": "W.-Christmas",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Christmas",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Christmas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145801638"
                        ],
                        "name": "J. Kittler",
                        "slug": "J.-Kittler",
                        "structuredName": {
                            "firstName": "Josef",
                            "lastName": "Kittler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kittler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144877016"
                        ],
                        "name": "M. Petrou",
                        "slug": "M.-Petrou",
                        "structuredName": {
                            "firstName": "Maria",
                            "lastName": "Petrou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Petrou"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43727979,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "b8bf6ef08c7d7815dc75e88bf035b1830882f6f8",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Probabilistic-feature-labelling-schemes:-modelling-Christmas-Kittler",
            "title": {
                "fragments": [],
                "text": "Probabilistic feature-labelling schemes: modelling compatibility coefficient distributions"
            },
            "venue": {
                "fragments": [],
                "text": "Image Vis. Comput."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46461872"
                        ],
                        "name": "M. Theisen",
                        "slug": "M.-Theisen",
                        "structuredName": {
                            "firstName": "Marc",
                            "lastName": "Theisen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Theisen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3235406"
                        ],
                        "name": "A. Steudel",
                        "slug": "A.-Steudel",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Steudel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Steudel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2703537"
                        ],
                        "name": "M. Rychetsky",
                        "slug": "M.-Rychetsky",
                        "structuredName": {
                            "firstName": "Matthias",
                            "lastName": "Rychetsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Rychetsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695280"
                        ],
                        "name": "M. Glesner",
                        "slug": "M.-Glesner",
                        "structuredName": {
                            "firstName": "Manfred",
                            "lastName": "Glesner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Glesner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 111104075,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cb4f2fc50b3e138888e4c675b83c2aaff51cdb37",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Fuzzy-logic-and-neuro-systems-assisted-intelligent-Theisen-Steudel",
            "title": {
                "fragments": [],
                "text": "Fuzzy logic and neuro-systems assisted intelligent sensors"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "corpusId": 198168928,
            "fieldsOfStudy": [],
            "id": "eb46bda7b1f60fff84265fec045b473df170caea",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Fuzzy Set Theory - and Its Applications"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 9,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Learning-in-Pattern-Recognition-Petrou/62fbbc4c92a1cdcb9cb37a392f780d7b13b2e9fd?sort=total-citations"
}