{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 40175393,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aa4b60b5847999c2f778e3e67ca1f2201e396abb",
            "isKey": false,
            "numCitedBy": 1004,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "An introduction is given to a theory of early visual information processing. The theory has been implemented, and examples are given of images at various stages of analysis. It is argued that the first step of consequence is to compute a primitive but rich description of the grey-level changes present in an image. The description is expressed in a vocabulary of kinds of intensity change (EDGE, SHADING-EDGE, EXTENDED-EDGE, LINE, BLOB etc.). Modifying parameters are bound to the elements in the description, specifying their POSITION, ORIENTATION, TERMINATION points, CONTRAST, SIZE and FUZZINESS. This description is obtained from the intensity array by fixed techniques, and it is called the primal sketch. For most images, the primal sketch is large and unwieldy. The second important step in visual information processing is to group its contents in a way that is appropriate for later recognition. From our ability to interpret drawings with little semantic content, one may infer the presence in our perceptual equipment of symbolic processes that can define \"place-tokens\" in an image in various ways, and can group them according to certain rules. Homomorphic techniques fail to account for many of these grouping phenomena, whose explanations require mechanisms of construction rather than mechanisms of detection. The necessary grouping of elements in the primal sketch may be achieved by a mechanism that has available the processes inferred from above, together with the ability to select items by first order discriminations acting on the elements' parameters. Only occasionally do these mechanisms use downward-flowing information about the contents of the particular image being processed. It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch. The class of computations so obtained differs slightly from the class of second order operations on the intensity array. The extraction of a form from the primal sketch using these techniques amounts to the separation of figure from ground. It is concluded that most of the separation can be carried out by using techniques that do not depend upon the particular image in question. Therefore, figure-ground separation can normally precede the description of the shape of the extracted form. Up to this point, higher-level knowledge and purpose are brought to bear on only a few of the decisions taken during the processing. This relegates the widespread use of downward-flowing information to a later stage than is found in current machine-vision programs, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "slug": "Early-processing-of-visual-information.-Marr",
            "title": {
                "fragments": [],
                "text": "Early processing of visual information."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is argued that \"non-attentive\" vision is in practice implemented by these grouping operations and first order discriminations acting on the primal sketch, and implies that such knowledge should influence the control of, rather than interfering with, the actual data-processing that is taking place lower down."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4327694,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "8999355e47248bc60f5768fc2168fd28295b5f27",
            "isKey": false,
            "numCitedBy": 1772,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "Research with texture pairs having identical second-order statistics has revealed that the pre-attentive texture discrimination system cannot globally process third- and higher-order statistics, and that discrimination is the result of a few local conspicuous features, called textons. It seems that only the first-order statistics of these textons have perceptual significance, and the relative phase between textons cannot be perceived without detailed scrutiny by focal attention."
            },
            "slug": "Textons,-the-elements-of-texture-perception,-and-Julesz",
            "title": {
                "fragments": [],
                "text": "Textons, the elements of texture perception, and their interactions"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Research with texture pairs having identical second-order statistics has revealed that the pre-attentive texture discrimination system cannot globally process third- and higher- order statistics, and that discrimination is the result of a few local conspicuous features, called textons."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23388527,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a76fefea8a0ea13ace7dbaf8dcc8d1122529b204",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "In 1962, Julesz observed that texture pairs with identical second-order statistics but different third- and higher-order statistics were usually not discriminable without scrutiny. Since second-order (dipole) statistics determine the autocorrelation functions and hence the power spectra, this observation also meant that in preattentive perception of texture the phase (position) spectra were ignored. In the last two decades many new classes of texture pairs with identical power spectra have been invented that were not effortlessly discriminable; however, recently (Caelli & Julesz 1978; Caelli et al. 1978; Julesz et al. 1978) several counterexamples were found. In these texture pairs with identical power spectra some local structures of 'quasi-collinearity', 'corner', 'closure' and 'granularity' yielded strong discrimination. These features can be regarded as the fundamental building blocks of form, that is, the essential nonlinearities of the preattentive perceptual system. Here, it will be shown that these counter-examples are not independent of each other, but can be described by two elementary units; bars (line segments) and their terminators. Furthermore, the preattentive texture perception system can count the number of terminators but ignores their positions."
            },
            "slug": "Spatial-nonlinearities-in-the-instantaneous-of-with-Julesz",
            "title": {
                "fragments": [],
                "text": "Spatial nonlinearities in the instantaneous perception of textures with identical power spectra."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It will be shown that these counter-examples are not independent of each other, but can be described by two elementary units; bars (line segments) and their terminators, which means the preattentive texture perception system can count the number of terminators but ignores their positions."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2502152"
                        ],
                        "name": "A. Treisman",
                        "slug": "A.-Treisman",
                        "structuredName": {
                            "firstName": "Anne",
                            "lastName": "Treisman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Treisman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3662180"
                        ],
                        "name": "G. Gelade",
                        "slug": "G.-Gelade",
                        "structuredName": {
                            "firstName": "Garry",
                            "lastName": "Gelade",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Gelade"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 353246,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "76361a44e145732a39dbc68d9418871038c83be2",
            "isKey": false,
            "numCitedBy": 11416,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-feature-integration-theory-of-attention-Treisman-Gelade",
            "title": {
                "fragments": [],
                "text": "A feature-integration theory of attention"
            },
            "venue": {
                "fragments": [],
                "text": "Cognitive Psychology"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33987862"
                        ],
                        "name": "J. Hoffman",
                        "slug": "J.-Hoffman",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Hoffman",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hoffman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 143571010,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "65c6f8be87c99d843a5601aa8b50f4aab729f850",
            "isKey": false,
            "numCitedBy": 79,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "Previous research had indicated that when subjects are instructed to report one of a number of visually displayed items, both the number and spacing of the presented material affect report accuracy and latency. The present experiment sought to determine the nature and temporal course of the interference provided by nonattended visual material. Subjects reaction times were measured for deciding which of two targets occupied the indicated position in one or eight element displays. Placing replicas of the target in nonindicated display positions was equivalent to presenting the target alone. Members of the opposite response set produced maximum interference, while encodable and unencodable noise elements not belonging to a response set produced an intermediate decrement. For all display types, presenting the indicator prior to display onset decreased reaction time. Dividing each of the display elements into two parts and presenting the parts asynchronously provided evidence that subjects were indifferent to the presence of complete forms for the first 50 msec. These results were interpreted as supporting the existence of a hiararchical sequence of stages consisting of a preattentive stage which segregates the input into objects and an attentive stage which is likened to a spatial scanner responsible for synthesizing the crude preattentive features into recognized forms. The concurrent operation of these stages provides for the redirection of attention when changes in the input are detected."
            },
            "slug": "Hierarchical-stages-in-the-processing-of-visual-Hoffman",
            "title": {
                "fragments": [],
                "text": "Hierarchical stages in the processing of visual information"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 26926741,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "e96e3eedd60a5a42001498bbda017a119f560586",
            "isKey": false,
            "numCitedBy": 498,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "When stimuli are available for just a brief period (∼100 ms) only restricted spatial information can be processed by the visual system. If the stimuli are presented very briefly, eye movements are not possible. The time during which the after-image of the stimulus is available for inspection is terminated by presentation of a masking pattern. We show here that in these conditions a small pattern is easily detected against a background made up of many others, only if this target pattern differs from the background patterns in certain local features. In this case the detectability of the target is almost independent of the number of background elements, suggesting that a parallel process is operating. Detection of patterns not differing from their backgrounds in such features requires focal attention which is a serial process. The aperture of this attention is scaled to minimize the number of shifts of attention required."
            },
            "slug": "Parallel-versus-serial-processing-in-rapid-pattern-Bergen-Julesz",
            "title": {
                "fragments": [],
                "text": "Parallel versus serial processing in rapid pattern discrimination"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is shown here that in these conditions a small pattern is easily detected against a background made up of many others, only if this target pattern differs from the background patterns in certain local features."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737968"
                        ],
                        "name": "E. Gilbert",
                        "slug": "E.-Gilbert",
                        "structuredName": {
                            "firstName": "Edgar",
                            "lastName": "Gilbert",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Gilbert"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2108020"
                        ],
                        "name": "L. Shepp",
                        "slug": "L.-Shepp",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Shepp",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Shepp"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40563444"
                        ],
                        "name": "H. Frisch",
                        "slug": "H.-Frisch",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Frisch",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Frisch"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44767187,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e8f81faa0bd0e018c06c2088223d1fdbc29224a1",
            "isKey": false,
            "numCitedBy": 400,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "In an earlier study by Julesz (1962) pairs of random textures were generated side-by-side using a Markov process with different third-order joint-probability distributions but identical first- and second-order distributions. Such texture pairs could not be discriminated from each other by the human visual system without scrutiny. Unfortunately, Markov processes are inherently one-dimensional while the general processes underlying visual texture discrimination are two-dimensional. Here three new methods are introduced that generate two-dimensional non-Markovian textures with different third-order but identical first- and second-order statistics. All three methods generate texture pairs that cannot be discriminated from each other. The lack of texture discrimination is the more astonishing since the individual elements that form the texture pair are clearly perceived as being very different. However, a counterexample was found that yields discrimination although the texture pair has approximately identical second-order statistics. This case can be explained by assuming that early feature extractors do some preprocessing. These new demonstrations give support to a model of texture discrimination in which the stimulus is first analyzed by local feature extractors that can detect only simple features such as dots and edges of given sizes and orientations. Then the outputs of these simple extractors are evaluated by a global processor that can compute only second- or first-order statistics (that is can compare at most two such outputs)."
            },
            "slug": "Inability-of-Humans-to-Discriminate-between-Visual-Julesz-Gilbert",
            "title": {
                "fragments": [],
                "text": "Inability of Humans to Discriminate between Visual Textures That Agree in Second-Order Statistics—Revisited"
            },
            "tldr": {
                "abstractSimilarityScore": 53,
                "text": "Three new methods are introduced that generate two-dimensional non-Markovian textures with different third-order but identical first- and second-order statistics that cannot be discriminated from each other."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144046748,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "89bffba9cb9fc3769eccc33c67ba1268c96afe48",
            "isKey": false,
            "numCitedBy": 1893,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This classic work on cyclopean perception has influenced a generation of vision researchers, cognitive scientists, and neuroscientists and has inspired artists, designers, and computer graphics pioneers. In Foundations of Cyclopean Perception (first published in 1971 and unavailable for years), Bela Julesz traced the visual information flow in the brain, analyzing how the brain combines separate images received from the two eyes to produce depth perception. Julesz developed novel tools to do this: random-dot stereograms and cinematograms, generated by early digital computers at Bell Labs. These images, when viewed with the special glasses that came with the book, revealed complex, three-dimensional surfaces; this mode of visual stimulus became a paradigm for research in vision and perception. This reprint edition includes all 48 color random-dot designs from the original, as well as the special 3-D glasses required to view them.Foundations of Cyclopean Perception has had a profound impact on the vision studies community. It was chosen as one of the one hundred most influential works in cognitive science in a poll conducted by the University of Minnesota's Center for Cognitive Sciences. Many copies are \"permanently borrowed\" from college libraries; used copies are sought after online. Now, with this facsimile of the 1971 edition, the book is available again to cognitive scientists, neuroscientists, vision researchers, artists, and designers."
            },
            "slug": "Foundations-of-Cyclopean-Perception-Julesz",
            "title": {
                "fragments": [],
                "text": "Foundations of Cyclopean Perception"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122868787,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "8c698a0e0e54ef70bdb5a41585598b84400db178",
            "isKey": false,
            "numCitedBy": 736,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "The perception of depth involves monocular and binocular depth cues. The latter seem simpler and more suitable for investigation. Particularly important is the problem of finding binocular parallax, which involves matching patterns of the left and right visual fields. Stereo pictures of familiar objects or line drawings preclude the separation of interacting cues, and thus this pattern-matching process is difficult to investigate. More insight into the process can be gained by using unfamiliar picture material devoid of all cues except binocular parallax. To this end, artificial stereo picture pairs were generated on a digital computer. When viewed monocularly, they appear completely random, but if viewed binocularly, certain correlated point domains are seen in depth. By introducing distortions in this material and testing for perception of depth, it is possible to show that pattern-matching of corresponding points of the left and right visual fields can be achieved by first combining the two fields and then searching for patterns in the fused field. By this technique, some interesting properties of this fused binocular field are revealed, and a simple analog model is derived. The interaction between the monocular and binocular fields is also describea. A number of stereo images that demonstrate these and other findings are presented."
            },
            "slug": "Binocular-depth-perception-of-computer-generated-Julesz",
            "title": {
                "fragments": [],
                "text": "Binocular depth perception of computer-generated patterns"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 29648250,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "4754bfb45726057d98ad47499481e8c172233e20",
            "isKey": false,
            "numCitedBy": 895,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Visual discrimination experiments were conducted using unfamiliar displays generated by a digital computer. The displays contained two side-by-side fields with different statistical, topological or heuristic properties. Discrimination was defined as that spontaneous visual process which gives the immediate impression of two distinct fields. The condition for such discrimination was found to be based primarily on clusters or lines formed by proximate points of uniform brightness. A similar rule of connectivity with hue replacing brightness was obtained by using varicolored dots of equal subjective brightness. The limitations in discriminating complex line structures were also investigated."
            },
            "slug": "Visual-Pattern-Discrimination-Julesz",
            "title": {
                "fragments": [],
                "text": "Visual Pattern Discrimination"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The condition for discrimination was found to be based primarily on clusters or lines formed by proximate points of uniform brightness, and a similar rule of connectivity with hue replacing brightness was obtained by using varicolored dots of equal subjective brightness."
            },
            "venue": {
                "fragments": [],
                "text": "IRE Trans. Inf. Theory"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 39,
                                "start": 36
                            }
                        ],
                        "text": "sponses in different cortical areas.(6)• S These results seem to imply that the focus of attention is restricted to a very small region of visual cortex, and that stimuli producing responses far apart in the cortex cannot be attended simultaneously."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 7136759,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c5f5311fa1f34159ab3a0a1d58da51cd0340a640",
            "isKey": false,
            "numCitedBy": 6319,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light. Most cells can be categorized as simple, complex, or hypercomplex, with response properties very similar to those previously described in the cat. On the average, however, receptive fields are smaller, and there is a greater sensitivity to changes in stimulus orientation. A small proportion of the cells are colour coded."
            },
            "slug": "Receptive-fields-and-functional-architecture-of-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields and functional architecture of monkey striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light, with response properties very similar to those previously described in the cat."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153095767"
                        ],
                        "name": "J. P. Thomas",
                        "slug": "J.-P.-Thomas",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Thomas",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. P. Thomas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3188502"
                        ],
                        "name": "J. Gille",
                        "slug": "J.-Gille",
                        "structuredName": {
                            "firstName": "Jennifer",
                            "lastName": "Gille",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gille"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 25737679,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "ba672cf2085eb02e7f69ad7adef6e93589fb226e",
            "isKey": false,
            "numCitedBy": 146,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "The ability of observers to discriminate between stimuli differing in orientation was measured using low contrast, foveally viewed stimuli. Detection and discrimination performance were measured simultaneously. A model is presented which permits bandwidths of orientation-tuned mechanisms to be estimated from the data. In a group of five observers, half-amplitude bandwidths varied from 10 degrees to 20 degrees."
            },
            "slug": "Bandwidths-of-orientation-channels-in-human-vision.-Thomas-Gille",
            "title": {
                "fragments": [],
                "text": "Bandwidths of orientation channels in human vision."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A model is presented which permits bandwidths of orientation-tuned mechanisms to be estimated from the data and shows that in a group of five observers, half-amplitude bandwidths varied from 10 degrees to 20 degrees."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4734126"
                        ],
                        "name": "J. Nachmias",
                        "slug": "J.-Nachmias",
                        "structuredName": {
                            "firstName": "Jacob",
                            "lastName": "Nachmias",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Nachmias"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "91215676"
                        ],
                        "name": "J. Jukes",
                        "slug": "J.-Jukes",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Jukes",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Jukes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28836851,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "7286bde878bbb3df54fe1e051b5fa0ebfb0f99e6",
            "isKey": false,
            "numCitedBy": 170,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Subjects were presented with two gratings with different spatial frequencies and they were asked to discriminate one from the other. Their ability to discriminate between the gratings was found to depend primarily on the ratio of their spatial frequencies over a wide range of absolute frequency. At high spatial frequencies, discrimination deteriorates when differences of subjective contrast are eliminated."
            },
            "slug": "Spatial-frequency-discrimination-in-human-vision.-Campbell-Nachmias",
            "title": {
                "fragments": [],
                "text": "Spatial-frequency discrimination in human vision."
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "Subjects were presented with two gratings with different spatial frequencies and they were asked to discriminate one from the other, finding that at high spatial frequencies, discrimination deteriorates when differences of subjective contrast are eliminated."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144337525"
                        ],
                        "name": "C. Trevarthen",
                        "slug": "C.-Trevarthen",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Trevarthen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Trevarthen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27943693,
            "fieldsOfStudy": [
                "Psychology",
                "Medicine"
            ],
            "id": "1c836d6ef8406502d8e3e70f506b622d3a451740",
            "isKey": false,
            "numCitedBy": 825,
            "numCiting": 70,
            "paperAbstract": {
                "fragments": [],
                "text": "ZusammenfassungVersuche an „split-brain“ Affen legten die Annahme nahe, daß die Wahrnehmung des Raumes und die Wahrnehmung der Identität von Gegenständen auf anatomisch getrennten Hirnmechanismen beruhen. In der vorliegenden Arbeit werden die Sehmechanismen des Gehirns untersucht, wobei von der Überlegung ausgegangen wird, daß hier zwei parallele Prozesse involviert sind: ein dezentrierter („ambient“), der die Wahrnehmung des den Körper umgebenden Raumes bestimmt, und ein zentrierter („focal“), durch welchen Details kleiner Raumflächen aufgefaßt werden.Bei Wirbeltieren wird eine detaillierte Topographie des körper-zentrierten Verhaltensraumes vom Auge zum Mittelhirn projiziert. Diese visuelle Topographie ist so mit dem bi-symmetrischen motorischen System integriert, daß sich eine Korrespondenz zwischen gesehenen Punkten und Bewegungszielen ergibt.Das phylogenetisch jüngere visuelle System des Vorderhirns befaßt sich fast ausschließlich mit dem zentralen Verhaltensraum; die corticale motorische Kontrolle befaßt sich entsprechend mit sehr spezifischen Handlungen im gleichen zentralen Gebiet.Anatomie und Hirnchirurgie liefern bei Primaten Hinweise auf einen visuellen Mechanismus im Mittelhirn, der für die dezentrierte Raumwahrnehmung eine Rolle spielt. Im Gegensatz dazu greift das auf Fovea, Parafovea und den visuellen Arealen des Cortex beruhende zentrierte Sehen Areale des umgebenden Feldes für eine eingehendere Inspektion heraus. Koordinierte Augenbewegungen sind direkter Ausdruck dieser Aufmerksamkeitszuwendung.Die Wechselwirkung zweier Mechanismen der visuellen Analyse kennzeichnet das Sehen bei allen aktiven Tieren. Die Komplexität des zentrierten Sehens zeigt sich auf allen Stufen des visuellen Systems von Primaten und in den Teilen des motorischen Systems, welche das Sehen ausrichten und die auf bestimmte visuelle Objekte gerichteten Handlungen steuern.SummaryExperiments with split-brain monkeys led me to consider that vision of space and vision of object identity may be subserved by anatomically distinct brain mechanisms. In this paper I examine the visual mechanisms of the brain to test the idea that vision involves two parallel processes; one ambient, determining space at large around the body, the other focal which examines detail in small areas of space.In vertebrates there is a projection from eye to midbrain of a detailed topography of body-centered behavioral space. This visual map is integrated with the bisymmetric motor system to obtain correspondence between visual loci and the goals for movements. The midbrain visual system governs basic vertebrate locomotor behavior.The phylogenetically more recent forebrain visual system looks almost exclusively at central behavioral space, and cortical motor control is likewise concerned with the formulation of highly specific acts in the same central territory.Anatomy and brain surgery reveal a midbrain visual mechanism in primates which plays a part in ambient space perception over the whole field. In contrast, focal vision served by the fovea and parafovea and by the cortical visual areas picks out areas in the ambient field for close attention. Conjugate eye movements are the most direct sign of this attention.The interplay between the two channels of visual analysis is a feature of vision in all active animals; but the complexity of focal vision in primates is revealed in their visual system at all levels, and in the parts of the motor system which orient vision, or which govern acts directed to specific visual objects."
            },
            "slug": "Two-mechanisms-of-vision-in-primates-Trevarthen",
            "title": {
                "fragments": [],
                "text": "Two mechanisms of vision in primates"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The visual mechanisms of the brain are examined to test the idea that vision involves two parallel processes; one ambient, determining space at large around the body, the other focal which examines detail in small areas of space."
            },
            "venue": {
                "fragments": [],
                "text": "Psychologische Forschung"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40563444"
                        ],
                        "name": "H. Frisch",
                        "slug": "H.-Frisch",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Frisch",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Frisch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1911183"
                        ],
                        "name": "F. Stillinger",
                        "slug": "F.-Stillinger",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Stillinger",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Stillinger"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121513277,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "097582cd4e396b8047e2e8634dca2a98b1fd423a",
            "isKey": false,
            "numCitedBy": 41,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a number of formal properties of the hierarchy of correlation functions describing the statistical geometry of a random porous medium consisting of homogeneous matter and void regions. Our principal result concerns the determination of the average number of interparticle contacts in a randomly packed aggregate of monodisperse hard spheres. We indicate how this number can be determined, in principle, from the analysis of large angle scattering of radiation. We discuss the bearing of our result on the Debye ``random scatterers'' and the study of models of random close packing of spheres. We give a brief list of possible applications and open problems suggested by this field."
            },
            "slug": "Contribution-to-the-Statistical-Geometric-Basis-of-Frisch-Stillinger",
            "title": {
                "fragments": [],
                "text": "Contribution to the Statistical Geometric Basis of Radiation Scattering"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707626"
                        ],
                        "name": "N. Wiener",
                        "slug": "N.-Wiener",
                        "structuredName": {
                            "firstName": "Norbert",
                            "lastName": "Wiener",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Wiener"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 125829144,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "cb2ffb67def387b584a4bca8a6d40e1c7be44f72",
            "isKey": false,
            "numCitedBy": 1282,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Extrapolation interpolation and smoothing of stationary. extrapolation interpolation and smoothing of stationary. extrapolation interpolation and smoothing of stationary. on causal extrapolation of sequences with applications to. wiener n the extrapolation interpolation and smoothing. extrapolation interpolation and smoothing of stationary. stochastic processes interpolation of encyclopedia of. extrapolation interpolation and smoothing of stationary. extrapolation semantic scholar. extrapolation interpolation and smoothing of stationary. kakutani review nobert wiener extrapolation. extrapolation interpolation and smoothing of stationary. extrapolation interpolation and smoothing of stationary. wiener filter. extrapolation interpolation and smoothing of stationary. stationary time series financial definition of stationary. extrapolation interpolation and smoothing of stationary. pdf extrapolation of stationary random fields. extrapolation interpolation and smoothing of stationary. download pdf extrapolation interpolation and smoothing. extrapolation interpolation and smoothing of stationary. extrapolation interpolation and smoothing of stationary. stochastic process extrapolation of a article about. download pdf extrapolation interpolation and smoothing. extrapolation interpolation and smoothing of stationary. extrapolation interpolation and smoothing of stationary. recursive extrapolation interpolation and smoothing of. stationary tones interference cancellation using adaptive. norbert wiener american mathematician britannica."
            },
            "slug": "Extrapolation,-Interpolation,-and-Smoothing-of-Time-Wiener",
            "title": {
                "fragments": [],
                "text": "Extrapolation, Interpolation, and Smoothing of Stationary Time Series, with Engineering Applications"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "Extrapolation interpolation and smoothing of stationary, stationary tones interference cancellation using adaptive and stationary time series financial definition of stationary."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1949
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2499781"
                        ],
                        "name": "L. Leguire",
                        "slug": "L.-Leguire",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Leguire",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Leguire"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144043541"
                        ],
                        "name": "R. Blake",
                        "slug": "R.-Blake",
                        "structuredName": {
                            "firstName": "Randolph",
                            "lastName": "Blake",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Blake"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 116434496,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "0ea8b99aeafe963feffdae5021e9c070a6094b9f",
            "isKey": false,
            "numCitedBy": 35,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Threshold-and-afterimage-duration-(A)-Leguire-Blake",
            "title": {
                "fragments": [],
                "text": "Threshold and afterimage duration (A)"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144420921"
                        ],
                        "name": "M. Rosenblatt",
                        "slug": "M.-Rosenblatt",
                        "structuredName": {
                            "firstName": "Murray",
                            "lastName": "Rosenblatt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Rosenblatt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2480110"
                        ],
                        "name": "D. Slepian",
                        "slug": "D.-Slepian",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Slepian",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Slepian"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121742398,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d54aebf5c76109786bd3e43dfd78df2c9d5747e4",
            "isKey": false,
            "numCitedBy": 33,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Nth-Order-Markov-Chains-with-Every-N-Variables-Rosenblatt-Slepian",
            "title": {
                "fragments": [],
                "text": "Nth Order Markov Chains with Every N Variables Independent"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707626"
                        ],
                        "name": "N. Wiener",
                        "slug": "N.-Wiener",
                        "structuredName": {
                            "firstName": "Norbert",
                            "lastName": "Wiener",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Wiener"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60881246,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "80e9826f5a4238251340b5bf8e81bed7337e7c12",
            "isKey": false,
            "numCitedBy": 3191,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Extrapolation,-Interpolation,-and-Smoothing-of-Time-Wiener",
            "title": {
                "fragments": [],
                "text": "Extrapolation, Interpolation, and Smoothing of Stationary Time Series"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1964
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40244041"
                        ],
                        "name": "D. Ingle",
                        "slug": "D.-Ingle",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Ingle",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ingle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38092047"
                        ],
                        "name": "G. Schneider",
                        "slug": "G.-Schneider",
                        "structuredName": {
                            "firstName": "Gerald",
                            "lastName": "Schneider",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Schneider"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144337525"
                        ],
                        "name": "C. Trevarthen",
                        "slug": "C.-Trevarthen",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Trevarthen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Trevarthen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2887277"
                        ],
                        "name": "R. Held",
                        "slug": "R.-Held",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Held",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Held"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 69676092,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c42c119ff1aadc0090c46f48fde5b2f32b64193d",
            "isKey": false,
            "numCitedBy": 68,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Locating-and-identifying:-Two-modes-of-visual-Ingle-Schneider",
            "title": {
                "fragments": [],
                "text": "Locating and identifying: Two modes of visual processing"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1794253"
                        ],
                        "name": "S. Zeki",
                        "slug": "S.-Zeki",
                        "structuredName": {
                            "firstName": "Semir",
                            "lastName": "Zeki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zeki"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36870809,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "aed6dd9fcfb46a269979cd42841079a18ac8cff0",
            "isKey": false,
            "numCitedBy": 161,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-functional-organization-of-projections-from-to-Zeki",
            "title": {
                "fragments": [],
                "text": "The functional organization of projections from striate to prestriate visual cortex in the rhesus monkey."
            },
            "venue": {
                "fragments": [],
                "text": "Cold Spring Harbor symposia on quantitative biology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 33862721,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "436234a4dc9b8a35f5c1407b66b306fc3b452c0e",
            "isKey": false,
            "numCitedBy": 645,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Experiments-in-the-visual-perception-of-texture.-Julesz",
            "title": {
                "fragments": [],
                "text": "Experiments in the visual perception of texture."
            },
            "venue": {
                "fragments": [],
                "text": "Scientific American"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "B . Julesz , \" Visual Pattern Discrimination"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Melchner, \"Visual Search, Visual Attention and the Attention ~rating Characteristics,\" in J. Requin (ed.) Attention and Performance VII, Hilladale"
            },
            "venue": {
                "fragments": [],
                "text": "NJ: Erlbaum,"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Spat~al-FrequencyDiscrimination in Human VISion"
            },
            "venue": {
                "fragments": [],
                "text": "J. Opt. Soc. Am.,"
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Visual Diacrimination of Textures with Identical Third-Order"
            },
            "venue": {
                "fragments": [],
                "text": "Statistics,\" Biol,"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Julesz , \" Textons , the Elements of Texture Perception , and Their Interactions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Perceptual Limits of Texture Discrimination and Their Implications to TEXTONS 1843  Figure-Ground Separation,\" in E.L.J"
            },
            "venue": {
                "fragments": [],
                "text": "Leeuwenberg and H.F.J.M. Buffart (eds.), Formal Theories of Visual Percef!.tion,"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Melchner, \"Visual Search, Visual Attention and the Attention Operating Characteristics,\" in J. Requin (ed.) Attention and Performance VII, Hillsdale"
            },
            "venue": {
                "fragments": [],
                "text": "NJ: Erlbaum,"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Julesz, \"Discrimination with Brief Inspection Times,"
            },
            "venue": {
                "fragments": [],
                "text": "J. Opt. Soc. Am.,"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Julesz, \"Discrimination with Brief Inspection Timea,"
            },
            "venue": {
                "fragments": [],
                "text": "J. ~t. Soc. Am.,"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Short-term Storage of Information in Vision,\" in C"
            },
            "venue": {
                "fragments": [],
                "text": "Cherry (ed.) Information Theory, Fourth London Symposium, London: Butterworth,"
            },
            "year": 1961
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Two Modes of Visual Processing, 31, Psychol"
            },
            "venue": {
                "fragments": [],
                "text": "Forsch., pp. 44-62; 299-348"
            },
            "year": 1968
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Perceptual Limits of Texture Discrimination and Their Implications to TEXTONS 1643 Figure-Ground Separation,\" in E.L.J"
            },
            "venue": {
                "fragments": [],
                "text": "Leeuwenberg and H.F.J.M. Buffart (eds.), Formal Theories of Visual Perception,"
            },
            "year": 1978
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 34,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Human-factors-and-behavioral-science:-Textons,-the-Julesz-Bergen/a113b95f9f92447cd5d51fbf3c4b5914f6d4b2b3?sort=total-citations"
}