{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1760994"
                        ],
                        "name": "R. Basri",
                        "slug": "R.-Basri",
                        "structuredName": {
                            "firstName": "Ronen",
                            "lastName": "Basri",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Basri"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 21104720,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e88df129649b24e3f782deba6d64aed592995c3b",
            "isKey": false,
            "numCitedBy": 86,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract This paper examines the recognition of rigid objects bounded by smooth surfaces, using an alignment approach. The projected image of such an object changes during rotation in a manner that is generally difficult to predict. An approach to this problem is suggested, using the 3D surface curvature at the points along the silhouette. The curvature information requires a single number for each point along the object′s silhouette, the radial curvature at the point. We have implemented this method and tested it on images of complex 3D objects. Models of the viewed objects were acquired using three images of each object. The implemented scheme was found to give accurate predictions of the objects′ appearances for large transformations. Using this method, a small number of (viewer-centered) models can be used to predict the new appearance of an object from any given viewpoint."
            },
            "slug": "The-Alignment-Of-Objects-With-Smooth-Surfaces-Basri-Ullman",
            "title": {
                "fragments": [],
                "text": "The Alignment Of Objects With Smooth Surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "This paper examines the recognition of rigid objects bounded by smooth surfaces, using an alignment approach, using the 3D surface curvature at the points along the silhouette, to give accurate predictions of the objects′ appearances for large transformations."
            },
            "venue": {
                "fragments": [],
                "text": "[1988 Proceedings] Second International Conference on Computer Vision"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35238678"
                        ],
                        "name": "D. Lowe",
                        "slug": "D.-Lowe",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Lowe",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Lowe"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 678619,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8735690a9e8f8884bf27717877ddf7f9071472e5",
            "isKey": false,
            "numCitedBy": 1457,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Three-Dimensional-Object-Recognition-from-Single-Lowe",
            "title": {
                "fragments": [],
                "text": "Three-Dimensional Object Recognition from Single Two-Dimensional Images"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144901036"
                        ],
                        "name": "H. Nishihara",
                        "slug": "H.-Nishihara",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Nishihara",
                            "middleNames": [
                                "Keith"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nishihara"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 43759520,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bdf9b8f4de001f5f37bc844efbce1210d581d599",
            "isKey": false,
            "numCitedBy": 2323,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The human visual process can be studied by examining the computational problems associated with deriving useful information from retinal images. In this paper, we apply this approach to the problem of representing three-dimensional shapes for the purpose of recognition. 1. Three criteria, accessibility, scope and uniqueness, and stability and sensitivity, are presented for judging the usefulness of a representation for shape recognition. 2. Three aspects of a representation’s design are considered, (i) the representation’s coordinate system, (ii) its primitives, which are the primary units of shape information used in the representation, and (iii) the organization the representation imposes on the information in its descriptions. 3. In terms of these design issues and the criteria presented, a shape representation for recognition should: (i) use an object-centred coordinate system, (ii) include volumetric primitives of varied sizes, and (iii) have a modular organization. A representation based on a shape’s natural axes (for example the axes identified by a stick figure) follows directly from these choices. 4. The basic process for deriving a shape description in this representation must involve: (i) a means for identifying the natural axes of a shape in its image and (ii) a mechanism for transforming viewer-centred axis specifications to specifications in an object-centred coordinate system. 5. Shape recognition involves: (i) a collection of stored shape descriptions, and (ii) various indexes into the collection that allow a newly derived description to be associated with an appropriate stored description. The most important of these indexes allows shape recognition to proceed conservatively from the general to the specific based on the specificity of the information available from the image. 6. New constraints supplied by a conservative recognition process can be used to extract more information from the image. A relaxation process for carrying out this constraint analysis is described."
            },
            "slug": "Representation-and-recognition-of-the-spatial-of-Marr-Nishihara",
            "title": {
                "fragments": [],
                "text": "Representation and recognition of the spatial organization of three-dimensional shapes"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "The human visual process can be studied by examining the computational problems associated with deriving useful information from retinal images by applying the approach to the problem of representing three-dimensional shapes for the purpose of recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713089"
                        ],
                        "name": "D. Huttenlocher",
                        "slug": "D.-Huttenlocher",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Huttenlocher",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Huttenlocher"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 116985418,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f6c6e2d8753b76f2a10f3b4ce5ae3d00959bcd8b",
            "isKey": false,
            "numCitedBy": 74,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This thesis addresses the problem of recognizing solid objects in the three-dimensional world, using two-dimensional shape information extracted from a single image. Objects can be partly occluded and can occur in cluttered scenes. A model based approach is taken, where stored models are matched to an image. The matching problem is separated into two stages, which employ different representations of objects. The first stage uses the smallest possible number of local features to find transformations from a model to an image. This minimizes the amount of search required in recognition. The second stage uses the entire edge contour of an object to verify each transformation. This reduces the chance of finding false matches."
            },
            "slug": "Three-Dimensional-Recognition-of-Solid-Objects-from-Huttenlocher",
            "title": {
                "fragments": [],
                "text": "Three-Dimensional Recognition of Solid Objects from a Two- Dimensional Image"
            },
            "tldr": {
                "abstractSimilarityScore": 81,
                "text": "This thesis addresses the problem of recognizing solid objects in the three-dimensional world, using two-dimensional shape information extracted from a single image, by using the entire edge contour of an object to verify each transformation."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1706614"
                        ],
                        "name": "J. Connell",
                        "slug": "J.-Connell",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Connell",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Connell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6657794,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "29144feb3fa93dd54f5759c9f4ccb962eecea9ad",
            "isKey": false,
            "numCitedBy": 37,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : We present the results of an implemented system for learning structural prototypes from gray-scale images. We show how to divide an object into subparts and how to encode the properties of these subparts and how to encode the properties of these subparts and the relations between them. We discuss the importance of hierarchy and grouping in representing objects and show how a notion of visual similarity can be embedded in the description language. Finally we exhibit a learning algorithm that forms class models from the descriptions produced and used these models to recognize new members of the class. Keywords: Learning; Concept learning; Shape description; Machine vision; High-level vision; (SLS)Smoothed Local Symmetries."
            },
            "slug": "Learning-Shape-Descriptions:-Generating-and-Models-Connell",
            "title": {
                "fragments": [],
                "text": "Learning Shape Descriptions: Generating and Generalizing Models of Visual Objects"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "An implemented system for learning structural prototypes from gray-scale images and a learning algorithm that forms class models from the descriptions produced and used these models to recognize new members of the class is exhibited."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2299972"
                        ],
                        "name": "I. Biederman",
                        "slug": "I.-Biederman",
                        "structuredName": {
                            "firstName": "Irving",
                            "lastName": "Biederman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Biederman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5535504,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2c7babd0f86f6e1e61cdc02a4b22aab0c1245e92",
            "isKey": false,
            "numCitedBy": 531,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Human-image-understanding:-Recent-research-and-a-Biederman",
            "title": {
                "fragments": [],
                "text": "Human image understanding: Recent research and a theory"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118953780,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "32e4ca6a657dfc43c4a77186fcae80e9a35b5712",
            "isKey": false,
            "numCitedBy": 201,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This work deals with the computer vision problem of recognizing and locating rigid shapes in the plane which have been subjected to unknown rotation, scaling, and noise. The recognition task includes both locating the overall pattern and identifying each of its features. Location is achieved by finding a geometric registration function that does a good job of superimposing the instance and the model. Identifying the features requires matching each model feature with the corresponding instance feature.A pruned tree-search algorithm is developed which makes effective use of the Soviet ellipsoid algorithm for feasibility of linear constraints. An interesting blend of theoretical analysis and practical implementation shows that the resulting algorithm has an expected runtime that is theoretically asymptotically quadratic in the number of feature points, but practically linear in n for patterns with fewer than 100 points.Contents: Introduction; Task Abstraction; Prior Approaches; A Linear Programming Approach; Geometry of Registrations and Ellipsoids; Worst-Case Number of Feasible Matchings; Random Patterns; Expected Cost of Feasibility Testing; Expected Size of Search Tree; Monte Carlo Trials; Conclusions.Henry S. Baird received his doctorate from Princeton University. He is currently a technical staff member et AT & T Bell Laboratories. \"Model-Based Image Matching Using Location \"is a 1984 ACM Distinguished Dissertation."
            },
            "slug": "Model-Based-Image-Matching-Using-Location-Baird",
            "title": {
                "fragments": [],
                "text": "Model-Based Image Matching Using Location"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "This work deals with the computer vision problem of recognizing and locating rigid shapes in the plane which have been subjected to unknown rotation, scaling, and noise and develops a pruned tree-search algorithm which makes effective use of the Soviet ellipsoid algorithm for feasibility of linear constraints."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5875328"
                        ],
                        "name": "I. Rock",
                        "slug": "I.-Rock",
                        "structuredName": {
                            "firstName": "Irvin",
                            "lastName": "Rock",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Rock"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2907729"
                        ],
                        "name": "J. diVita",
                        "slug": "J.-diVita",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "diVita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. diVita"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40154873,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "b5c3ac68515a41ab85b26804396a77be0ac1b121",
            "isKey": false,
            "numCitedBy": 230,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-case-of-viewer-centered-object-perception-Rock-diVita",
            "title": {
                "fragments": [],
                "text": "A case of viewer-centered object perception"
            },
            "venue": {
                "fragments": [],
                "text": "Cognitive Psychology"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145423031"
                        ],
                        "name": "James V. Mahoney",
                        "slug": "James-V.-Mahoney",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Mahoney",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "James V. Mahoney"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59760794,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dce4a60db4f4a2ce14919c3858d3af878199bad5",
            "isKey": false,
            "numCitedBy": 54,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Rapid judgments about the properties and spatial relations of objects are the crux of visually guided interaction with the world. Vision begins, however, with essentially pointwise representations of the scene, such as arrays of pixels or small edge fragments. For adequate time-performance in recognition, manipulation, navigation, and reasoning, the processes that extract meaningful entities from the pointwise representations must exploit parallelism. This report develops a framework for the fast extraction of scene entities, based on a simple, local model of parallel computation. An image chunk is a subset of an image that can act as a unit in the course of spatial analysis. A parallel preprocessing stage constructs a variety of simple chunks uniformly over the visual array. On the basis of these chunks, subsequent serial processes locate relevant scene components and assemble detailed descriptions of them rapidly. This thesis defines image chunks that facilitate the most potentially time-consuming operations of spatial analysis---boundary tracing, area coloring, and the selection of locations at which to apply detailed analysis. Fast parallel processes for computing these chunks from images, and chunk-based formulations of indexing, tracing, and coloring, are presented. These processes have been simulated and evaluated on the lisp machine and the connection machine."
            },
            "slug": "Image-Chunking:-Defining-Spatial-Building-Blocks-Mahoney",
            "title": {
                "fragments": [],
                "text": "Image Chunking: Defining Spatial Building Blocks for Scene Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This report develops a framework for the fast extraction of scene entities, based on a simple, local model of parallel computation, that defines image chunks that facilitate the most potentially time-consuming operations of spatial analysis---boundary tracing, area coloring, and the selection of locations at which to apply detailed analysis."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66038872"
                        ],
                        "name": "C. Dane",
                        "slug": "C.-Dane",
                        "structuredName": {
                            "firstName": "Clayton",
                            "lastName": "Dane",
                            "middleNames": [
                                "Albert"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Dane"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117556224,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d21038acccb7a93bafec061183d5045148d2f0c0",
            "isKey": false,
            "numCitedBy": 23,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A method of building a three-dimensional model of a rigid object using information from many views is described. Planar and quadric surface primitives describe the object's surface in an object-centered reference frame. The extent of a primitive is defined by the intersection of the primitive with its neighbors. An edge graph defined by these intersections implicitly expresses spatial relationships between surface primitives. \nThe model builder's input consists of groups of data points corresponding to different views. Each data point contains spatial and orientation information about the object's surface at a discrete location. A set of registered arrays is used to summarize input information in local areas. Mathematical principles from differential geometry are applied to determine local surface properties. A region-growing technique is applied to this information to identify data points which then are represented by a surface primitive. Edges and corners are computed based on the intersections of surface primitives. The results from the analysis of the various views are transformed to a common, arbitrary reference frame for integration into a global model. The final object-centered reference frame is established based on the center of gravity and moments of inertia of the object as determined from the complete model. \nThe goal of model building has applications in the fields of pattern recognition, computer vision, robotics, computer-aided design and computer-aided manufacturing. A model using surface primitives appears as a natural first step in describing an object because surfaces are obvious visual features. The strengths and weaknesses of this surface model are explored."
            },
            "slug": "An-object-centered-three-dimensional-model-builder-Dane",
            "title": {
                "fragments": [],
                "text": "An object-centered three-dimensional model builder"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "A method of building a three-dimensional model of a rigid object using information from many views is described, and a model using surface primitives appears as a natural first step in describing an object because surfaces are obvious visual features."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3096453"
                        ],
                        "name": "Y. Lamdan",
                        "slug": "Y.-Lamdan",
                        "structuredName": {
                            "firstName": "Yehezkel",
                            "lastName": "Lamdan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Lamdan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144035149"
                        ],
                        "name": "J. Schwartz",
                        "slug": "J.-Schwartz",
                        "structuredName": {
                            "firstName": "Jacob",
                            "lastName": "Schwartz",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Schwartz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1756534"
                        ],
                        "name": "H. Wolfson",
                        "slug": "H.-Wolfson",
                        "structuredName": {
                            "firstName": "Haim",
                            "lastName": "Wolfson",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wolfson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 11315051,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2fb9aeba42264f0b4277e05730af59364d82936d",
            "isKey": false,
            "numCitedBy": 126,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Techniques are described for model-based recognition of 3-D objects from unknown viewpoints using single gray-scale images. The method is especially useful for recognition of scenes with overlapping and partially occluded objects. An efficient matching algorithm, which assumes affine approximation to the perspective viewing transformation, is proposed. The algorithm has an off line model preprocessing phase and a recognition phase to reduce matching complexity. The algorithm was successfully tested in recognition of flat industrial objects appearing in composite occluded scenes.<<ETX>>"
            },
            "slug": "On-recognition-of-3-D-objects-from-2-D-images-Lamdan-Schwartz",
            "title": {
                "fragments": [],
                "text": "On recognition of 3-D objects from 2-D images"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "An efficient matching algorithm, which assumes affine approximation to the perspective viewing transformation, is proposed, which has an off line model preprocessing phase and a recognition phase to reduce matching complexity."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. 1988 IEEE International Conference on Robotics and Automation"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "13290124"
                        ],
                        "name": "N. Sutherland",
                        "slug": "N.-Sutherland",
                        "structuredName": {
                            "firstName": "N.",
                            "lastName": "Sutherland",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Sutherland"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9430181,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8d8e1983d277b6182365de3c7bfac9326583bdd8",
            "isKey": false,
            "numCitedBy": 231,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper lists twelve conditions that must be fulfilled by a satisfactory theory of visual pattern recognition in animals and man : such a theory must explain (1) size invariance, (2) position invariance, (3) brightness invariance, (4) the equivalence of outline and filled-in shapes, (5) lack of invariance under most rotations, (6) the known confusions made between patterns, (7) animals’ ability to disregard jitter, (8) the human ability to segment shapes in different ways, (9) the way in which man recognizes complex scenes without recognizing individual details of the scene, (10) perceptual learning, (11) the way in which the brain takes advantage of the redundancy of the visual environment; (12) finally any theory must be consistent with the physiological evidence. The outlines of a theory meeting these conditions are put forward. The model has three parts : (1) A processor that extracts local features from the input picture preserving information about the spatial relationships between the features. (2) A mechanism that induces an abstract description of the output from the processor. (3) A store in which such descriptions are held. Some suggestions are made about the language in which descriptions are framed : it must contain hierarchical elements to allow for the possibility of segmenting a picture in different ways. It is shown how the properties of such a language could account for the facts listed above. In recognizing a picture the output from the store is matched to a stored descriptive rule. What we see is the descriptive rule selected to describe an input picture—we cannot respond to details of the picture not represented in the rule. Since, however, many different rules describe the same input picture, animals and man respond to different aspects of the same picture on different occasions of presentation."
            },
            "slug": "Outlines-of-a-theory-of-visual-pattern-recognition-Sutherland",
            "title": {
                "fragments": [],
                "text": "Outlines of a theory of visual pattern recognition in animals and man"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "This paper lists twelve conditions that must be fulfilled by a satisfactory theory of visual pattern recognition in animals and man and shows how the properties of such a language could account for the facts listed above."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1388700951"
                        ],
                        "name": "Tomas Lozano-Perez",
                        "slug": "Tomas-Lozano-Perez",
                        "structuredName": {
                            "firstName": "Tomas",
                            "lastName": "Lozano-Perez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tomas Lozano-Perez"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14484943,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1230072567fed362e7a39bb8bc83c867c0c1a9f5",
            "isKey": false,
            "numCitedBy": 550,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper discusses how local measurements of positions and surface normals may be used to identify and locate overlapping objects. The objects are modeled as polyhedra (or polygons) having up to six degrees of positional freedom relative to the sensors. The approach operates by examining all hypotheses about pairings between sensed data and object surfaces and efficiently discarding inconsistent ones by using local constraints on: distances between faces, angles between face normals, and angles (relative to the surface normals) of vectors between sensed points. The method described here is an extension of a method for recognition and localization of nonoverlapping parts previously described in [18] and [15]."
            },
            "slug": "Localizing-Overlapping-Parts-by-Searching-the-Tree-Grimson-Lozano-Perez",
            "title": {
                "fragments": [],
                "text": "Localizing Overlapping Parts by Searching the Interpretation Tree"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The approach operates by examining all hypotheses about pairings between sensed data and object surfaces and efficiently discarding inconsistent ones by using local constraints on distances between faces, angles between face normals, and angles of vectors between sensed points."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49157497"
                        ],
                        "name": "D. Shoham",
                        "slug": "D.-Shoham",
                        "structuredName": {
                            "firstName": "Doron",
                            "lastName": "Shoham",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Shoham"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6455452,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "587f126726b89ee92d6c692d9c89e5adb5f46dd3",
            "isKey": false,
            "numCitedBy": 20,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "The ability to determine the geometrical transformation which aligns a 3D object with its 2D image plays an important role in recognition and other visual tasks. We suggest that since usually the possible. transformations are constrained, they can be determined by using a small number of features. We prove that combinations of three co-planar points and lines can determine the alignment transformation uniquely or almost uniquely."
            },
            "slug": "Aligning-A-Model-To-An-Image-Using-Minimal-Shoham-Ullman",
            "title": {
                "fragments": [],
                "text": "Aligning A Model To An Image Using Minimal Information"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is proved that combinations of three co-planar points and lines can determine the alignment transformation uniquely or almost uniquely."
            },
            "venue": {
                "fragments": [],
                "text": "[1988 Proceedings] Second International Conference on Computer Vision"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37429376,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "afc51a561ae5a6bcdf615435ce88f6d3c16fec77",
            "isKey": false,
            "numCitedBy": 1037,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-routines-Ullman",
            "title": {
                "fragments": [],
                "text": "Visual routines"
            },
            "venue": {
                "fragments": [],
                "text": "Cognition"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34637657"
                        ],
                        "name": "M. Potmesil",
                        "slug": "M.-Potmesil",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Potmesil",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Potmesil"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 16358067,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ad6b459fb999a5d35a4bc2c496c8eb6bc41e40f2",
            "isKey": false,
            "numCitedBy": 123,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper summarizes a method for constructing surface models of arbitrarily-shaped, solid objects by spatially matching 3D surface segments describing the objects. A surface segment of a solid object is a partial description of the object's surface, usually limited to the surface area that can be reconstructed from two corresponding images of the object in an arbitrary orientation. Each surface segment is defined in its 3D coordinate system. The matching algorithm uses heuristic search to align overlapping surface segments of an object into a common 3D coordinate system. It searches for a rigid 3D transformation which minimizes shape differences between a pair of surface segments. Once this transformation is determined, the surface segments are merged into a new segment. This match-and-merge process is iteratively repeated for pairs of available surface segments until a complete model of the object is assembled."
            },
            "slug": "Generating-Models-of-Solid-Objects-by-Matching-3D-Potmesil",
            "title": {
                "fragments": [],
                "text": "Generating Models of Solid Objects by Matching 3D Surface Segments"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "This paper summarizes a method for constructing surface models of arbitrarily-shaped, solid objects by spatially matching 3D surface segments describing the objects by using heuristic search to align overlapping surface segments of an object into a common 3D coordinate system."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107258185"
                        ],
                        "name": "D. W. Thompson",
                        "slug": "D.-W.-Thompson",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Thompson",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. W. Thompson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3453447"
                        ],
                        "name": "J. Mundy",
                        "slug": "J.-Mundy",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Mundy",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mundy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 25747161,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1c5ca852ba75e3614c9f55fbe441c40b74258292",
            "isKey": false,
            "numCitedBy": 278,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "It is demonstrated that the affine viewing transformation is a reasonable approximation to perspective. A group of image vertices and edges, called the vertex-pair, which fully determines the affine transformation between a three-dimensional model and a two-dimensional image is defined. A clustering approach, which produces a set of consistent assignments between vertex-pairs in the model and in the image is described. A number of experimental results on outdoor images are presented."
            },
            "slug": "Three-dimensional-model-matching-from-an-viewpoint-Thompson-Mundy",
            "title": {
                "fragments": [],
                "text": "Three-dimensional model matching from an unconstrained viewpoint"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "It is demonstrated that the affine viewing transformation is a reasonable approximation to perspective and a clustering approach, which produces a set of consistent assignments between vertex-pairs in the model and in the image is described."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. 1987 IEEE International Conference on Robotics and Automation"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733113"
                        ],
                        "name": "T. Kanade",
                        "slug": "T.-Kanade",
                        "structuredName": {
                            "firstName": "Takeo",
                            "lastName": "Kanade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kanade"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66710479"
                        ],
                        "name": "J. R. Render",
                        "slug": "J.-R.-Render",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Render",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. R. Render"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 126386942,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e148ca8fbd5afdfe4f6898dce125abd5cdcbca4f",
            "isKey": false,
            "numCitedBy": 88,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Mapping-Image-Properties-into-Shape-Constraints:-Kanade-Render",
            "title": {
                "fragments": [],
                "text": "Mapping Image Properties into Shape Constraints: Skewed Symmetry, Affine-Transformable Patterns, and the Shape-from-Texture Paradigm"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2259916"
                        ],
                        "name": "Donald D. Hoffman",
                        "slug": "Donald-D.-Hoffman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Hoffman",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Donald D. Hoffman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31913541"
                        ],
                        "name": "W. Richards",
                        "slug": "W.-Richards",
                        "structuredName": {
                            "firstName": "Whitman",
                            "lastName": "Richards",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Richards"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6397710,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "150662e38fc67ca81ac93faf981cf2151fbf6a9a",
            "isKey": false,
            "numCitedBy": 1354,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Parts-of-recognition-Hoffman-Richards",
            "title": {
                "fragments": [],
                "text": "Parts of recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Cognition"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691804"
                        ],
                        "name": "D. Ballard",
                        "slug": "D.-Ballard",
                        "structuredName": {
                            "firstName": "Dana",
                            "lastName": "Ballard",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ballard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1757612"
                        ],
                        "name": "Hiromi T. Tanaka",
                        "slug": "Hiromi-T.-Tanaka",
                        "structuredName": {
                            "firstName": "Hiromi",
                            "lastName": "Tanaka",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hiromi T. Tanaka"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14434002,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4607e054569efa79d8c3dbeccdef615ac29b7463",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Most of the geometric information in a scene is captured by local coordinate frames oriented according to local geometric features. In polyhedral worlds these features are faces, vertices and edges. Such features lead naturally to parallel algorithms for building such a scene description from stereo input that are insensitive to noise and occlusion. This representation can be used for object location, object recognition, and navigation."
            },
            "slug": "Transformational-Form-Perception-in-3D:-Algorithms,-Ballard-Tanaka",
            "title": {
                "fragments": [],
                "text": "Transformational Form Perception in 3D: Constraints, Algorithms, Implementation"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This paper presents parallel algorithms for building a scene description from stereo input that are insensitive to noise and occlusion for object location, object recognition, and navigation."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691341"
                        ],
                        "name": "R. L. Grimsdale",
                        "slug": "R.-L.-Grimsdale",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Grimsdale",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. Grimsdale"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "24348125"
                        ],
                        "name": "F. Sumner",
                        "slug": "F.-Sumner",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Sumner",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Sumner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16929711"
                        ],
                        "name": "C. J. Tunis",
                        "slug": "C.-J.-Tunis",
                        "structuredName": {
                            "firstName": "Cyril",
                            "lastName": "Tunis",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. J. Tunis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34704748"
                        ],
                        "name": "T. Kilburn",
                        "slug": "T.-Kilburn",
                        "structuredName": {
                            "firstName": "Tom",
                            "lastName": "Kilburn",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kilburn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 57111671,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "726e2870e754dd2c3b30dfe9486ff23fceb01730",
            "isKey": false,
            "numCitedBy": 91,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "The paper describes a new method for the automatic recognition of patterns. The method may be applied to any form of spatial pattern, but in the present instance, patterns consisting of line figures are considered. The pattern is presented to a flying-spot scanner connected to a digital computer. The shape of the pattern is analysed and a statement is prepared describing the basic features of the pattern. The pattern is then recognized by comparing this statement with a number of others already stored in the computer which relate to named patterns. Patterns are recognized independently of the angle at which they are presented to the scanner, and may be of any size provided that limits imposed by the resolution of the scanner are not exceeded. The average time to recognize a character is 60 seconds with the system programmed on a medium-speed computer. Special-purpose equipment built to perform certain of the stages of the process, together with the use of higher-speed computers now envisaged, will reduce this time by at least a thousandfold. If a new pattern is presented to the machine it will indicate its inability to recognize the pattern, but by giving the machine the name of the pattern, it may become one of the standard patterns which it can subsequently recognize. All the patterns recognized by the machine are hand-drawn and consist of such symbols as the capital letters of the alphabet and numerals, although the system is in no way limited to any special set of characters. Using exactly the same method but with an increase in the degree of complexity, it will be possible for machines to read handwriting. Special allowances are made for imperfections in the patterns, including breaks and general ill-definition. Where there is some confusion and an unknown pattern resembles two or more of the standard patterns, the relative degrees of similarity of the unknown to each of these standard patterns is printed out by the machine."
            },
            "slug": "A-system-for-the-automatic-recognition-of-patterns-Grimsdale-Sumner",
            "title": {
                "fragments": [],
                "text": "A system for the automatic recognition of patterns"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "A new method for the automatic recognition of patterns consisting of line figures, using exactly the same method but with an increase in the degree of complexity, it will be possible for machines to read handwriting."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144592244"
                        ],
                        "name": "J. Tenenbaum",
                        "slug": "J.-Tenenbaum",
                        "structuredName": {
                            "firstName": "Jay",
                            "lastName": "Tenenbaum",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tenenbaum"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117867449,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e2dc6b0d1f0454e990778b412c92b9048c2115cd",
            "isKey": false,
            "numCitedBy": 421,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-the-Role-of-Structure-in-Vision-Witkin-Tenenbaum",
            "title": {
                "fragments": [],
                "text": "On the Role of Structure in Vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764443"
                        ],
                        "name": "R. Bolles",
                        "slug": "R.-Bolles",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Bolles",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bolles"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15764395,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fd10304d259196b0db929fe02872e700092ce8cc",
            "isKey": false,
            "numCitedBy": 365,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "A new method of locating partially visible two-dimensional objects has been designed. The method is applicable to complex industrial parts that may contain several occurrences of local features such as holes and corners. The matching process is robust, because it bases its decisions on groups of mutually consistent features, and it is relatively fast, because it concentrates on key features that are automatically selected on the basis of a detailed analysis of CAD type of models of the objects."
            },
            "slug": "Locating-Partially-Visible-Objects:-The-Local-Focus-Bolles",
            "title": {
                "fragments": [],
                "text": "Locating Partially Visible Objects: The Local Feature Focus Method"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "A new method of locating partially visible two-dimensional objects has been designed that is applicable to complex industrial parts that may contain several occurrences of local features such as holes and corners."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5737624"
                        ],
                        "name": "E. Rosch",
                        "slug": "E.-Rosch",
                        "structuredName": {
                            "firstName": "Eleanor",
                            "lastName": "Rosch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Rosch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3050353"
                        ],
                        "name": "C. Mervis",
                        "slug": "C.-Mervis",
                        "structuredName": {
                            "firstName": "Carolyn",
                            "lastName": "Mervis",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Mervis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2926253"
                        ],
                        "name": "Wayne D. Gray",
                        "slug": "Wayne-D.-Gray",
                        "structuredName": {
                            "firstName": "Wayne",
                            "lastName": "Gray",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Wayne D. Gray"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50156221"
                        ],
                        "name": "D. M. Johnson",
                        "slug": "D.-M.-Johnson",
                        "structuredName": {
                            "firstName": "D",
                            "lastName": "Johnson",
                            "middleNames": [
                                "M"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. M. Johnson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1405696055"
                        ],
                        "name": "P. Boyes-Braem",
                        "slug": "P.-Boyes-Braem",
                        "structuredName": {
                            "firstName": "Penny",
                            "lastName": "Boyes-Braem",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Boyes-Braem"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5612467,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "2c05d131576d01668ef01156ac73e52c3152384a",
            "isKey": false,
            "numCitedBy": 4981,
            "numCiting": 58,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Basic-objects-in-natural-categories-Rosch-Mervis",
            "title": {
                "fragments": [],
                "text": "Basic objects in natural categories"
            },
            "venue": {
                "fragments": [],
                "text": "Cognitive Psychology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2465976"
                        ],
                        "name": "M. Fischler",
                        "slug": "M.-Fischler",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Fischler",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Fischler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764443"
                        ],
                        "name": "R. Bolles",
                        "slug": "R.-Bolles",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Bolles",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bolles"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 972888,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "278c9a78d4505cfaf6b709df364dbd1206a017c1",
            "isKey": false,
            "numCitedBy": 15957,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "A new paradigm, Random Sample Consensus (RANSAC), for fitting a model to experimental data is introduced. RANSAC is capable of interpreting/smoothing data containing a significant percentage of gross errors, and is thus ideally suited for applications in automated image analysis where interpretation is based on the data provided by error-prone feature detectors. A major portion of this paper describes the application of RANSAC to the Location Determination Problem (LDP): Given an image depicting a set of landmarks with known locations, determine that point in space from which the image was obtained. In response to a RANSAC requirement, new results are derived on the minimum number of landmarks needed to obtain a solution, and algorithms are presented for computing these minimum-landmark solutions in closed form. These results provide the basis for an automatic system that can solve the LDP under difficult viewing"
            },
            "slug": "Random-sample-consensus:-a-paradigm-for-model-with-Fischler-Bolles",
            "title": {
                "fragments": [],
                "text": "Random sample consensus: a paradigm for model fitting with applications to image analysis and automated cartography"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "New results are derived on the minimum number of landmarks needed to obtain a solution, and algorithms are presented for computing these minimum-landmark solutions in closed form that provide the basis for an automatic system that can solve the Location Determination Problem under difficult viewing."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49486682"
                        ],
                        "name": "M. G. Eley",
                        "slug": "M.-G.-Eley",
                        "structuredName": {
                            "firstName": "Malcolm",
                            "lastName": "Eley",
                            "middleNames": [
                                "Gordon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. G. Eley"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 33453154,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "6d0cdb20c65b14bca52722f234eb14bcc9b780b3",
            "isKey": false,
            "numCitedBy": 79,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Previous research has shown that the identification of rotated alphanumeric symbols seems to be performed via the extraction of critical features encoded invariant to the symbol’s orientation. The present research argued that the use of such feature extraction processes might be a function of, first, a subject’s familiarity with the symbols, and second, the number of symbols from which a presented symbol is sampled. Earlier research has used highly over learned alphanumerics, in sets of six symbols; this practice is argued here as being seemingly conducive to feature extraction. In two experiments, the generality of a feature extraction interpretation, in contrast to one of mental rotation, was tested by having subjects previously trained to relative high- vs. low-familiarity criteria identify novel symbols in conditions in which a presented symbol was 1 of either 5 or 20 possibilities. Identification response times were found to be constant across all nonstandard orientations of presented symbols, irrespective of symbol familiarity or symbol set size. The findings support the generalization of a feature extraction interpretation to varying numbers of novel symbols of varying familiarity."
            },
            "slug": "Identifying-rotated-letter-like-symbols-Eley",
            "title": {
                "fragments": [],
                "text": "Identifying rotated letter-like symbols"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The present research argued that the use of feature extraction processes might be a function of a subject’s familiarity with the symbols, and second, the number of symbols from which a presented symbol is sampled, and the findings support the generalization of a feature extraction interpretation to varying numbers of novel symbols of varying familiarity."
            },
            "venue": {
                "fragments": [],
                "text": "Memory & cognition"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3050737"
                        ],
                        "name": "P. Besl",
                        "slug": "P.-Besl",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Besl",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Besl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144938732"
                        ],
                        "name": "R. Jain",
                        "slug": "R.-Jain",
                        "structuredName": {
                            "firstName": "Ramesh",
                            "lastName": "Jain",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Jain"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14648882,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8560e9c39c50ea928eef7c115d99fdae5acfdfa3",
            "isKey": false,
            "numCitedBy": 1129,
            "numCiting": 260,
            "paperAbstract": {
                "fragments": [],
                "text": "A general-purpose computer vision system must be capable of recognizing three-dimensional (3-D) objects. This paper proposes a precise definition of the 3-D object recognition problem, discusses basic concepts associated with this problem, and reviews the relevant literature. Because range images (or depth maps) are often used as sensor input instead of intensity images, techniques for obtaining, processing, and characterizing range data are also surveyed."
            },
            "slug": "Three-dimensional-object-recognition-Besl-Jain",
            "title": {
                "fragments": [],
                "text": "Three-dimensional object recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A precise definition of the 3-D object recognition problem is proposed, basic concepts associated with this problem are discussed, and techniques for obtaining, processing, and characterizing range data are surveyed."
            },
            "venue": {
                "fragments": [],
                "text": "CSUR"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2259916"
                        ],
                        "name": "Donald D. Hoffman",
                        "slug": "Donald-D.-Hoffman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Hoffman",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Donald D. Hoffman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3170927,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "dc6598a6fe1ad425fcee00e7f03ace958f587820",
            "isKey": false,
            "numCitedBy": 48,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Vision is a process of inference. What you see when you look around depends not only on what is there to be seen but also on how your visual system organizes and interprets the images that fall on your retinas. An intriguing demonstration of this aspect of perception is presented by the apparent surface that is formed by rotating a cosine wave around a vertical axis viewed obliquely [see illustration on this page]. When you first look at the figure, it appears to be organized into a set of raised concentric rings, with the boundaries between the rings delineated approximately by the colored circular contours. If you turn the page upside down, however, the organization changes: now each colored contour, instead of lying in a trough between two rings, appears to trace the crest of a ring. (Try it.) Evidently the visual system does more than passively transmit signals to the brain. It . actively takes part in organizing and interpreting them. This finding raises three questions. First, why does the visual system need to organize and interpret the images formed on the retinas? Second, how does it remain true to the real world in the process? Third, what rules of inference does it follow? The answers to these questions call for a closer examination of such figures."
            },
            "slug": "The-Interpretation-of-Visual-Illusions-Hoffman",
            "title": {
                "fragments": [],
                "text": "The Interpretation of Visual Illusions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2693903"
                        ],
                        "name": "S. Pinker",
                        "slug": "S.-Pinker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Pinker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Pinker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10094366,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "0af69edf58eb88a87988848582d01700b74beccc",
            "isKey": false,
            "numCitedBy": 347,
            "numCiting": 186,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-cognition:-An-introduction-Pinker",
            "title": {
                "fragments": [],
                "text": "Visual cognition: An introduction"
            },
            "venue": {
                "fragments": [],
                "text": "Cognition"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40461178"
                        ],
                        "name": "P. Jolicoeur",
                        "slug": "P.-Jolicoeur",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Jolicoeur",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Jolicoeur"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 36898436,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "3fbdd71849b679fa381c56c5ea47e3198765cb3f",
            "isKey": false,
            "numCitedBy": 501,
            "numCiting": 55,
            "paperAbstract": {
                "fragments": [],
                "text": "A series of experiments revealed systematic effects of orientation on the time required to identify line drawings of natural objects. Naming time increases as patterns are rotated further from the upright. With practice, however, the effect of orientation is reduced considerably. Furthermore, the reduced orientation effect with practice on a set of objects does not transfer to a new set of objects, suggesting that the acquired ability to reduce the orientation effect is specific to particular patterns. Finally, for departures in orientation from the upright between 0° and 120°, the magnitude of the orientation effect on identification for patterns seen for the first time is equivalent to that found in a mental rotation task using the same patterns (making left/right decisions about rotated patterns). This final result suggests that novel depictions of a known class of objects may be identified by a process of mental rotation."
            },
            "slug": "The-time-to-name-disoriented-natural-objects-Jolicoeur",
            "title": {
                "fragments": [],
                "text": "The time to name disoriented natural objects"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "A series of experiments revealed systematic effects of orientation on the time required to identify line drawings of natural objects, and suggested that novel depictions of a known class of objects may be identified by a process of mental rotation."
            },
            "venue": {
                "fragments": [],
                "text": "Memory & cognition"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2502152"
                        ],
                        "name": "A. Treisman",
                        "slug": "A.-Treisman",
                        "structuredName": {
                            "firstName": "Anne",
                            "lastName": "Treisman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Treisman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3662180"
                        ],
                        "name": "G. Gelade",
                        "slug": "G.-Gelade",
                        "structuredName": {
                            "firstName": "Garry",
                            "lastName": "Gelade",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Gelade"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 353246,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "76361a44e145732a39dbc68d9418871038c83be2",
            "isKey": false,
            "numCitedBy": 11416,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-feature-integration-theory-of-attention-Treisman-Gelade",
            "title": {
                "fragments": [],
                "text": "A feature-integration theory of attention"
            },
            "venue": {
                "fragments": [],
                "text": "Cognitive Psychology"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1388700951"
                        ],
                        "name": "Tomas Lozano-Perez",
                        "slug": "Tomas-Lozano-Perez",
                        "structuredName": {
                            "firstName": "Tomas",
                            "lastName": "Lozano-Perez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tomas Lozano-Perez"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 121088195,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "7232c7a3aad15ab5d9f3de951f331eaf14169920",
            "isKey": false,
            "numCitedBy": 651,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper discusses how local measurements of three- dimensional positions and surface normals (recorded by a set of tactile sensors, or by three-dimensional range sensors), may be used to identify and locate objects from among a set of known objects. The objects are modeled as polyhedra having up to six degrees of freedom relative to the sensors. We show that inconsistent hypotheses about pairings between sensed points and object surfaces can be discarded efficiently by using local constraints on distances between faces, angles between face normals, and angles (relative to the surface normals) of vectors between sensed points. We show by simu lation and by mathematical bounds that the number of hy potheses consistent with these constraints is small. We also show how to recover the position and orientation of the object from the sensory data. The algorithm's performance on data obtained from a triangulation range sensor is illustrated."
            },
            "slug": "Model-Based-Recognition-and-Localization-from-Range-Grimson-Lozano-Perez",
            "title": {
                "fragments": [],
                "text": "Model-Based Recognition and Localization from Sparse Range or Tactile Data"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5875328"
                        ],
                        "name": "I. Rock",
                        "slug": "I.-Rock",
                        "structuredName": {
                            "firstName": "Irvin",
                            "lastName": "Rock",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Rock"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6174809"
                        ],
                        "name": "J. Di Vita",
                        "slug": "J.-Di-Vita",
                        "structuredName": {
                            "firstName": "J",
                            "lastName": "Di Vita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Di Vita"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5206206"
                        ],
                        "name": "R. Barbeito",
                        "slug": "R.-Barbeito",
                        "structuredName": {
                            "firstName": "Raphael",
                            "lastName": "Barbeito",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Barbeito"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10687054,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "4f9fcc949da10bd99eb043907307f3a291b0174e",
            "isKey": false,
            "numCitedBy": 70,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "The experiments reported here concern the effect of change of orientation of figures in the third dimension on phenomenal shape. In one experiment, novel two-dimensional wire figures were first shown in one orientation in the sagittal plane, and recognition of them was then tested in an altered orientation in that plane. In another experiment, novel three-dimensional wire figures were first shown in one orientation, and recognition of them was tested following rotation about one of the three major axes of space. The guiding hypotheses were (a) form perception is the end result of a process of figural description; (b) orientation change that alters the perceived location of the top, bottom, and sides of a figure will affect this description; and (c) front-back reversal and rotations about the Y axis will not affect the description because front and back constitute the sides of a figure much as left and right do, and all figural sides are phenomenally equivalent. The findings support these hypotheses except for an unanticipated effect on recognition of 90 degrees rotations about the Y axis. This effect was seen as a hitherto unknown example of egocentrism in perception, since the description is governed by the retinal projection resulting from the particular vantage point of the observer."
            },
            "slug": "The-effect-on-form-perception-of-change-of-in-the-Rock-Vita",
            "title": {
                "fragments": [],
                "text": "The effect on form perception of change of orientation in the third dimension."
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "The experiments reported here concern the effect of change of orientation of figures in the third dimension on phenomenal shape, and support the guiding hypotheses except for an unanticipated effect on recognition of 90 degrees rotations about the Y axis."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of experimental psychology. Human perception and performance"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69508001"
                        ],
                        "name": "L. Cooper",
                        "slug": "L.-Cooper",
                        "structuredName": {
                            "firstName": "Lynn",
                            "lastName": "Cooper",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Cooper"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15716382,
            "fieldsOfStudy": [
                "Materials Science",
                "Psychology"
            ],
            "id": "47c24cf9495f6b2a8fcedd4527abcd79b6bc0a9e",
            "isKey": false,
            "numCitedBy": 261,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Subjects imagined a designated two-dimensional shape rotating within a blank, circular field at a self-determined rate. At some point during the mental rotation, a test shape was presented at one of 12 picture-plane orientations, and the subject was required to determine as rapidly as possible whether the test shape was the same as the originally designated shape or was its mirror image. When the test shape was presented in the expected orientation (the orientation assumed to correspond to the current orientation of the rotating internal representation), reaction time was short and constant, regardless of the angular departure of that orientation from a previously trained position. This was true even when the test shape was presented in an orientation which had not previously been tested. When the test shape was presented at some other, unexpected orientation, reaction time increased linearly with the angular difference between the expected orientation and the orientation of the test shape. It is argued that these results provide a demonstration of the \\ldanalog\\rd nature of mental rotation."
            },
            "slug": "Demonstration-of-a-mental-analog-of-an-external-Cooper",
            "title": {
                "fragments": [],
                "text": "Demonstration of a mental analog of an external rotation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1954977"
                        ],
                        "name": "F. Alt",
                        "slug": "F.-Alt",
                        "structuredName": {
                            "firstName": "Franz",
                            "lastName": "Alt",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Alt"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6789532,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "21cc022ec6cc1211ccd97cc6fe0078d696bfb3d6",
            "isKey": false,
            "numCitedBy": 207,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem which concerns us may be stated as follows: A digital computer receives information about a plane black-and-white pattern, and is to decide on the basis of this infoim~ation whether the pattern is \"similar\", in some sense to be specified below, to a given prototype. It is usually assumed that the patterns considered are of bounded size, say each contained in a given rectangle. Thus a pattern may be defined as any subset of the points in the rectangle, namely, the subset of \"black\" points. The information given to the computer must be of finite length; usually the rectangle is covered by a finite number of cells, and the information to the computer amounts to signals indicating whether any given cell is white or black. Patterns used as prototypes may be, for example, a ring, the letter \"A\", or the like. The recognition of alphabetic and numerical characters is of particular practical importance. What constitutes \"similarity\" varies widely from ease to case, and the methods which the machine uses in recognizing similarity must vary accordingly. To give two extreme examples, one might call two patterns similar only if they agree point for point (or rather, cell for cell) ; or else, one might admit as similar two patterns which are topo-logically equivalent (after defining a suitable topology in the space of cells), so that e.g. any simple closed curve would be called similar to a circle. 3/fany intermediate definitions are possible. In particular, for the recognition of printed characters one will wish to admit as similar two patterns if they differ at most in the following respects: (A) Location (B) Size (C) \"Stretching\" and \"Squeezing\" in either X-or Y-direction. Mathematically , these are affine transformations preserving the X-and Y-directions, i.e., transformations of the form X* = aX + b, Y* = cY + d. The special ease a = c = 1 corresponds to translations, i.e. to (A). (D) While one might consider rotation through a small angle as admissible, rotations through large angles are obviously not; e.g. the characters \"6\" and \"9\" should be recognized as different. It seems preferable to omit rotation entirely and admit in its place \"slanting\" such as occurs in italic type by comparison with roman. Mathematically, this is characterized as an affine transformation which leaves the points of the X-axis fixed. Combinations of the transformations (A) and (D) ex-240"
            },
            "slug": "Digital-Pattern-Recognition-by-Moments-Alt",
            "title": {
                "fragments": [],
                "text": "Digital Pattern Recognition by Moments"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "A digital computer receives information about a plane black-and-white pattern, and is to decide on the basis of this information whether the pattern is \"similar\", in some sense to be specified below, to a given prototype."
            },
            "venue": {
                "fragments": [],
                "text": "JACM"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695689"
                        ],
                        "name": "Geoffrey E. Hinton",
                        "slug": "Geoffrey-E.-Hinton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Hinton",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Geoffrey E. Hinton"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9041037,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "272cb3db246145e13f8db4acbe1d2eae088c7677",
            "isKey": false,
            "numCitedBy": 105,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "There has been a recent revival of interest in parallel systems in which computation is performed by excitatory and inhibitory interactions within a network of relatively simple, neuronlike units [1 2 3 4]. At the early stages of visual processing, individual units can represent hypotheses about how small local fragments of the visual input should be interpreted, and interactions between units can encode knowledge about the constraints between local interpretations. Higher up in the visual system, the representational issues are more complex. This paper considers the difficulties involved in representing shapes in parallel systems, and suggests ways of overcoming them. In doing so, it provides a mechanism for shape perception and visual attention which allows a novel interpretation of the Gestalt slogan that the whole is more than the sum of its parts."
            },
            "slug": "Shape-Representation-in-Parallel-Systems-Hinton",
            "title": {
                "fragments": [],
                "text": "Shape Representation in Parallel Systems"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This paper considers the difficulties involved in representing shapes in parallel systems, and suggests ways of overcoming them, and provides a mechanism for shape perception and visual attention which allows a novel interpretation of the Gestalt slogan that the whole is more than the sum of its parts."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2359839"
                        ],
                        "name": "S. Palmer",
                        "slug": "S.-Palmer",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Palmer",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Palmer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 54296649,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "e2eef466573de571ad5621e4780dc0a465b9a253",
            "isKey": false,
            "numCitedBy": 654,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Hierarchical-structure-in-perceptual-representation-Palmer",
            "title": {
                "fragments": [],
                "text": "Hierarchical structure in perceptual representation"
            },
            "venue": {
                "fragments": [],
                "text": "Cognitive Psychology"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2156786341"
                        ],
                        "name": "tephen E. Palmer",
                        "slug": "tephen-E.-Palmer",
                        "structuredName": {
                            "firstName": "tephen",
                            "lastName": "Palmer",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "tephen E. Palmer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 20646799,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "cc9057f0fc18874314a3c1049d93a6749dc36f73",
            "isKey": false,
            "numCitedBy": 631,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "This experiment demonstrates the influence of the prior presentation of visual scenes on the identification of briefly presented drawings of real-world objects. Different pairings of objects and scenes were used to produce three main contextual conditions: appropriate, inappropriate, and no context. Correct responses and confusions with visually similar objects depended strongly on both the contextual condition and the particular target object presented. The probability of being correct was highest in the appropriate context condition and lowest in the inappropriate context condition. Confidence ratings of responses were a function of the perceptual similarity between the stimulus object and the named object; they were not strongly affected by contextual conditions. Morton’s (1970) “logogen” model provided a good quantitative fit to the response probability data."
            },
            "slug": "The-effects-of-contextual-scenes-on-the-of-objects-Palmer",
            "title": {
                "fragments": [],
                "text": "The effects of contextual scenes on the identification of objects"
            },
            "tldr": {
                "abstractSimilarityScore": 88,
                "text": "This experiment demonstrates the influence of the prior presentation of visual scenes on the identification of briefly presented drawings of real-world objects using Morton’s (1970) “logogen” model."
            },
            "venue": {
                "fragments": [],
                "text": "Memory & cognition"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2064181"
                        ],
                        "name": "A. Tversky",
                        "slug": "A.-Tversky",
                        "structuredName": {
                            "firstName": "Amos",
                            "lastName": "Tversky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Tversky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9173202,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f718309706172d6fb1e89f583927274f9a4cdf4f",
            "isKey": false,
            "numCitedBy": 7350,
            "numCiting": 61,
            "paperAbstract": {
                "fragments": [],
                "text": "The metric and dimensional assumptions that underlie the geometric representation of similarity are questioned on both theoretical and empirical grounds. A new set-theoretical approach to similarity is developed in which objects are represented as collections of features, and similarity is described as a feature-matching process. Specifically, a set of qualitative assumptions is shown to imply the contrast model, which expresses the similarity between objects as a linear combination of the measures of their common and distinctive features. Several predictions of the contrast model are tested in studies of similarity with both semantic and perceptual stimuli. The model is used to uncover, analyze, and explain a variety of empirical phenomena such as the role of common and distinctive features, the relations between judgments of similarity and difference, the presence of asymmetric similarities, and the effects of context on judgments of similarity. The contrast model generalizes standard representations of similarity data in terms of clusters and trees. It is also used to analyze the relations of prototypicality and family resemblance"
            },
            "slug": "Features-of-Similarity-Tversky",
            "title": {
                "fragments": [],
                "text": "Features of Similarity"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "The metric and dimensional assumptions that underlie the geometric representation of similarity are questioned on both theoretical and empirical grounds and a set of qualitative assumptions are shown to imply the contrast model, which expresses the similarity between objects as a linear combination of the measures of their common and distinctive features."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144737366"
                        ],
                        "name": "D. Sagi",
                        "slug": "D.-Sagi",
                        "structuredName": {
                            "firstName": "Dov",
                            "lastName": "Sagi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Sagi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 31013542,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "8f318d69ad488d20460c0495be544187a64e8081",
            "isKey": false,
            "numCitedBy": 473,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The mixture of a few horizontal and vertical line segments embedded in an aggregate of diagonal line segments can be rapidly counted and their positions rapidly determined by a parallel (preattentive) process. However, the discrimination between horizontal and vertical orientation (that is, discrimination of a single conspicuous feature) requires serial search by focal attention. Under recent theories of attention, focal attention has been assumed to be required for the recognition of different combinations of features. According to the findings of this experiment, knowing \"what\" even a single feature is requires time-consuming search by focal attention. Only knowing \"where\" a target it is mediated by a parallel process."
            },
            "slug": "\"Where\"-and-\"what\"-in-vision.-Sagi-Julesz",
            "title": {
                "fragments": [],
                "text": "\"Where\" and \"what\" in vision."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "According to the findings of this experiment, knowing \"what\" even a single feature is requires time-consuming search by focal attention, and only knowing \"where\" a target it is mediated by a parallel process."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2359839"
                        ],
                        "name": "S. Palmer",
                        "slug": "S.-Palmer",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Palmer",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Palmer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 45378991,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "33488e1c7f4b5eab36269ccb840f0e536a049c7d",
            "isKey": false,
            "numCitedBy": 85,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "The hypothesis that visual representations for lines and/or points are independent structural units was tested using similarity judgment and speeded discrimination for pairs of six-segment letter-like figures. The stimuli were constructed such that each of two comparison figures had five segments in common with a standard figure. One figure was similar to the standard in its higher order structure (connectedness and closedness properties), whereas the other differed. The results show that the figures with similar higher order structure were systematically judged more similar to the standard than the figures with different structure. The former were also more difficult to discriminate from standards than the latter, as indicated by both time and error measurements. These effects were less pronounced in sequential than in simultaneous comparisons."
            },
            "slug": "Structural-aspects-of-visual-similarity-Palmer",
            "title": {
                "fragments": [],
                "text": "Structural aspects of visual similarity"
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "The hypothesis that visual representations for lines and/or points are independent structural units was tested using similarity judgment and speeded discrimination for pairs of six-segment letter-like figures to show that the figures with similar higher order structure were systematically judged more similar to the standard than the Figures with different structure."
            },
            "venue": {
                "fragments": [],
                "text": "Memory & cognition"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2359839"
                        ],
                        "name": "S. Palmer",
                        "slug": "S.-Palmer",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Palmer",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Palmer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118772290,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "c95b58f49f3818139551a34f6e1e0d456fc6588e",
            "isKey": false,
            "numCitedBy": 181,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Psychology-of-Perceptual-Organization:-A-Palmer",
            "title": {
                "fragments": [],
                "text": "The Psychology of Perceptual Organization: A Transformational Approach"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2053178525"
                        ],
                        "name": "G. Johansson",
                        "slug": "G.-Johansson",
                        "structuredName": {
                            "firstName": "Gunnar",
                            "lastName": "Johansson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Johansson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 54046837,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "58ea2fa0580b2117618be6e1cc9658a5c9531dba",
            "isKey": false,
            "numCitedBy": 4094,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper reports the first phase of a research program on visual perception of motion patterns characteristic of living organisms in locomotion. Such motion patterns in animals and men are termed here as biological motion. They are characterized by a far higher degree of complexity than the patterns of simple mechanical motions usually studied in our laboratories. In everyday perceptions, the visual information from biological motion and from the corresponding figurative contour patterns (the shape of the body) are intermingled. A method for studying information from the motion pattern per se without interference with the form aspect was devised. In short, the motion of the living body was represented by a few bright spots describing the motions of the main joints. It is found that 10–12 such elements in adequate motion combinations in proximal stimulus evoke a compelling impression of human walking, running, dancing, etc. The kinetic-geometric model for visual vector analysis originally developed in the study of perception of motion combinations of the mechanical type was applied to these biological motion patterns. The validity of this model in the present context was experimentally tested and the results turned out to be highly positive."
            },
            "slug": "Visual-perception-of-biological-motion-and-a-model-Johansson",
            "title": {
                "fragments": [],
                "text": "Visual perception of biological motion and a model for its analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The kinetic-geometric model for visual vector analysis originally developed in the study of perception of motion combinations of the mechanical type was applied to biological motion patterns and the results turned out to be highly positive."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2965900"
                        ],
                        "name": "D. Besner",
                        "slug": "D.-Besner",
                        "structuredName": {
                            "firstName": "Derek",
                            "lastName": "Besner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Besner"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 34945728,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "58f529524d29102f9da019f138d53ae9ab505d93",
            "isKey": false,
            "numCitedBy": 6,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "In a recent study, Sekuler and Nash (1972) investigated the effects of irrelevant size and orientation differences on the time taken to decide whether two forms were the same or not. Three findings are of interest: (1) The time to respond \"same\" increased monotonically as a function of the magnitude of the relative size difference between the two forms. (2) A 90° difference in orientation between the forms slowed \"same\" decision time by approximately 70 msec. (3) When both orientation and size differences were present simultaneously, they had additive effects on reaction time. Sekuler and Nash interpreted these results as evidence consistent with the hypothesis that size and orientation transformations are necessary to normalize the stimuli prior to comparison operations. In their view, size and orientation invariance is thus achieved by a time-consuming process of mental transformation, rather than on the basis of the extraction and comparison of size and rotation invariant features, as has been suggested by other pattern recognition theorists such as Corcoran (1971), Dodwell (1970), Gibson (1969), Milner (1974) and Sutherland (1973). Moreover, the finding that size and orientation effects were additive implies that these operations are sequentially organized such that one operation starts only after the other has finished (see Sternberg, 1969, for a discussion of additive stages logic). The purpose of the present note is to point out that these conclusions were based only on the results of analyses performed on the. reaction time data, the problems of which have been discussed at some length by Pachella (1974). In fact, an analysis of the error data I confirms that a significant interaction between size and orientation is present, F(6,24) = 3.50, p < .02. Clearly, then, the claim that size and orientation are additive factors is no longer tenable. Finally, it should be noted that, in a recent experiment, Cavanagh (1977) has localized the effect of orientation on character classification time at a decision stage in the recognition process. If additive stages logic is accepted, then the presence of an interaction between size and orientation in the Sekuler and Nash study might be taken as indicating that size also has its effects after comparison rather than before, a locus that has been suggested previously by Besner and Coltheart (1975, 1976), and one that is inconsistent with the preprocessing explanation offered by Bundesen and Larsen (1975), Posner (1%9), Posner and Mitchell (1967), and Sekuler and Nash (1972)."
            },
            "slug": "Pattern-recognition:-Are-size-and-orientation-Besner",
            "title": {
                "fragments": [],
                "text": "Pattern recognition: Are size and orientation additive factors?"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The finding that size and orientation effects were additive implies that these operations are sequentially organized such that one operation starts only after the other has finished (see Sternberg, 1969, for a discussion of additive stages logic)."
            },
            "venue": {
                "fragments": [],
                "text": "Perception & psychophysics"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12432,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30457331"
                        ],
                        "name": "J. Gibson",
                        "slug": "J.-Gibson",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Gibson",
                            "middleNames": [
                                "Jerome"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gibson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 33656271,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "4971bec3386a33fa6c3850abf3d358e7143dff8b",
            "isKey": false,
            "numCitedBy": 18752,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "Contents: Preface. Introduction. Part I: The Environment To Be Perceived.The Animal And The Environment. Medium, Substances, Surfaces. The Meaningful Environment. Part II: The Information For Visual Perception.The Relationship Between Stimulation And Stimulus Information. The Ambient Optic Array. Events And The Information For Perceiving Events. The Optical Information For Self-Perception. The Theory Of Affordances. Part III: Visual Perception.Experimental Evidence For Direct Perception: Persisting Layout. Experiments On The Perception Of Motion In The World And Movement Of The Self. The Discovery Of The Occluding Edge And Its Implications For Perception. Looking With The Head And Eyes. Locomotion And Manipulation. The Theory Of Information Pickup And Its Consequences. Part IV: Depiction.Pictures And Visual Awareness. Motion Pictures And Visual Awareness. Conclusion. Appendixes: The Principal Terms Used in Ecological Optics. The Concept of Invariants in Ecological Optics."
            },
            "slug": "The-Ecological-Approach-to-Visual-Perception-Gibson",
            "title": {
                "fragments": [],
                "text": "The Ecological Approach to Visual Perception"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105494"
                        ],
                        "name": "J. Cerella",
                        "slug": "J.-Cerella",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Cerella",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Cerella"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 8808255,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "63dd2bfa02439b937ded2f7235366f05c0f348d2",
            "isKey": false,
            "numCitedBy": 37,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Pigeons-and-perceptrons-Cerella",
            "title": {
                "fragments": [],
                "text": "Pigeons and perceptrons"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62146851,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "92b5734b814d72bf69920864816612f255e2e5bf",
            "isKey": false,
            "numCitedBy": 393,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "A survey and critique of the state of the art in model-based image analysis systems is presented. The paper includes summaries of a selection of systems and evaluates them from the viewpoint of progress toward general vision systems. The paper also describes principles of design of general vision systems."
            },
            "slug": "Survey-of-Model-Based-Image-Analysis-Systems-Binford",
            "title": {
                "fragments": [],
                "text": "Survey of Model-Based Image Analysis Systems"
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "A survey and critique of the state of the art in model-based image analysis systems is presented and principles of design of general vision systems are described."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40461178"
                        ],
                        "name": "P. Jolicoeur",
                        "slug": "P.-Jolicoeur",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Jolicoeur",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Jolicoeur"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6049088,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "8e449605674d636c9f458ad42393b8dfeb220ae0",
            "isKey": false,
            "numCitedBy": 98,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "In five experiments, visual shapes were shown at either a small or a large size for study in the learning phase of a recognition memory experiment. Later, in the test phase, recognition memory was tested in anold-new paradigm in which an equal number of new shapes were mixed at random with previously seen shapes. Half of theold shapes were shown at the same size as in the learning phase, whereas half were shown at the other size. In every experiment, shapes tested at the same size as shown in the learning phase were recognized more quickly and more accurately than shapes tested at a different size. This size-congruency effect was found for line drawings of natural objects and for unfamiliar shapes (i.e., blobs and stick figures). Furthermore, the magnitude of the size-congruency effect depended on the degree of discrepancy between the learning size and the test size. Together, the results suggest that visual shape memory can be sensitive to the size at which patterns are originally encoded, and that the speed and accuracy of recognition memory is influenced by the size of a shape."
            },
            "slug": "A-size-congruency-effect-in-memory-for-visual-shape-Jolicoeur",
            "title": {
                "fragments": [],
                "text": "A size-congruency effect in memory for visual shape"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "The results suggest that visual shape memory can be sensitive to the size at which patterns are originally encoded, and that the speed and accuracy of recognition memory is influenced by the size of a shape."
            },
            "venue": {
                "fragments": [],
                "text": "Memory & cognition"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2137198"
                        ],
                        "name": "R. Shepard",
                        "slug": "R.-Shepard",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Shepard",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Shepard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "41135805"
                        ],
                        "name": "J. Metzler",
                        "slug": "J.-Metzler",
                        "structuredName": {
                            "firstName": "Jacqueline",
                            "lastName": "Metzler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Metzler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16357397,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "5add6f4067e415a6dc76c025da3d49a6524a87c0",
            "isKey": false,
            "numCitedBy": 5294,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The time required to recognize that two perspective drawings portray objects of the same three-dimensional shape is found to be (i) a linearly increasing function of the angular difference in the portrayed orientations of the two objects and (ii) no shorter for differences corresponding simply to a rigid rotation of one of the two-dimensional drawings in its own picture plane than for differences corresponding to a rotation of the three-dimensional object in depth."
            },
            "slug": "Mental-Rotation-of-Three-Dimensional-Objects-Shepard-Metzler",
            "title": {
                "fragments": [],
                "text": "Mental Rotation of Three-Dimensional Objects"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "The time required to recognize that two perspective drawings portray objects of the same three-dimensional shape is found to be a linearly increasing function of the angular difference in the portrayed orientations of the two objects."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "28992078"
                        ],
                        "name": "M. White",
                        "slug": "M.-White",
                        "structuredName": {
                            "firstName": "Murray",
                            "lastName": "White",
                            "middleNames": [
                                "John"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. White"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 144835972,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "56dd3afb7951b839ac0355427337bb1bdd1b6428",
            "isKey": false,
            "numCitedBy": 65,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Single letters and numbers were shown at different angular orientations in the frontal plane, in both forward and backward (mirror-image) versions. In three separate conditions, subjects were required to discriminate the stimuli on the basis of version, category (letter, number, and name (G, 2, etc.). There was a pronounced effect of orientation on version judgments but none at all on category and name judgments, indicating that the identification of a tilted character requires neither the assignment of a cognitive up-down axis nor mental rotation to the upright. Nevertheless, reaction times for backward versions were slower than reaction times for forward versions in both category and name conditions, implicating some sort of interhemispheric transfer process. No support was obtained for the so-called “conceptual category” effect in that reaction times for category judgments were consistently slower than reaction times for name judgments."
            },
            "slug": "Naming-and-categorization-of-tilted-alphanumeric-do-White",
            "title": {
                "fragments": [],
                "text": "Naming and categorization of tilted alphanumeric characters do not require mental rotation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713795"
                        ],
                        "name": "C. Suen",
                        "slug": "C.-Suen",
                        "structuredName": {
                            "firstName": "Ching",
                            "lastName": "Suen",
                            "middleNames": [
                                "Yee"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Suen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2301906"
                        ],
                        "name": "M. Berthod",
                        "slug": "M.-Berthod",
                        "structuredName": {
                            "firstName": "Marc",
                            "lastName": "Berthod",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Berthod"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153312185"
                        ],
                        "name": "S. Mori",
                        "slug": "S.-Mori",
                        "structuredName": {
                            "firstName": "Shunji",
                            "lastName": "Mori",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mori"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23774011,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cd6a2622ef81530dad7e4b53b48f41d0e07b1fba",
            "isKey": false,
            "numCitedBy": 335,
            "numCiting": 136,
            "paperAbstract": {
                "fragments": [],
                "text": "Based on a study of the extensive literature in handprint recognition, this paper presents a survey in this challenging field. Recognition algorithms, data bases, character models, and handprint standards are examined. Achievements in the recognition of handprinted numerals, alphanumerics, Fortran, and Katakana characters are analyzed and compared. Data quality and constraints, as well as human and machine factors are also described. Characteristics, problems, and actual results on on-line recognition of handprinted characters for different applications are discussed. New emphases and directions are suggested."
            },
            "slug": "Automatic-recognition-of-handprinted-state-of-the-Suen-Berthod",
            "title": {
                "fragments": [],
                "text": "Automatic recognition of handprinted characters&#8212;The state of the art"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Recognition algorithms, data bases, character models, and handprint standards are examined and Achievements in the recognition of handprinted numerals, alphanumerics, Fortran, and Katakana characters are analyzed and compared."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "corpusId": 222269982,
            "fieldsOfStudy": [],
            "id": "32a90887c0d44483a8d967f8784d9896c83b8d48",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Why faces are and are not special: an effect of expertise."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145258975"
                        ],
                        "name": "A. Larsen",
                        "slug": "A.-Larsen",
                        "structuredName": {
                            "firstName": "Axel",
                            "lastName": "Larsen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Larsen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3069252"
                        ],
                        "name": "C. Bundesen",
                        "slug": "C.-Bundesen",
                        "structuredName": {
                            "firstName": "Claus",
                            "lastName": "Bundesen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Bundesen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12495223,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "e442304fa2917dff84964d8b414928711c9c8ef1",
            "isKey": false,
            "numCitedBy": 184,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": "Human visual recognition on the basis of shape but regardless of size was investigated by reaction time methods. For successive matching of random figures, reaction time increased linearly with the linear size ratio of stimulus pairs. For single-character classification, reaction time increased with divergence between cued size format and stimulus format such that for character nonrepetitions, the increment in latency was approximately proportional to the logarithm of the linear size ratio of the two formats. However, when reactions to character repetitions were faster than those to nonrepetitions, the repetition reaction time function was similar to that for successive matching of random figures. The results suggested two processes of size scaling: mental-image transformation and perceptual-scale transformation. Image transformation accounted for matching performance based on visual short-term memory, whereas scale transformation accounted for size invariance in recognition based on comparison against visual representations in long-term memory."
            },
            "slug": "Size-scaling-in-visual-pattern-recognition.-Larsen-Bundesen",
            "title": {
                "fragments": [],
                "text": "Size scaling in visual pattern recognition."
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "Human visual recognition on the basis of shape but regardless of size was investigated by reaction time methods, and the results suggested two processes of size scaling: mental-image transformation and perceptual-scale transformation."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of experimental psychology. Human perception and performance"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3069252"
                        ],
                        "name": "C. Bundesen",
                        "slug": "C.-Bundesen",
                        "structuredName": {
                            "firstName": "Claus",
                            "lastName": "Bundesen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Bundesen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145258975"
                        ],
                        "name": "A. Larsen",
                        "slug": "A.-Larsen",
                        "structuredName": {
                            "firstName": "Axel",
                            "lastName": "Larsen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Larsen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 29229,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "6f9ec686329ab9498e2d504c2b692e13180c6292",
            "isKey": false,
            "numCitedBy": 243,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "To investigate human visual identification of different-sized objects as identically shaped, matching reaction times were measured for pairs of simultaneously presented random figures. In three experiments, reaction time for correct reactions to test pairs of figures of the same shape and orientation consistently increased approximately linearly as a function of the linear size ratio of the figures. In the second experiment, where this ratio was defined for control pairs as well as for test pairs, reaction time for correct reactions to control pairs showed a similar increase as a function of size ratio. The results suggest that the task was performed by a gradual process of mental size transformation of one of the members of each pair of figures to the format of the other one."
            },
            "slug": "Visual-transformation-of-size.-Bundesen-Larsen",
            "title": {
                "fragments": [],
                "text": "Visual transformation of size."
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "The results suggest that the visual identification of different-sized objects as identically shaped was performed by a gradual process of mental size transformation of one of the members of each pair of figures to the format of the other one."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of experimental psychology. Human perception and performance"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695074"
                        ],
                        "name": "D. Perrett",
                        "slug": "D.-Perrett",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Perrett",
                            "middleNames": [
                                "Ian"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Perrett"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2118218819"
                        ],
                        "name": "P. A. Smith",
                        "slug": "P.-A.-Smith",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Smith",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. A. Smith"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2014651"
                        ],
                        "name": "D. Potter",
                        "slug": "D.-Potter",
                        "structuredName": {
                            "firstName": "Douglas",
                            "lastName": "Potter",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Potter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48333074"
                        ],
                        "name": "A. J. Mistlin",
                        "slug": "A.-J.-Mistlin",
                        "structuredName": {
                            "firstName": "Amanda",
                            "lastName": "Mistlin",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. J. Mistlin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145105100"
                        ],
                        "name": "A. S. Head",
                        "slug": "A.-S.-Head",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Head",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. S. Head"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2112717386"
                        ],
                        "name": "A. Milner",
                        "slug": "A.-Milner",
                        "structuredName": {
                            "firstName": "Ar",
                            "lastName": "Milner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Milner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144568050"
                        ],
                        "name": "M. Jeeves",
                        "slug": "M.-Jeeves",
                        "structuredName": {
                            "firstName": "Malcolm",
                            "lastName": "Jeeves",
                            "middleNames": [
                                "Alexander"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Jeeves"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 8035463,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "ead147d8abed4f2ef1ca31fcd8fcf6f155c91fc2",
            "isKey": false,
            "numCitedBy": 904,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "The direction of eye gaze and orientation of the face towards or away from another are important social signals for man and for macaque monkey. We have studied the effects of these signals in a region of the macaque temporal cortex where cells have been found to be responsive to the sight of faces. Of cells selectively responsive to the sight of the face or head but not to other objects (182 cells) 63% were sensitive to the orientation of the head. Different views of the head (full face, profile, back or top of the head, face rotated by 45° up to the ceiling or down to the floor) maximally activated different classes of cell. All classes of cell, however, remained active as the preferred view was rotated isomorphically or was changed in size or distance. Isomorphic rotation by 90–180° increased cell response latencies by 10–60 ms. Sensitivity to gaze direction was found for 64% of the cells tested that were tuned to head orientation. Eighteen cells most responsive to the full face preferred eye contact, while 18 cells tuned to the profile face preferred averted gaze. Sensitivity to gaze was thus compatible with, but could be independent of, sensitivity to head orientation. Results suggest that the recognition of one type of object may proceed via the independent high level analysis of several restricted views of the object (viewer-centred descriptions)."
            },
            "slug": "Visual-cells-in-the-temporal-cortex-sensitive-to-Perrett-Smith",
            "title": {
                "fragments": [],
                "text": "Visual cells in the temporal cortex sensitive to face view and gaze direction"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Results suggest that the recognition of one type of object may proceed via the independent high level analysis of several restricted views of the object (viewer-centred descriptions)."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50314979"
                        ],
                        "name": "W. Pitts",
                        "slug": "W.-Pitts",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Pitts",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pitts"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4605464"
                        ],
                        "name": "W. McCulloch",
                        "slug": "W.-McCulloch",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "McCulloch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. McCulloch"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36971397,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "0e9b804adcedfe82d5139b572c5c165fa161efb7",
            "isKey": false,
            "numCitedBy": 753,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Two neural mechanisms are described which exhibit recognition of forms. Both are independent of small perturbations at synapses of excitation, threshold, and synchrony, and are referred to partiular appropriate regions of the nervous system, thus suggesting experimental verification. The first mechanism averages an apparition over a group, and in the treatment of this mechanism it is suggested that scansion plays a significant part. The second mechanism reduces an apparition to a standard selected from among its many legitimate presentations. The former mechanism is exemplified by the recognition of chords regardless of pitch and shapes regardless of size. The latter is exemplified here only in the reflexive mechanism translating apparitions to the fovea. Both are extensions to contemporaneous functions of the knowing of universals heretofore treated by the authors only with respect to sequence in time."
            },
            "slug": "How-we-know-universals;-the-perception-of-auditory-Pitts-McCulloch",
            "title": {
                "fragments": [],
                "text": "How we know universals; the perception of auditory and visual forms."
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "Two neural mechanisms are described which exhibit recognition of forms which are independent of small perturbations at synapses of excitation, threshold, and synchrony, and are referred to partiular appropriate regions of the nervous system, thus suggesting experimental verification."
            },
            "venue": {
                "fragments": [],
                "text": "The Bulletin of mathematical biophysics"
            },
            "year": 1947
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3358140"
                        ],
                        "name": "H. Asada",
                        "slug": "H.-Asada",
                        "structuredName": {
                            "firstName": "Haruo",
                            "lastName": "Asada",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Asada"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "120971205"
                        ],
                        "name": "M. Brady",
                        "slug": "M.-Brady",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brady",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brady"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10704807,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3b698e9255b2e4837511772a4e574b06a78863d9",
            "isKey": false,
            "numCitedBy": 814,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we introduce a novel representation of the significant changes in curvature along the bounding contour of planar shape. We call the representation the Curvature Primal Sketch because of the close analogy to the primal sketch representation advocated by Marr for describing significant intensity changes. We define a set of primitive parameterized curvature discontinuities, and derive expressions for their convolutions with the first and second derivatives of a Gaussian. We describe an implemented algorithm that computes the Curvature Primal Sketch by matching the multiscale convolutions of a shape, and illustrate its performance on a set of tool shapes. Several applications of the representation are sketched."
            },
            "slug": "The-Curvature-Primal-Sketch-Asada-Brady",
            "title": {
                "fragments": [],
                "text": "The Curvature Primal Sketch"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "An implemented algorithm is described that computes the Curvature Primal Sketch by matching the multiscale convolutions of a shape, and its performance on a set of tool shapes is illustrated."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38374258"
                        ],
                        "name": "F. L. Engel",
                        "slug": "F.-L.-Engel",
                        "structuredName": {
                            "firstName": "Frits",
                            "lastName": "Engel",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. L. Engel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38214556,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "ee6d1def4054c843f7938f02cc5c22b2525733db",
            "isKey": false,
            "numCitedBy": 133,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-conspicuity-and-selective-background-in-Engel",
            "title": {
                "fragments": [],
                "text": "Visual conspicuity and selective background interference in eccentric vision."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3140335"
                        ],
                        "name": "A. Shashua",
                        "slug": "A.-Shashua",
                        "structuredName": {
                            "firstName": "Amnon",
                            "lastName": "Shashua",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Shashua"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 38536052,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8437bb1a15eb2c2a09abbcae3cf6ae0210d26eae",
            "isKey": false,
            "numCitedBy": 661,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Certain salient structures in images attract our immediate attention without requiring a systematic scan. We present a method for computing saliency by a simple iterative scheme, using a uniform network of locally connected processing elements. The network uses an optimization approach to produce a ``saliency map,'''' a representation of the image emphasizing salient locations. The main properties of the network are: (i) the computations are simple and local, (ii) globally salient structures emerge with a small number of iterations, and (iii) as a by-product of the computations, contours are smoothed and gaps are filled in."
            },
            "slug": "Structural-Saliency:-The-Detection-Of-Globally-A-Shashua-Ullman",
            "title": {
                "fragments": [],
                "text": "Structural Saliency: The Detection Of Globally Salient Structures using A Locally Connected Network"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A method for computing saliency by a simple iterative scheme, using a uniform network of locally connected processing elements, to produce a ``saliency map,'''' a representation of the image emphasizing salient locations."
            },
            "venue": {
                "fragments": [],
                "text": "[1988 Proceedings] Second International Conference on Computer Vision"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145258975"
                        ],
                        "name": "A. Larsen",
                        "slug": "A.-Larsen",
                        "structuredName": {
                            "firstName": "Axel",
                            "lastName": "Larsen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Larsen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 43867655,
            "fieldsOfStudy": [
                "Materials Science"
            ],
            "id": "388b718bf0d8f3a57f9b059e28378094bf748cd1",
            "isKey": false,
            "numCitedBy": 67,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Matching of simultaneously presented patterns with respect to shape regardless of differences in size and orientation was investigated using reaction time methods. When a new pair of unfamiliar random polygons was presented on each trial, matching reaction times in a number of experimental conditions showed strong linear and additive effects of the linear size ratio and the angular difference in orientation between the members of a stimulus pair. However, when the same few random polygons were used over an extended number of trials, the pattern of linear and additive effects degenerated. The results provide a basis for resolving some conflicts in the literature on mental transformations of size and orientation."
            },
            "slug": "Pattern-matching:-Effects-of-size-ratio,-angular-in-Larsen",
            "title": {
                "fragments": [],
                "text": "Pattern matching: Effects of size ratio, angular difference in orientation, and familiarity"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The results provide a basis for resolving some conflicts in the literature on mental transformations of size and orientation when the same few random polygons were used over an extended number of trials."
            },
            "venue": {
                "fragments": [],
                "text": "Perception & psychophysics"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691804"
                        ],
                        "name": "D. Ballard",
                        "slug": "D.-Ballard",
                        "structuredName": {
                            "firstName": "Dana",
                            "lastName": "Ballard",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ballard"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 53550263,
            "fieldsOfStudy": [
                "Biology",
                "Computer Science",
                "Psychology"
            ],
            "id": "902a9f6fd1b17f0d0bc9de54cccd4baa179a7845",
            "isKey": false,
            "numCitedBy": 342,
            "numCiting": 237,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract The cerebral cortex is a rich and diverse structure that is the basis of intelligent behavior. One of the deepest mysteries of the function of cortex is that neural processing times are only about one hundred times as fast as the fastest response times for complex behavior. At the very least, this would seem to indicate that the cortex does massive amounts of parallel computation. This paper explores the hypothesis that an important part of the cortex can be modeled as a connectionist computer that is especially suited for parallel problem solving. The connectionist computer uses a special representation, termed value unit encoding, that represents small subsets of parameters in a way that allows parallel access to many different parameter values. This computer can be thought of as computing hierarchies of sensorimotor invariants. The neural substrate can be interpreted as a commitment to data structures and algorithms that compute invariants fast enough to explain the behavioral response times. A detailed consideration of this model has several implications for the underlying anatomy and physiology."
            },
            "slug": "Cortical-connections-and-parallel-processing:-and-Ballard",
            "title": {
                "fragments": [],
                "text": "Cortical connections and parallel processing: Structure and function"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "The hypothesis that an important part of the cortex can be modeled as a connectionist computer that is especially suited for parallel problem solving is explored."
            },
            "venue": {
                "fragments": [],
                "text": "Behavioral and Brain Sciences"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "97306284"
                        ],
                        "name": "K. Fu",
                        "slug": "K.-Fu",
                        "structuredName": {
                            "firstName": "King-Sun",
                            "lastName": "Fu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Fu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2545803"
                        ],
                        "name": "M. Aizerman",
                        "slug": "M.-Aizerman",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Aizerman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Aizerman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 195718556,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9ebe893e426d1f4c0e1cc2059ea87cf9bceeb4a1",
            "isKey": false,
            "numCitedBy": 521,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "This book is an integrated sequence of papers Professor Michie has published, for a general audience, over the last decade or so. It contains the following: Introduction Trial and Error (Science Survey, 1961) Puzzle-learning versus Game-learning (The Scientist Speculates, 1962) Game-playing Automata (Advances in Programming and Non-Numerical Computation, 1966) Machines that Play and Plan (Science Journal, 1968) Computer servant or master (Theoria to Theory, 1968) Integrated Cognitive Systems (Nature, 1970) Tokyo-Edinburgh Dialogue (The Computer Journal, 1971) Artificial Intelligence (New Society, 1971) On not seeing things (Experimental Programming Report, 1971) Programmer's Gambit (New Scientist, 1972) Machine Intelligence at Edinburgh (Management Informatics, 1973) Theory of Intelligence (Nature, 1973) Memory Mechanisms and Learning (Simple Nervous Systems, 1974) Knowledge Engineering (Kybernetics, 1973) Maching Intelligence as Technology (Proceedings of the Conference on Shop Floor Automation, 1973) 7. The Structure of Belief Systems -Robert P. Abelson"
            },
            "slug": "Syntactic-Methods-in-Pattern-Recognition-Fu-Aizerman",
            "title": {
                "fragments": [],
                "text": "Syntactic Methods in Pattern Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This book is an integrated sequence of papers Professor Michie has published, for a general audience, over the last decade or so."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Systems, Man, and Cybernetics"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1810079"
                        ],
                        "name": "R. Sekuler",
                        "slug": "R.-Sekuler",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Sekuler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Sekuler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152370468"
                        ],
                        "name": "D. Nash",
                        "slug": "D.-Nash",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Nash",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Nash"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15602801,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "29ab30883797c0b93e27611be0852b39460c3f6c",
            "isKey": false,
            "numCitedBy": 97,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Ss compared the forms of pairs of rapidly presented rectangles. The rectangles varied in size and frontal plane orientation. The speed of mental size scaling was estimated from the relationship of judgment time to the size discrepancy between the rectangles. In addition, the speed of mental rotation was estimated by the increase in judgment time produced by a discrepancy between the orientations of the rectangles. Size scaling and mental rotation seem to be largely independent of one another."
            },
            "slug": "Speed-of-size-scaling-in-human-vision-Sekuler-Nash",
            "title": {
                "fragments": [],
                "text": "Speed of size scaling in human vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145944906"
                        ],
                        "name": "M. Potter",
                        "slug": "M.-Potter",
                        "structuredName": {
                            "firstName": "Mary",
                            "lastName": "Potter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Potter"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35385513,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "29c5af8f630bb688ad627e6f750ba5c10fc8b86c",
            "isKey": false,
            "numCitedBy": 584,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "Viewers briefly glimpsed pictures presented in a sequence at rates up to eight per second. They recognized a target picture as accurately and almost as rapidly when they knew only its meaning given by a name (for example, a boat) as when they had seen the picture itself in advance."
            },
            "slug": "Meaning-in-visual-search.-Potter",
            "title": {
                "fragments": [],
                "text": "Meaning in visual search."
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "Viewers briefly glimpsed pictures presented in a sequence at rates up to eight per second and recognized a target picture as accurately and almost as rapidly when they knew only its meaning given by a name."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "147933392"
                        ],
                        "name": "R. Maki",
                        "slug": "R.-Maki",
                        "structuredName": {
                            "firstName": "Renji",
                            "lastName": "Maki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Maki"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40572983,
            "fieldsOfStudy": [
                "Psychology",
                "Medicine"
            ],
            "id": "5a221caf351d2564093382b90d7c70a57c12c0ae",
            "isKey": false,
            "numCitedBy": 61,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "On a montre a des sujets des dessins d'objets communs d'orientations diverses et on leur a demande de les nommer ou d'indiquer la localisation de leur «haut» a l'aide d'une manette. Au cours de la tâche de denomination, la fonction reliant les latences de denomination a l'orientation a ete semblable a celle trouvee dans les etudes de rotation mentale (plus on s'eloigne de la verticale, plus le temps de denomination s'allonge)... Dans la tâche de localisation du haut des dessins, les figures verticales ont ete plus rapides que les figures dont le haut etait oriente a droite a gauche et en bas"
            },
            "slug": "Naming-and-locating-the-tops-of-rotated-pictures.-Maki",
            "title": {
                "fragments": [],
                "text": "Naming and locating the tops of rotated pictures."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Dans la tâche de localisation du haut des dessins, les figures verticales ont ete plus rapides que les figures dont le haut etait oriente a droite a gauche and en bas."
            },
            "venue": {
                "fragments": [],
                "text": "Canadian journal of psychology"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40461178"
                        ],
                        "name": "P. Jolicoeur",
                        "slug": "P.-Jolicoeur",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Jolicoeur",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Jolicoeur"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2965900"
                        ],
                        "name": "D. Besner",
                        "slug": "D.-Besner",
                        "structuredName": {
                            "firstName": "Derek",
                            "lastName": "Besner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Besner"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15762091,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "fb202743a55991e3918337a1789e1dc91559eede",
            "isKey": false,
            "numCitedBy": 40,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "In Experiment 1, subjects made same-different judgments to pairs of shapes that could differ (irrelevantly) in size and in which different pairs combined distinct shapes. Size discrepancy had an effect both on same and different responses. However, the effect on different responses was not monotonic across size discrepancies. It is argued that this nonmonotonicity was produced by a form of bias acting to slow different responses for same-sized pairs. Consistent with the proposed bias account, the nonmonotonic size-discrepancy effect on different trials was eliminated in Experiment 2, in which trials were blocked by size ratio. In Experiment 3, subjects performed a task similar to that in Experiments 1 and 2. However, additional visual information was added inside the bounding contour of the shapes, and this information was either the same or different across shapes. The match between within-contour information across shapes (whether same or different) was varied orthogonally with whether the bounding contours of the shapes were the same or different. In this experiment subjects decided whether the bounding contours of the shapes were the same or different, while ignoring the added information within the contours. When the added information matched across the two shapes, same responses were facilitated relative to when the added information mismatched. The converse occurred for different responses. This effect was more pronounced when the shapes were shown at the same size than when the shapes were at different sizes. In general, the results suggest that (a) size discrepancy affects some perceptual operations that are preliminary to shape matching, and (b) bias mechanisms can play an important role in shape-matching experiments in which the shapes can be shown in different sizes. The interaction of two processes--size scaling and bias--can account for these and hitherto contradictory results in the literature."
            },
            "slug": "Additivity-and-interaction-between-size-ratio-and-Jolicoeur-Besner",
            "title": {
                "fragments": [],
                "text": "Additivity and interaction between size ratio and response category in the comparison of size-discrepant shapes."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The results suggest that (a) size discrepancy affects some perceptual operations that are preliminary to shape matching, and (b) bias mechanisms can play an important role in shape-matching experiments in which the shapes can be shown in different sizes."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of experimental psychology. Human perception and performance"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144377104"
                        ],
                        "name": "J. Morton",
                        "slug": "J.-Morton",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Morton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Morton"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17703056,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "760af8ab0202189b9d545b8ba0c9c1845a1a7c48",
            "isKey": false,
            "numCitedBy": 2099,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "Quantitative predictions are made from a model for word recognition. The model has as its central feature a set of \"logogens\": devices which accept information relevant to a particular word response irrespective of the source of this information. When more than a threshold amount of information has accumulated in any logogen, that particular response becomes available for responding. The model is tested against data available on the effect of word frequency on recognition, the effect of limiting the number of response alternatives, the interaction of stimulus and context, and the interaction of successive presentations of stimuli. The implications of the underlying model are largely upheld. Other possible models for word recognition are discussed as are the implications of the Logogen Model for theories of memory."
            },
            "slug": "Interaction-of-information-in-word-recognition.-Morton",
            "title": {
                "fragments": [],
                "text": "Interaction of information in word recognition."
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "The model has as its central feature a set of \"logogens\": devices which accept information relevant to a particular word response irrespective of the source of this information when more than a threshold amount of information has accumulated in any logogen."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2345416"
                        ],
                        "name": "J. Cutting",
                        "slug": "J.-Cutting",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Cutting",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Cutting"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7265948"
                        ],
                        "name": "L. Kozlowski",
                        "slug": "L.-Kozlowski",
                        "structuredName": {
                            "firstName": "Lynn",
                            "lastName": "Kozlowski",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Kozlowski"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 143687558,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "a6f0aa2485265e2f714708570a495cf0469ca717",
            "isKey": false,
            "numCitedBy": 1058,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "Viewers can recognize themselves and others in an abstract display of their movements. Light sources mounted on joints prominent during the act of walking are sufficient cues for identification. No other information, no feedback, and little practice with such a display are needed. This procedure, developed by Johansson, holds promise for inquiry into the dimensions and features of event perception: It is both naturalistic and experimentally manageable."
            },
            "slug": "Recognizing-friends-by-their-walk:-Gait-perception-Cutting-Kozlowski",
            "title": {
                "fragments": [],
                "text": "Recognizing friends by their walk: Gait perception without familiarity cues"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5122729"
                        ],
                        "name": "P. Wortman",
                        "slug": "P.-Wortman",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Wortman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Wortman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2977490"
                        ],
                        "name": "L. Uhr",
                        "slug": "L.-Uhr",
                        "structuredName": {
                            "firstName": "Leonard",
                            "lastName": "Uhr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Uhr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 147567894,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "d83f759a251fcb91f129f71f31583d052217018d",
            "isKey": false,
            "numCitedBy": 68,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Downloading the book in this website lists can give you more advantages. It will show you the best book collections and completed collections. So many books can be found in this website. So, this is not only this pattern recognition learning and thought. However, this book is referred to read because it is an inspiring book to give you more chance to get experiences and also thoughts. This is simple, read the soft file of the book and you get it."
            },
            "slug": "Pattern-Recognition,-Learning,-and-Thought-Wortman-Uhr",
            "title": {
                "fragments": [],
                "text": "Pattern Recognition, Learning, and Thought"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34683408"
                        ],
                        "name": "J. Tou",
                        "slug": "J.-Tou",
                        "structuredName": {
                            "firstName": "Julius",
                            "lastName": "Tou",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152470352"
                        ],
                        "name": "R. González",
                        "slug": "R.-González",
                        "structuredName": {
                            "firstName": "Rafael",
                            "lastName": "González",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. González"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58813594,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "921975b4df20b605ab98988da13fac5a0d45cc6c",
            "isKey": false,
            "numCitedBy": 3267,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The present work gives an account of basic principles and available techniques for the analysis and design of pattern processing and recognition systems. Areas covered include decision functions, pattern classification by distance functions, pattern classification by likelihood functions, the perceptron and the potential function approaches to trainable pattern classifiers, statistical approach to trainable classifiers, pattern preprocessing and feature selection, and syntactic pattern recognition."
            },
            "slug": "Pattern-Recognition-Principles-Tou-González",
            "title": {
                "fragments": [],
                "text": "Pattern Recognition Principles"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The present work gives an account of basic principles and available techniques for the analysis and design of pattern processing and recognition systems."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7136759,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c5f5311fa1f34159ab3a0a1d58da51cd0340a640",
            "isKey": false,
            "numCitedBy": 6319,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light. Most cells can be categorized as simple, complex, or hypercomplex, with response properties very similar to those previously described in the cat. On the average, however, receptive fields are smaller, and there is a greater sensitivity to changes in stimulus orientation. A small proportion of the cells are colour coded."
            },
            "slug": "Receptive-fields-and-functional-architecture-of-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields and functional architecture of monkey striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light, with response properties very similar to those previously described in the cat."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3219867"
                        ],
                        "name": "J. Hopfield",
                        "slug": "J.-Hopfield",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Hopfield",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hopfield"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 784288,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "98b4d4e24aab57ab4e1124ff8106909050645cfa",
            "isKey": false,
            "numCitedBy": 16693,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "Computational properties of use of biological organisms or to the construction of computers can emerge as collective properties of systems having a large number of simple equivalent components (or neurons). The physical meaning of content-addressable memory is described by an appropriate phase space flow of the state of a system. A model of such a system is given, based on aspects of neurobiology but readily adapted to integrated circuits. The collective properties of this model produce a content-addressable memory which correctly yields an entire memory from any subpart of sufficient size. The algorithm for the time evolution of the state of the system is based on asynchronous parallel processing. Additional emergent collective properties include some capacity for generalization, familiarity recognition, categorization, error correction, and time sequence retention. The collective properties are only weakly sensitive to details of the modeling or the failure of individual devices."
            },
            "slug": "Neural-networks-and-physical-systems-with-emergent-Hopfield",
            "title": {
                "fragments": [],
                "text": "Neural networks and physical systems with emergent collective computational abilities."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "A model of a system having a large number of simple equivalent components, based on aspects of neurobiology but readily adapted to integrated circuits, produces a content-addressable memory which correctly yields an entire memory from any subpart of sufficient size."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the National Academy of Sciences of the United States of America"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2137198"
                        ],
                        "name": "R. Shepard",
                        "slug": "R.-Shepard",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Shepard",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Shepard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69508001"
                        ],
                        "name": "L. Cooper",
                        "slug": "L.-Cooper",
                        "structuredName": {
                            "firstName": "Lynn",
                            "lastName": "Cooper",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Cooper"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144773989,
            "fieldsOfStudy": [
                "Psychology",
                "Art"
            ],
            "id": "bd9977729440f675cce025e22e89516a2408c3c3",
            "isKey": false,
            "numCitedBy": 1083,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This book collects some of the most exciting pioneering work in perceptual and cognitive psychology."
            },
            "slug": "Mental-Images-and-Their-Transformations-Shepard-Cooper",
            "title": {
                "fragments": [],
                "text": "Mental Images and Their Transformations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060896"
                        ],
                        "name": "P. Winston",
                        "slug": "P.-Winston",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Winston",
                            "middleNames": [
                                "Henry"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Winston"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 106617047,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "a7eb50210a468d0878666e8f82fb55f2b179f802",
            "isKey": false,
            "numCitedBy": 1208,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Massachusetts Institute of Technology. Dept. of Electrical Engineering. Thesis. 1970. Ph.D."
            },
            "slug": "Learning-Structural-Descriptions-From-Examples-Winston",
            "title": {
                "fragments": [],
                "text": "Learning Structural Descriptions From Examples"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40227361"
                        ],
                        "name": "D. Willshaw",
                        "slug": "D.-Willshaw",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Willshaw",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Willshaw"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1687528"
                        ],
                        "name": "O. Buneman",
                        "slug": "O.-Buneman",
                        "structuredName": {
                            "firstName": "Oscar",
                            "lastName": "Buneman",
                            "middleNames": [
                                "Peter"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Buneman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1407029196"
                        ],
                        "name": "H. Longuet-Higgins",
                        "slug": "H.-Longuet-Higgins",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Longuet-Higgins",
                            "middleNames": [
                                "Christopher"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Longuet-Higgins"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 27768997,
            "fieldsOfStudy": [
                "Art",
                "Physics"
            ],
            "id": "fd253ff0f4f33caad4ec0aef200a85fe88572ccc",
            "isKey": false,
            "numCitedBy": 975,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The features of a hologram that commend it as a model of associative memory can be improved on by other devices."
            },
            "slug": "Non-Holographic-Associative-Memory-Willshaw-Buneman",
            "title": {
                "fragments": [],
                "text": "Non-Holographic Associative Memory"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The features of a hologram that commend it as a model of associative memory can be improved on by other devices."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2100081"
                        ],
                        "name": "S. K. Reed",
                        "slug": "S.-K.-Reed",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Reed",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. K. Reed"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 145120312,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "963b2931f13e9104ac13382f022914739dd2a082",
            "isKey": false,
            "numCitedBy": 70,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Psychological-processes-in-pattern-recognition-Reed",
            "title": {
                "fragments": [],
                "text": "Psychological processes in pattern recognition"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2097134"
                        ],
                        "name": "M. Corballis",
                        "slug": "M.-Corballis",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Corballis",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Corballis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47576263"
                        ],
                        "name": "B. Nagourney",
                        "slug": "B.-Nagourney",
                        "structuredName": {
                            "firstName": "Beth",
                            "lastName": "Nagourney",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Nagourney"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144513397,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "3a94d6b48ef0ff00cd073cb5eef724160b88d682",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Latency-to-categorize-disoriented-alphanumeric-as-Corballis-Nagourney",
            "title": {
                "fragments": [],
                "text": "Latency to categorize disoriented alphanumeric characters as letters or digits."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4936858"
                        ],
                        "name": "L. Zusne",
                        "slug": "L.-Zusne",
                        "structuredName": {
                            "firstName": "Leonard",
                            "lastName": "Zusne",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Zusne"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143759503,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "6068036d5decb1ad8ec834c6bfbf8e75ebc0b6e3",
            "isKey": false,
            "numCitedBy": 222,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-perception-of-form-Zusne",
            "title": {
                "fragments": [],
                "text": "Visual perception of form"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30457331"
                        ],
                        "name": "J. Gibson",
                        "slug": "J.-Gibson",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Gibson",
                            "middleNames": [
                                "Jerome"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gibson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 195034367,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "fc0d34992ba4c2c68806eb52c096749f847f5424",
            "isKey": false,
            "numCitedBy": 2204,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-perception-of-the-visual-world-Gibson",
            "title": {
                "fragments": [],
                "text": "The perception of the visual world"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1950
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1794321"
                        ],
                        "name": "B. Huberman",
                        "slug": "B.-Huberman",
                        "structuredName": {
                            "firstName": "Bernardo",
                            "lastName": "Huberman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Huberman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144157926"
                        ],
                        "name": "T. Hogg",
                        "slug": "T.-Hogg",
                        "structuredName": {
                            "firstName": "Tad",
                            "lastName": "Hogg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Hogg"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120402180,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cb38044aa6a13eca608e4de1c1c3b230fff90a9c",
            "isKey": false,
            "numCitedBy": 42,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Adaptation-and-self-repair-in-parallel-computing-Huberman-Hogg",
            "title": {
                "fragments": [],
                "text": "Adaptation and self-repair in parallel computing structures"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5875328"
                        ],
                        "name": "I. Rock",
                        "slug": "I.-Rock",
                        "structuredName": {
                            "firstName": "Irvin",
                            "lastName": "Rock",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Rock"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 71570017,
            "fieldsOfStudy": [
                "Computer Science",
                "Psychology"
            ],
            "id": "f307c135dd5687c3d63965cb0893352499897147",
            "isKey": false,
            "numCitedBy": 544,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Orientation-and-form-Rock",
            "title": {
                "fragments": [],
                "text": "Orientation and form"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49690235"
                        ],
                        "name": "P. H. Lindsay",
                        "slug": "P.-H.-Lindsay",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Lindsay",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. H. Lindsay"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 62432454,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "198c64ac89ac5f74a7550f370703bc53c1f80c55",
            "isKey": false,
            "numCitedBy": 1676,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Human-Information-Processing-Lindsay",
            "title": {
                "fragments": [],
                "text": "Human Information Processing"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40461178"
                        ],
                        "name": "P. Jolicoeur",
                        "slug": "P.-Jolicoeur",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Jolicoeur",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Jolicoeur"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46523364"
                        ],
                        "name": "M. Landau",
                        "slug": "M.-Landau",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Landau",
                            "middleNames": [
                                "Jordan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Landau"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45912760,
            "fieldsOfStudy": [
                "Psychology",
                "Medicine"
            ],
            "id": "759a4000c0f43d4faf0eb389e82b8da02e9122ef",
            "isKey": false,
            "numCitedBy": 75,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Effects-of-orientation-on-the-identification-of-Jolicoeur-Landau",
            "title": {
                "fragments": [],
                "text": "Effects of orientation on the identification of simple visual patterns."
            },
            "venue": {
                "fragments": [],
                "text": "Canadian journal of psychology"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145717066"
                        ],
                        "name": "P. Milner",
                        "slug": "P.-Milner",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Milner",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Milner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37125787,
            "fieldsOfStudy": [
                "Computer Science",
                "Medicine"
            ],
            "id": "19caa675aeb103cd5bb3329247fb258c81f4bf72",
            "isKey": false,
            "numCitedBy": 613,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-model-for-visual-shape-recognition.-Milner",
            "title": {
                "fragments": [],
                "text": "A model for visual shape recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Psychological review"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "73467617"
                        ],
                        "name": "R. Narasimhan",
                        "slug": "R.-Narasimhan",
                        "structuredName": {
                            "firstName": "Ramarathnam",
                            "lastName": "Narasimhan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Narasimhan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 11561684,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "5a765bbdfe0c354eb84e2462ad400cf98331036f",
            "isKey": false,
            "numCitedBy": 90,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-pattern-analysis-in-machines-and-animals.-Barlow-Narasimhan",
            "title": {
                "fragments": [],
                "text": "Visual pattern analysis in machines and animals."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2026553"
                        ],
                        "name": "O. Selfridge",
                        "slug": "O.-Selfridge",
                        "structuredName": {
                            "firstName": "Oliver",
                            "lastName": "Selfridge",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Selfridge"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61337194,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "7193aa7b003acb10463057c521bad5578e9a2875",
            "isKey": false,
            "numCitedBy": 588,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Pandemonium:-a-paradigm-for-learning-Selfridge",
            "title": {
                "fragments": [],
                "text": "Pandemonium: a paradigm for learning"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060896"
                        ],
                        "name": "P. Winston",
                        "slug": "P.-Winston",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Winston",
                            "middleNames": [
                                "Henry"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Winston"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6755536,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "9aad8a4c8a94209beb49d97a40c0e6deeffa50e7",
            "isKey": false,
            "numCitedBy": 1675,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-psychology-of-computer-vision-Winston",
            "title": {
                "fragments": [],
                "text": "The psychology of computer vision"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "120971205"
                        ],
                        "name": "M. Brady",
                        "slug": "M.-Brady",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brady",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brady"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144189388"
                        ],
                        "name": "J. Ponce",
                        "slug": "J.-Ponce",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Ponce",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Ponce"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3358140"
                        ],
                        "name": "H. Asada",
                        "slug": "H.-Asada",
                        "structuredName": {
                            "firstName": "Haruo",
                            "lastName": "Asada",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Asada"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 37274040,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c5d85410012e580f58b88fa0655618616742f9e8",
            "isKey": false,
            "numCitedBy": 292,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Describing-surfaces-Brady-Ponce",
            "title": {
                "fragments": [],
                "text": "Describing surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1985
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 89,
        "totalPages": 9
    },
    "page_url": "https://www.semanticscholar.org/paper/Aligning-pictorial-descriptions:-An-approach-to-Ullman/1844c55a8f76c09257c84e886a7bf10fc7e98e3f?sort=total-citations"
}