{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144677513"
                        ],
                        "name": "David G. Jones",
                        "slug": "David-G.-Jones",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Jones",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David G. Jones"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 101,
                                "start": 91
                            }
                        ],
                        "text": "A methodfor handling slanted surfaces such as this has been discussed in detail elsewhere (Jones,1991; Jones and Malik, 1992)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 127,
                                "start": 91
                            }
                        ],
                        "text": "A method for handling slanted surfaces such as this has been discussed in detail elsewhere (Jones, 1991; Jones and Malik, 1992)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 127009742,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "f5604205d457025ee711ccfc7b82bcb3bb7ccedb",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "We have developed a new stereo algorithm that goes beyond edge-based and area-based approaches by using an image description that is richer than attributes of edges or pixel-brightness values. The algorithm also incorporates several stereo cues that have previously been neglected in the computer vision literature. \nAny stereo algorithm must have at its core a basic and robust mechanism for establishing correspondence between two images. We use linear spatial filters at a range of scales and orientations that are similar to those known to exist in the visual cortex. Filter responses at a given point characterize the local image patch, providing a more concise representation than traditional correlation-based techniques. A simple similarity measure, motivated by robust statistics, serves as a basis for establishing correspondence between image patches in two views. From initial horizontal and vertical disparity estimates, additional information can be recovered about a scene. The viewing geometry, along with the locations of depth discontinuities and occluded regions, all can be recovered and used to iteratively refine the disparity estimates. \nOrientation and spatial frequency disparities can be related geometrically to the slant and tilt of surfaces in a scene. These cues have traditionally been regarded as noise when determining point correspondences. We have developed two new algorithms for recovering local surface orientation based on orientation and spatial frequency disparities: (1) a least squares algorithm based on measurements of corresponding line segments, and (2) a method that makes use of filter responses directly. The second method has also been shown to account for some previously unexplained psychophysical observations by Tyler and Sutter, and von der Heydt. \nIn primary visual cortex of both macaque monkey and cat, inputs from the two eyes are segregated into alternating zones known as ocular dominance bands. If the striking differences in the overall arrangements of these inputs reflect important differences in the basic rules governing cortical ocular dominance, then this poses a problem for attempts to formulate general principles of visual cortical organization. We have formulated and tested a single computational model that accurately predicts the quite dissimilar ocular dominance pattern in cat and monkey. This model also generalizes to predict the ocular dominance pattern in three-eyed frogs, supporting the notion that the overall pattern of ocular dominance is governed by a common set of rules."
            },
            "slug": "Computational-models-of-binocular-vision-Jones",
            "title": {
                "fragments": [],
                "text": "Computational models of binocular vision"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A single computational model is formulated and tested that accurately predicts the quite dissimilar ocular dominance pattern in cat and monkey and generalizes to predict the ocular dominated pattern in three-eyed frogs, supporting the notion that the overall pattern of ocular Dominance is governed by a common set of rules."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144677513"
                        ],
                        "name": "David G. Jones",
                        "slug": "David-G.-Jones",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Jones",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David G. Jones"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143751119"
                        ],
                        "name": "Jitendra Malik",
                        "slug": "Jitendra-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jitendra Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 13573519,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ef4da68443bd6fa826b05196f4fccdb62588a426",
            "isKey": false,
            "numCitedBy": 200,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computational-framework-for-determining-stereo-from-Jones-Malik",
            "title": {
                "fragments": [],
                "text": "Computational framework for determining stereo correspondence from a set of linear spatial filters"
            },
            "venue": {
                "fragments": [],
                "text": "Image Vis. Comput."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "71058586"
                        ],
                        "name": "R. D. Arnold",
                        "slug": "R.-D.-Arnold",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Arnold",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. D. Arnold"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120151178,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a658164fd27833871973053d60ae94376e768fb4",
            "isKey": false,
            "numCitedBy": 75,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "The correspondence problem, matching the same feature in two views, is a central problem of stereo vision. We examine geometric constraints on stereo correspondence and describe progress toward formulation from first principles of an evaluation function for selection of the best among alternative correspondences. Within a surface interpretation, conditions on correspondence of edges and surface intervals are shown. These conditions are useful with wide angle stereo and provide particularly tight constraints for narrow angle stereo. We invoke the general assumption that edge and surface orientations are not related to observer position. We are combining these general constraints with ongoing work in scene modeling of known regularities which include distributions with respect to the gravity vector (horizontal and vertical edges and surfaces), parallelism and alignment with local coordinate systems, and orthogonal corners. We will use them to calculate a likelihood measure for correspondences."
            },
            "slug": "Geometric-Constraints-In-Stereo-Vision-Arnold-Binford",
            "title": {
                "fragments": [],
                "text": "Geometric Constraints In Stereo Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "Geometric constraints on stereo correspondence are examined and progress toward formulation from first principles of an evaluation function for selection of the best among alternative correspondences is described, using a likelihood measure for correspondences."
            },
            "venue": {
                "fragments": [],
                "text": "Optics & Photonics"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143790090"
                        ],
                        "name": "W. Hoff",
                        "slug": "W.-Hoff",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Hoff",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Hoff"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145237406"
                        ],
                        "name": "N. Ahuja",
                        "slug": "N.-Ahuja",
                        "structuredName": {
                            "firstName": "Narendra",
                            "lastName": "Ahuja",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Ahuja"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 67,
                                "start": 48
                            }
                        ],
                        "text": "Some previous workin this area has been done by Ho and Ahuja (1989)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2800388,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "3ffb442ba95ac657a0ea6785555384f43f662d0c",
            "isKey": false,
            "numCitedBy": 355,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": "An approach is described that integrates the processes of feature matching, contour detection, and surface interpolation to determine the three-dimensional distance, or depth, of objects from a stereo pair of images. Integration is necessary to ensure that the detected surfaces are smooth. Surface interpolation takes into account detected occluding and ridge contours in the scene; interpolation is performed within regions enclosed by these contours. Planar and quadratic patches are used as local models of the surface. Occluded regions in the image are identified, and are not used for matching and interpolation. A coarse-to-fine algorithm is presented that generates a multiresolution hierarchy of surface maps, one at each level of resolution. Experimental results are given for a variety of stereo images. >"
            },
            "slug": "Surfaces-from-Stereo:-Integrating-Feature-Matching,-Hoff-Ahuja",
            "title": {
                "fragments": [],
                "text": "Surfaces from Stereo: Integrating Feature Matching, Disparity Estimation, and Contour Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "An approach is described that integrates the processes of feature matching, contour detection, and surface interpolation to determine the three-dimensional distance, or depth, of objects from a stereo pair of images."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143602141"
                        ],
                        "name": "M. Kass",
                        "slug": "M.-Kass",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Kass",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Kass"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 179,
                                "start": 170
                            }
                        ],
                        "text": "A third approach is based on the idea of rst convolving the left and right images witha bank of linear lters tuned to a number of di erent orientations and scales (e.g., Kass,1983)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 61682590,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "eedaec6f0b9fb8348173caa1fecbc7903ac693be",
            "isKey": false,
            "numCitedBy": 41,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : A computational framework for solving the visual correspondence problem is presented and evaluated by using a stochastic image model. The framework differs from previous work in that it emphasizes the combination of a large collection of independent measurements. Partial derivatives of images smoothed with a few different-sized Gaussian filters are suggested as suitable measurements. A specific computation is shown based on a stochastic image model to reliably establish whether or not two points correspond, provided that the signal to correspondence noise ratio in the images to be matched exceeds two. The computation has been applied to artificial and natural images with encouraging results. (Author)"
            },
            "slug": "Computing-Visual-Correspondence-Kass",
            "title": {
                "fragments": [],
                "text": "Computing Visual Correspondence"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A specific computation is shown based on a stochastic image model to reliably establish whether or not two points correspond, provided that the signal to correspondence noise ratio in the images to be matched exceeds two."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2210169"
                        ],
                        "name": "S. Barnard",
                        "slug": "S.-Barnard",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Barnard",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Barnard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144816086"
                        ],
                        "name": "W. Thompson",
                        "slug": "W.-Thompson",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Thompson",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Thompson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 97
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery,1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Pog-gio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni andNevatia, 1985; Ayache and Faverjon, 1987).? This work has…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 53
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery, 1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Poggio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 10132470,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "22d262e5dfd45776f5616fe405cf153c8466e965",
            "isKey": false,
            "numCitedBy": 900,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm for matching images of real world scenes is presented. The matching is a specification of the geometrical disparity between the images and may be used to partially reconstruct the three-dimensional structure of the scene. Sets of candidate matching points are selected independently in each image. These points are the locations of small, distinct features which are likely to be detectable in both images. An initial network of possible matches between the two sets of candidates is constructed. Each possible match specifies a possible disparity of a candidate point in a selected reference image. An initial estimate of the probability of each possible disparity is made, based on the similarity of subimages surrounding the points. These estimates are iteratively improved by a relaxation labeling technique making use of the local continuity property of disparity that is a consequence of the continuity of real world surfaces. The algorithm is effective for binocular parallax, motion parallax, and object motion. It quickly converges to good estimates of disparity, which reflect the spatial organization of the scene."
            },
            "slug": "Disparity-Analysis-of-Images-Barnard-Thompson",
            "title": {
                "fragments": [],
                "text": "Disparity Analysis of Images"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "An algorithm for matching images of real world scenes is presented, which quickly converges to good estimates of disparity, which reflect the spatial organization of the scene."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 283,
                                "start": 144
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery, 1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Poggio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni and Nevatia, 1985; Ayache and Faverjon, 1987)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 96
                            }
                        ],
                        "text": "To cope withthe enormous number of false matches, a coarse-to- ne strategy may be adopted (e.g.,Marr and Poggio, 1979; Grimson, 1981)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 60545300,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "75d5b6239679642070a29859ec009874f3be9a4a",
            "isKey": false,
            "numCitedBy": 380,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "An Algorithm is proposed for solving the stereoscopic matching problem. The algorithm consists of five steps: (1) Each image is filtered with bar masks of four sizes that vary with eccentricity; the equivalent filters are about one octave wide. (2) Zero-crossings of the mask values are localized, and positions that correspond to terminations are found; (3) For each mask size, matching takes place between pairs of zero- crossings or terminations of the same sign in the two images, for a range of disparities up to about the vergence movements, thus causing small masks to come into correspondence; (5) When a correspondence is achieved, it is written into a dynamic buffer, called the 2 1/2 D sketch. It is shown that this proposal provides a theoretical framework for most existing phychophysical and neurophysiological data about stereopsis. Several critical experimental predictions are also made, for instance, about the wsize of Panum?s area under various conditions. The results of such experiments would tell us whether, for example, cooperativity is necessary for the fusion process."
            },
            "slug": "A-Theory-of-Human-Stereo-Vision-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "A Theory of Human Stereo Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This proposal provides a theoretical framework for most existing phychophysical and neurophysiological data about stereopsis, and several critical experimental predictions are made, for instance, about the wsize of Panum?s area under various conditions."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145099732"
                        ],
                        "name": "S. Pollard",
                        "slug": "S.-Pollard",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Pollard",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Pollard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2544594"
                        ],
                        "name": "J. Frisby",
                        "slug": "J.-Frisby",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Frisby",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Frisby"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 283,
                                "start": 144
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery, 1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Poggio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni and Nevatia, 1985; Ayache and Faverjon, 1987)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 77,
                                "start": 57
                            }
                        ],
                        "text": "The disparity gradient constraint (Burt andJulesz, 1980; Pollard et al., 1985) and the ordering constraint (Baker and Binford,1982) are closely related."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 174,
                                "start": 138
                            }
                        ],
                        "text": "In some instances, additional limits can be imposed, such as a limit on the rate at which disparity is allowed to change across the image (Mayhew, 1983; Pollard et al., 1985)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 34
                            }
                        ],
                        "text": "The disparity gradient constraint (Burt and Julesz, 1980; Pollard et al., 1985) and the ordering constraint (Baker and Binford, 1982) are closely related."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 173,
                                "start": 153
                            }
                        ],
                        "text": "In some instances, additional limits can be im-posed, such as a limit on the rate at which disparity is allowed to change across theimage (Mayhew, 1983; Pollard et al., 1985)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 167,
                                "start": 147
                            }
                        ],
                        "text": "…1974; Gennery,1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Pog-gio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni andNevatia, 1985; Ayache and Faverjon, 1987).? This work has been supported by a grant to DJ from the Natural Sciences…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 37508824,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "11996252bec281d26e7b9c9b0eb3a834d194ad9d",
            "isKey": true,
            "numCitedBy": 544,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "The advantages of solving the stereo correspondence problem by imposing a limit on the magnitude of allowable disparity gradients are examined. It is shown how the imposition of such a limit can provide a suitable balance between the twin requirements of disambiguating power and the ability to deal with a wide range of surfaces. Next, the design of a very simple stereo algorithm called PMF is described. In conjunction with certain other constraints used in many other stereo algorithms, PMF employs a limit on allowable disparity gradients of 1, a value that coincides with that reported for human stereoscopic vision. The excellent performance of PMF is illustrated on a series of natural and artificial stereograms. Finally, the differences between the theoretical justification for the use of disparity gradients for solving the stereo correspondence problems presented in the paper and others that exist in the stereo algorithm literature are discussed."
            },
            "slug": "PMF:-A-Stereo-Correspondence-Algorithm-Using-a-Pollard-Mayhew",
            "title": {
                "fragments": [],
                "text": "PMF: A Stereo Correspondence Algorithm Using a Disparity Gradient Limit"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "It is shown how the imposition of a limit on the magnitude of allowable disparity gradients can provide a suitable balance between the twin requirements of disambiguating power and the ability to deal with a wide range of surfaces."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145337347"
                        ],
                        "name": "H. Baker",
                        "slug": "H.-Baker",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Baker",
                            "middleNames": [
                                "Harlyn"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738591"
                        ],
                        "name": "T. Binford",
                        "slug": "T.-Binford",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Binford",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Binford"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11002139,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "278618251450aaeb334227ec82bacabfc1c266de",
            "isKey": false,
            "numCitedBy": 545,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The past few years have seen a growing interest in the application\" of three-dimensional image processing. With the increasing demand for 3-D spatial information for tasks of passive navigation [7,12], automatic surveillance [9], aerial cartography [10,13], and inspection in industrial automation, the importance of effective stereo analysis has been made quite clear. A particular challenge is to provide reliable and accurate depth data for input to object or terrain modelling systems (such as [5]. This paper describes an algorithm for such stereo sensing It uses an edge-based line-by-line stereo correlation scheme, and appears to be fast, robust, and parallel implementable. The processing consists of extracting edge descriptions for a stereo pair of images, linking these edges to their nearest neighbors to obtain the edge connectivity structure, correlating the edge descriptions on the basis of local edge properties, then cooperatively removmg those edge correspondences determined to be in error - those which violate the connectivity structure of the two images. A further correlation process, using a technique similar to that used for the edges, is applied to the image intensity values over intervals defined by the previous correlation The result of the processing is a full image array disparity map of the scene viewed."
            },
            "slug": "Depth-from-Edge-and-Intensity-Based-Stereo-Baker-Binford",
            "title": {
                "fragments": [],
                "text": "Depth from Edge and Intensity Based Stereo"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper describes an algorithm for stereo sensing that uses an edge-based line-by-line stereo correlation scheme, and appears to be fast, robust, and parallel implementable."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144117609"
                        ],
                        "name": "J. Mayhew",
                        "slug": "J.-Mayhew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mayhew",
                            "middleNames": [
                                "E.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mayhew"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 55,
                                "start": 45
                            }
                        ],
                        "text": "Proc Royal Society London B204:301{328Mayhew JEW (1982) The interpretation of stereo disparity information: the computationof surface orientation and depth."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 27417700,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "493ce1be809e1a65c0030696f2767fdc80ab7882",
            "isKey": false,
            "numCitedBy": 87,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Two methods for interpreting disparity information are described. Neither requires extraretinal information to scale for distance: one method uses horizontal disparities to solve for the viewing distance, the other uses the vertical disparities. Method 1 requires the assumption that the disparities derive from a locally planar surface. Then from the horizontal disparities measured at four retinal locations the viewing distance and the equation of local surface ‘patch’ can be obtained. Method 2 does not need this assumption. The vertical disparities are first used to obtain the values of the gaze and viewing distance. These are then used to interpret the horizontal disparity information. An algorithm implementing the methods has been tested and is found to be subject to a perceptual phenomenon known as the ‘induced effect’."
            },
            "slug": "The-Interpretation-of-Stereo-Disparity-Information:-Mayhew",
            "title": {
                "fragments": [],
                "text": "The Interpretation of Stereo-Disparity Information: The Computation of Surface Orientation and Depth"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "Two methods for interpreting disparity information are described and an algorithm implementing the methods has been tested and is found to be subject to a perceptual phenomenon known as the ‘induced effect’."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3129516"
                        ],
                        "name": "M. J. Hannah",
                        "slug": "M.-J.-Hannah",
                        "structuredName": {
                            "firstName": "Marsha",
                            "lastName": "Hannah",
                            "middleNames": [
                                "Jo"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. J. Hannah"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 66,
                                "start": 54
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery,1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Pog-gio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni andNevatia, 1985; Ayache and Faverjon, 1987).? This work has…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 53
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery, 1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Poggio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 62672515,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "02a0829a658e7dbfdf49e8112b38f8911a12eb76",
            "isKey": false,
            "numCitedBy": 222,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : This dissertation describes techniques for efficiently matching corresponding areas of a stereo pair of images. Measures of match which are suitable for this purpose are discussed, as are methods for pruning the search for a match. The mathematics necessary to convert a set of matchings into a workable camera model are given, along with calculations which use this model and a pair of image points to locate the corresponding scene point. Methods are included to detect some types of unmatchable target areas in the original data and for detecting when a supposed match is invalid. Region growing techniques are di9 for extend matching areas into regions of constant parallax and for delimiting uniform regions in an image. Also, two algorithms are presented to show some of the ways in which these techniques can be combined to perform useful tasks in the processing of stereo images."
            },
            "slug": "Computer-matching-of-areas-in-stereo-images.-Hannah",
            "title": {
                "fragments": [],
                "text": "Computer matching of areas in stereo images."
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "Techniques for efficiently matching corresponding areas of a stereo pair of images and two algorithms are presented to show some of the ways in which these techniques can be combined to perform useful tasks in the processing of stereo images."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3463966"
                        ],
                        "name": "G. Medioni",
                        "slug": "G.-Medioni",
                        "structuredName": {
                            "firstName": "Gérard",
                            "lastName": "Medioni",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Medioni"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144862593"
                        ],
                        "name": "R. Nevatia",
                        "slug": "R.-Nevatia",
                        "structuredName": {
                            "firstName": "Ramakant",
                            "lastName": "Nevatia",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Nevatia"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 283,
                                "start": 144
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery, 1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Poggio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni and Nevatia, 1985; Ayache and Faverjon, 1987)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8805362,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "af6516a0682a1612badacdc6afd719fd3a67ed55",
            "isKey": false,
            "numCitedBy": 444,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Segment-based-stereo-matching-Medioni-Nevatia",
            "title": {
                "fragments": [],
                "text": "Segment-based stereo matching"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144677513"
                        ],
                        "name": "David G. Jones",
                        "slug": "David-G.-Jones",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Jones",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David G. Jones"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143751119"
                        ],
                        "name": "Jitendra Malik",
                        "slug": "Jitendra-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jitendra Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 103
                            }
                        ],
                        "text": "A methodfor handling slanted surfaces such as this has been discussed in detail elsewhere (Jones,1991; Jones and Malik, 1992)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 127,
                                "start": 91
                            }
                        ],
                        "text": "A method for handling slanted surfaces such as this has been discussed in detail elsewhere (Jones, 1991; Jones and Malik, 1992)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 17617198,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "0afed81a47d764a73b27290decafbf2f9bfc10d6",
            "isKey": false,
            "numCitedBy": 75,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Binocular differences in orientation and foreshortening are systematically related to surface slant and tilt and could potentially be exploited by biological and machine vision systems. Indeed, human stereopsis may possess a mechanism that specifically makes use of these orientation and spatial frequency disparities, in addition to the usual cue of horizontal disparity. In machine vision algorithms, orientation and spatial frequency disparities are a source of error in finding stereo correspondence because one seeks to find features or areas which are similar in the two views when, in fact, they are systematically different. In other words, it is common to treat as noise what is useful signal."
            },
            "slug": "Determining-Three-Dimensional-Shape-from-and-Jones-Malik",
            "title": {
                "fragments": [],
                "text": "Determining Three-Dimensional Shape from Orientation and Spatial Frequency Disparities"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Orientation and spatial frequency disparities are a source of error in finding stereo correspondence because one seeks to find features or areas which are similar in the two views when, in fact, they are systematically different."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728376"
                        ],
                        "name": "K. Nakayama",
                        "slug": "K.-Nakayama",
                        "structuredName": {
                            "firstName": "Ken",
                            "lastName": "Nakayama",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Nakayama"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47706614"
                        ],
                        "name": "S. Shimojo",
                        "slug": "S.-Shimojo",
                        "structuredName": {
                            "firstName": "Shinsuke",
                            "lastName": "Shimojo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Shimojo"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30647950,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1d461a2a0aa46ee50d6ba95e3c35d4ee8f49137d",
            "isKey": false,
            "numCitedBy": 317,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Da-vinci-stereopsis:-Depth-and-subjective-occluding-Nakayama-Shimojo",
            "title": {
                "fragments": [],
                "text": "Da vinci stereopsis: Depth and subjective occluding contours from unpaired image points"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144496341"
                        ],
                        "name": "B. Gillam",
                        "slug": "B.-Gillam",
                        "structuredName": {
                            "firstName": "Barbara",
                            "lastName": "Gillam",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Gillam"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102979881"
                        ],
                        "name": "B. Lawergren",
                        "slug": "B.-Lawergren",
                        "structuredName": {
                            "firstName": "B.",
                            "lastName": "Lawergren",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Lawergren"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1840162,
            "fieldsOfStudy": [
                "Physics",
                "Geology"
            ],
            "id": "cee2a4b0e37295fbae51333f09ca4f30c21d6ed2",
            "isKey": false,
            "numCitedBy": 112,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "The induced effect is an apparent slant of a frontal plane surface around a vertical axis, resulting from vertical magnification of the image in one eye. It is potentially important in suggesting a role for vertical disparity in stereoscopic vision, as proposed by Helmholtz. The paper first discusses previous theories of the induced effect and their implications. A theory is then developed attributing the effect to the process by which the stereoscopic response to horizontal disparity is scaled for viewing distance and eccentricity. The theory is based on a mathematical analysis of vertical disparity gradients produced by surfaces at various distances and eccentricities relative to the observer. Vertical disparity is shown to be an approximately linear function of eccentricity, with a slope or gradient which decreases with observation distance. The effect of vertical magnification on such gradients is analyzed and shown to be consistent with a change in the eccentricity factor, but not the distance factor, required to scale horizontal disparity. The induced effect is shown to be an appropriate stereoscopic response to a zero horizontal disparity surface at the eccentricity indicated. However, since extraretinal convergence signals provide conflicting evidence about eccentricity, they may attenuate the induced effect from its mathematically predicted value. The discomfort associated with the induced effect is attributed to this conflict."
            },
            "slug": "The-induced-effect,-vertical-disparity,-and-theory-Gillam-Lawergren",
            "title": {
                "fragments": [],
                "text": "The induced effect, vertical disparity, and stereoscopic theory"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The induced effect is shown to be an appropriate stereoscopic response to a zero horizontal disparity surface at the eccentricity indicated, however, since extraretinal convergence signals provide conflicting evidence about eccentricity, they may attenuate the induced effect from its mathematically predicted value."
            },
            "venue": {
                "fragments": [],
                "text": "Perception & psychophysics"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2192229"
                        ],
                        "name": "D. Gennery",
                        "slug": "D.-Gennery",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Gennery",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gennery"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 80,
                                "start": 68
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery,1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Pog-gio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni andNevatia, 1985; Ayache and Faverjon, 1987).? This work has…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 53
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery, 1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Poggio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2915080,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0ccf495dc086476505b40c6639f2ceffe10594a2",
            "isKey": false,
            "numCitedBy": 82,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Several techniques for use in a stereo vision system are described. These include a stereo camera model solver, a high resolution stereo correlator for producing accurate matches with accuracy and confidence estimates, a search technique for using the correlator to produce a dense sampling of matched points for a pair of pictures, and a ground surface finder for distinguishing the ground from objects, in the resulting three-dimensional data. Possible ways of using these techniques in an autonomous vehicle designed to explore its environment are discussed. An example is given showing the detection of objects from a stereo pair of pictures."
            },
            "slug": "A-Stereo-Vision-System-for-an-Autonomous-Vehicle-Gennery",
            "title": {
                "fragments": [],
                "text": "A Stereo Vision System for an Autonomous Vehicle"
            },
            "tldr": {
                "abstractSimilarityScore": 95,
                "text": "Several techniques for use in a stereo vision system include a stereo camera model solver, a high resolution stereo correlator for producing accurate matches with accuracy and confidence estimates, a search technique for using the correlator to produce a dense sampling of matched points for a pair of pictures, and a ground surface finder for distinguishing the ground from objects."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768236"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Freeman",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 208,
                                "start": 183
                            }
                        ],
                        "text": "Such lters for which responses at a small numberof orientations allow the easy computation of lter responses for other orientations havebeen termed steerable lters (Koenderink, 1988; Freeman and Adelson, 1991; Perona,1991)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 225,
                                "start": 166
                            }
                        ],
                        "text": "Such lters for which responses at a small number of orientations allow the easy computation of lter responses for other orientations have been termed steerable lters (Koenderink, 1988; Freeman and Adelson, 1991; Perona, 1991)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 29187618,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "993b1083455b5c4d631eaf44f230b061994e75c3",
            "isKey": false,
            "numCitedBy": 3379,
            "numCiting": 55,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors present an efficient architecture to synthesize filters of arbitrary orientations from linear combinations of basis filters, allowing one to adaptively steer a filter to any orientation, and to determine analytically the filter output as a function of orientation. Steerable filters may be designed in quadrature pairs to allow adaptive control over phase as well as orientation. The authors show how to design and steer the filters and present examples of their use in the analysis of orientation and phase, angularly adaptive filtering, edge detection, and shape from shading. One can also build a self-similar steerable pyramid representation. The same concepts can be generalized to the design of 3-D steerable filters. >"
            },
            "slug": "The-Design-and-Use-of-Steerable-Filters-Freeman-Adelson",
            "title": {
                "fragments": [],
                "text": "The Design and Use of Steerable Filters"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The authors present an efficient architecture to synthesize filters of arbitrary orientations from linear combinations of basis filters, allowing one to adaptively steer a filter to any orientation, and to determine analytically the filter output as a function of orientation."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2066894"
                        ],
                        "name": "Hans P. Moravec",
                        "slug": "Hans-P.-Moravec",
                        "structuredName": {
                            "firstName": "Hans",
                            "lastName": "Moravec",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hans P. Moravec"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 81,
                                "start": 68
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery,1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Pog-gio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni andNevatia, 1985; Ayache and Faverjon, 1987).? This work has been supported by a grant to DJ from the Natural Sciences and EngineeringResearch Council of Canada (OGP0105912) and by a National Science Foundation PYI award(IRI-8957274) to JM."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 95,
                                "start": 82
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery,1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Pog-gio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni andNevatia, 1985; Ayache and Faverjon, 1987).? This work has…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 53
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery, 1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Poggio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15630760,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "3b4a713d67a0a4f7099bdc40d818311b8827b8b7",
            "isKey": false,
            "numCitedBy": 738,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This report describes ongoing research on a working system which drives a vehicle through cluttered environments under computer control, guided by images perceived through an onboard television camera. The emphasis is on reliable and fast low level visual techniques which determine the existence and location of objects in the world, but do not identify them"
            },
            "slug": "Towards-Automatic-Visual-Obstacle-Avoidance-Moravec",
            "title": {
                "fragments": [],
                "text": "Towards Automatic Visual Obstacle Avoidance"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This report describes ongoing research on a working system which drives a vehicle through cluttered environments under computer control, guided by images perceived through an onboard television camera."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2302358"
                        ],
                        "name": "P. Burt",
                        "slug": "P.-Burt",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Burt",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Burt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 34
                            }
                        ],
                        "text": "The disparity gradient constraint (Burt and Julesz, 1980; Pollard et al., 1985) and the ordering constraint (Baker and Binford, 1982) are closely related."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 21326878,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "dd79190fdb39828441708c94ccaaa5289ed664ea",
            "isKey": false,
            "numCitedBy": 288,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Ever since Panum, it has been commonly assumed that there is an absolute disparity limit for binocular fusion. It is now found that nearby objects modify this disparity limit. This result sheds new light on several enigmatic phenomena in stereopsis."
            },
            "slug": "A-disparity-gradient-limit-for-binocular-fusion.-Burt-Julesz",
            "title": {
                "fragments": [],
                "text": "A disparity gradient limit for binocular fusion."
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "It is found that nearby objects modify this disparity limit for binocular fusion and this result sheds new light on several enigmatic phenomena in stereopsis."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 161,
                                "start": 148
                            }
                        ],
                        "text": "…approaches are area correlation (Hannah, 1974; Gennery,1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Pog-gio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni andNevatia, 1985; Ayache and Faverjon, 1987).? This work has been supported by…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 91
                            }
                        ],
                        "text": "To cope with the enormous number of false matches, a coarse-to- ne strategy may be adopted (e.g., Marr and Poggio, 1979; Grimson, 1981)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 283,
                                "start": 144
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery, 1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Poggio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni and Nevatia, 1985; Ayache and Faverjon, 1987)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 132,
                                "start": 119
                            }
                        ],
                        "text": "To cope withthe enormous number of false matches, a coarse-to- ne strategy may be adopted (e.g.,Marr and Poggio, 1979; Grimson, 1981)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 53778103,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "7d4398e9ef96d20270177d57caab63fdc9f13295",
            "isKey": true,
            "numCitedBy": 173,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "From-images-to-surfaces-Grimson",
            "title": {
                "fragments": [],
                "text": "From images to surfaces"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 122,
                                "start": 106
                            }
                        ],
                        "text": "Theadvantages of such a representation have been described in some detail (Koenderink andvan Doorn, 1987; Koenderink, 1988)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 75
                            }
                        ],
                        "text": "The advantages of such a representation have been described in some detail (Koenderink and van Doorn, 1987; Koenderink, 1988)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 181,
                                "start": 165
                            }
                        ],
                        "text": "Such lters for which responses at a small numberof orientations allow the easy computation of lter responses for other orientations havebeen termed steerable lters (Koenderink, 1988; Freeman and Adelson, 1991; Perona,1991)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 225,
                                "start": 166
                            }
                        ],
                        "text": "Such lters for which responses at a small number of orientations allow the easy computation of lter responses for other orientations have been termed steerable lters (Koenderink, 1988; Freeman and Adelson, 1991; Perona, 1991)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Operational signi cance of receptive eld assemblies"
            },
            "venue": {
                "fragments": [],
                "text": "Biol Cybern"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 173,
                                "start": 147
                            }
                        ],
                        "text": "…to determine viewing geometry date back towork in the photogrammetry community in the beginning of this century (for some histor-ical references, Faugeras and Maybank, 1990) and have been rediscovered and developedin the work on structure from motion in the computational vision community."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 195837951,
            "fieldsOfStudy": [],
            "id": "a18ab523c143bebdec421d66bf01e1967262c919",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Motion from point matches: multiplicity of solutions"
            },
            "venue": {
                "fragments": [],
                "text": "[1989] Proceedings. Workshop on Visual Motion"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728376"
                        ],
                        "name": "K. Nakayama",
                        "slug": "K.-Nakayama",
                        "structuredName": {
                            "firstName": "Ken",
                            "lastName": "Nakayama",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Nakayama"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47706614"
                        ],
                        "name": "S. Shimojo",
                        "slug": "S.-Shimojo",
                        "structuredName": {
                            "firstName": "Shinsuke",
                            "lastName": "Shimojo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Shimojo"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 202,
                                "start": 174
                            }
                        ],
                        "text": "Recent psychophysical work has convincingly established that the human visual system can exploit this cue for depth in a manner consistent with the geometry of the situation (Nakayama and Shimojo, 1990)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 201,
                                "start": 175
                            }
                        ],
                        "text": "Recent psychophysical work has convincingly established that the human visual sys-tem can exploit this cue for depth in a manner consistent with the geometry of thesituation (Nakayama and Shimojo, 1990)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 141608138,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "8091930dd3b029966312706ae75bbb7dedaffaac",
            "isKey": false,
            "numCitedBy": 31,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "DaVinci-stereopsis:-Depth-and-subjective-contours-Nakayama-Shimojo",
            "title": {
                "fragments": [],
                "text": "DaVinci stereopsis: Depth and subjective contours from unpaired monocular points"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712211"
                        ],
                        "name": "G. Golub",
                        "slug": "G.-Golub",
                        "structuredName": {
                            "firstName": "Gene",
                            "lastName": "Golub",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Golub"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 126299280,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b9efffc63f81bf3f6cb6357ddc15e9cd9da75d16",
            "isKey": false,
            "numCitedBy": 27000,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Matrix-computations-Golub",
            "title": {
                "fragments": [],
                "text": "Matrix computations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "corpusId": 29762917,
            "fieldsOfStudy": [],
            "id": "7217934b2ae40782b8f477b1a88770bd16060863",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Motion from point matches: multiplicity of solutions"
            },
            "venue": {
                "fragments": [],
                "text": "Geometry and Robotics"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Computational models of binocular vision A computational framework for determining stereo correspondence from a set of linear spatial lters"
            },
            "venue": {
                "fragments": [],
                "text": "Computational models of binocular vision A computational framework for determining stereo correspondence from a set of linear spatial lters"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 75
                            }
                        ],
                        "text": "Details of our algorithm for estimating viewing parameters may be found in (Jones and Malik, 1991)."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A computational framework for determining stereo"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 229,
                                "start": 216
                            }
                        ],
                        "text": "An assumption that visible surfaces in the sceneare piecewise smooth leads to di erential treatment of image regions corre-sponding to binocularly visible surfaces, surface boundaries, and occludedregions that are only monocularly visible."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 80,
                                "start": 68
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery,1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Pog-gio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni andNevatia, 1985; Ayache and Faverjon, 1987).? This work has…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A stereo vision system for autonomous vehicles Proc 5th IJCAI 576{582 Gillam B, Lawergren B (1983) The induced eeect, vertical disparity, and stereoscopic theory"
            },
            "venue": {
                "fragments": [],
                "text": "Perception and Psychophysics"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 223,
                                "start": 210
                            }
                        ],
                        "text": "Very early in cortical visual processing, receptive elds become oriented and are well approximated by linear spatial lters, with impulse response functions that are similar to partial derivatives of a Gaussian (Young, 1985)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 220,
                                "start": 209
                            }
                        ],
                        "text": "Very early in cortical visual processing, receptive elds become oriented andare well approximated by linear spatial lters, with impulse response functions that aresimilar to partial derivatives of a Gaussian (Young, 1985)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Gaussian derivative theory of spatial vision: analysis of cortical cell"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 174,
                                "start": 138
                            }
                        ],
                        "text": "In some instances, additional limits can be imposed, such as a limit on the rate at which disparity is allowed to change across the image (Mayhew, 1983; Pollard et al., 1985)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 151,
                                "start": 139
                            }
                        ],
                        "text": "In some instances, additional limits can be im-posed, such as a limit on the rate at which disparity is allowed to change across theimage (Mayhew, 1983; Pollard et al., 1985)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Stereopsis. in Physiological and Biological Processing of Images"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The induced e ect , vertical disparity , and stereoscopictheory"
            },
            "venue": {
                "fragments": [],
                "text": "Perception and Psychophysics"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Operational signiicance of receptive eld assemblies"
            },
            "venue": {
                "fragments": [],
                "text": "Biol Cybern"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Faverjon B (1987) E cient registration of stereo images by matching graph"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 173,
                                "start": 148
                            }
                        ],
                        "text": "…Thompson, 1980) and edge matching (Marr and Pog-gio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni andNevatia, 1985; Ayache and Faverjon, 1987).? This work has been supported by a grant to DJ from the Natural Sciences and EngineeringResearch Council of Canada…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "E \u000e cient registration of stereo images by matching graphdescriptions of edge segments"
            },
            "venue": {
                "fragments": [],
                "text": "Int J Computer Vision"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 80,
                                "start": 68
                            }
                        ],
                        "text": "The two best studied approaches are area correlation (Hannah, 1974; Gennery,1977; Moravec, 1977; Barnard and Thompson, 1980) and edge matching (Marr and Pog-gio, 1979; Grimson, 1981; Baker and Binford, 1982; Pollard et al., 1985; Medioni andNevatia, 1985; Ayache and Faverjon, 1987).? This work has…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A stereo vision system for autonomous vehicles Proc 5th IJCAI 576{582 Gillam B, Lawergren B (1983) The induced eect, vertical disparity, and stereoscopic theory"
            },
            "venue": {
                "fragments": [],
                "text": "A stereo vision system for autonomous vehicles Proc 5th IJCAI 576{582 Gillam B, Lawergren B (1983) The induced eect, vertical disparity, and stereoscopic theory"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 67,
                                "start": 48
                            }
                        ],
                        "text": "Some previous workin this area has been done by Ho and Ahuja (1989)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Surfaces from stereo: integrating stereo matching, disparity"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "EEcient registration of stereo images by matching graph descriptions of edge segments Depth from edge-and intensity-based stereo Disparity analysis of images"
            },
            "venue": {
                "fragments": [],
                "text": "Proc 7th IJCAI 631{636 Barnard ST"
            },
            "year": 1980
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 19,
            "methodology": 7
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 37,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/A-Computational-Framework-for-Determining-Stereo-a-Jones-Malik/1ff22944d8a76831867d902570ed85a7e0e3cac6?sort=total-citations"
}