{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48572350"
                        ],
                        "name": "S. Lam",
                        "slug": "S.-Lam",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Lam",
                            "middleNames": [
                                "Wang-Cheung"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Lam"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398880839"
                        ],
                        "name": "L. Javanbakht",
                        "slug": "L.-Javanbakht",
                        "structuredName": {
                            "firstName": "Ladan",
                            "lastName": "Javanbakht",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Javanbakht"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696384"
                        ],
                        "name": "S. Srihari",
                        "slug": "S.-Srihari",
                        "structuredName": {
                            "firstName": "Sargur",
                            "lastName": "Srihari",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Srihari"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Analyses [4, 5, 6] using frame-line intersections are more robust, if non-frame lines do not cross or do not touch the frame lines."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "The conventional method [4, 5, 6] defines nine types of corner patterns, which are four L-junction patterns, four T-junction patterns and one +-junction pattern."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 206774379,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1462c98095382d867cb9d026988ed6e3455f9617",
            "isKey": false,
            "numCitedBy": 45,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Forms are used extensively in today's offices. The task of an automated form reader is to locate data filled on a form and to encode the content into appropriate symbolic descriptions. The challenges in form reading are due to high volume and large variety. A robust form reader with high adaptability and trainability. The form reader consists of two modules: field registration and data recognition module. The field registration module acquires knowledge about the forms of interest and the data recognition module recognizes text data on filled forms using the acquired knowledge. The capability of the reader increases progressively through supervised learning. The form reader has been training to read a large variety of forms with machine-printed data. The adaptability and trainability of the system have been demonstrated through the experiments.<<ETX>>"
            },
            "slug": "Anatomy-of-a-form-reader-Lam-Javanbakht",
            "title": {
                "fragments": [],
                "text": "Anatomy of a form reader"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A robust form reader with high adaptability and trainability, training to read a large variety of forms with machine-printed data is demonstrated."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2741916"
                        ],
                        "name": "M. Garris",
                        "slug": "M.-Garris",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Garris",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Garris"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "In cell recognition by line structure analysis [3], it is very difficult to distinguish frame lines from non-frame lines, such as noise strokes."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 56224981,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e0212d327f58ea20fde4deaeb477eb452bd7517c",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm designed to detect intrinsic form structure within binary digitized documents has been developed. This Correlated Run Length algorithm automatically locates and extracts line segments, line endings, and combinations of line intersections including corners, crosses, and T's from images. These structures, once detected, can be used as form features to identify the fonn type in an image, and they can be used to automatically identifying entry fields containing information in need of optical character recognition. This technique has several advantages over more conventional approaches in that form structures are detected without any a priori knowledge of the specific form in the image, and these structures are detected directly from the original image so that any distortions including translation, rotation, and scale are automatically handled. The algorithm performs extremely well on highly cluttered fonns and noisy images and is well suited for implementation in a highly parallel processing environment. Imaging technologies have been rapidly advancing as the performance of computers and the intelligence of algorithms have continued to increase. Current document processing technologies rely heavily on the use of forms printed with drop-out inks and are overly constrained to rigid form design and printing specifications. Document processing applications frequently cannot be limited to these constraints rendering the technology useless or only partially useful. In order to effectively and efficiently handle electronically scanned documents, automated document processing technologies must continue to improve. The Correlated Run Length algorithm (CURL) has been designed to support flexible forms identification and entry field location. These functions serve as font-ends to Optical Character Recognition (OCR) systems. CURL automatically detects a wide variety of structures frequently incorporated into the design of a form. These structures include line segments, line endings, and combinations of line intersections (comers, crosses, and T's). These lowlevel structures form higher-level constructs including lines, boxes, and grids denoting form regions and data entry fields. By detecting these intrinsic structures, the form type of an image can be identified. The NIST Model Recognition System [I] currently uses localized spatial histograms to detect and locate the types of form structures listed above. Every entry field on the forms processed by the system is demarcated by a bounding box like the entry field shown in Figure 7. The field isolation module of the system uses a static template to direct localized histogram searches in an attempt to locate the four edges of each box. This is accomplished by defining a region of interest in which both horizontal and vertical histogram projections are calculated. The comers of a box are located by finding coinciding bins containing relative maxima between the horizontal and vertical projections. The localized histogram technique works well when the boxes are well defined by bold markings, when the boxes are more than sufficient in size to comfortably contain the data requested to be entered into the box, and when the boxes are adequately spaced apart from one another on the form. When a form does not conform to these constraints, the accuracy of the localized histogram technique quickly degrades due to ambiguities introduced in the histogram projections. These projections can be used to describe orthogonal densities, but they cannot be used to accurately detect complex shapes, such as box comers, on cluttered and cramped forms because the technique simply aggregates pixels in rows and columns without taking pixel contiguity into account. In his paper, \"Image Segmentation with Networks of Variable Scales\", Hans Graf describes an experiment in which he studied the application of a set of kernels for detecting edges and comers in gray scale images of boxcars.[2] The kernels define directions and shapes of contrast change in local neighborhoods. In the experiments described in Graf's paper, the kernels were very successful in detecting characters on the sides of boxcars. The success can be attributed primarily to the fact that the gray scale background of the boxcars is relatively uniform, so that contrast changes primarily occur around the characters of interest. This technique suffers when applied to binary scanned documents and forms that are comprised almost entirely of edge information. Hand print strokes, machine print text, and form structures are all ambiguously represented by collections of edges. Therefore, contrast detection kernels detect contrast-based structures at too fine a detail to be useful in extracting higher-level form structures. The algorithm presented in this paper extracts larger-scale shape-based structures, not contrast-based structures, and accurately distinguishes hand print strokes and machine print text from form structures. This paper demonstrates how the CURL algorithm overcomes the deficiencies of localized histograms and contrast kernels by using vector correlations that reward contiguity of pixels through the use of run length values. Section 2 provides a technical description of the algorithm, Section 3 shows working examples for entry fields and form structures, Section 4 points out various implementation issues, and Section 5 demonstrates CURL's tolerance to rotational distortions. CURL correlates and aggregates pixels along selected trajectories in order to detect and locate shape-based structures within an image. Shape is represented by at least two edge vectors called an edge pair. The elements of the edge vectors address pixel positions within the input image, and these pixel addresses are defined relative to a current pixel location within the image. The edge pair is applied independently to each pixel in the image, extracting pixels along the specified trajectories. For example, one edge vector may be defined to extend horizontally 32 pixels to the right of the current pixel, and another edge may be defined to extend vertically 32 pixels below the current pixel. CURL uses this edge pair definition to detect upper-left comers of boxes. CURL is not limited to linear edges only. A point-to-point Parallel Input Image {PijJ Distribute Edge _I Pairs e1iJ' e2ij Correlate Edge 3 Pairs Parallel Output Image ( sijJ Accumulate Runs 4 rm Apply Non-linear 5 Operator In lij = If(ri) i = I r. I f(r) = Ii"
            },
            "slug": "Correlated-Run-length-Algorithm-(CURL)-for-form-Garris",
            "title": {
                "fragments": [],
                "text": "Correlated Run length Algorithm (CURL) for detecting form structure within digitized documents."
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "An algorithm designed to detect intrinsic form structure within binary digitized documents has been developed and automatically locates and extracts line segments, line endings, and combinations of line intersections including corners, crosses, and T's from images."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143772136"
                        ],
                        "name": "O. Hori",
                        "slug": "O.-Hori",
                        "structuredName": {
                            "firstName": "Osamu",
                            "lastName": "Hori",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Hori"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48471936"
                        ],
                        "name": "D. Doermann",
                        "slug": "D.-Doermann",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Doermann",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Doermann"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "For example, the accuracy of conventional cell recognition by contour extraction [1, 2] is not sufficient for low-quality images because breaks in frame lines or the frame lines touching the characters make it impossible to detect contours."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2750254,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "92e74fde9c613dd22c193bb11d889d7a0428bced",
            "isKey": false,
            "numCitedBy": 69,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Table form document structure analysis is an important problem in the document processing domain. The paper presents a method called Box Driven Reasoning (BDR) to robustly analyze the structure of table form documents which include touching characters and broken lines. Most previous methods employ a line oriented approach. Real documents are copied repeatedly and overlaid with printed data, resulting in characters which touch cells and lines which are broken. BDR deals with regions directly, in contrast with other previous methods. Experimental tests show that BDR reliably recognizes cells and strings in document images with touching characters and broken lines."
            },
            "slug": "Robust-table-form-structure-analysis-based-on-Hori-Doermann",
            "title": {
                "fragments": [],
                "text": "Robust table-form structure analysis based on box-driven reasoning"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A method called Box Driven Reasoning (BDR) is presented to robustly analyze the structure of table form documents which include touching characters and broken lines."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2463997"
                        ],
                        "name": "Huizhu Luo",
                        "slug": "Huizhu-Luo",
                        "structuredName": {
                            "firstName": "Huizhu",
                            "lastName": "Luo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Huizhu Luo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3110392"
                        ],
                        "name": "R. Kasturi",
                        "slug": "R.-Kasturi",
                        "structuredName": {
                            "firstName": "Rangachar",
                            "lastName": "Kasturi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kasturi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27130718"
                        ],
                        "name": "J. F. Arias",
                        "slug": "J.-F.-Arias",
                        "structuredName": {
                            "firstName": "Juan",
                            "lastName": "Arias",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. F. Arias"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34817063"
                        ],
                        "name": "A. Chhabra",
                        "slug": "A.-Chhabra",
                        "structuredName": {
                            "firstName": "Atul",
                            "lastName": "Chhabra",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Chhabra"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Analyses [4, 5, 6] using frame-line intersections are more robust, if non-frame lines do not cross or do not touch the frame lines."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "The conventional method [4, 5, 6] defines nine types of corner patterns, which are four L-junction patterns, four T-junction patterns and one +-junction pattern."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 41187202,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "60c7c6125eea76a1072afb0c509c2ebee6eb5cce",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "The paper describes a method for interpretation of lines in distributing frame drawings of a telephone company. The lines are composed of hierarchical components: intersections, segments and line links. First, intersections are located. Segments of lines are then detected. Adjacent segments are finally linked into a line. A post processing step refines the lines. The line extraction and classification are insensitive to touching characters and broken lines. A number of experimental results using real drawings demonstrate good performance of the algorithms."
            },
            "slug": "Interpretation-of-lines-in-distributing-frame-Luo-Kasturi",
            "title": {
                "fragments": [],
                "text": "Interpretation of lines in distributing frame drawings"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "The paper describes a method for interpretation of lines in distributing frame drawings of a telephone company: intersections, segments and line links that are insensitive to touching characters and broken lines."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Fourth International Conference on Document Analysis and Recognition"
            },
            "year": 1997
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 4,
            "methodology": 2
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 4,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/A-recursive-analysis-for-form-cell-recognition-Shinjo-Hadano/948854ff92de3fc93fcfa061a0dd6a5046eb1266?sort=total-citations"
}