{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1792404"
                        ],
                        "name": "J. Elder",
                        "slug": "J.-Elder",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Elder",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Elder"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 181,
                                "start": 178
                            }
                        ],
                        "text": "Modelling the position of a tangent as a uniform distribution over the image domain, for an L L image, and r << L we can approximate the no-link likelihood for r as p(r) 4r L(2) [5]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 144,
                                "start": 141
                            }
                        ],
                        "text": "While interesting from a theoretical point of view, a large fraction of the edges in real images are not occlusion edges, and a recent study [5] suggests that it is not possible to locally distinguish occlusion edges from other types of edges."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 123
                            }
                        ],
                        "text": "Modelling image intensity i as a uniform distribution, 0 i 255, no-link likelihood functions for ih and il, can be derived [5]:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 115246720,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e9cadc9d34aeb257e2ac8d9861461d78761636c5",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of computing closed bounding contours from a visual image is addressed. The approach is motivated by the fact that many important image structures are heterogeneous and therefore cannot be segmented by traditional region-based methods based on homogeneity or smoothness constraints. Both psychophysical and computational aspects of the problem are studied. \nPsychophysical evidence is presented which shows that properties of bounding contour such as closure act as binding features for the segmentation of 2-D shapes, whereas texture (a region property) does not. These psychological results motivate an investigation of local and global issues in the computation of bounding contours for the purpose of figure/ground segmentation. \nNovel techniques for the local analysis of contour are presented which allow edges to be reliably detected and localized over a broad range of blur scale and contrast in images with shallow depth-of-field and shadows. Local estimates of contour blur are shown to be useful for computing depth segmentation from focal blur in complex images where the continuity assumptions required by existing Fourier techniques do not apply. \nIt is hypothesized that in order to integrate contours fragmented by occlusion and insufficient contrast, the human visual system exploits a measure of geometric contour closure. The results of psychophysical experiments show that a measure for closure based on $L\\sb2$ norm of contour gaps in psychophysically consistent. The existence of this measure is evidence for the computation of geometric closure by the human visual system. \nThese psychophysical findings motivate an algorithm for computing closed bounding contours as cycles of curve tangents. Tangent cycles extracted from a variety of real images are shown to correspond to the bounding contours of 2-D image structures, many of which are heterogeneous over their interior. Thus closure computations are seen to complement region-grouping methods by extending the class of structures which may be segmented to include heterogeneous image structures."
            },
            "slug": "The-visual-computation-of-bounding-contours-Zucker-Elder",
            "title": {
                "fragments": [],
                "text": "The visual computation of bounding contours"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Closure computations are seen to complement region-grouping methods by extending the class of structures which may be segmented to include heterogeneous image structures, many of which are heterogeneous over their interior."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2955375"
                        ],
                        "name": "L. Williams",
                        "slug": "L.-Williams",
                        "structuredName": {
                            "firstName": "Lance",
                            "lastName": "Williams",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Williams"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733922"
                        ],
                        "name": "A. Hanson",
                        "slug": "A.-Hanson",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Hanson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Hanson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 82
                            }
                        ],
                        "text": "4 The rim of a smooth solid can generate a self-intersecting contour in the image [26]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 116
                            }
                        ],
                        "text": "A separate branch of research investigates the grouping of occlusion edges into complete contours, ordered in depth [18,26]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 39,
                                "start": 27
                            }
                        ],
                        "text": "Unlike previous algorithms [11, 18, 26], no restrictions are placed on the type of structure bounded or its shape."
                    },
                    "intents": []
                }
            ],
            "corpusId": 2184756,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "dcd67688cb6a0e157e1aea132574cb7f8f5668bb",
            "isKey": false,
            "numCitedBy": 92,
            "numCiting": 115,
            "paperAbstract": {
                "fragments": [],
                "text": "Researchers in computer vision have primarily studied the problem of visual reconstruction of environmental structure that is plainly visible. In this paper, the conventional goals of visual reconstruction are generalized to include both visible and occluded forward facing surfaces. This larger fraction of the environment is termed the anterior surfaces. In this paper, we show that the boundaries of the anterior surfaces can be represented in viewer-centered coordinates as a labeled knot diagram. Where boundaries are not occluded and where surface reflectance is distinct from that of the background, boundaries will be marked by image contours. However, where boundaries are occluded, or where surface reflectance matches background reflectance, there will be no detectable luminance change in the image. Deducing the complete image trace of the boundaries of the anterior surfaces under these circumstances is termed the figural completion problem. The second half of this paper describes a computational theory of figural completion. A working model is demonstrated on a variety of illusory contour displays. The experimental system employs a two stage process of completion hypothesis and combinatorial optimization. The labeling scheme is enforced by integer linear inequalities so that the optimal feasible solution of an integer linear program defines a typologically valid surface organization.<<ETX>>"
            },
            "slug": "Perceptual-completion-of-occluded-surfaces-Williams-Hanson",
            "title": {
                "fragments": [],
                "text": "Perceptual completion of occluded surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that the boundaries of the anterior surfaces can be represented in viewer-centered coordinates as a labeled knot diagram where boundaries are not occluded and where surface reflectance is distinct from that of the background, boundaries will be marked by image contours."
            },
            "venue": {
                "fragments": [],
                "text": "1994 Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1792404"
                        ],
                        "name": "J. Elder",
                        "slug": "J.-Elder",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Elder",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Elder"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 116
                            }
                        ],
                        "text": "However, despite persuasive psychophysical demonstrations of the role of contour closure in perceptual organization [6, 7, 14, 15, 25], closure constraints for computer vision algorithms have been largely ignored (although see [1, 11])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 142,
                                "start": 124
                            }
                        ],
                        "text": "Motivated by growing evidence that the human visual system exploits contour closure for the purposes of perceptual grouping [6, 7, 14, 15, 25], we present an algorithm for computing highly closed bounding contours from images."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 588132,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0a3f70794d8156d99bf99fb974c31e4f3b0421b6",
            "isKey": false,
            "numCitedBy": 86,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-measure-of-closure-Elder-Zucker",
            "title": {
                "fragments": [],
                "text": "A measure of closure"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38336119"
                        ],
                        "name": "P. Parent",
                        "slug": "P.-Parent",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Parent",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Parent"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 193,
                                "start": 175
                            }
                        ],
                        "text": "Inspired in part by these studies, algorithms have been developed to apply continuity, cocircularity and smoothness constraints to organize local edges into extended contours [2,10,17,19,22,24]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 6779369,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8c21b3372894b25ed595a73ff058ec5876976ca6",
            "isKey": false,
            "numCitedBy": 567,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "An approach is described for curve inference that is based on curvature information. The inference procedure is divided into two stages: a trace inference stage, which is the subject of the present work, and a curve synthesis stage. It is shown that recovery of the trace of a curve requires estimating local models for the curve at the same time, and that tangent and curvature information are sufficient. These make it possible to specify powerful constraints between estimated tangents to a curve, in terms of a neighborhood relationship called cocircularity, and between curvature estimates, in terms of a curvature consistency relation. Because all curve information is quantized, special care must be taken to obtain accurate estimates of trace points, tangents, and curvatures. This issue is addressed specifically to the introduction of a smoothness constraint and a maximum curvature constraint. The procedure is applied to two types of images: artificial images designed to evaluate curvature and noise sensitivity, and natural images. >"
            },
            "slug": "Trace-Inference,-Curvature-Consistency,-and-Curve-Parent-Zucker",
            "title": {
                "fragments": [],
                "text": "Trace Inference, Curvature Consistency, and Curve Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is shown that recovery of the trace of a curve requires estimating local models for the curve at the same time, and that tangent and curvature information are sufficient, which make it possible to specify powerful constraints between estimated tangents to a curve."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1792404"
                        ],
                        "name": "J. Elder",
                        "slug": "J.-Elder",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Elder",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Elder"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 116
                            }
                        ],
                        "text": "However, despite persuasive psychophysical demonstrations of the role of contour closure in perceptual organization [6, 7, 14, 15, 25], closure constraints for computer vision algorithms have been largely ignored (although see [1, 11])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 142,
                                "start": 124
                            }
                        ],
                        "text": "Motivated by growing evidence that the human visual system exploits contour closure for the purposes of perceptual grouping [6, 7, 14, 15, 25], we present an algorithm for computing highly closed bounding contours from images."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8799772,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "6ad9f81dad46471f5be8a500599f8a5103303d2c",
            "isKey": false,
            "numCitedBy": 237,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-effect-of-contour-closure-on-the-rapid-of-Elder-Zucker",
            "title": {
                "fragments": [],
                "text": "The effect of contour closure on the rapid discrimination of two-dimensional shapes"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31338632"
                        ],
                        "name": "E. Riseman",
                        "slug": "E.-Riseman",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Riseman",
                            "middleNames": [
                                "M."
                            ],
                            "suffix": ""
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Riseman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1795076"
                        ],
                        "name": "M. Arbib",
                        "slug": "M.-Arbib",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Arbib",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Arbib"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62760738,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "8790362a783c217302b7b419e5c0554194962af1",
            "isKey": false,
            "numCitedBy": 128,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computational-Techniques-in-the-Visual-Segmentation-Riseman-Arbib",
            "title": {
                "fragments": [],
                "text": "Computational Techniques in the Visual Segmentation of Static Scenes."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39112482"
                        ],
                        "name": "T. D. Alter",
                        "slug": "T.-D.-Alter",
                        "structuredName": {
                            "firstName": "Tao",
                            "lastName": "Alter",
                            "middleNames": [
                                "Daniel"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. D. Alter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 336,
                                "start": 329
                            }
                        ],
                        "text": "Multi-scale smoothness criteria have been used to impose an organization on image curves [4,17,22], sequential methods for tracking contours within a Bayesian framework have recently been developed [2] and parallel methods for computing local \\saliency\" measures based on contour smoothness and total arclength have been studied [1, 24]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 234,
                                "start": 227
                            }
                        ],
                        "text": "However, despite persuasive psychophysical demonstrations of the role of contour closure in perceptual organization [6, 7, 14, 15, 25], closure constraints for computer vision algorithms have been largely ignored (although see [1, 11])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 57
                            }
                        ],
                        "text": "Most similar to our work is a very recent study by Alter [1] on the application of shortest-path algorithms to the computation of closed image contours."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 109875030,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "606284c5f42027f73d4ddf0e10a3243db8e1f021",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Man-made environments typically contain many objects with well-defined boundary edges, such as staplers, tables, and computers. These edges may determine the shapes of the objects and are invaluable in their identification. This thesis is about using such edge information for recognizing three-dimensional objects in images. In particular, we consider an approach that first identifies image features that are likely to come from a single object, and later uses these features to project similar model features into the image for verification. In light of this approach, we focus on two critical problems: identifying salient curves in images and the propagation of error from image features to projected model features. \nIn our study of saliency, we analyze one of the notable approaches to the problem, Shashua and Ullman's Saliency Network, and propose a new method based on shortest-paths algorithms. The new method is designed to overcome some of the most critical problems in the network. Using shortest-paths methods, we find the optimal curves in the image according to a measure that prefers contours that are long, smooth, and connected. \nFor the verification stage, we consider how to make the verification robust to locational errors in the image features. Error in the image features leads to uncertainty in the projected model features, which deters effective recognition. We show how error propagates when poses are based on three pairs of model and image points, for both Gaussian and bounded error in the detection of image points, and for both scaled-orthographic and perspective projection models. This result applies to objects that are fully three-dimensional, where past results considered only two-dimensional objects. In addition, we show how we can utilize linear programming to compute the propagated error region for any number of initial matches. Finally, we use these results to extend, from two-dimensional to three-dimensional objects, robust implementations of alignment, interpretation-tree search, and transformation clustering. (Copies available exclusively from MIT Libraries, Rm. 14-0551, Cambridge, MA 02139-4307. Ph. 617-253-5668; Fax 617-253-1690.)"
            },
            "slug": "The-role-of-saliency-and-error-propagation-in-Alter-Grimson",
            "title": {
                "fragments": [],
                "text": "The role of saliency and error propagation in visual object recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This thesis considers an approach that first identifies image features that are likely to come from a single object, and later uses these features to project similar model features into the image for verification, and proposes a new method based on shortest-paths algorithms."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768236"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Freeman",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 193,
                                "start": 175
                            }
                        ],
                        "text": "Inspired in part by these studies, algorithms have been developed to apply continuity, cocircularity and smoothness constraints to organize local edges into extended contours [2,10,17,19,22,24]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 118738049,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "84cfa3269521d77edc257246b8cf8cf7ec67873b",
            "isKey": false,
            "numCitedBy": 98,
            "numCiting": 119,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Two paradigms for visual analysis are top-down, starting from high-level models or information about the image, and bottom-up, where little is assumed about the image or objects in it. We explore a local, bottom-up approach to image analysis. We develop operators to identify and classify image junctions, which contain important visual cues for identifying occlusion, transparency, and surface bends. Like the human visual system, we begin with the application of linear filters which are oriented in all possible directions. We develop an efficient way to create an oriented filter of arbitrary orientation by describing it as a linear combination of basis filters. This approach to oriented filtering, which we call steerable filters, offers advantages for analysis as well as computation. We design a variety of steerable filters, including steerable quadrature pairs, which measure local energy. We show applications of these filters in orientation and texture analysis, and image representation and enhancement. We develop methods based on steerable filters to study structures such as contours and junctions. We describe how to post-filter the energy measures in order to more efficiently analyze structures with multiple orientations. We introduce a new detector for contours, based on energy local maxima. We analyze contour phases at energy local maxima, and compare the results with the prediction of a simple model. Using these tools, we analyze junctions. Based on local oriented filters, we develop simple mechanisms which respond selectively to T, L, and X junctions. The T and X junctions may indicate occlusion and transparency, respectively. These mechanism show that detectors for important, low-level visual cues can be built out of oriented filters and energy measures, which resemble responses found in the visual cortex. We present a second approach to junction detection based on salient contours."
            },
            "slug": "Steerable-filters-and-local-analysis-of-image-Freeman",
            "title": {
                "fragments": [],
                "text": "Steerable filters and local analysis of image structure"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A local, bottom-up approach to image analysis, which develops operators to identify and classify image junctions, which contain important visual cues for identifying occlusion, transparency, and surface bends and introduces a new detector for contours, based on energy local maxima."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1792404"
                        ],
                        "name": "J. Elder",
                        "slug": "J.-Elder",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Elder",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Elder"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 192,
                                "start": 189
                            }
                        ],
                        "text": "Edges are detected by a multi-scale method which automatically adapts estimation scale to the local signal strength and provides reliable estimates of edge position and tangent orientation [9]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2413248,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1311db1b88f731e4826d70705222b798331646ef",
            "isKey": false,
            "numCitedBy": 426,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "We show that knowledge of sensor properties and operator norms can be exploited to define a unique, locally computable minimum reliable scale for local estimation at each point in the image. This method for local scale control is applied to the problem of detecting and localizing edges in images with shallow depth of field and shadows. We show that edges spanning a broad range of blur scales and contrasts can be recovered accurately by a single system with no input parameters other than the second moment of the sensor noise. A natural dividend of this approach is a measure of the thickness of contours which can be used to estimate focal and penumbral blur. Local scale control is shown to be important for the estimation of blur in complex images, where the potential for interference between nearby edges of very different blur scale requires that estimates be made at the minimum reliable scale."
            },
            "slug": "Local-Scale-Control-for-Edge-Detection-and-Blur-Elder-Zucker",
            "title": {
                "fragments": [],
                "text": "Local Scale Control for Edge Detection and Blur Estimation"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Local scale control is shown to be important for the estimation of blur in complex images, where the potential for interference between nearby edges of very different blur scale requires that estimates be made at the minimum reliable scale."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1798721"
                        ],
                        "name": "G. Dudek",
                        "slug": "G.-Dudek",
                        "structuredName": {
                            "firstName": "Gregory",
                            "lastName": "Dudek",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Dudek"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727853"
                        ],
                        "name": "John K. Tsotsos",
                        "slug": "John-K.-Tsotsos",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsotsos",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John K. Tsotsos"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 89
                            }
                        ],
                        "text": "Multi-scale smoothness criteria have been used to impose an organization on image curves [4,17,22], sequential methods for tracking contours within a Bayesian framework have recently been developed [2] and parallel methods for computing local \\saliency\" measures based on contour smoothness and total arclength have been studied [1, 24]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 13907978,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "547acb9a35ae6c8f16210e2566bb48a2804f27f9",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors present a technique for both the smoothing and decomposition of planar curves. This technique, called curvature-tuned smoothing, provides for robust rotation- and translation-invariant smoothing of planar curves. As the smoothing is performed, parts are extracted robustly and at multiple scales. These parts can subsequently be used for object recognition. The parts extracted correspond to regions of roughly uniform curvature and constitute a rich description of the original data. This representation describes some regions at multiple scales, since multiple structures may occur.<<ETX>>"
            },
            "slug": "Recognizing-planar-curves-using-curvature-tuned-Dudek-Tsotsos",
            "title": {
                "fragments": [],
                "text": "Recognizing planar curves using curvature-tuned smoothing"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "This technique, called curvature-tuned smoothing, provides for robust rotation- and translation-invariant smoothing of planar curves and represents some regions at multiple scales, since multiple structures may occur."
            },
            "venue": {
                "fragments": [],
                "text": "[1990] Proceedings. 10th International Conference on Pattern Recognition"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3140335"
                        ],
                        "name": "A. Shashua",
                        "slug": "A.-Shashua",
                        "structuredName": {
                            "firstName": "Amnon",
                            "lastName": "Shashua",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Shashua"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 336,
                                "start": 329
                            }
                        ],
                        "text": "Multi-scale smoothness criteria have been used to impose an organization on image curves [4,17,22], sequential methods for tracking contours within a Bayesian framework have recently been developed [2] and parallel methods for computing local \\saliency\" measures based on contour smoothness and total arclength have been studied [1, 24]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 193,
                                "start": 175
                            }
                        ],
                        "text": "Inspired in part by these studies, algorithms have been developed to apply continuity, cocircularity and smoothness constraints to organize local edges into extended contours [2,10,17,19,22,24]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 38536052,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8437bb1a15eb2c2a09abbcae3cf6ae0210d26eae",
            "isKey": false,
            "numCitedBy": 661,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Certain salient structures in images attract our immediate attention without requiring a systematic scan. We present a method for computing saliency by a simple iterative scheme, using a uniform network of locally connected processing elements. The network uses an optimization approach to produce a ``saliency map,'''' a representation of the image emphasizing salient locations. The main properties of the network are: (i) the computations are simple and local, (ii) globally salient structures emerge with a small number of iterations, and (iii) as a by-product of the computations, contours are smoothed and gaps are filled in."
            },
            "slug": "Structural-Saliency:-The-Detection-Of-Globally-A-Shashua-Ullman",
            "title": {
                "fragments": [],
                "text": "Structural Saliency: The Detection Of Globally Salient Structures using A Locally Connected Network"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A method for computing saliency by a simple iterative scheme, using a uniform network of locally connected processing elements, to produce a ``saliency map,'''' a representation of the image emphasizing salient locations."
            },
            "venue": {
                "fragments": [],
                "text": "[1988 Proceedings] Second International Conference on Computer Vision"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1393626964"
                        ],
                        "name": "I. Kovács",
                        "slug": "I.-Kovács",
                        "structuredName": {
                            "firstName": "Ilona",
                            "lastName": "Kovács",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Kovács"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 189925,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "8f28efa8aefbe0ac8592199e1e9a530f3d7b1f2c",
            "isKey": false,
            "numCitedBy": 548,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Detection of fragmented closed contours against a cluttered background occurs much beyond the local coherence distance (maximal separation between segments) of nonclosed contours. This implies that the extent of interaction between locally connected detectors is boosted according to the global stimulus structure. We further show that detection of a target probe is facilitated when the probe is positioned inside a closed circle. To explain the striking contour segregation ability found here, and performance enhancement inside closed boundaries, we propose the existence of a synergetic process in early vision."
            },
            "slug": "A-closed-curve-is-much-more-than-an-incomplete-one:-Kovács-Julesz",
            "title": {
                "fragments": [],
                "text": "A closed curve is much more than an incomplete one: effect of closure in figure-ground segmentation."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The existence of a synergetic process in early vision is proposed, and the striking contour segregation ability found here, and performance enhancement inside closed boundaries are proposed."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the National Academy of Sciences of the United States of America"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1763321"
                        ],
                        "name": "E. Saund",
                        "slug": "E.-Saund",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Saund",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Saund"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 89
                            }
                        ],
                        "text": "Multi-scale smoothness criteria have been used to impose an organization on image curves [4,17,22], sequential methods for tracking contours within a Bayesian framework have recently been developed [2] and parallel methods for computing local \\saliency\" measures based on contour smoothness and total arclength have been studied [1, 24]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 193,
                                "start": 175
                            }
                        ],
                        "text": "Inspired in part by these studies, algorithms have been developed to apply continuity, cocircularity and smoothness constraints to organize local edges into extended contours [2,10,17,19,22,24]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 42642900,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "20bd0abf85a32f855db2f7b05ed63de33052d1cb",
            "isKey": false,
            "numCitedBy": 52,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "A symbolic approach to constructing a multiscale primitive shape description to 2-D binary (silhouette) shape images is presented. In contrast to contour or region smoothing techniques, grouping operations are performed over collections of tokens residing on a scale-space blackboard. Two types of grouping operations are identified that, respectively, aggregate edge primitives at one scale into edge primitives at a coarser scale and group edge primitives into partial-region assertions, including curved contours, primitive corners, and bars. Procedures to perform these computations are presented. >"
            },
            "slug": "Symbolic-Construction-of-a-2-D-Scale-Space-Image-Saund",
            "title": {
                "fragments": [],
                "text": "Symbolic Construction of a 2-D Scale-Space Image"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A symbolic approach to constructing a multiscale primitive shape description to 2-D binary (silhouette) shape images is presented, and two types of grouping operations are identified that aggregate edge primitives at one scale into edgePrimitives at a coarser scale and group edge Primitives into partial-region assertions."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9175683"
                        ],
                        "name": "Michael L. Baird",
                        "slug": "Michael-L.-Baird",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Baird",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael L. Baird"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 116,
                                "start": 112
                            }
                        ],
                        "text": "The extended tangent algorithm is conceptually simpler than most methods for computing polygonal approximations [20], and does not require preprocessing of the edge map to link local edges into ordered lists, as is required for most other methods (e."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 14939484,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "39d8df286932d5a328a462db25d634ee3c872669",
            "isKey": false,
            "numCitedBy": 285,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "recognition. Classic applications are illustrated such as Shaw's picture description language (1969) applied to bubble chamber photographs, and Ledley's chromosome grammar ( 1965). The student with no particular interest in pattern recognition, who nevertheless desires to grasp a quick overview of what formal language theory is all about, could read this chapter. A minimum of preliminary definitions and notation must be waded through before learning about-types of grammars (regular, context-free, context-sensitive), equivalency of grammars, syntaxdirected translations, and deterministic, nondeterministic, and stochastic systems. Higher dimensional grammars are treated in Chapter Three, i.e., those allowing more complex primitive description and interconnection capabilities. Tree, web, plex, and shape grammars are each described with accompanying examples which make the material very easy to absorb. Chapter Four, on recognition and translation of syntactic structures, presents that integral part of formal language theory known as automata theory. The one-to-one correspondences between types of string grammars and automata are presented here, namely finite automation/regular grammar, push-down automaton/context-free grammar, linear-bounded automaton/ context-sensitive grammar, and Turing machine/unrestricted grammar. Quite properly, the authors restrict their attention to the finite and push-down automata used to accept or reject input strings and to automata for tree recognition, since these are the models thus far proved to be most useful for syntactic pattern recognition tasks. Chapter Five introduces stocastic grammars, languages, and recognizers. The material is well covered and brings the reader up to date (1978). As the authors mention, the impact of this theory on syntactic pattern processing has not been thoroughly realized, and references are cited for one interested in pursuing the topic further. The final chapter deals with grammatical inference and exemplifies the principalideas underlying the problem of obtaining a pattern grammar from a set of samples. Again, the material in this chapter is presented in a logical and easy to understand format. By this time the reader is beginning to understand the limitations of the linguistic aspect of syntactic pattern recognition (Reviewer's opinion), and will draw his or her attention to some of the material which came out of this work in the late sixties, which can be described as structural pattern recognition, and which is the topic of the book review which follows."
            },
            "slug": "Structural-Pattern-Recognition-Baird",
            "title": {
                "fragments": [],
                "text": "Structural Pattern Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The authors restrict their attention to the finite and push-down automata used to accept or reject input strings and to automata for tree recognition, since these are the models thus far proved to be most useful for syntactic pattern recognition tasks."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1795076"
                        ],
                        "name": "M. Arbib",
                        "slug": "M.-Arbib",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Arbib",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Arbib"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733922"
                        ],
                        "name": "A. Hanson",
                        "slug": "A.-Hanson",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Hanson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Hanson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 142831177,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b59d71a16effbe9590f3908d9678a35a9d977175",
            "isKey": false,
            "numCitedBy": 162,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Vision,-brain,-and-cooperative-computation-Arbib-Hanson",
            "title": {
                "fragments": [],
                "text": "Vision, brain, and cooperative computation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2502152"
                        ],
                        "name": "A. Treisman",
                        "slug": "A.-Treisman",
                        "structuredName": {
                            "firstName": "Anne",
                            "lastName": "Treisman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Treisman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "13939021"
                        ],
                        "name": "S. Gormican",
                        "slug": "S.-Gormican",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Gormican",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Gormican"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 116
                            }
                        ],
                        "text": "However, despite persuasive psychophysical demonstrations of the role of contour closure in perceptual organization [6, 7, 14, 15, 25], closure constraints for computer vision algorithms have been largely ignored (although see [1, 11])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 142,
                                "start": 124
                            }
                        ],
                        "text": "Motivated by growing evidence that the human visual system exploits contour closure for the purposes of perceptual grouping [6, 7, 14, 15, 25], we present an algorithm for computing highly closed bounding contours from images."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14197500,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "74257ff0d6645ab73650fdc9faaf8fe1a6a430b5",
            "isKey": false,
            "numCitedBy": 2300,
            "numCiting": 160,
            "paperAbstract": {
                "fragments": [],
                "text": "In this article we review some new evidence relating to early visual processing and propose an explanatory framework. A series of search experiments tested detection of targets distinguished from the distractors by differences on a single dimension. Our aim was to use the pattern of search latencies to infer which features are coded automatically in early vision. For each of 12 different dimensions, one or more pairs of contrasting stimuli were tested. Each member of a pair played the role of target in one condition and the role of distractor in the other condition. Many pairs gave rise to a marked asymmetry in search latencies, such that one stimulus in the pair was detected either through parallel processing or with small increases in latency as display size increased, whereas the other gave search functions that increased much more steeply. Targets denned by larger values on the quantitative dimensions of length, number, and contrast, by line curvature, by misaligned orientation, and by values that deviated from a standard or prototypical color or shape were detected easily, whereas targets defined by smaller values on the quantitative dimensions, by straightness, by frame-aligned orientation, and by prototypical colors or shapes required slow and apparently serial search. These values appear to be coded by default, as the absence of the contrasting values. We found no feature of line arrangements that allowed automatic, preattentive detection; nor did connectedness or containment—the two examples of topological features that we tested. We interpret the results as evidence that focused attention to single items or to groups is required to reduce background activity when the Weber fraction distinguishing the pooled feature activity with displays containing a target and with displays containing only distractors is too small to allow reliable discrimination."
            },
            "slug": "Feature-analysis-in-early-vision:-evidence-from-Treisman-Gormican",
            "title": {
                "fragments": [],
                "text": "Feature analysis in early vision: evidence from search asymmetries."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The results of a series of search experiments are interpreted as evidence that focused attention to single items or to groups is required to reduce background activity when the Weber fraction distinguishing the pooled feature activity with displayscontaining a target and with displays containing only distractors is too small to allow reliable discrimination."
            },
            "venue": {
                "fragments": [],
                "text": "Psychological review"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102920774"
                        ],
                        "name": "M. D. Carmo",
                        "slug": "M.-D.-Carmo",
                        "structuredName": {
                            "firstName": "Manfredo",
                            "lastName": "Carmo",
                            "middleNames": [
                                "P.",
                                "do"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. D. Carmo"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 35089975,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c3eb42dccf5f00e84c7087ed0e31f62bbc5b63f1",
            "isKey": false,
            "numCitedBy": 2273,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Curves: Parametrized Curves. 2. Regular Surfaces: Regular Surfaces Inverse Images of Regular Values. 3. Geometry of the Gauss Map: Definition of the Gauss Map and Its Fundamental Properties. 4. Intrinsic Geometry of Surfaces: Isometrics Conformal Maps. 5. Global Differential Geometry: Rigidity of the Sphere."
            },
            "slug": "Differential-geometry-of-curves-and-surfaces-Carmo",
            "title": {
                "fragments": [],
                "text": "Differential geometry of curves and surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This paper presents a meta-geometry of Surfaces: Isometrics Conformal Maps, which describes how the model derived from the Gauss Map changed over time to reflect the role of curvature in the model construction."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745921"
                        ],
                        "name": "R. Sedgewick",
                        "slug": "R.-Sedgewick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Sedgewick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Sedgewick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 167,
                                "start": 163
                            }
                        ],
                        "text": "Thus computing the maximum likelihood cycle for each tangent is a shortest-path problem, and can be solved using standard techniques, such as Dijkstra's algorithm [23], allowing the maximum likelihood cycles for all tangents to be computed in O(n(2) logn) operations, where n is the number of tangents in the image."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 21
                            }
                        ],
                        "text": "Dijkstra's algorithm [23]) to solve this problem in low-order polynomial time."
                    },
                    "intents": []
                }
            ],
            "corpusId": 10976311,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "89fd00d296b38acdf92730f4ca9cd698360c08f1",
            "isKey": false,
            "numCitedBy": 1074,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Algorithms in C is a comprehensive repository of algorithms, complete with code. If you're in a pinch and need to code something up fast, this book is the place to look. Starting with basic data structures, Algorithms in C covers an enormous scope of information, with extensive treatment of searching and advanced data structures, sorting, string processing, computational geometry, graph problems, and mathematical algorithms. Although the manual often neglects to provide rigorous analysis, the text surrounding the algorithms provides clear and relevant insight into why the algorithms work."
            },
            "slug": "Algorithms-in-C-Sedgewick",
            "title": {
                "fragments": [],
                "text": "Algorithms in C"
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "Algorithms in C is a comprehensive repository of algorithms, complete with code, with extensive treatment of searching and advanced data structures, sorting, string processing, computational geometry, graph problems, and mathematical algorithms."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144042261"
                        ],
                        "name": "Mark Nitzberg",
                        "slug": "Mark-Nitzberg",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Nitzberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mark Nitzberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2082087031"
                        ],
                        "name": "David Mumford",
                        "slug": "David-Mumford",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mumford",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David Mumford"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2071277858"
                        ],
                        "name": "Takahiro Shiota",
                        "slug": "Takahiro-Shiota",
                        "structuredName": {
                            "firstName": "Takahiro",
                            "lastName": "Shiota",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Takahiro Shiota"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 116
                            }
                        ],
                        "text": "A separate branch of research investigates the grouping of occlusion edges into complete contours, ordered in depth [18,26]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 39,
                                "start": 27
                            }
                        ],
                        "text": "Unlike previous algorithms [11, 18, 26], no restrictions are placed on the type of structure bounded or its shape."
                    },
                    "intents": []
                }
            ],
            "corpusId": 19955526,
            "fieldsOfStudy": [
                "Geology",
                "Medicine"
            ],
            "id": "ce9c4a8c292b59894a359ad485371b95a6d02d67",
            "isKey": false,
            "numCitedBy": 361,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Overview.- Filtering for occlusion detection.- Finding contours and junctions.- Continuations.- Finding the 2.1D sketch.- Conclusion."
            },
            "slug": "Filtering,-Segmentation-and-Depth-Nitzberg-Mumford",
            "title": {
                "fragments": [],
                "text": "Filtering, Segmentation and Depth"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "The 2.1D sketch was found by filtering for occlusion detection and finding contours and junctions and finding the 2.2D sketch by following the dotted line pattern."
            },
            "venue": {
                "fragments": [],
                "text": "Lecture Notes in Computer Science"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 165,
                                "start": 153
                            }
                        ],
                        "text": "Studies of perceptual organization have demonstrated that the human visual system exploits a range of regularities in image structure to solve this task [12, 14, 28]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 60763871,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "722711676eceb57fd928ee551618d9e8143c30d1",
            "isKey": false,
            "numCitedBy": 21,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-diversity-of-perceptual-grouping-Zucker",
            "title": {
                "fragments": [],
                "text": "The diversity of perceptual grouping"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34734622"
                        ],
                        "name": "D. Jacobs",
                        "slug": "D.-Jacobs",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Jacobs",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Jacobs"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 31,
                                "start": 27
                            }
                        ],
                        "text": "Unlike previous algorithms [11], this closure algorithm does not impose hard constraints on the shape of the image structures to be recovered."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 11,
                                "start": 7
                            }
                        ],
                        "text": "Jacobs [11] has studied the problem of inferring highly-closed convex cycles of line segments from an image, to be used as input for a part-based object recognition strategy."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 234,
                                "start": 227
                            }
                        ],
                        "text": "However, despite persuasive psychophysical demonstrations of the role of contour closure in perceptual organization [6, 7, 14, 15, 25], closure constraints for computer vision algorithms have been largely ignored (although see [1, 11])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 39,
                                "start": 27
                            }
                        ],
                        "text": "Unlike previous algorithms [11, 18, 26], no restrictions are placed on the type of structure bounded or its shape."
                    },
                    "intents": []
                }
            ],
            "corpusId": 3896100,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "7f6e8c1ea5d1b292beaaea17dbdd63f03b32a6e0",
            "isKey": true,
            "numCitedBy": 6,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Finding-Salient-Convex-Groups-Jacobs",
            "title": {
                "fragments": [],
                "text": "Finding Salient Convex Groups"
            },
            "venue": {
                "fragments": [],
                "text": "Partitioning Data Sets"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716933"
                        ],
                        "name": "I. Cox",
                        "slug": "I.-Cox",
                        "structuredName": {
                            "firstName": "Ingemar",
                            "lastName": "Cox",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Cox"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1708912"
                        ],
                        "name": "Pierre Hansen",
                        "slug": "Pierre-Hansen",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Hansen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Pierre Hansen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 126234864,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0bab45e6839d12815f03dcfec4c3e40601df14b1",
            "isKey": false,
            "numCitedBy": 34,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Partitioning-Data-Sets-Cox-Hansen",
            "title": {
                "fragments": [],
                "text": "Partitioning Data Sets"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Deformable templates Active Vision"
            },
            "venue": {
                "fragments": [],
                "text": "Deformable templates Active Vision"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 116
                            }
                        ],
                        "text": "However, despite persuasive psychophysical demonstrations of the role of contour closure in perceptual organization [6, 7, 14, 15, 25], closure constraints for computer vision algorithms have been largely ignored (although see [1, 11])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 142,
                                "start": 124
                            }
                        ],
                        "text": "Motivated by growing evidence that the human visual system exploits contour closure for the purposes of perceptual grouping [6, 7, 14, 15, 25], we present an algorithm for computing highly closed bounding contours from images."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A closed curve is much more than an incomplete one: E ect of closure in gure-ground discrimination"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Natl. Acad. Sci. USA,"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Principles of Gestalt Psychology. Harcourt, Brace & World"
            },
            "venue": {
                "fragments": [],
                "text": "Principles of Gestalt Psychology. Harcourt, Brace & World"
            },
            "year": 1935
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 165,
                                "start": 153
                            }
                        ],
                        "text": "Studies of perceptual organization have demonstrated that the human visual system exploits a range of regularities in image structure to solve this task [12, 14, 28]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Organization in Vision"
            },
            "venue": {
                "fragments": [],
                "text": "Praeger, New York,"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Zucker . Boundaries , textures and the perceptual binding offragmented gures"
            },
            "venue": {
                "fragments": [],
                "text": "European Conf . on Visual Perception"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A closed curve is much more than an incomplete one: EEect of closure in gure-ground discrimination"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Natl. Acad. Sci. USA, 90:7495{7497"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 49
                            }
                        ],
                        "text": "Interestingly, recent psychophysical experiments [8] suggest that contour grouping cues such as closure may be more important than regional texture cues for the perceptual organization of 2-D form (Fig."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 62,
                                "start": 59
                            }
                        ],
                        "text": "This may explain in part the recent psychophysical results [8] suggesting a stronger role for boundary cues than regional cues in the perceptual organization of form (Fig."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Boundaries, textures and the perceptual binding of fragmented gures"
            },
            "venue": {
                "fragments": [],
                "text": "In European Conf. on Visual Perception. Tubingen,"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Zucker . Boundaries , textures and the perceptual binding of fragmented gures"
            },
            "venue": {
                "fragments": [],
                "text": "European Conf . on Visual Perception"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 116
                            }
                        ],
                        "text": "However, despite persuasive psychophysical demonstrations of the role of contour closure in perceptual organization [6, 7, 14, 15, 25], closure constraints for computer vision algorithms have been largely ignored (although see [1, 11])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 165,
                                "start": 153
                            }
                        ],
                        "text": "Studies of perceptual organization have demonstrated that the human visual system exploits a range of regularities in image structure to solve this task [12, 14, 28]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 142,
                                "start": 124
                            }
                        ],
                        "text": "Motivated by growing evidence that the human visual system exploits contour closure for the purposes of perceptual grouping [6, 7, 14, 15, 25], we present an algorithm for computing highly closed bounding contours from images."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "ka. Principles of Gestalt Psychology"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1935
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Filtering, segmentation and depth. Lecture Notes in Computer Science"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Di erential Geometry of Curves and Surfaces"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "This article was processed using the L A T E X macro package with ECCV'96 style"
            },
            "venue": {
                "fragments": [],
                "text": "This article was processed using the L A T E X macro package with ECCV'96 style"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Diierential Geometry of Curves and Surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "Diierential Geometry of Curves and Surfaces"
            },
            "year": 1976
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 13,
            "methodology": 9,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 35,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Computing-Contour-Closure-Elder-Zucker/018a317f615c51e060ab3dc330e282eed917c8d5?sort=total-citations"
}