{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32733837"
                        ],
                        "name": "H. Wilson",
                        "slug": "H.-Wilson",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Wilson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1573287,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "b45c9da1e49cce9f37976d9187f85fb217d8d092",
            "isKey": false,
            "numCitedBy": 751,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-four-mechanism-model-for-threshold-spatial-vision-Wilson-Bergen",
            "title": {
                "fragments": [],
                "text": "A four mechanism model for threshold spatial vision"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1402983557"
                        ],
                        "name": "B. O'Brien",
                        "slug": "B.-O'Brien",
                        "structuredName": {
                            "firstName": "Brendan",
                            "lastName": "O'Brien",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. O'Brien"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35323891,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "51283fffb12df5b5472cead75b145d0308798cd8",
            "isKey": false,
            "numCitedBy": 113,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "The relation of the structure of the retina to factors influencing visual acuity is examined in some detail. Dimensions of the foveal cones have been redetermined in a series of measurements on histological materials from several sources. In no case has center to center distance between the most central cones in adult human eyes been found less than 2.0μ nor greater than 2.3μ, these being values for the living eye, due allowance being made for shrinkage of the preparations. Photomicrographs of the central foveal mosaic are shown to illustrate the rapid increase in center to center distance between cones a short distance from the small central fovea. These results are in general agreement with those of Polyak. This cone mosaic is in good accord with the observed effect on resolution acuity of the particular location of the image within the fovea. The central cones are of such size that the optical system of the eye at optimum pupil concentrates approximately three-quarters of the energy of a star image into a circle containing three cones, but some additional optical mechanism must exist in the retina to prevent loss of this image quality by spread of rays after the focus, but within the retinal depth represented by the length of the cones. Optical processes occurring within the cones are considered in detail. It is shown that not only is the Stiles and Crawford effect explained quantitatively by these processes, but also that the spread of rays beyond the focus is prevented, so that the retinal mosaic can behave as though the light receptors were concentrated in the focal plane. This same process also makes possible greatly increased light absorption per unit weight of cone pigment. The structure of the retina is thus consistent, numerically, with resolution acuity at high illumination but does not account for observed changes in acuity as retinal illumination is reduced. Ballistic stimulation of 10 microsecond duration eliminates effect of eye movements and serves to test both the Hecht theory of change of acuity with luminance, and the alternate hypothesis that very few quanta are absorbed per cone at threshold, statistical variation in this number accounting for the acuity change. The result of these experiments indicates that neither theory can be accepted."
            },
            "slug": "Vision-and-resolution-in-the-central-retina.-O'Brien",
            "title": {
                "fragments": [],
                "text": "Vision and resolution in the central retina."
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The structure of the retina is consistent, numerically, with resolution acuity at high illumination but does not account for observed changes in acuity as retinal illumination is reduced."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1951
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32733837"
                        ],
                        "name": "H. Wilson",
                        "slug": "H.-Wilson",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Wilson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2499348"
                        ],
                        "name": "J. Cowan",
                        "slug": "J.-Cowan",
                        "structuredName": {
                            "firstName": "Jack",
                            "lastName": "Cowan",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Cowan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42543399,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "87b9b227a7c701ceb17874ed44461e32fc77d675",
            "isKey": false,
            "numCitedBy": 59,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "It is now generally accepted that several mechanisms mediate contrast detection at threshold. Many attempts to measure the bandwidths of these mechanisms using subthreshold summation have yielded estimates suggesting very narrow frequency tuning. We have measured thresholds for three classes of stimuli: gratings containing two sinusoidal components, sums of \"difference of Gaussian\" (DOG) patterns, and square waves. The results of the subthreshold summation experiments with gratings are consistent with those of other studies. All of these thresholds can be predicted by a model requiring only four center-surround-type mechanisms at each retinal locus. These mechanisms have a full bandwidth at a half-height of about 1.75 octaves. Quantitative prediction of sensitivities depends critically upon spatial probability summation. It is this spatial nonlinearity that yields these somewhat conterintuitive results. The much narrower bandwidths inferred by others are due to the assumption of linearity used in their analyses."
            },
            "slug": "Further-evidence-for-four-mechanisms-mediating-at-Bergen-Wilson",
            "title": {
                "fragments": [],
                "text": "Further evidence for four mechanisms mediating vision at threshold: sensitivities to complex gratings and aperiodic stimuli."
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This work has measured thresholds for three classes of stimuli: gratings containing two sinusoidal components, sums of \"difference of Gaussian\" (DOG) patterns, and square waves, and predicted by a model requiring only four center-surround-type mechanisms at each retinal locus."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 38715307,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bd32c8c89e52f5b4142b848d9b4dae2ececc2892",
            "isKey": false,
            "numCitedBy": 123,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Under appropriate conditions zero-crossings of a bandpass signal are very rich in information. The authors examine here the relevance of this result to the early stages of visual information processing, where zero-crossings in the output of independent spatial-frequency-tuned channels may contain sufficient information for much of the subsequent processing."
            },
            "slug": "Bandpass-channels,-zero-crossings,-and-early-visual-Marr-Ullman",
            "title": {
                "fragments": [],
                "text": "Bandpass channels, zero-crossings, and early visual information processing."
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "Under appropriate conditions zero-crossings of a bandpass signal are very rich in information and may contain sufficient information for much of the subsequent processing in the early stages of visual information processing."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13140630,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d1d186fe8eae26824a380f70454be04d6a756bef",
            "isKey": false,
            "numCitedBy": 896,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper is concerned with the relationship between orientation columns, ocular‐dominance columns, the topographic mapping of visual fields onto cortex, and receptive‐field size and scatter. Although the orientation columns are an order of magnitude smaller than the ocular‐dominance columns, the horizontal distance corresponding to a complete cycle of orientation columns, representing a rotation through 180°, seems to be roughly the same size as a left‐plus‐right ocular dominance set, with a thickness of about 0.5–1 mm, independent of eccentricity at least out to 15°. We use the term hypercolumn to refer to a complete set of either type (180°, or left‐plus‐right eyes)."
            },
            "slug": "Uniformity-of-monkey-striate-cortex:-A-parallel-and-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Uniformity of monkey striate cortex: A parallel relationship between field size, scatter, and magnification factor"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "The term hypercolumn is used to refer to a complete set of either type (180°, or left‐plus‐right eyes), with implications for the topographic mapping of visual fields onto cortex, and receptive‐field size and scatter."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3422501"
                        ],
                        "name": "G. Westheimer",
                        "slug": "G.-Westheimer",
                        "structuredName": {
                            "firstName": "Gerald",
                            "lastName": "Westheimer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Westheimer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34548589,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "86e13f46bfd8721db2353b43e2dc4b807bc004fe",
            "isKey": false,
            "numCitedBy": 69,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "&NA; The implications of the diffraction theory of light are examined as they relate to visual acuity and hyperacuity. Two incoherent point sources of light give rise to a double‐peaked light distribution whose trough is 26% below the adjoining peaks when the sources are separated by the Rayleigh limit of resolution, but the dip has vanished when the separation is 80% of the Rayleigh limit. Diffraction theory, however, places no restriction on the precision with which any single source can be localized. No paradox is therefore involved in having a point‐spread function with half‐width one minute of arc and, at the same time, a localization threshold of a few seconds of arc, although the need for a sophisticated processing mechanism to achieve such low hyperacuity thresholds is emphasized."
            },
            "slug": "Diffraction-Theory-and-Visual-Hyperacuity*-Westheimer",
            "title": {
                "fragments": [],
                "text": "Diffraction Theory and Visual Hyperacuity*"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "No paradox is involved in having a point‐spread function with half‐width one minute of arc and, at the same time, a localization threshold of a few seconds of arc, although the need for a sophisticated processing mechanism to achieve such low hyperacuity thresholds is emphasized."
            },
            "venue": {
                "fragments": [],
                "text": "American journal of optometry and physiological optics"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4138381"
                        ],
                        "name": "G. Poggio",
                        "slug": "G.-Poggio",
                        "structuredName": {
                            "firstName": "Gian",
                            "lastName": "Poggio",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Poggio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2054056395"
                        ],
                        "name": "B. Fischer",
                        "slug": "B.-Fischer",
                        "structuredName": {
                            "firstName": "Beth",
                            "lastName": "Fischer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Fischer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11546860,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "68637ae468286d4070b54213fb72c44a0a78d625",
            "isKey": false,
            "numCitedBy": 765,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "2. Impulse activity was recorded from neurons in fovea1 striate (A17) and prestriate (Al@ cortex of monkeys trained to fixate monocularly and binocularly by rewarding them for detecting an abrupt change in the intensity of a small luminous spot. During periods of fixation, single bright or dark narrow bars moving across a frontoparallel plane were presented at a series of different depths. 2. Nearly all cortical neurons studied received input from both eyes. Binocular neurons were classifiedLint two categories on the basis of their monocular responses: those that gave similar responses to stimulation of right and left eye (ocular balance) and those that gave different responses (ocular unbalance). Different kinds of binocular interactions were observed. 3. Most neurons (84%) were sensitive to location of the stimulus in depth. Four types of depth-sensitive cells were recognized: a) tuned excitatory neurons, the most common type, that gave excitatory responses over a narrow range of depth about the fixation distance often with inhibitory flanks nearer and farther, and that typically received a balanced binocular input; b) tuned inhibitory neurons whose responses were largely suppressed by stimuli at or close to the plane of fixation; c) near neurons, which responded well to stimuli in front of the fixation plane and were suppressed by those behind it; d) far neurons, the opposite of near neurons. The last three types of depth cells were usually ocularly unbalanced. Peaks and steps of depthsensitivity profiles occurred at or close to the fixation distance (within t 0.4O of disparity), whereas the total range of binocular interaction, even for a single cell, could extend to more than t lo of disparity. 4. The results suggest that there are cells in fovea1 striate and prestriate which may be part of"
            },
            "slug": "Binocular-interaction-and-depth-sensitivity-in-and-Poggio-Fischer",
            "title": {
                "fragments": [],
                "text": "Binocular interaction and depth sensitivity in striate and prestriate cortex of behaving rhesus monkey."
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "The results suggest that there are cells in fovea1 striate and prestriate which may be part of the cortex of monkeys trained to fixate monocularly and binocularly by rewarding them for detecting an abrupt change in the intensity of a small luminous spot."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "118988170"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "Dale",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120306234,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ab46fdac0a3b484cd58978ba71dc71631b49f70a",
            "isKey": false,
            "numCitedBy": 989,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm is proposed for solving the stereoscopic matching problem. The algorithm consists of five steps: (1) Each image is filtered at different orientations with bar masks of four sizes that increase with eccentricity; the equivalent filters are one or two octaves wide. (2) Zero-crossings in the filtered images, which roughly correspond to edges, are localized. Positions of the ends of lines and edges are also found. (3) For each mask orientation and size, matching takes place between pairs of zero-crossings or terminations of the same sign in the two images, for a range of disparities up to about the width of the mask’s central region. (4) Wide masks can control vergence movements, thus causing small masks to come into correspondence. (5) When a correspondence is achieved, it is stored in a dynamic buffer, called the 2½-D sketch. It is shown that this proposal provides a theoretical framework for most existing psychophysical and neurophysiological data about stereopsis. Several critical experimental predictions are also made, for instance about the size of Panum’s area under various conditions. The results of such experiments would tell us whether, for example, co-operativity is necessary for the matching process."
            },
            "slug": "A-computational-theory-of-human-stereo-vision-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "A computational theory of human stereo vision"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1821772"
                        ],
                        "name": "A. Snyder",
                        "slug": "A.-Snyder",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Snyder",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Snyder"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144205451"
                        ],
                        "name": "W. H. Miller",
                        "slug": "W.-H.-Miller",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Miller",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. H. Miller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36558049,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "41104e659e0147b1c52294884b9e0ac8f77c8a26",
            "isKey": false,
            "numCitedBy": 195,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The maximum center-to-center angular spacing delta phi of photoreceptors tolerated for reconstructing the highest spatial frequency passed by a diffraction-limited pupil of diameter D is delta phi - lambda/D square root 3 when the photoreceptors are packed in a hexagonal array, where lambda is the wavelength in vacuum. This spacing gives the maximum signal-to-photon noise ratio when the inner segments touch. The mean luminance required for an eye to achieve its highest resolving power is independent of eye size, provided the retina is designed to sample the highest spatial frequency passed by the diffraction-limited optics."
            },
            "slug": "Photoreceptor-diameter-and-spacing-for-highest-Snyder-Miller",
            "title": {
                "fragments": [],
                "text": "Photoreceptor diameter and spacing for highest resolving power."
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The maximum center-to-center angular spacing delta phi of photoreceptors tolerated for reconstructing the highest spatial frequency passed by a diffraction-limited pupil of diameter D is delta phI - lambda/D square root 3 when the photoreCEPTors are packed in a hexagonal array, where lambda is the wavelength in vacuum."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32733837"
                        ],
                        "name": "H. Wilson",
                        "slug": "H.-Wilson",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Wilson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "51925280"
                        ],
                        "name": "Stephen C. Giese",
                        "slug": "Stephen-C.-Giese",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Giese",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Stephen C. Giese"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34051727,
            "fieldsOfStudy": [
                "Physics",
                "Environmental Science"
            ],
            "id": "4af0b5b557b4067a22a9c4c59fdf7bf0ff938eae",
            "isKey": false,
            "numCitedBy": 139,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Threshold-visibility-of-frequency-gradient-patterns-Wilson-Giese",
            "title": {
                "fragments": [],
                "text": "Threshold visibility of frequency gradient patterns"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3422501"
                        ],
                        "name": "G. Westheimer",
                        "slug": "G.-Westheimer",
                        "structuredName": {
                            "firstName": "Gerald",
                            "lastName": "Westheimer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Westheimer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 8053693,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "c2632a27cf2b4b534778644409d41b6cc634e64c",
            "isKey": false,
            "numCitedBy": 50,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Resolution (visual acuity) and differential spatial localization (hyperacuity) targets were selected to allow rigorous psychophysical measurements as well as ready expression of both their spatial frequency spectrum and their retinal image light distribution. Thresholds were about 1 arc min for acuity and 4-6 arc sec for hyperacuity. As is consistent with the reciprocal relationship between the space and spatial frequency domains, the small locally restricted spatial differences between just distinguishable patterns are represented in the frequency domain by equally small differences, which are distributed over the entire spatial frequency spectrum. While they occur in many test situations, phase variations of spatial frequency components are not necessary for achieving optimum acuity and hyperacuity."
            },
            "slug": "Spatial-frequency-and-light-spread-descriptions-of-Westheimer",
            "title": {
                "fragments": [],
                "text": "Spatial frequency and light-spread descriptions of visual acuity and hyperacuity."
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Resolution (visual acuity) and differential spatial localization (hyperacuity) targets were selected to allow rigorous psychophysical measurements as well as ready expression of both their spatial frequency spectrum and their retinal image light distribution."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16172422"
                        ],
                        "name": "R. Gubisch",
                        "slug": "R.-Gubisch",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Gubisch",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gubisch"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1600873,
            "fieldsOfStudy": [
                "Physics",
                "Medicine"
            ],
            "id": "db1cd81e2c54a0de7dc85519ac47aa0932fcbde7",
            "isKey": false,
            "numCitedBy": 853,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Optical quality of the eye was measured at eight pupil sizes between 1·5 and 6·6 mm diameter by recording the faint light emerging from the eye; this light was reflected from the bright image of a thin line on the fundus."
            },
            "slug": "Optical-quality-of-the-human-eye-Campbell-Gubisch",
            "title": {
                "fragments": [],
                "text": "Optical quality of the human eye"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "Optical quality of the eye was measured at eight pupil sizes between 1·5 and 6·6 mm diameter by recording the faint light emerging from the eye; this light was reflected from the bright image of a thin line on the fundus."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 228358,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ddc2ea63fa69eca4aa44a4fd135543d67badcb23",
            "isKey": false,
            "numCitedBy": 3039,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies."
            },
            "slug": "Application-of-fourier-analysis-to-the-visibility-Campbell-Robson",
            "title": {
                "fragments": [],
                "text": "Application of fourier analysis to the visibility of gratings"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies and the results show clear patterns of uniformity in the response to grating noise."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1993085645"
                        ],
                        "name": "P. Schiller",
                        "slug": "P.-Schiller",
                        "structuredName": {
                            "firstName": "P",
                            "lastName": "Schiller",
                            "middleNames": [
                                "H"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Schiller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33760699"
                        ],
                        "name": "B. Finlay",
                        "slug": "B.-Finlay",
                        "structuredName": {
                            "firstName": "Barbara",
                            "lastName": "Finlay",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Finlay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6849044"
                        ],
                        "name": "S. Volman",
                        "slug": "S.-Volman",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Volman",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Volman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14270911,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "09b4ba65735f8e1ae2b2bf71dec784911f9f67bc",
            "isKey": false,
            "numCitedBy": 229,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The response properties of single cells in monkey striate cortex were examined using moving bars, square-wave gratings, and sine-wave gratings. 2. The moving of cells studied were not selective for bar width or for the spatial frequency of square-wave gratings. 3. Most cells responded selectively to the spatial frequency of the sine-wave gratings. 4. The spatial frequency of the sine-wave grating eliciting the optimal response could not be predicted from the organization of the receptive field of each cell as determined by stationary or moving stimuli. 5. The sharpness of spatial-frequency selectivity is only slightly more pronounced in S-type cells than in CX-type cells. 6. S-type and CX-type cells differ significantly in the temporal modulation of their discharges to gratings. S-type cells discharge in sharp bursts to each cycle which traverses the receptive field. CX-type cells discharge in a rather continuous fashion. This measure can be used reliably to classify cells as S or CS type."
            },
            "slug": "Quantitative-studies-of-single-cell-properties-in-Schiller-Finlay",
            "title": {
                "fragments": [],
                "text": "Quantitative studies of single-cell properties in monkey striate cortex. III. Spatial frequency."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The spatial frequency of the sine-wave grating eliciting the optimal response could not be predicted from the organization of the receptive field of each cell as determined by stationary or moving stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16675221"
                        ],
                        "name": "K. J. Craik",
                        "slug": "K.-J.-Craik",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Craik",
                            "middleNames": [
                                "J.",
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. J. Craik"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143153225,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "fd7fb972568487545e27279d89968a5163b11386",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "THE-EFFECT-OF-ADAPTATION-UPON-VISUAL-ACUITY-Craik",
            "title": {
                "fragments": [],
                "text": "THE EFFECT OF ADAPTATION UPON VISUAL ACUITY"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1939
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4113648"
                        ],
                        "name": "F. Crick",
                        "slug": "F.-Crick",
                        "structuredName": {
                            "firstName": "Francis",
                            "lastName": "Crick",
                            "middleNames": [
                                "H.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Crick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60667221,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a35cb763da6077d40fa9e1331ef2533c98cf6f1b",
            "isKey": false,
            "numCitedBy": 98,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-Information-Processing-Approach-to-Understanding-Crick-Marr",
            "title": {
                "fragments": [],
                "text": "An Information Processing Approach to Understanding the Visual Cortex"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4846633"
                        ],
                        "name": "H. Wässle",
                        "slug": "H.-Wässle",
                        "structuredName": {
                            "firstName": "Heinz",
                            "lastName": "Wässle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wässle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6877136"
                        ],
                        "name": "O. Creutzfeldt",
                        "slug": "O.-Creutzfeldt",
                        "structuredName": {
                            "firstName": "Otto",
                            "lastName": "Creutzfeldt",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Creutzfeldt"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 29860933,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d550daea0d484c86c1d0c91ad6a014ec4c8db04d",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Spatial-resolution-in-visual-system:-a-theoretical-Wässle-Creutzfeldt",
            "title": {
                "fragments": [],
                "text": "Spatial resolution in visual system: a theoretical and experimental study on single units in the cat's lateral geniculate body."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30297475,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "0b69dc1d56f80c02478a76925cda39a233126783",
            "isKey": false,
            "numCitedBy": 161,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Reconstructing-the-visual-image-in-space-and-time-Barlow",
            "title": {
                "fragments": [],
                "text": "Reconstructing the visual image in space and time"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1979
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 19,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Smallest-channel-in-early-human-vision.-Marr-Poggio/e736f8c5c2008aa8c3733ffacc75fc906b9925dc?sort=total-citations"
}