{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2668183"
                        ],
                        "name": "G. Buchsbaum",
                        "slug": "G.-Buchsbaum",
                        "structuredName": {
                            "firstName": "Gershon",
                            "lastName": "Buchsbaum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Buchsbaum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2059821759"
                        ],
                        "name": "J. L. Goldstein",
                        "slug": "J.-L.-Goldstein",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Goldstein",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. L. Goldstein"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 20722632,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "4f289cc88939c4f72cc755ec8f7455ee5a5312d9",
            "isKey": false,
            "numCitedBy": 12,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "A statistical approach to account for psychophysical phenomena in human colour vision is presented. The central visual processor is viewed as an optimum recognizer of stochastic patterns supplied by the periphery. The processor makes an optimum estimate of the spectral parameters of the stimulus, given the wavelength filter characteristics of the periphery, the stochastic nature of the information and an internal template to which the external stimulus is matched. The estimate is constrained in ways inferred from empirical phenomena. Subjective brightness of monochromatic stimuli and related constant brightness manifolds in the colour space constitute the constraint for brightness estimation. Results analogous and in accord with those of earlier line element theories are obtained. The Bezold-Brücke hue shift constitutes the basic constraint for hue estimation. The hue estimate involves interrelation between the fields in the experiment. Similarities and differences both in basic conceptions and results introduced by the template matching notions are discussed."
            },
            "slug": "Optimum-probabilistic-processing-in-colour-II.-as-Buchsbaum-Goldstein",
            "title": {
                "fragments": [],
                "text": "Optimum probabilistic processing in colour perception. II. Colour vision as template matching"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A statistical approach to account for psychophysical phenomena in human colour vision is presented and similarities and differences both in basic conceptions and results introduced by the template matching notions are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145523037"
                        ],
                        "name": "D. Jameson",
                        "slug": "D.-Jameson",
                        "structuredName": {
                            "firstName": "Dorothea",
                            "lastName": "Jameson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Jameson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4264042"
                        ],
                        "name": "L. Hurvich",
                        "slug": "L.-Hurvich",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Hurvich",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Hurvich"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122623432,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "066612e70d7b2733cd0be38a9d5747ef35795bc9",
            "isKey": false,
            "numCitedBy": 364,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Saturation discrimination is assumed to be dependent on the ratio of chromatic to achromatic components in the sensory response to a given wavelength. The usual methods of measurement do not, however, permit independent control of the chromatic and achromatic variables. On the basis of an opponent-colors theory of vision, a method is described for measuring directly and separately the spectral distributions of the chromatic components. A series of experiments is reported in which this method was used to obtain measures of the paired chromatic responses associated with the four primary spectral hues. Results are reported for two observers, 1° foveal test field, for an equal brightness spectrum (10 mL), and a neutral state of adaptation (10 mL). The measured chromatic responses, together with achromatic (luminosity) functions measured earlier for the same observers, are used to predict the form of the spectral saturation discrimination function."
            },
            "slug": "Some-Quantitative-Aspects-of-an-Opponent-Colors-I.-Jameson-Hurvich",
            "title": {
                "fragments": [],
                "text": "Some Quantitative Aspects of an Opponent-Colors Theory. I. Chromatic Responses and Spectral Saturation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1955
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8493495"
                        ],
                        "name": "J. Werner",
                        "slug": "J.-Werner",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Werner",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Werner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5234266"
                        ],
                        "name": "B. Wooten",
                        "slug": "B.-Wooten",
                        "structuredName": {
                            "firstName": "Billy",
                            "lastName": "Wooten",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Wooten"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38667566,
            "fieldsOfStudy": [
                "Mathematics",
                "Medicine"
            ],
            "id": "3ecd35b513155beda2dde8d7651d05743a6dacd5",
            "isKey": false,
            "numCitedBy": 186,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "Opponent chromatic response functions were determined from monochromatic, equal-luminance stimuli from 400 to 700 nm for three observers using a hue cancellation procedure. The same observers scaled the hue of the stimuli using the terms red, green, yellow, and blue. The results showed that the hue scaling was accurately predicted from the cancellation functions using the model of Hurvich and Jameson. Theoretical curves were generated to fit the chromatic response functions with a linear combination of three cone photopigments. The theoretical photopigments were based on an idopsin nomogram with lambdamax at a = 435, beta = 530, and lambda = 562 nm. An estimate of the density of each observer's preretinal optic media was obtained in order to relate the photopigment absorption spectra to the psychophysical data. Good linear fits were obtained for each observer's red-green curve, but not for the yellow-blue curves. A nonlinear model with an expansive exponent was used to fit the yellow-blue response functions with the three theoretical photopigments."
            },
            "slug": "Opponent-chromatic-mechanisms:-relation-to-and-hue-Werner-Wooten",
            "title": {
                "fragments": [],
                "text": "Opponent chromatic mechanisms: relation to photopigments and hue naming."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The results showed that the hue scaling was accurately predicted from the cancellation functions using the model of Hurvich and Jameson, and good linear fits were obtained for each observer's red-green curve, but not for the yellow-blue curves."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6844692"
                        ],
                        "name": "R. Massof",
                        "slug": "R.-Massof",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Massof",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Massof"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102499355"
                        ],
                        "name": "J. F. Bird",
                        "slug": "J.-F.-Bird",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Bird",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. F. Bird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24101116,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "cb49a02cd79a7a40912104e985f06a0ba2b5f342",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "A general theory of color and brightness vision, developed from basic principles of the Helmholtz and Hering points-of-view on color vision is presented in a general mathematical form suitable for quantitative analysis. Visual sensation is described by a vector expressed in terms of Hering-like elements for color and brightness which underlie in their spatial-temporal variations the perceptions of form and change. The photic stimulus of vision is recognized to act first and only through photoabsorption producing a Helmholtz-like vector of quantum absorptions. The physiological transformation of the Helmholtz photochemical excitations into the Hering sensation responses is represented as a vector of general operators. The result is a mathematical framework encompassing traditional psychophysical and sensory scaling experiments. The theory is utilized to demonstrate that for many traditional (Class A) psychophysical observations, the physiological operator reduces to a linear (matrix) transformation. For static, uniform, focal stimulation, this reduction is seen to be the basis for earlier specific linear models of color vision. We also illustrate that static intensity-level effects (Bezold-Brücke hue shifts, unique hue invariance) can be modeled from the theory by power, but not logarithmic, intensity-level dependence for the sensation elements."
            },
            "slug": "A-general-zone-theory-of-color-and-brightness-I.-Massof-Bird",
            "title": {
                "fragments": [],
                "text": "A general zone theory of color and brightness vision. I. Basic formulation."
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "A general theory of color and brightness vision, developed from basic principles of the Helmholtz and Hering points-of-view on color vision is presented in a general mathematical form suitable for quantitative analysis to demonstrate that for many traditional psychophysical observations, the physiological operator reduces to a linear (matrix) transformation."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31537929"
                        ],
                        "name": "J. J. Vos",
                        "slug": "J.-J.-Vos",
                        "structuredName": {
                            "firstName": "Johannes",
                            "lastName": "Vos",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. J. Vos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3463629"
                        ],
                        "name": "P. Walraven",
                        "slug": "P.-Walraven",
                        "structuredName": {
                            "firstName": "Pieter",
                            "lastName": "Walraven",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Walraven"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36462810,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "bf7e998a231d0202f045a9ee7d9d27a267e0f08e",
            "isKey": false,
            "numCitedBy": 62,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-analytical-description-of-the-line-element-in-of-Vos-Walraven",
            "title": {
                "fragments": [],
                "text": "An analytical description of the line element in the zone-fluctuation model of colour vision. I. Basic concepts."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2668183"
                        ],
                        "name": "G. Buchsbaum",
                        "slug": "G.-Buchsbaum",
                        "structuredName": {
                            "firstName": "Gershon",
                            "lastName": "Buchsbaum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Buchsbaum"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 31080184,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "61684f2f01d10cd4e63c2e11e595fb6ef589c8bb",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 102,
            "paperAbstract": {
                "fragments": [],
                "text": "A comprehensive discussion on the human retina and its color-mechanism topography as a two-dimensional photodetector array being the first phase of the human visual sensory processor is presented. The treatment is a logical deduction from optimum statistical detection theory and its application to biological sensory systems. The evolution of color vision and of the application of statistical communications theory to sensory systems and the issues common to both that merge them into a unified research thrust in vision are briefly reviewed. The basic problems of retinal topography and available data are surveyed in detail to provide the constraints for the model. The model performance is confronted with actual visual performance data, particularly threshold and discrimination data. It is concluded that the theory of statistical communications and associated techniques of signal detectability, combined with the existing empirical findings provide a most powerful means to investigate sensory communication. As argued in earlier researches of sensory communications based on the same approach, a different new concept is defined for the sensory system and the various issues raised in the problem formulation."
            },
            "slug": "The-retina-as-a-two-dimensional-detector-array-in-Buchsbaum",
            "title": {
                "fragments": [],
                "text": "The retina as a two-dimensional detector array in the context of color vision theories and signal detection theory"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2668183"
                        ],
                        "name": "G. Buchsbaum",
                        "slug": "G.-Buchsbaum",
                        "structuredName": {
                            "firstName": "Gershon",
                            "lastName": "Buchsbaum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Buchsbaum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2059821759"
                        ],
                        "name": "J. L. Goldstein",
                        "slug": "J.-L.-Goldstein",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Goldstein",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. L. Goldstein"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 19423424,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cd966eb5eb84fd0543aa6abea9601f1a9694de79",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "A comprehensive account of wavelength discrimination and colour saturation discrimination is given in terms of optimum probabilistic signal detection. The theory is a logical deduction from statistical estimation theory of the visual estimate of the spectral parameters of the stimulus. In place of geometrical concepts associated with colour-space geometry, stimulus discriminability is determined by optimum decision rules given by likelihood ratio tests on statistics that are postulated for the trichromatic responses. The classical line element theory and its formulations are deduced to be discriminability measures between signals. The different mathematical forms of classical theory are shown to correspond to different statistical constraints."
            },
            "slug": "Optimum-probabilistic-processing-in-colour-I.-Buchsbaum-Goldstein",
            "title": {
                "fragments": [],
                "text": "Optimum probabilistic processing in colour perception. I. Colour discrimination"
            },
            "tldr": {
                "abstractSimilarityScore": 84,
                "text": "A comprehensive account of wavelength discrimination and colour saturation discrimination is given in terms of optimum probabilistic signal detection in classical line element theory and its formulations."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764008"
                        ],
                        "name": "S. L. Guth",
                        "slug": "S.-L.-Guth",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Guth",
                            "middleNames": [
                                "Lee"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. L. Guth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6844692"
                        ],
                        "name": "R. Massof",
                        "slug": "R.-Massof",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Massof",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Massof"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "119239965"
                        ],
                        "name": "T. Benzschawel",
                        "slug": "T.-Benzschawel",
                        "structuredName": {
                            "firstName": "Terry",
                            "lastName": "Benzschawel",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Benzschawel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40474386,
            "fieldsOfStudy": [
                "Biology",
                "Physics"
            ],
            "id": "63ba5c99c30beb56fb4f4e01252f8783d0879cdc",
            "isKey": false,
            "numCitedBy": 238,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "The inclusion of cone mechanisms in a slightly revised version of an earlier model allows accounts of phenomena that involve receptor effects as well as dichromatic color vision. Intensity-dependent parameters that stimulate the adaptation of receptors and opponent and nonopponent mechanisms are varied to predict a wide range of data for both normals and dichromats, including: (i) color matching; (ii) the approximate apparent hue and saturation of the spectrum; (iii) foveal spectral sensitivities obtained by flicker photometry and by detection in the dark and under conditions of achromatic or chromatic adaptation; (iv) heterochromatic additivity failures in the dark-adapted and chromatically adapted eye; (v) approximate differences between brightness and luminance; and, (vi) color and wavelength discrimination under varying adaptation conditions."
            },
            "slug": "Vector-model-for-normal-and-dichromatic-color-Guth-Massof",
            "title": {
                "fragments": [],
                "text": "Vector model for normal and dichromatic color vision."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Intensity-dependent parameters that stimulate the adaptation of receptors and opponent and nonopponent mechanisms are varied to predict a wide range of data for both normals and dichromats."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8493495"
                        ],
                        "name": "J. Werner",
                        "slug": "J.-Werner",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Werner",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Werner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145141062"
                        ],
                        "name": "J. Walraven",
                        "slug": "J.-Walraven",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Walraven",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Walraven"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 11762896,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "e1a4de3e7dd72e9c3a101d22397ae51becd6a14b",
            "isKey": false,
            "numCitedBy": 105,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Effect-of-chromatic-adaptation-on-the-achromatic-of-Werner-Walraven",
            "title": {
                "fragments": [],
                "text": "Effect of chromatic adaptation on the achromatic locus: The role of contrast, luminance and background color"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37367206,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "9a54172f15b835ace455bff6d2d3811d23d3e8fd",
            "isKey": false,
            "numCitedBy": 241,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "What-causes-trichromacy-A-theoretical-analysis-Barlow",
            "title": {
                "fragments": [],
                "text": "What causes trichromacy? A theoretical analysis using comb-filtered spectra"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2810762"
                        ],
                        "name": "V. Smith",
                        "slug": "V.-Smith",
                        "structuredName": {
                            "firstName": "Vivianne",
                            "lastName": "Smith",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Smith"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46438571"
                        ],
                        "name": "J. Pokorny",
                        "slug": "J.-Pokorny",
                        "structuredName": {
                            "firstName": "Joel",
                            "lastName": "Pokorny",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pokorny"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41916794,
            "fieldsOfStudy": [
                "Chemistry"
            ],
            "id": "50d0aea6b7c5e4d4faad3d39ce27e96d64a84044",
            "isKey": false,
            "numCitedBy": 1272,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Spectral-sensitivity-of-the-foveal-cone-between-400-Smith-Pokorny",
            "title": {
                "fragments": [],
                "text": "Spectral sensitivity of the foveal cone photopigments between 400 and 500 nm"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3613355"
                        ],
                        "name": "F. de Monasterio",
                        "slug": "F.-de-Monasterio",
                        "structuredName": {
                            "firstName": "Francisco",
                            "lastName": "de Monasterio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. de Monasterio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6190348"
                        ],
                        "name": "P. Gouras",
                        "slug": "P.-Gouras",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Gouras",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Gouras"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 23100796,
            "fieldsOfStudy": [
                "Biology",
                "Medicine"
            ],
            "id": "5ba21830d6c2807ea1daa39f8bad96133d86a3c7",
            "isKey": false,
            "numCitedBy": 602,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Three general classes of cells were identified in a sample of 460 cells recorded from all areas of the retina subserving the central 40 degrees of vision in the rhesus monkey. 2. One class (colour‐opponent) had sustained colour‐opponent responses and concentrically organized receptive fields, in which usually one cone mechanism mediated the centre response and one or two different cone mechanisms mediated the antagonistic surround. A few cells of this class had non‐concentric (co‐extensive) receptive field organization. 3. A second class (broad‐band) had transient responses and concentrically organized receptive fields, in which usually two cone mechanisms mediated the centre response. In most cells, the surround had the same spectral sensitivity as the centre and the cells had non‐colour opponent responses. In other cells, the surround had a spectral sensitivity different to that of the centre and the cells had colour‐opponent responses. 4. The third class (non‐concentric) did not have concentrically organized receptive fields. One group of cells had extremely phasic on‐, off‐ or on‐off responses and no spontaneous activity, another group had characteristically regular spontaneous activity and was responsive only to moving stimuli. 5. Cells of the colour‐opponent class with concentric receptive fields had the smallest centre‐sizes, which did not vary markedly from cell to cell (mean 15 mum); cells of the non‐concentric class with phasic responses had the largest centre‐sizes, which varied from cell to cell. 6. Colour‐opponent cells comprised the highest proportion of cells near the foveola; broad‐band cells comprised the highest proportion in the more peripheral areas of the retina; non‐concentric cells were equally represented in all areas."
            },
            "slug": "Functional-properties-of-ganglion-cells-of-the-Monasterio-Gouras",
            "title": {
                "fragments": [],
                "text": "Functional properties of ganglion cells of the rhesus monkey retina."
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "Three general classes of cells were identified in a sample of 460 cells recorded from all areas of the retina subserving the central 40 degrees of vision in the rhesus monkey, and colour‐opponent, broad‐band and non‐concentric cells were equally represented in all areas."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152536829"
                        ],
                        "name": "G. Mitarai",
                        "slug": "G.-Mitarai",
                        "structuredName": {
                            "firstName": "Genyo",
                            "lastName": "Mitarai",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Mitarai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105671574"
                        ],
                        "name": "T. Goto",
                        "slug": "T.-Goto",
                        "structuredName": {
                            "firstName": "Takuo",
                            "lastName": "Goto",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Goto"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "83454580"
                        ],
                        "name": "S. Takagi",
                        "slug": "S.-Takagi",
                        "structuredName": {
                            "firstName": "Sadaharu",
                            "lastName": "Takagi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Takagi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37596908,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e1ef9abf4ed7a4ba5d825cd767b8bb72a3094078",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Seven color-opponent bipolar and 50 color-opponent amacrine cells were identified in the carp retina and their spectral responses examined by using procion-dye-filled micropipets for staining and recording. Four of the bipolar cells had a +R-G-and three a +Y-B-type chromatic center. Six of the bipolar cells showed hyperpolarizing non-color-opponent surrounds, while one +R-G-type cell had a +Y-RB-type surround. This cell showed the greatest complexity of all bipolar cells identified so far, and its spectral property strongly suggests the existence of an intimate relation between it and +Y-RB-type horizontal cells. Examination and classification of the 50 amacrine cells revealed that 17 belonged to the +R-G, 16 to the -R+G, 6 to the +Y-B, and 11 to the -Y + B type. Most of these cells showed non-color-opponent surrounds. Yet, the similarity of the chromatic arrangement of their centers with that of the ganglion cells shows that the four basic types of color channels are already in existence in the amacrine cells where they seem to originate."
            },
            "slug": "Receptive-field-arrangement-of-color-opponent-and-Mitarai-Goto",
            "title": {
                "fragments": [],
                "text": "Receptive field arrangement of color-opponent bipolar and amacrine cells in the carp retina."
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "The similarity of the chromatic arrangement of their centers with that of the ganglion cells shows that the four basic types of color channels are already in existence in the amacrine cells where they seem to originate."
            },
            "venue": {
                "fragments": [],
                "text": "Sensory processes"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31537929"
                        ],
                        "name": "J. J. Vos",
                        "slug": "J.-J.-Vos",
                        "structuredName": {
                            "firstName": "Johannes",
                            "lastName": "Vos",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. J. Vos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3463629"
                        ],
                        "name": "P. Walraven",
                        "slug": "P.-Walraven",
                        "structuredName": {
                            "firstName": "Pieter",
                            "lastName": "Walraven",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Walraven"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36421425,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7c8babc9439deedee3dff6781e1db7c9e012edd0",
            "isKey": false,
            "numCitedBy": 303,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-the-derivation-of-the-foveal-receptor-primaries.-Vos-Walraven",
            "title": {
                "fragments": [],
                "text": "On the derivation of the foveal receptor primaries."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38718061,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "709e9e78094d3f077c2c9156bb3792bbb2dd9f3a",
            "isKey": false,
            "numCitedBy": 238,
            "numCiting": 121,
            "paperAbstract": {
                "fragments": [],
                "text": "The main factors limiting the performance of the peripheral parts of the visual system can be specified, and doing this clarifies the nature of the interpretive tasks that must be performed by the central parts of the system. It is argued that the critical factor that hinders development of better resolving power is the difficulty of confining light within the waveguide-like outer segment, and that for sensitivity this critical factor is the thermal decomposition of photosensitive pigments. Knowledge of these limits makes many surprising details of the eye intelligible. Understanding the difficulties posed by the narrow dynamic range of nerve fibres may give similar insight into the coding of the retinal image for transmission to the brain. Our level of understanding changes when we come to the visual cortex, for although we do not lack good anatomical and neurophysiological data, these do not make the principles of operation self-evident in the way that the structure of the eye immediately suggests that it is an image-forming device. The cortex converts the representation of the visual field that it receives into reliable knowledge of the world around us, and the trouble may be that we lack good models of how this can be done. A system that can respond to single quanta and resolve almost to the diffraction limit is unlikely to employ grossly inefficient methods for those higher functions upon which its whole utility depends, and so it is worth seeking out the limiting factors. The quality of human performance at certain higher perceptual tasks is high compared with the limit of reliable statistical inference; hence much of the sample of information available in a visual image must be effectively utilized. But there are strong limitations on the connectivity in the cortex, so that one is forced to consider how the relevant information can be collected together. Three stages of dealing with the visual image are proposed: the improvement of the cortical map in primary visual cortex by processes analogous to spatial and temporal interpolation ; the detection of linking features in this map; and the concentration of this information by non-topographical mapping in adjacent visual areas."
            },
            "slug": "The-Ferrier-lecture,-1980-Barlow",
            "title": {
                "fragments": [],
                "text": "The Ferrier lecture, 1980"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Three stages of dealing with the visual image are proposed: the improvement of the cortical map in primary visual cortex by processes analogous to spatial and temporal interpolation ; the detection of linking features in this map; and the concentration of this information by non-topographical mapping in adjacent visual areas."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6098610"
                        ],
                        "name": "C. R. Ingling",
                        "slug": "C.-R.-Ingling",
                        "structuredName": {
                            "firstName": "Carl",
                            "lastName": "Ingling",
                            "middleNames": [
                                "R."
                            ],
                            "suffix": "Jr"
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. R. Ingling"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38584275,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "40a370a044dd14ffd1df351631325e36d7d73f86",
            "isKey": false,
            "numCitedBy": 116,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-spectral-sensitivity-of-the-opponent-color-Ingling",
            "title": {
                "fragments": [],
                "text": "The spectral sensitivity of the opponent-color channels"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4264042"
                        ],
                        "name": "L. Hurvich",
                        "slug": "L.-Hurvich",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Hurvich",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Hurvich"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145523037"
                        ],
                        "name": "D. Jameson",
                        "slug": "D.-Jameson",
                        "structuredName": {
                            "firstName": "Dorothea",
                            "lastName": "Jameson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Jameson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10892969,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "95bcdde60453336af7357fa1869e139ad7dfb848",
            "isKey": false,
            "numCitedBy": 361,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "A quantitative model for an opponent-colors theory of vision is presented that is based on the CIE color mixture data for the standard observer. The model is used to account for spectral brightness, saturation, and hue and some of their associated psychophysical functions in both normal and dichromatic vision. Special attention is given to an account of the Bezold-Brucke hue shift, and to changes in saturation and wavelength discrimination with changes in stimulus luminance."
            },
            "slug": "Some-quantitative-aspects-of-an-opponent-colors-II.-Hurvich-Jameson",
            "title": {
                "fragments": [],
                "text": "Some quantitative aspects of an opponent-colors theory. II. Brightness, saturation, and hue in normal and dichromatic vision."
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "A quantitative model for an opponent-colors theory of vision is presented that is based on the CIE color mixture data for the standard observer to account for spectral brightness, saturation, and hue and some of their associated psychophysical functions in both normal and dichromatic vision."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1955
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145339648"
                        ],
                        "name": "M. Srinivasan",
                        "slug": "M.-Srinivasan",
                        "structuredName": {
                            "firstName": "Mandyam",
                            "lastName": "Srinivasan",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Srinivasan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2161090"
                        ],
                        "name": "S. Laughlin",
                        "slug": "S.-Laughlin",
                        "structuredName": {
                            "firstName": "Simon",
                            "lastName": "Laughlin",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Laughlin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32531540"
                        ],
                        "name": "A. Dubs",
                        "slug": "A.-Dubs",
                        "structuredName": {
                            "firstName": "Andreas",
                            "lastName": "Dubs",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Dubs"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24698209,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a95311474d799499fbb50b4b7e765a9af99791d9",
            "isKey": false,
            "numCitedBy": 975,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "Interneurons exhibiting centre-surround antagonism within their receptive fields are commonly found in peripheral visual pathways. We propose that this organization enables the visual system to encode spatial detail in a manner that minimizes the deleterious effects of intrinsic noise, by exploiting the spatial correlation that exists within natural scenes. The antagonistic surround takes a weighted mean of the signals in neighbouring receptors to generate a statistical prediction of the signal at the centre. The predicted value is subtracted from the actual centre signal, thus minimizing the range of outputs transmitted by the centre. In this way the entire dynamic range of the interneuron can be devoted to encoding a small range of intensities, thus rendering fine detail detectable against intrinsic noise injected at later stages in processing. This predictive encoding scheme also reduces spatial redundancy, thereby enabling the array of interneurons to transmit a larger number of distinguishable images, taking into account the expected structure of the visual world. The profile of the required inhibitory field is derived from statistical estimation theory. This profile depends strongly upon the signal: noise ratio and weakly upon the extent of lateral spatial correlation. The receptive fields that are quantitatively predicted by the theory resemble those of X-type retinal ganglion cells and show that the inhibitory surround should become weaker and more diffuse at low intensities. The latter property is unequivocally demonstrated in the first-order interneurons of the fly’s compound eye. The theory is extended to the time domain to account for the phasic responses of fly interneurons. These comparisons suggest that, in the early stages of processing, the visual system is concerned primarily with coding the visual image to protect against subsequent intrinsic noise, rather than with reconstructing the scene or extracting specific features from it. The treatment emphasizes that a neuron’s dynamic range should be matched to both its receptive field and the statistical properties of the visual pattern expected within this field. Finally, the analysis is synthetic because it is an extension of the background suppression hypothesis (Barlow & Levick 1976), satisfies the redundancy reduction hypothesis (Barlow 1961 a, b) and is equivalent to deblurring under certain conditions (Ratliff 1965)."
            },
            "slug": "Predictive-coding:-a-fresh-view-of-inhibition-in-Srinivasan-Laughlin",
            "title": {
                "fragments": [],
                "text": "Predictive coding: a fresh view of inhibition in the retina"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Comparisons suggest that, in the early stages of processing, the visual system is concerned primarily with coding the visual image to protect against subsequent intrinsic noise, rather than with reconstructing the scene or extracting specific features from it."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6098610"
                        ],
                        "name": "C. R. Ingling",
                        "slug": "C.-R.-Ingling",
                        "structuredName": {
                            "firstName": "Carl",
                            "lastName": "Ingling",
                            "middleNames": [
                                "R."
                            ],
                            "suffix": "Jr"
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. R. Ingling"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145163793"
                        ],
                        "name": "B. Tsou",
                        "slug": "B.-Tsou",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Tsou",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Tsou"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 12015825,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "714232c999258ec5e97b7ab73f79a59d0bd428be",
            "isKey": false,
            "numCitedBy": 229,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Orthogonal-combination-of-the-three-visual-channels-Ingling-Tsou",
            "title": {
                "fragments": [],
                "text": "Orthogonal combination of the three visual channels"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145309959"
                        ],
                        "name": "W. Stiles",
                        "slug": "W.-Stiles",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Stiles",
                            "middleNames": [
                                "Stanley"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Stiles"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120684590,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "ce0bfd4c3c42d93a52b5e83b172fb7e9fcdac5ab",
            "isKey": false,
            "numCitedBy": 157,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Helmholtz, Schrodinger and others have considered the relation between the trichromatic coordinates, x, y, z and x + δx y + δy, z + δz, of two juxtaposed light patches which can just be discriminated by the eye. The Helmholtz expression, (δx/(a + x))2 + (δy/(b + y))2 + (δz/(c + z))2 = const. = δs2 is the most readily interpretable in terms of the trichromatic theory, but to explain the observed variation of the hue limen through the spectrum it demands double-peak fundamental response curves which are at variance with other evidence. It also leads to a step-by-step visibility curve of wrong shape. The difficulties mentioned are removed by introducing different constant factors in the three terms. Such a modification is indicated independently by recent measurements of the liminal brightness increment, from which appropriate values of the factors have been derived. The factor in each term is simply related to the limiting Fechner fraction of the corresponding trichromatic mechanism, i.e., the Fechner fraction ΔB/B which would be observed at sufficiently high brightnesses B if visual discrimination depended on that mechanism only. The modified expression for δs2 is applied to the calculation of hue limens, the step-by-step visibility curve, the Fechner fraction curves, and the general colour limen at different points of the colour triangle. Certain main features of the experimental results are correctly reproduced, but discrepancies with Wright and MacAdam's measurements of general colour limens may indicate that the modified element ignores some factor which is operative in their experiments."
            },
            "slug": "A-modified-Helmholtz-line-element-in-space-Stiles",
            "title": {
                "fragments": [],
                "text": "A modified Helmholtz line-element in brightness-colour space"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1946
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 210471473,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "61ff9b7fd04a31b5d8755bdd29bbb89415163cee",
            "isKey": false,
            "numCitedBy": 322,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "The main factors limiting the performance of the peripheral parts of the visual system can be specified, and doing this clarifies the nature of the interpretive tasks that must be performed by the central parts of the system. It is argued that the critical factor that hinders development of better resolving power is the difficulty of confining light within the waveguide-like outer segment, and that for sensitivity this critical factor is the thermal decomposition of photosensitive pigments. Knowledge of these limits makes many surprising details of the eye intelligible. Understanding the difficulties posed by the narrow dynamic range of nerve fibres may give similar insight into the coding of the retinal image for transmission to the brain. Our level of understanding changes when we come to the visual cortex, for although we do not lack good anatomical and neurophysiological data, these do not make the principles of operation self-evident in the way that the structure of the eye immediately suggests that it is an image-forming device. The cortex converts the representation of the visual field that it receives into reliable knowledge of the world around us, and the trouble may be that we lack good models of how this can be done. A system that can respond to single quanta and resolve almost to the diffraction limit is unlikely to employ grossly inefficient methods for those higher functions upon which its whole utility depends, and so it is worth seeking out the limiting factors. The quality of human performance at certain higher perceptual tasks is high compared with the limit of reliable statistical inference; hence mnuch of the sample of information available in a visual image must be effectively utilized. But there are strong limitations on the connectivity in the cortex, so that one is forced to consider how the relevant information can be collected together. Three stages of dealing with the visual image are proposed: the improvement of the cortical map in primary visual cortex by processes analogous to spatial and temporal interpolation; the detection of linking features in this map; and the concentration of this information by non-topographical mapping in adjacent visual areas."
            },
            "slug": "Critical-limiting-factors-in-the-design-of-the-eye-Barlow",
            "title": {
                "fragments": [],
                "text": "Critical limiting factors in the design of the eye and visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Three stages of dealing with the visual image are proposed: the improvement of the cortical map in primary visual cortex by processes analogous to spatial and temporal interpolation; the detection of linking features in this map; and the concentration of this information by non-topographical mapping in adjacent visual areas."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145141062"
                        ],
                        "name": "J. Walraven",
                        "slug": "J.-Walraven",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Walraven",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Walraven"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6096627,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a0b49b160bbc5f467e244a40943e071e625f5e22",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Perceived-colour-under-conditions-of-chromatic-for-Walraven",
            "title": {
                "fragments": [],
                "text": "Perceived colour under conditions of chromatic adaptation: Evidence for gain control by π mechanisms"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2386034"
                        ],
                        "name": "D. Krantz",
                        "slug": "D.-Krantz",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Krantz",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Krantz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 53480197,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "040b87a1c7083db38484878769aa9a6b50617860",
            "isKey": false,
            "numCitedBy": 104,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Color-measurement-and-color-theory:-II.-theory-Krantz",
            "title": {
                "fragments": [],
                "text": "Color measurement and color theory: II. Opponent-colors theory"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38871475,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "a4904e88d0ae48937db30e8ebd75abe176988161",
            "isKey": false,
            "numCitedBy": 418,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown that the absorption of one quantum can excite a rod in the human retina, but that at least two, and probably many more, excited rods are needed to give a sensation of light. It is suggested that noise in the optic pathway limits its sensitivity, and this idea is subjected to an experimental test. The hypothesis is then formulated quantitatively, and shown to be able to account for the above experiment, and also the disagreement in the literature between those who believe that the absorption of two quanta can cause a sensation, and those who believe that 5 or more are required. The formulation of the hypothesis is used to calculate the maximum allowable noise (expressed as a number x of random, independent events confusable with the absorption of a quantum of light) in the optic pathway for the absorption of various fractions of the total number of quanta incident at the cornea."
            },
            "slug": "Retinal-noise-and-absolute-threshold.-Barlow",
            "title": {
                "fragments": [],
                "text": "Retinal noise and absolute threshold."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The hypothesis that noise in the optic pathway limits its sensitivity is formulated quantitatively, and shown to be able to account for the above experiment, and also the disagreement in the literature between those who believe that the absorption of two quanta can cause a sensation, and thosewho believe that 5 or more are required."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33018326"
                        ],
                        "name": "A. Eisner",
                        "slug": "A.-Eisner",
                        "structuredName": {
                            "firstName": "Alvin",
                            "lastName": "Eisner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Eisner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2010809"
                        ],
                        "name": "D. Macleod",
                        "slug": "D.-Macleod",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Macleod",
                            "middleNames": [
                                "I.",
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Macleod"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46004575,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "beb1545be8a7b88296d72f17c042e881ab758c1f",
            "isKey": false,
            "numCitedBy": 130,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "Flicker photometric equivalence is both additive and transitive when the test and standard are alternated upon a relatively more intense colored background. When the balance of red versus green cone excitation from the background is unequal, the contribution of one cone type to flicker photometric spectral sensitivity may be depressed in relation to that of the other by at least 1 order of magnitude more than Weber's law predicts. The resultant spectral sensitivity is determined predominantly by only one class of cone. The cone spectral sensitivities of normals are then seen to be the same as those of dichromats, although there is some individual variation. A model is developed to explain this surprising phenomenon."
            },
            "slug": "Flicker-photometric-study-of-chromatic-adaption:-of-Eisner-Macleod",
            "title": {
                "fragments": [],
                "text": "Flicker photometric study of chromatic adaption: selective suppression of cone inputs by colored backgrounds."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A model is developed to explain this surprising phenomenon where the cone spectral sensitivities of normals are seen to be the same as those of dichromats, although there is some individual variation."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145141062"
                        ],
                        "name": "J. Walraven",
                        "slug": "J.-Walraven",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Walraven",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Walraven"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35191771,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ca694ca7e17c8ade9165b5722c705b439873facd",
            "isKey": false,
            "numCitedBy": 180,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Discounting-the-background—the-missing-link-in-the-Walraven",
            "title": {
                "fragments": [],
                "text": "Discounting the background—the missing link in the explanation of chromatic induction"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145008607"
                        ],
                        "name": "E. Pugh",
                        "slug": "E.-Pugh",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Pugh",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Pugh"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 20909899,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "0b698f8fcaf99ca0fe0729c15802dea7f172311f",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "The ppi1 colour mechanism was isolated by means of Stile's auxiliary field technique: that it is pi1 which is isolated is proven by both test and field action spectra. 2. The fundamental mechanisms of human trichromatic colour vision must satisfy Grassman's law of additivity. The hypothesis that pi1 is one of the three fundamentals is tested by experiments in which pairs (u1, u2) of monochromatic adapting fields are mixed 3. When two fields with wave‐lengths in the neighbourhood of its primary mode (mu1, mu2 less than or equal to 500 nm) are combined, pi1 is field‐additive, consistent with the hypothesis that this portion of the pi1 action spectrum is that of the short‐wave‐length‐sensitive photoreceptors. 4. When a short‐wave‐length adaptation field (mu1 less than or equal to 500 nm) is mixed with a longer wave‐length field (mu2 greater than or equal 550 nm) i1 is strongly non‐additive. This result proves that the long‐wave‐length portion of the pi1 field spectrum is generated at least in part by a signal originating in the long‐ or middle‐wave‐length sensitive cones. 5. Analysis of the additivity failures supports a model of pi1 in which the signal to be detected is generated in the short‐wave‐length cones, and must pass serially through two gain stages: the gain in the first stage is controlled by the short‐wave‐length cones alone; the gain in the second stage is controlled by a signal originating in the middle, or long‐wave‐length cones, or both."
            },
            "slug": "The-nature-of-the-pi1-colour-mechanism-of-W.S.-Pugh",
            "title": {
                "fragments": [],
                "text": "The nature of the pi1 colour mechanism of W.S. Stiles."
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "The ppi1 colour mechanism was isolated by means of Stile's auxiliary field technique: that it is pi1 which is isolated is proven by both test and field action spectra, and analysis of the additivity failures supports a model of pi1 in which the signal to be detected is generated in the short‐wave‐length cones."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3439085"
                        ],
                        "name": "J. Mollon",
                        "slug": "J.-Mollon",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mollon",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mollon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4952305"
                        ],
                        "name": "P. Polden",
                        "slug": "P.-Polden",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Polden",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Polden"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38279407,
            "fieldsOfStudy": [
                "Physics",
                "Biology"
            ],
            "id": "150d42839f756ce3295da5554a486868da9cbd17",
            "isKey": false,
            "numCitedBy": 138,
            "numCiting": 50,
            "paperAbstract": {
                "fragments": [],
                "text": "Adaptation of the human eye to long-wavelength light leaves it insensitive to short-wavelengths: a blue flash that is visible in the presence of a yellow adapting field may remain invisible for several seconds after the field has been turned off (see experiment 1 and Appendix). This ‘transient tritanopia’ occurs for a large range of adapting intensities, but is abolished if the adapting field is very bright (experiment 2). The loss of sensitivity is primarily confined to the blue-sensitive cone mechanism (experiments 2 a , 3 and 4 ; and Appendix) and can be produced by small attenuations of the adapting field (experiment 5). It occurs in both foveal and parafoveal vision (experiment 6) but is absent when adapting and test stimuli are presented to opposite eyes (experiment 7). It was found in a protanope (experiment 9 a ) and, in a modified form, in a deuteranope (experiment 9 b ). No differences in sensitivity were found for blue flashes presented in the light and dark phases of a field flickering at a rate above the fusion frequency (Appendix). The sensitivity of the blue-sensitive mechanism of the eye appears to be controlled not only by quanta absorbed by the blue receptors but also by a mechanism with a different spectral sensitivity"
            },
            "slug": "An-anomaly-in-the-response-of-the-eye-to-light-of-Mollon-Polden",
            "title": {
                "fragments": [],
                "text": "An anomaly in the response of the eye to light of short wavelengths."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The sensitivity of the blue-sensitive mechanism of the eye appears to be controlled not only by quanta absorbed by the blue receptors but also by a mechanism with a different spectral sensitivity."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5167126"
                        ],
                        "name": "J. Krauskopf",
                        "slug": "J.-Krauskopf",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Krauskopf",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Krauskopf"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2152728258"
                        ],
                        "name": "David R. Williams",
                        "slug": "David-R.-Williams",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Williams",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David R. Williams"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40599538"
                        ],
                        "name": "D. W. Heeley",
                        "slug": "D.-W.-Heeley",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Heeley",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. W. Heeley"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10480870,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0dd1e80f7299317339054463203f41078381c671",
            "isKey": false,
            "numCitedBy": 725,
            "numCiting": 56,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Cardinal-directions-of-color-space-Krauskopf-Williams",
            "title": {
                "fragments": [],
                "text": "Cardinal directions of color space"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113588000"
                        ],
                        "name": "R. L. de Valois",
                        "slug": "R.-L.-de-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "de Valois",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. de Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4192208"
                        ],
                        "name": "I. Abramov",
                        "slug": "I.-Abramov",
                        "structuredName": {
                            "firstName": "Israel",
                            "lastName": "Abramov",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Abramov"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145749008"
                        ],
                        "name": "G. H. Jacobs",
                        "slug": "G.-H.-Jacobs",
                        "structuredName": {
                            "firstName": "Gerald",
                            "lastName": "Jacobs",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. H. Jacobs"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2061303,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7639e079cf69e251f97e839d5d6dbfa9f8c34714",
            "isKey": false,
            "numCitedBy": 614,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "A detailed analysis was made of the response characteristics of single cells in the lateral geniculate nucleus of the macaque monkey. The goal was to understand how these cells contribute to the processing of visual information. Data were analyzed from a representative sample of 147 cells, whose responses to equal-energy spectra (presented as diffuse flashes of monochromatic light) were recorded at three radiance levels. On the basis of their responses, the cells were divided into two general classes: (a) spectrally nonopponent cells which respond to all wavelengths with either an increase or decrease in firing rate, (b) spectrally opponent cells (about two-thirds of the sample) which respond with an increase in firing rate to some parts of the spectrum and a decrease to other parts. Four types of opponent cells were found: (i) red excitatory and green inhibitory (+R−G), (ii) green excitatory and red inhibitory (+G−R), (iii) yellow excitatory and blue inhibitory (+Y−B), (iv) blue excitatory and yellow inhibitory (+B−Y). Comparisons with psychophysical data indicated that nonopponent cells transmit brightness information; opponent cells, however, carry information about color, the hue of a light being determined by the relative responses of the four types. The saturation of spectral lights appears to be related to the differences in responses of opponent and non-opponent cells."
            },
            "slug": "Analysis-of-response-patterns-of-LGN-cells.-Valois-Abramov",
            "title": {
                "fragments": [],
                "text": "Analysis of response patterns of LGN cells."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Comparisons with psychophysical data indicated that nonopponent cells transmit brightness information; opponent cells, however, carry information about color, the hue of a light being determined by the relative responses of the four types."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145523037"
                        ],
                        "name": "D. Jameson",
                        "slug": "D.-Jameson",
                        "structuredName": {
                            "firstName": "Dorothea",
                            "lastName": "Jameson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Jameson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4264042"
                        ],
                        "name": "L. Hurvich",
                        "slug": "L.-Hurvich",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Hurvich",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Hurvich"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 12547900,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "a4c319e8ceff33b1baa4b2140817649455091b2d",
            "isKey": false,
            "numCitedBy": 58,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "A theoretical model for an opponent-colors theory of vision is used to predict and describe quantitatively changes in the brightness, saturation, and hue of colors with changes in chromatic adaptation. The systematic nature of such changes in color appearance is examined, and comparisons are made between specific theoretical predictions and results of experimental studies of chromatic adaptation."
            },
            "slug": "Some-quantitative-aspects-of-an-opponent-colors-in-Jameson-Hurvich",
            "title": {
                "fragments": [],
                "text": "Some quantitative aspects of an opponent-colors theory. III. Changes in brightness, saturation, and hue with chromatic adaptation."
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A theoretical model for an opponent-colors theory of vision is used to predict and describe quantitatively changes in the brightness, saturation, and hue of colors with changes in chromatic adaptation."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49679156"
                        ],
                        "name": "Y. Hashimoto",
                        "slug": "Y.-Hashimoto",
                        "structuredName": {
                            "firstName": "Yoko",
                            "lastName": "Hashimoto",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Hashimoto"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "51936624"
                        ],
                        "name": "M. Inokuchi",
                        "slug": "M.-Inokuchi",
                        "structuredName": {
                            "firstName": "Mie",
                            "lastName": "Inokuchi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Inokuchi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2053931,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "514cd5ee272964199b99015006fc414d81bd7726",
            "isKey": false,
            "numCitedBy": 23,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Characteristics-of-second-order-neurons-in-the-dace-Hashimoto-Inokuchi",
            "title": {
                "fragments": [],
                "text": "Characteristics of second order neurons in the dace retina: Physiological and morphological studies"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145008607"
                        ],
                        "name": "E. Pugh",
                        "slug": "E.-Pugh",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Pugh",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Pugh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3439085"
                        ],
                        "name": "J. Mollon",
                        "slug": "J.-Mollon",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mollon",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mollon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38319698,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "d99edeec9776cac94f75878f368630abf1300080",
            "isKey": false,
            "numCitedBy": 219,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-theory-of-theΠ1-andΠ3-color-mechanisms-of-stiles-Pugh-Mollon",
            "title": {
                "fragments": [],
                "text": "A theory of theΠ1\n andΠ3\n color mechanisms of stiles"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3463629"
                        ],
                        "name": "P. Walraven",
                        "slug": "P.-Walraven",
                        "structuredName": {
                            "firstName": "Pieter",
                            "lastName": "Walraven",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Walraven"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40624666,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "b7e389a36f03e49dd99d6f79cccda92485d83210",
            "isKey": false,
            "numCitedBy": 127,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-closer-look-at-the-tritanopic-convergence-point.-Walraven",
            "title": {
                "fragments": [],
                "text": "A closer look at the tritanopic convergence point."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3207460"
                        ],
                        "name": "M. Teich",
                        "slug": "M.-Teich",
                        "structuredName": {
                            "firstName": "Malvin",
                            "lastName": "Teich",
                            "middleNames": [
                                "Carl"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Teich"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144504492"
                        ],
                        "name": "P. Prucnal",
                        "slug": "P.-Prucnal",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Prucnal",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Prucnal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2335502"
                        ],
                        "name": "G. Vannucci",
                        "slug": "G.-Vannucci",
                        "structuredName": {
                            "firstName": "Giovanni",
                            "lastName": "Vannucci",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Vannucci"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48542744"
                        ],
                        "name": "M. Breton",
                        "slug": "M.-Breton",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Breton",
                            "middleNames": [
                                "E."
                            ],
                            "suffix": "PhD"
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Breton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2098060965"
                        ],
                        "name": "W. J. McGill",
                        "slug": "W.-J.-McGill",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "McGill",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. J. McGill"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 120774177,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "dd151b2844d6540cb3403f0eaad8777a896a4847",
            "isKey": false,
            "numCitedBy": 58,
            "numCiting": 93,
            "paperAbstract": {
                "fragments": [],
                "text": "We have carried out a series of frequency-of-seeing experiments similar to those performed by Hecht, Shlaer, and Pirenne [ J. Gen. Physiol.25, 819– 840 ( 1942)], using an Ar+ laser operated at 514.5 nm as the source of light. In certain blocks of trials, our subjects were encouraged to report as seen those trials in which the stimulus might have been present. It was determined that sensitivity and reliability were traded against each other over a broad range: for our four subjects, the detection of 147 photons at the cornea with 60% frequency of seeing entailed, on the average, a 1% false-positive rate (FPR), whereas the detection of 34 photons at the cornea with 60% frequency of seeing was accompanied by a 33% FPR. A new neural-counting model has been developed in the framework of signal-detection theory. It combines Poisson stimulus fluctuations with additive and multiplicative neural noise, both of which are known to be present in the visual system at threshold. The resulting probability-of-detection curves, derived from the Neyman Type-A counting distribution, are in good accord with our experimental frequency-of-seeing data for sensible values of the model parameters. We deduce that, on the average, our four subjects are able to detect a single photon at the retina with 60% frequency of seeing, at the expense of a 55% FPR. In Part 2 of this set of papers [ PrucnalP. R.TeichM. C., Biol. Cybern.43, 87– 96 ( 1982)], we use the normalizing transform, together with probit analysis, to provide improved estimates of threshold parameters, whereas in Part 3 [ TeichM. C.PrucnalP. R.VannucciG.BretonM. E.McGillW. J., submitted to Biol. Cybern.], we consider the effects of non-Poisson quantum fluctuations."
            },
            "slug": "Multiplication-noise-in-the-human-visual-system-at-Teich-Prucnal",
            "title": {
                "fragments": [],
                "text": "Multiplication noise in the human visual system at threshold: 1. Quantum fluctuations and minimum detectable energy"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35202510"
                        ],
                        "name": "W. Pratt",
                        "slug": "W.-Pratt",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Pratt",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pratt"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62313192,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "feb7563edd19a97ad4c9f8292246e6bb40721112",
            "isKey": false,
            "numCitedBy": 115,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "During the past few years several monochromeimage transform-coding systems have been developed. In these systems, a quantized and coded version of a spatial unitary transform of an image is transmitted over a channel, rather than an image itself. In this paper the transform-coding concept has been applied to the coding of color images represented by three primary color planes of data. The principles of spatial transform coding are reviewed and the merits of various methods of color-image representation are discussed. A performance analysis is presented for the color-image transform-coding system. Results of a computer simulation of the coding system are also given. It is shown that, by transform coding, the chrominance content of a color image can be coded with an average of 1.0 bits per element or less without serious degradation. If luminance coding is also employed, the average rate reduces to about 2.0 bits per element or less."
            },
            "slug": "Spatial-Transform-Coding-of-Color-Images-Pratt",
            "title": {
                "fragments": [],
                "text": "Spatial Transform Coding of Color Images"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The transform-coding concept has been applied to the coding of color images represented by three primary color planes of data and it is shown that, by transform coding, the chrominance content of a color image can be coded with an average of 1.0 bits per element or less without serious degradation."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145738735"
                        ],
                        "name": "G. Wald",
                        "slug": "G.-Wald",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Wald",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Wald"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26856831,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "95ebbb6b88246540b8b4773cf0baeef970dd0875",
            "isKey": false,
            "numCitedBy": 155,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "An area at the center of the human fovea, subtending a visual angle of only 7–8 min and hence hardly larger than the fixation area, is blue-blind in the sense of almost or entirely lacking blue-sensitive cones. This is a matter of foveal topography, not size of field, for in fields of this size elsewhere in the fovea or in the parafovea, blue-sensitive cones are well represented. The blue-cone system falls in sensitivity from the border of the photopic zone—the functionally all-cone area—to a minimum, usually to extinction, at its center. Other features of foveal topography oppose this trend: the density of cones rises and the macular pigmentation thins out toward the center of the fovea. Also the red- and green-cone systems display the opposite gradient; their sensitivities decline regularly from the center toward the borders of the fovea and beyond.Tritanopia, though the rarest form of congenital color-blindness, is thus a regular feature of the center of the normal fovea. The existence of two neutral points in this condition, in the yellow and violet, has its basis in the observation that the luminosity curves of the red- and green-sensitive cones, drawn so as to cross in the yellow, cross again or fuse in the violet region. It is suggested that the blue-blindness of the fixation area is a final step in the general withdrawal of image vision from the short wavelengths of the spectrum, for which the chromatic aberration of the eye is greatest. The blue-blindness of the fixation area, taken together with the red-green blindness of more-or-less concentric zones of the near periphery, and the total colorblindness of the far periphery, raises the possibility that various zones of the normal retina display all the major forms of colorblindness. Trichromic vision is normal only in the broad, central annulus of the retina, which alone is ordinarily tested. Some instances of defective color vision may be similarly localized. The problems of both normal and defective color vision involve not only the presence or absence of certain visual pigments and types of cone, but their spatial distributions on the retinal surface, and their neural connections."
            },
            "slug": "Blue-blindness-in-the-normal-fovea.-Wald",
            "title": {
                "fragments": [],
                "text": "Blue-blindness in the normal fovea."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is suggested that the blue-blindness of the fixation area is a final step in the general withdrawal of image vision from the short wavelengths of the spectrum, for which the chromatic aberration of the eye is greatest."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5075907"
                        ],
                        "name": "K. Fukurotani",
                        "slug": "K.-Fukurotani",
                        "structuredName": {
                            "firstName": "Kenkichi",
                            "lastName": "Fukurotani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Fukurotani"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121835296,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "66d48c462816a76a54d6ec5aaaca9c6d993f75be",
            "isKey": false,
            "numCitedBy": 8,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Retinal horizontal cells responded linearly to weak monochromatic lights. Their spectral responses were analyzed in the linear range. Mutually orthogonal relations were found among the three different types of spectral response curves. According to communication theory, the interactions between cones and horizontal cells are interpreted as an orthogonalizing process which provides the optimal coding for the transmission of color information to the central nervous system."
            },
            "slug": "Color-information-coding-of-horizontal‐cell-in-fish-Fukurotani",
            "title": {
                "fragments": [],
                "text": "Color information coding of horizontal‐cell responses in fish retina"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "Retinal horizontal cells responded linearly to weak monochromatic lights andMutually orthogonal relations were found among the three different types of spectral response curves."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2386034"
                        ],
                        "name": "D. Krantz",
                        "slug": "D.-Krantz",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Krantz",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Krantz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 53607700,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "36f5f6778cfc80b8af5cf5b3fab7cfe6599a5b00",
            "isKey": false,
            "numCitedBy": 125,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Color-Measurement-and-Color-Theory:-I.-Theorem-for-Krantz",
            "title": {
                "fragments": [],
                "text": "Color Measurement and Color Theory: I. Representation Theorem for Grassmann Structures"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50359956"
                        ],
                        "name": "F. Attneave",
                        "slug": "F.-Attneave",
                        "structuredName": {
                            "firstName": "Fred",
                            "lastName": "Attneave",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Attneave"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8453552,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6d0198460198fdb49b89d1646049712b3a0683df",
            "isKey": false,
            "numCitedBy": 2762,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "xThe ideas of information theory are at present stimulating many different areas of psychological inquiry. In providing techniques for quantifying situations which have hitherto been difficult or impossible to quantify, they suggest new and more precise ways of conceptualizing these situations (see Miller [12] for a general discussion and bibliography). Events ordered in time are particularly amenable to informational analysis; thus language sequences are being extensively studied, and other sequences, such as those of music, plainly invite research. In this paper I shall indicate some of the ways in which the concepts and techniques of information theory may clarify our understanding of visual perception. When we begin to consider perception as an information-handling process, it quickly becomes clear that much of the information received by any higher organism is redundant. Sensory events are highly interdependent in both space and time: if we know at a given moment the states of a limited number of receptors (i.e., whether they are firing or not firing), we can make better-than-chance inferences with respect to the prior and subsequent states of these receptors, and also with respect to the present, prior, and subsequent states of other receptors. The preceding statement, taken in its broadest im1 The experimental work for this study was performed as part of the United States Air Force Human Resources Research and Development Program. The opinions and conclusions contained in this report are those of the author. They are not to be construed as reflecting the views or indorsement of the Department of the Air Force. plications, is precisely equivalent to an assertion that the world as we know it is lawful. In the present discussion, however, we shall restrict our attention to special types of lawfulness which may exist in space at a fixed time, and which seem particularly relevant to processes of visual perception."
            },
            "slug": "Some-informational-aspects-of-visual-perception.-Attneave",
            "title": {
                "fragments": [],
                "text": "Some informational aspects of visual perception."
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "Special types of lawfulness which may exist in space at a fixed time, and which seem particularly relevant to processes of visual perception are focused on."
            },
            "venue": {
                "fragments": [],
                "text": "Psychological review"
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50289440"
                        ],
                        "name": "D. B. Judd",
                        "slug": "D.-B.-Judd",
                        "structuredName": {
                            "firstName": "Deane",
                            "lastName": "Judd",
                            "middleNames": [
                                "Brewster"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. B. Judd"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4211084"
                        ],
                        "name": "D. L. Macadam",
                        "slug": "D.-L.-Macadam",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Macadam",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. L. Macadam"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72026341"
                        ],
                        "name": "G. Wyszecki",
                        "slug": "G.-Wyszecki",
                        "structuredName": {
                            "firstName": "Gunter",
                            "lastName": "Wyszecki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Wyszecki"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39485449"
                        ],
                        "name": "H. W. Budde",
                        "slug": "H.-W.-Budde",
                        "structuredName": {
                            "firstName": "H",
                            "lastName": "Budde",
                            "middleNames": [
                                "W"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. W. Budde"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49384138"
                        ],
                        "name": "H. Condit",
                        "slug": "H.-Condit",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Condit",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Condit"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "92637198"
                        ],
                        "name": "S. T. Henderson",
                        "slug": "S.-T.-Henderson",
                        "structuredName": {
                            "firstName": "Stanley",
                            "lastName": "Henderson",
                            "middleNames": [
                                "Thomas"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. T. Henderson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "92957790"
                        ],
                        "name": "J. Simonds",
                        "slug": "J.-Simonds",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Simonds",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Simonds"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119732338,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "58a8feca5058b6f6bcaaafa42a97a2113304cce6",
            "isKey": false,
            "numCitedBy": 820,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Spectral distributions of 622 samples of daylight (skylight, and sunlight plus skylight) have been subjected to characteristic vector analysis, as composite data and in three subgroups (99 distributions measured by Budde; 249, by Condit; and 274, by Henderson and Hodgkiss). The chromaticity coordinates (x,y) computed from these distributions have been compared with direct visual determinations of chromaticity coordinates of daylight by Nayatani and Wyszecki, and by Chamberlin, Lawrence, and Belbin. It was found that the chromaticities indicated by the spectral distributions and by direct visual colorimetry cluster about the curve: y = 2.870x−3.000x2−0.275. This curve of typical daylight chromaticities falls slightly on the green side of the Planckian locus. From the mean and the first two characteristic vectors of the composite data, spectral distribution curves have been reconstituted by choice of scalar multiples of the vectors such that the chromaticity points fall on the curve of typical daylight chromaticities at places corresponding to correlated color temperatures of 4800°, 5500°, 6500°, 7500°, and 10 000°K. The representative character of these reconstituted spectral-distribution curves has been established by comparison with the measured curves from each subgroup yielding the closest approximation to the same chromaticities. The agreement so found suggests that this family of curves is more representative of the various phases of daylight between correlated color temperatures 4800° and 10 000°K than any previously derived distributions."
            },
            "slug": "Spectral-Distribution-of-Typical-Daylight-as-a-of-Judd-Macadam",
            "title": {
                "fragments": [],
                "text": "Spectral Distribution of Typical Daylight as a Function of Correlated Color Temperature"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1964
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5403672"
                        ],
                        "name": "R. Weale",
                        "slug": "R.-Weale",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Weale",
                            "middleNames": [
                                "Alexander"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Weale"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 71624723,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "09e565d572d706d05b0100c95bbd5c58d1c3e571",
            "isKey": false,
            "numCitedBy": 152,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "first meeting, and Douglas Anderson is the moderator of the second meeting, consisting of 7 cases of angle closure glaucoma. The panels consist of eminent researchers into glaucoma and are different in each symposium (except for Robert Shaffer, who was present in both, and whose comments are always to the point, profound yet essentially practical). The case presentations are halted at certain points for discussions and generalisations, and much ground is covered. The bias of the symposium is towards the solution of specific everyday problems, and, not unexpectedly, the level of discussion varies widely between traditional views and controversial and stimulating statements. It is clearly impossible to discuss the 19 chapters individually, but perhaps a few statements and opinions may be singled out for their interest. Assessment of the diurnal variations in pressure is best carried out by sporadic checks at the clinic at different hours, or by home tonometry; inpatient hospital phasing is not so reliable, as it involves a profound change in the patient's routine. Almost all the panelists commonly used the water drinking test, but tonography is no longer a routine investigation, being reserved for special cases. A recent spate of litigation cases in the US concerning juvenile glaucoma prompts several panelists to perform tonometry on every co-operative subject regardless of age. However, Shaffer would limit this to cases with suspicious-looking discs and to those persons in whom it can be carried out in a reasonably short time. Epinephrine almost certainly improves outflow facility fairly rapidly and not, as was thought, after a long latent period. The peak of its dose-response curve appears to be at the 1 % concentration of active drug in the short term, though it may be as high as 2% in the long term (Bernard Becker). Stability of adrenaline solution is greater with the bitartrate and the hydrochloride (Epifrin, Glaucon) than with the borate (Epinal, Eppy), but the borate compounds are more comfortable to use. Although little statistical evidence has been adduced, there is an impression that the disc cup changes more readily if it is already large (John Hetherington). In ocular hypertension the pressure responses to, and patient tolerance of, treatment are important factors in deciding when and how much to treat. In drainage operations vitreous aspiration is increasingly recommended to prevent sealing up of the drainage aperture by vitreous. Provocative tests in angle closure glaucoma remain essentially unreliable. The least unsatisfactory tests are the dark room test and the prone test. Mydriatic tests give many false positives. Neither the patient's advanced age nor a considerable degree of widening of the angle with pilocarpine should weaken our resolve to operate on every case of acute angle closure glaucoma (Pollack). However, tonography has a place in evaluating the chances of success of peripheral iridectomy after an acute attack: if C < 0 1, we can expect over 75% of failures (Shaffer). The volume is beautifully presented and contains several illustrations and clear tables. JOHN ROMANO"
            },
            "slug": "Mechanisms-of-Colour-Vision-Weale",
            "title": {
                "fragments": [],
                "text": "Mechanisms of Colour Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The bias of the symposium is towards the solution of specific everyday problems, and the level of discussion varies widely between traditional views and controversial and stimulating statements."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145712748"
                        ],
                        "name": "T. Young",
                        "slug": "T.-Young",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Young",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Young"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 111329955,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d746b53708b86fa3c6268c3d50e97e3a37bc4889",
            "isKey": false,
            "numCitedBy": 441,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Although the invention of plausible hypotheses, independent of any connection with experimental observations, can be of very little use in the promotion of natural knowledge; yet the discover of simple uniform principles, by which a great number of apparently heterogeneous phenomena are reduced to coherent and universal laws, must ever be allowed to be of considerable importance towards the improvement of the human intellect. The object of the present dissertation is not so much to propose any opinions which are absolutely new, as to refer some theories, which have been already advanced, to their original inventors, to support them by additional evidence, and to apply them to a great number of diversified facts, which have hitherto been buried in obscurity. Nor is it absolutely necessary in this instance to produce a single new experiment; for of experiments there is already an ample store, which are so much the more unexceptionable, as they must have been conducted with out the least partiality for the system by which they will be explained; yet some facts, hitherto unobserved, will be brought forwards, in order to show the perfect agreement of that system with the multifarious phenomena of nature."
            },
            "slug": "II.-The-Bakerian-Lecture.-On-the-theory-of-light-Young",
            "title": {
                "fragments": [],
                "text": "II. The Bakerian Lecture. On the theory of light and colours"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The object of the present dissertation is not so much to propose any opinions which are absolutely new, as to refer some theories, which have been already advanced, to their original inventors, to support them by additional evidence, and to apply them to a great number of diversified facts which have hitherto been buried in obscurity."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical Transactions of the Royal Society of London"
            },
            "year": 1802
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102816748"
                        ],
                        "name": "J. Cohen",
                        "slug": "J.-Cohen",
                        "structuredName": {
                            "firstName": "Jozef",
                            "lastName": "Cohen",
                            "middleNames": [
                                "Bertram"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Cohen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 120840914,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "899a4e9b8fb72cc326980b81294001c635348fdf",
            "isKey": false,
            "numCitedBy": 428,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "The spectral reflectance curves of 433 chips in the Munsell Book of Color have been found to depend on only three components which account for 99.18% of the variance. It is suggested that this three-component dependency may be a characteristic of all organic pigments, including those in the retina, and thus explain the trichromatic nature of color vision."
            },
            "slug": "Dependency-of-the-spectral-reflectance-curves-of-Cohen",
            "title": {
                "fragments": [],
                "text": "Dependency of the spectral reflectance curves of the Munsell color chips"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1964
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31537929"
                        ],
                        "name": "J. J. Vos",
                        "slug": "J.-J.-Vos",
                        "structuredName": {
                            "firstName": "Johannes",
                            "lastName": "Vos",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. J. Vos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3463629"
                        ],
                        "name": "P. Walraven",
                        "slug": "P.-Walraven",
                        "structuredName": {
                            "firstName": "Pieter",
                            "lastName": "Walraven",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Walraven"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30660737,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "889d4387f272f952c05eb226a336d104eee65863",
            "isKey": false,
            "numCitedBy": 43,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-analytical-description-of-the-line-element-in-of-Vos-Walraven",
            "title": {
                "fragments": [],
                "text": "An analytical description of the line element in the zone-fluctuation model of colour vision. II. The derivation of the line element."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "29627719"
                        ],
                        "name": "T. Tomita",
                        "slug": "T.-Tomita",
                        "structuredName": {
                            "firstName": "Tsuneo",
                            "lastName": "Tomita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Tomita"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 29877742,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5dd5373184ce5d09a3f8cf16fe48d4dc0a1eb52e",
            "isKey": false,
            "numCitedBy": 111,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "Descriptions are made of recent developments in research on the S potential and the ERG, two major responses in the vertebrate retina which undoubtedly represent important processes that are intermediate between the initial photochemical process and nervous activity as encoded information to the brain. Both of these responses, together with the nervous activity, have played a superb role as tools to the understanding of many psychophysical phenomena in terms of what is actually taking place in the retina. In this paper, however, emphasis is placed on the effort of investigators during the last decade toward the attainment of more basic knowledge concerning these tools themselves. The progress may not have been completely satisfactory, but the question of how the individual cellular units contribute to these responses will doubtless continue to be of interest to investigators."
            },
            "slug": "Electrical-activity-in-the-vertebrate-retina.-Tomita",
            "title": {
                "fragments": [],
                "text": "Electrical activity in the vertebrate retina."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32310555"
                        ],
                        "name": "W. Siebert",
                        "slug": "W.-Siebert",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Siebert",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Siebert"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60737646,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "668d6e7bb32bd31df95fe4a5d805f35660f75843",
            "isKey": false,
            "numCitedBy": 227,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "The pattern of all-or-none firings in many sensory nerves can usefully be modeled as a set of sample functions from non-stationary random processes whose parameters are determined by the sensory stimulus. Given such a description, one can compare the parameter estimation, discrimination, or detection performance of a human observer (as measured behaviorally) with the computed limiting performance of an ideal observer operating on the same neural input. Such a comparison is carried out in detail for the discrimination in frequency of an auditory sinusoidal tone burst. The results suggest that the human listener behaves as if he ignored (at least for this class of sounds) the periodicity information in the auditory nerve pattern (resulting from the phase-locking of the firings to the stimulus), but made full effective use of the place information (resulting primarily, although not entirely, from the mechanical tuning of the inner ear). On the other hand, it is known that the auditory system can discriminate certain more complicated stimuli on the basis of periodicity information if that is the only cue available. A modification of the structure of an optimum sinusoidal frequency discrimination system is conjectured that seems to be, at least qualitatively, consistent with the available evidence."
            },
            "slug": "Frequency-discrimination-in-the-auditory-system:-or-Siebert",
            "title": {
                "fragments": [],
                "text": "Frequency discrimination in the auditory system: Place or periodicity mechanisms?"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A modification of the structure of an optimum sinusoidal frequency discrimination system is conjectured that seems to be, at least qualitatively, consistent with the available evidence."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2736055"
                        ],
                        "name": "J. Limb",
                        "slug": "J.-Limb",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Limb",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Limb"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "13153356"
                        ],
                        "name": "C. B. Rubinstein",
                        "slug": "C.-B.-Rubinstein",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Rubinstein",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. B. Rubinstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48144958"
                        ],
                        "name": "J. Thompson",
                        "slug": "J.-Thompson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Thompson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Thompson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "The idea is that more resources will then be allocated in transmitting the message components that have most of the signal energy and less in transmitting those with little energy without much effect on the error in the received signal (Pratt 1971, 1978; Watanabe I967; Limb et al. 1977)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 51654263,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "80ba8b8c943b68486e3f6fcc47f61a39b48b342b",
            "isKey": false,
            "numCitedBy": 94,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper reviews the field of the efficient coding of color television signals. Because this paper is perhaps the first review on this topic, some background is given in the areas of colorimetry, visual perception of color and color television systems. We assume that the reader has some familiarity with luminance encoding techniques. Coding techniques themselves are divided into two broad groups: component coding methods in which each component (usually three) is coded separately, and composite coding methods in which the composite television signal with its \"color\" modulated subcarrier is processed as a single entity. Both approaches are covered in detail. The field is still growing, pushed primarily by the desire in the television area to find digital coding standards accepted by both broadcasters and carriers and suitable for use with NTSC, PAL and SECAM television systems. We discuss this aspect by comparing composite and component coding methods."
            },
            "slug": "Digital-Coding-of-Color-Video-Signals-A-Review-Limb-Rubinstein",
            "title": {
                "fragments": [],
                "text": "Digital Coding of Color Video Signals - A Review"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "The field of the efficient coding of color television signals is reviewed, pushed primarily by the desire in the television area to find digital coding standards accepted by both broadcasters and carriers and suitable for use with NTSC, PAL and SECAM television systems."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Communications"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145309959"
                        ],
                        "name": "W. Stiles",
                        "slug": "W.-Stiles",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Stiles",
                            "middleNames": [
                                "Stanley"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Stiles"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72026341"
                        ],
                        "name": "G. Wyszecki",
                        "slug": "G.-Wyszecki",
                        "structuredName": {
                            "firstName": "Gunter",
                            "lastName": "Wyszecki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Wyszecki"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695915"
                        ],
                        "name": "N. Ohta",
                        "slug": "N.-Ohta",
                        "structuredName": {
                            "firstName": "Noboru",
                            "lastName": "Ohta",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Ohta"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120603418,
            "fieldsOfStudy": [
                "Mathematics",
                "Environmental Science"
            ],
            "id": "c6da3b1135274aec7f3e4018f42b536400cad624",
            "isKey": false,
            "numCitedBy": 80,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper is a supplementary article on counting metamers to one presented earlier in this journal. Whereas in the previous study the basic collection of object-color stimuli contained “jagged” spectral reflectance curves, including a great many that exhibit extreme reflectance variations within small spectral ranges, the present paper makes use of basic collections which contain “smooth” spectral reflectance curves generated by frequency-limited functions. The results obtained in the present study are similar to those obtained previously, particularly when the limiting frequency of the spectral reflectance functions is set at ω = 1/50. Such a limiting frequency leads to spectral reflectance curves of typically four oscillations within the visible spectrum, making them resemble practical spectral reflectance curves."
            },
            "slug": "Counting-metameric-object-color-stimuli-using-Stiles-Wyszecki",
            "title": {
                "fragments": [],
                "text": "Counting metameric object-color stimuli using frequency-limited spectral reflectance functions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47836833"
                        ],
                        "name": "J. L. Goldstein",
                        "slug": "J.-L.-Goldstein",
                        "structuredName": {
                            "firstName": "Julius",
                            "lastName": "Goldstein",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. L. Goldstein"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37277358,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "891b725caad06d2dd7310c26fe791ccb805e60dc",
            "isKey": false,
            "numCitedBy": 568,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory was formulated for the central formation of the pitch of complex tones, i.e., periodicity pitch. This theory is a logical deduction from statistical estimation theory of the optimal estimate for fundamental frequency, when this estimate is constrained in ways inferred from empirical phenomena. These constraints are (1) the estimator receives noisy information on the frequencies, but not amplitudes and phases, of aurally resolvable simple tones from the stimulus and its aural combination tones, and (2) the estimator presumes all stimuli are periodic with spectra comprising successive harmonics. The stochastic signals representing the frequencies of resolved tones are characterized by independent Gaussian distributions with mean equal to the frequency represented and a variance that serves as free parameter. The theory is indifferent to whether frequency is coded by place or time. Optimum estimates of fundamental frequency and harmonic numbers are calculated upon each stimulus presentation. Multimo..."
            },
            "slug": "An-optimum-processor-theory-for-the-central-of-the-Goldstein",
            "title": {
                "fragments": [],
                "text": "An optimum processor theory for the central formation of the pitch of complex tones."
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "A theory was formulated for the central formation of the pitch of complex tones, i.e., periodicity pitch, which is a logical deduction from statistical estimation theory of the optimal estimate for fundamental frequency."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of the Acoustical Society of America"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31537929"
                        ],
                        "name": "J. J. Vos",
                        "slug": "J.-J.-Vos",
                        "structuredName": {
                            "firstName": "Johannes",
                            "lastName": "Vos",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. J. Vos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Currently in use are two psychophysically developed sets of primaries, the Vos-Walraven primaries (Vos & Walraven 1971; Walraven 1974; Vos 1978) and the Smith-Pokorny primaries (Smith & Pokorny 1975)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 62740550,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c17e14e8993fb72176f2483c482129756fd8a897",
            "isKey": false,
            "numCitedBy": 345,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "The availability of tables with standardized data on the properties of a normal visual visual observer has been a great help in scientific communication. For daily practice these data, going back to the 1920s, still suffice. For basic science they show shortocmings, however. The present paper gives new and extended tables which are intended to be complementary to, rather than to compete with, the old CIE tables."
            },
            "slug": "Colorimetric-and-photometric-properties-of-a-2°-Vos",
            "title": {
                "fragments": [],
                "text": "Colorimetric and photometric properties of a 2° fundamental observer"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "New and extended tables which are intended to be complementary to, rather than to compete with, the old CIE tables are given."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5734863"
                        ],
                        "name": "G. Svaetichin",
                        "slug": "G.-Svaetichin",
                        "structuredName": {
                            "firstName": "Gunnar",
                            "lastName": "Svaetichin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Svaetichin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48178574"
                        ],
                        "name": "M. Laufer",
                        "slug": "M.-Laufer",
                        "structuredName": {
                            "firstName": "Miguel",
                            "lastName": "Laufer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Laufer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152536829"
                        ],
                        "name": "G. Mitarai",
                        "slug": "G.-Mitarai",
                        "structuredName": {
                            "firstName": "Genyo",
                            "lastName": "Mitarai",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Mitarai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16729096"
                        ],
                        "name": "R. Fatehchand",
                        "slug": "R.-Fatehchand",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Fatehchand",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Fatehchand"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3656626"
                        ],
                        "name": "E. Vallecalle",
                        "slug": "E.-Vallecalle",
                        "structuredName": {
                            "firstName": "Edmundo",
                            "lastName": "Vallecalle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Vallecalle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680161"
                        ],
                        "name": "J. Villegas",
                        "slug": "J.-Villegas",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Villegas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Villegas"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 86010201,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3806ee4eb917e55231c38d68bdada2fa11520427",
            "isKey": false,
            "numCitedBy": 58,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "Our experimental findings which showed the glial origin of the retinal S-potentials and their behavior were for the first time presented and discussed at this symposium. The conference, concerning the same subject, given by Svaetichin (October 26, 1960) at Washington, stimulated his old friend and colleague Robert Galambos to write a paper concerning “a glia-neural theory of brain function” [Proc. Nat. Acad. Sci. 47, 129 –136 (1961)]. This exciting article is a much better introduction to our work than anything we could have written ourselves, since it emphasizes the problem faced by the conventional “millisecond” neurophysiology and the neuron theory when trying to explain complex functions of our nervous system, as for instance sleep, alertness, learning, memory, inborn instinctive behavior, etc., and also gives a historical review of earlier thought, suggesting an important role for the glia in brain function. Anatomical and biochemical studies (Nansen, Holmgren, KornmUller, Hyden, Sjostrand, DE Robertis, G. Villegas and others) suggest the existence of interactions between the neuron and the glia; however, our studies directly demonstrate that the glial cells exert a metabolic excitability control on the neurons. Actually, all investigations on the S-potentials which have been carried out since 1953 are studies on the functional mechanisms of the glial cells, although this had not been realized before we definitely localized the recording site of the micro-electrode to individual Muller fibers and (glial) horizontal cells of the Teleost retina."
            },
            "slug": "Glial-Control-of-Neuronal-Networks-and-Receptors-Svaetichin-Laufer",
            "title": {
                "fragments": [],
                "text": "Glial Control of Neuronal Networks and Receptors"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This exciting article is a much better introduction to the authors' work than anything they could have written themselves, and emphasizes the problem faced by the conventional “millisecond” neurophysiology and the neuron theory when trying to explain complex functions of the nervous system."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31537929"
                        ],
                        "name": "J. J. Vos",
                        "slug": "J.-J.-Vos",
                        "structuredName": {
                            "firstName": "Johannes",
                            "lastName": "Vos",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. J. Vos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122669892,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "d4460bda5ad7dc7fb69b947d5126f5c103313eb2",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Line elements are mathematical formulations that describe subjective color differences in terms of model characteristics. An attempt is made to discover a trend in their development—a trend that is, interestingly, marked by gains in insight into the mechanism of color vision, rather than by distinct improvements in the description of color discrimination data."
            },
            "slug": "Line-elements-and-physiological-models-of-color-Vos",
            "title": {
                "fragments": [],
                "text": "Line elements and physiological models of color vision"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "Line elements are mathematical formulations that describe subjective color differences in terms of model characteristics that are marked by gains in insight into the mechanism of color vision, rather than by distinct improvements in the description of color discrimination data."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2616213"
                        ],
                        "name": "E. J. Augenstein",
                        "slug": "E.-J.-Augenstein",
                        "structuredName": {
                            "firstName": "Elise",
                            "lastName": "Augenstein",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. J. Augenstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145008607"
                        ],
                        "name": "E. Pugh",
                        "slug": "E.-Pugh",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Pugh",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Pugh"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 21191554,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "02fc7295437472fb1af81ed15a68d6f62e706304",
            "isKey": false,
            "numCitedBy": 69,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The visual pathway that determines Stiles's Π1 colour mechanism was isolated by the auxiliary field technique and studied under dynamic conditions of light adaptation and recovery by threshold measurements."
            },
            "slug": "The-dynamics-of-the-Π1-colour-mechanism:-further-of-Augenstein-Pugh",
            "title": {
                "fragments": [],
                "text": "The dynamics of the Π1 colour mechanism: further evidence for two sites of adaptation"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "The visual pathway that determines Stiles's Π1 colour mechanism was isolated by the auxiliary field technique and studied under dynamic conditions of light adaptation and recovery by threshold measurements."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27573133,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "ff99adabdf30b0949e99d589b02a5bf064ef9ee6",
            "isKey": false,
            "numCitedBy": 90,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "Our perceptions of the world around us are stable and reliable. Is this because the mechanisms that yield them are crude and insensitive and thus immune to false responses? Or is it because a statistical censor that blocks unreliable messages intervenes between the signals from our sense organs and our knowledge of them? This question can be answered by measuring the efficiency with which statistical information is utilized in perception. It is shown that mirror symmetry can be detected in displays of otherwise random dots with an efficiency of up to 50%; thus the statistical mechanisms are not crude and insensitive, and this aspect of sensory physiology and psychology may deserve more attention."
            },
            "slug": "The-absolute-efficiency-of-perceptual-decisions.-Barlow",
            "title": {
                "fragments": [],
                "text": "The absolute efficiency of perceptual decisions."
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "It is shown that mirror symmetry can be detected in displays of otherwise random dots with an efficiency of up to 50%; thus the statistical mechanisms are not crude and insensitive, and this aspect of sensory physiology and psychology may deserve more attention."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33018326"
                        ],
                        "name": "A. Eisner",
                        "slug": "A.-Eisner",
                        "structuredName": {
                            "firstName": "Alvin",
                            "lastName": "Eisner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Eisner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2010809"
                        ],
                        "name": "D. Macleod",
                        "slug": "D.-Macleod",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Macleod",
                            "middleNames": [
                                "I.",
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Macleod"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 35676824,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bf4dcd73f217fce59485dbfaf5c6ca6dca800129",
            "isKey": false,
            "numCitedBy": 171,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "By using violet backgrounds we selectively altered blue-cone sensitivity but found no change in flicker photometric sensitivity. This indicates that blue cones do not contribute to luminance as defined by flicker photometry."
            },
            "slug": "Blue-sensitive-cones-do-not-contribute-to-Eisner-Macleod",
            "title": {
                "fragments": [],
                "text": "Blue-sensitive cones do not contribute to luminance."
            },
            "tldr": {
                "abstractSimilarityScore": 85,
                "text": "By using violet backgrounds, blue-cone sensitivity is selectively altered but no change in flicker photometric sensitivity is found, indicating that blue cones do not contribute to luminance as defined by flickers photometry."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49400375"
                        ],
                        "name": "R. Monzingo",
                        "slug": "R.-Monzingo",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Monzingo",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Monzingo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1821626"
                        ],
                        "name": "R. Haupt",
                        "slug": "R.-Haupt",
                        "structuredName": {
                            "firstName": "Randy",
                            "lastName": "Haupt",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haupt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69936650"
                        ],
                        "name": "T. W. Miller",
                        "slug": "T.-W.-Miller",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Miller",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. W. Miller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60967715,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "b20a6a2ed9793c07e94aed156fb44cc760d376e9",
            "isKey": false,
            "numCitedBy": 1255,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This second edition is an extensive modernization of the bestselling introduction to the subject of adaptive array sensor systems. With the number of applications of adaptive array sensor systems growing each year, this look at the principles and fundamental techniques that are critical to these systems is more important than ever before. Introduction to Adaptive Arrays, 2nd Edition is organized as a tutorial, taking the reader by the hand and leading them through the maze of jargon that often surrounds this highly technical subject. It is easy to read and easy to follow, as fundamental concepts are introduced with examples before more current developments and techniques are introduced. Problems at the end of each chapter serve both instructors and professional readers by illustrating and extending the material presented in the text. Both students and practicing engineers will easily gain familiarity with the modern contribution that adaptive arrays have to offer practical signal reception systems."
            },
            "slug": "Introduction-to-Adaptive-Arrays-Monzingo-Haupt",
            "title": {
                "fragments": [],
                "text": "Introduction to Adaptive Arrays"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "This second edition is an extensive modernization of the bestselling introduction to the subject of adaptive array sensor systems, taking the reader by the hand and leading them through the maze of jargon that often surrounds this highly technical subject."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3672557"
                        ],
                        "name": "W. Levick",
                        "slug": "W.-Levick",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Levick",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Levick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 28935754,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "65e79f07569e1deb04289264566c83b09e78e39a",
            "isKey": false,
            "numCitedBy": 253,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Responses of cat retinal ganglion cells have been examined with a view to specifying the characteristics that limit the detection of light stimuli."
            },
            "slug": "Three-factors-limiting-the-reliable-detection-of-by-Barlow-Levick",
            "title": {
                "fragments": [],
                "text": "Three factors limiting the reliable detection of light by retinal ganglion cells of the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "Responses of cat retinal ganglion cells have been examined with a view to specifying the characteristics that limit the detection of light stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143642168"
                        ],
                        "name": "A. Berman",
                        "slug": "A.-Berman",
                        "structuredName": {
                            "firstName": "Abraham",
                            "lastName": "Berman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Berman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118980740,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a5a58702b18e1ee1d3435bc0b0de19a98e771399",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "CHAPTER-6-–-M-MATRICES-Berman",
            "title": {
                "fragments": [],
                "text": "CHAPTER 6 – M-MATRICES"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1770859"
                        ],
                        "name": "R. Gallager",
                        "slug": "R.-Gallager",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Gallager",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gallager"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121902258,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "eff026fee8b554a445ac881e5ffa899688e799a6",
            "isKey": false,
            "numCitedBy": 4192,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "Communication Systems and Information Theory. A Measure of Information. Coding for Discrete Sources. Discrete Memoryless Channels and Capacity. The Noisy-Channel Coding Theorem. Techniques for Coding and Decoding. Memoryless Channels with Discrete Time. Waveform Channels. Source Coding with a Fidelity Criterion. Index."
            },
            "slug": "Information-Theory-and-Reliable-Communication-Gallager",
            "title": {
                "fragments": [],
                "text": "Information Theory and Reliable Communication"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This chapter discusses Coding for Discrete Sources, Techniques for Coding and Decoding, and Source Coding with a Fidelity Criterion."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31617570"
                        ],
                        "name": "A. Papoulis",
                        "slug": "A.-Papoulis",
                        "structuredName": {
                            "firstName": "Athanasios",
                            "lastName": "Papoulis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Papoulis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 118245370,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "753fbc36641df174d1a61ff949e6637258912fde",
            "isKey": false,
            "numCitedBy": 10957,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "Part 1 Probability and Random Variables 1 The Meaning of Probability 2 The Axioms of Probability 3 Repeated Trials 4 The Concept of a Random Variable 5 Functions of One Random Variable 6 Two Random Variables 7 Sequences of Random Variables 8 Statistics Part 2 Stochastic Processes 9 General Concepts 10 Random Walk and Other Applications 11 Spectral Representation 12 Spectral Estimation 13 Mean Square Estimation 14 Entropy 15 Markov Chains 16 Markov Processes and Queueing Theory"
            },
            "slug": "Probability,-Random-Variables-and-Stochastic-Papoulis",
            "title": {
                "fragments": [],
                "text": "Probability, Random Variables and Stochastic Processes"
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "This chapter discusses the concept of a Random Variable, the meaning of Probability, and the axioms of probability in terms of Markov Chains and Queueing Theory."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1432682104"
                        ],
                        "name": "W. Nagel",
                        "slug": "W.-Nagel",
                        "structuredName": {
                            "firstName": "Wilibald",
                            "lastName": "Nagel",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Nagel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 151324244,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "fb6b867fe0b93072528adee9e48c47f91d334867",
            "isKey": false,
            "numCitedBy": 324,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Handbuch-der-Physiologie-des-Menschen.-Nagel",
            "title": {
                "fragments": [],
                "text": "Handbuch der Physiologie des Menschen."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1905
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5828345"
                        ],
                        "name": "L. Marks",
                        "slug": "L.-Marks",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Marks",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Marks"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This issue as to whether there is any contribution from the 'blue' mechanism to an achromatic channel is debated in the literature (Guth et al. I980; Smith & Pokorny 1975; Drum I98I; Eisner & MacLeod I980; Marks 1974; Whittle 1974; VOs & Walraven I97I, I972a, b; Boynton 1979) and is further discussed ?4(b) (i)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 144169579,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "edb264ba03aab7097a5fa1ab3f9c60bea464efb9",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Blue-sensitive-cones-can-mediate-brightness-Marks",
            "title": {
                "fragments": [],
                "text": "Blue-sensitive cones can mediate brightness"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3331395"
                        ],
                        "name": "G. Rota",
                        "slug": "G.-Rota",
                        "structuredName": {
                            "firstName": "Gian-Carlo",
                            "lastName": "Rota",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Rota"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 123998964,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e539c7aa04b260c58abaa7af48e634f0ee8a906a",
            "isKey": false,
            "numCitedBy": 60,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Non-negative-matrices-in-the-mathematical-sciences:-Rota",
            "title": {
                "fragments": [],
                "text": "Non-negative matrices in the mathematical sciences: A. Berman and R. J. Plemmons, Academic Press, 1979, 316 pp."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145523037"
                        ],
                        "name": "D. Jameson",
                        "slug": "D.-Jameson",
                        "structuredName": {
                            "firstName": "Dorothea",
                            "lastName": "Jameson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Jameson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4264042"
                        ],
                        "name": "L. Hurvich",
                        "slug": "L.-Hurvich",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Hurvich",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Hurvich"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120038487,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "cb464080787acab91b4baac3ecb4fd13590bc9df",
            "isKey": false,
            "numCitedBy": 75,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Opponent-Response-Functions-Related-to-Measured-Jameson-Hurvich",
            "title": {
                "fragments": [],
                "text": "Opponent-Response Functions Related to Measured Cone Photopigments*"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50240269"
                        ],
                        "name": "E. Schrödinger",
                        "slug": "E.-Schrödinger",
                        "structuredName": {
                            "firstName": "Erwin",
                            "lastName": "Schrödinger",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Schrödinger"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 222666678,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "1e486b94229956f07b7833418822744ec96fa7f2",
            "isKey": false,
            "numCitedBy": 149,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Grundlinien-einer-Theorie-der-Farbenmetrik-im-Schrödinger",
            "title": {
                "fragments": [],
                "text": "Grundlinien einer Theorie der Farbenmetrik im Tagessehen"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1920
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145712748"
                        ],
                        "name": "T. Young",
                        "slug": "T.-Young",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Young",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Young"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118295717,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c2542c622e42bc4efbd89823d9336a9cda633fa1",
            "isKey": false,
            "numCitedBy": 293,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-the-theory-of-light-and-colours-Young",
            "title": {
                "fragments": [],
                "text": "On the theory of light and colours"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "147324334"
                        ],
                        "name": "Levine Js",
                        "slug": "Levine-Js",
                        "structuredName": {
                            "firstName": "Levine",
                            "lastName": "Js",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Levine Js"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70601818"
                        ],
                        "name": "Macnichol Ef",
                        "slug": "Macnichol-Ef",
                        "structuredName": {
                            "firstName": "Macnichol",
                            "lastName": "Ef",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Macnichol Ef"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 89338810,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "724cde23539f17ce7fb95a4814378faa8542cb25",
            "isKey": false,
            "numCitedBy": 255,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-pigments-in-teleost-fishes-:-effects-of-and-Js-Ef",
            "title": {
                "fragments": [],
                "text": "Visual pigments in teleost fishes : effects of habitat, microhabitat, and behavior on visual system evolution"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145158854"
                        ],
                        "name": "S. Deutsch",
                        "slug": "S.-Deutsch",
                        "structuredName": {
                            "firstName": "Sid",
                            "lastName": "Deutsch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Deutsch"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 82683716,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "16881789c4e6065c9ee319a6e8337508f839e575",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Models-of-the-nervous-system-Deutsch",
            "title": {
                "fragments": [],
                "text": "Models of the nervous system"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3568937"
                        ],
                        "name": "R. M. Boynton",
                        "slug": "R.-M.-Boynton",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Boynton",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. M. Boynton"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This issue as to whether there is any contribution from the 'blue' mechanism to an achromatic channel is debated in the literature (Guth et al. I980; Smith & Pokorny 1975; Drum I98I; Eisner & MacLeod I980; Marks 1974; Whittle 1974; VOs & Walraven I97I, I972a, b; Boynton 1979) and is further discussed ?4(b) (i)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 72788373,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f90a3cc45b23539a558dd71cf1d8fc549c04b7bb",
            "isKey": false,
            "numCitedBy": 690,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Human-color-vision-Boynton",
            "title": {
                "fragments": [],
                "text": "Human color vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4264042"
                        ],
                        "name": "L. Hurvich",
                        "slug": "L.-Hurvich",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Hurvich",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Hurvich"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 64917244,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d0e8b30e1a5cdd10092c4cdfd18c82e70a09818d",
            "isKey": false,
            "numCitedBy": 1032,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Color-vision-Hurvich",
            "title": {
                "fragments": [],
                "text": "Color vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110979"
                        ],
                        "name": "H. V. Trees",
                        "slug": "H.-V.-Trees",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Trees",
                            "middleNames": [
                                "L.",
                                "Van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. V. Trees"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 222404292,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "79d40b4a9a8f2a13ea109dbd26dc83a47560bb48",
            "isKey": false,
            "numCitedBy": 2912,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Detection,-Estimation,-and-Modulation-Theory,-Part-Trees",
            "title": {
                "fragments": [],
                "text": "Detection, Estimation, and Modulation Theory, Part I"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5734863"
                        ],
                        "name": "G. Svaetichin",
                        "slug": "G.-Svaetichin",
                        "structuredName": {
                            "firstName": "Gunnar",
                            "lastName": "Svaetichin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Svaetichin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40866800,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "072f88dff61813f06b28df21ab539cba5d9cdbd2",
            "isKey": false,
            "numCitedBy": 195,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Spectral-response-curves-from-single-cones.-Svaetichin",
            "title": {
                "fragments": [],
                "text": "Spectral response curves from single cones."
            },
            "venue": {
                "fragments": [],
                "text": "Acta physiologica Scandinavica. Supplementum"
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145738735"
                        ],
                        "name": "G. Wald",
                        "slug": "G.-Wald",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Wald",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Wald"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6921590,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "da7a090672bd40a82d08f1530278698469137233",
            "isKey": false,
            "numCitedBy": 325,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "THE-RECEPTORS-OF-HUMAN-COLOR-VISION.-Wald",
            "title": {
                "fragments": [],
                "text": "THE RECEPTORS OF HUMAN COLOR VISION."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1964
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152322443"
                        ],
                        "name": "J. S. Levine",
                        "slug": "J.-S.-Levine",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Levine",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. S. Levine"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5801079"
                        ],
                        "name": "E. MacNichol",
                        "slug": "E.-MacNichol",
                        "structuredName": {
                            "firstName": "Edward F.",
                            "lastName": "MacNichol",
                            "middleNames": [],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. MacNichol"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6668839,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "b736a22efdf0d2bc875770bc37f785bb8e7aacb1",
            "isKey": false,
            "numCitedBy": 161,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visual-pigments-in-teleost-fishes:-effects-of-and-Levine-MacNichol",
            "title": {
                "fragments": [],
                "text": "Visual pigments in teleost fishes: effects of habitat, microhabitat, and behavior on visual system evolution."
            },
            "venue": {
                "fragments": [],
                "text": "Sensory processes"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47944547"
                        ],
                        "name": "P. Whittle",
                        "slug": "P.-Whittle",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Whittle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Whittle"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26572753,
            "fieldsOfStudy": [
                "Psychology",
                "Medicine"
            ],
            "id": "c767cdf29e4886f6ad0017f523a825704f9a8ec6",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Letter:-Intensity-discrimination-between-flashes-do-Whittle",
            "title": {
                "fragments": [],
                "text": "Letter: Intensity discrimination between flashes which do not differ in brightness: some new measurements on the \"blue\" cones."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1974
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Karhunen - Loeve expansion and factor analysis , theoretical remarks and applications"
            },
            "venue": {
                "fragments": [],
                "text": "Information theory statistical decision functions and random"
            },
            "year": 1967
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Report of the US Secretariat on colorimetry and artificial daylight"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1951
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A theory of the ttx and n 3 color mechanisms of Stiles"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Res ."
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "B cone input to achromatic channels"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Some problems of visual perception"
            },
            "venue": {
                "fragments": [],
                "text": "Discussion on vision , Physical Society , London , 1932 . Reprinted in D . L . MacAdam , 1961 , Sources of color science"
            },
            "year": 1932
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Stimulus transformation in the peripheral auditory system"
            },
            "venue": {
                "fragments": [],
                "text": "Recognizing patterns"
            },
            "year": 1968
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Reconstruction of cone - system contribution to colour - opponent neurons in monkey lateral geniculate"
            },
            "venue": {
                "fragments": [],
                "text": "Biol . Cyber ."
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The nature of the 7 CX color mechanism of W . S . Stiles"
            },
            "venue": {
                "fragments": [],
                "text": "J . Physiol . , Lond ."
            },
            "year": 1976
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Influence of adaptation on the effects produced by luminous stimuli"
            },
            "venue": {
                "fragments": [],
                "text": "Handbuch der Physiologie des Menschen"
            },
            "year": 1905
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Grundlinien Theorie der Farbenmetrik im Tagessehen I , II , III"
            },
            "venue": {
                "fragments": [],
                "text": "Ann . Physilc ."
            },
            "year": 1920
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 3
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 86,
        "totalPages": 9
    },
    "page_url": "https://www.semanticscholar.org/paper/Trichromacy,-opponent-colours-coding-and-optimum-in-Buchsbaum-Gottschalk/a641c50f2f3c5e5dd7814af62e0b8b0f15259d09?sort=total-citations"
}