{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2462253"
                        ],
                        "name": "C. Schmid",
                        "slug": "C.-Schmid",
                        "structuredName": {
                            "firstName": "Cordelia",
                            "lastName": "Schmid",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Schmid"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145299933"
                        ],
                        "name": "R. Mohr",
                        "slug": "R.-Mohr",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Mohr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Mohr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 325871,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "49fcd806450d947e56c82ef2b438ad9c484069dc",
            "isKey": false,
            "numCitedBy": 1792,
            "numCiting": 61,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper addresses the problem of retrieving images from large image databases. The method is based on local grayvalue invariants which are computed at automatically detected interest points. A voting algorithm and semilocal constraints make retrieval possible. Indexing allows for efficient retrieval from a database of more than 1,000 images. Experimental results show correct retrieval in the case of partial visibility, similarity transformations, extraneous features, and small perspective deformations."
            },
            "slug": "Local-Grayvalue-Invariants-for-Image-Retrieval-Schmid-Mohr",
            "title": {
                "fragments": [],
                "text": "Local Grayvalue Invariants for Image Retrieval"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "This paper addresses the problem of retrieving images from large image databases with a method based on local grayvalue invariants which are computed at automatically detected interest points and allows for efficient retrieval from a database of more than 1,000 images."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8196487"
                        ],
                        "name": "A. Bimbo",
                        "slug": "A.-Bimbo",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Bimbo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bimbo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1767957"
                        ],
                        "name": "P. Pala",
                        "slug": "P.-Pala",
                        "structuredName": {
                            "firstName": "Pietro",
                            "lastName": "Pala",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Pala"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35066164,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f174aaef217ae1d608549705ea554eac654355b2",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Image retrieval by contents from database is a major research subject in advanced multimedia systems. Effective image retrieval by contents requires that visual image properties are used instead of textual labels to properly index and recover pictorial data. Retrieval by shape similarity given a user-sketched template is particularly challenging, owing to the difficulty to derive a similarity measure that closely conforms to the common perception of similarity by humans. In this paper we present a technique which takes into account global shape properties and is based on elastic matching of sketched templates over the shapes in the images to evaluate similarity ranks. The degree of matching achieved and the elastic deformation energy spent by the sketch to achieve such a match are used to derive a measure of similarity between the sketch and the images in the database and to rank images to be displayed."
            },
            "slug": "Effective-image-retrieval-using-deformable-Bimbo-Pala",
            "title": {
                "fragments": [],
                "text": "Effective image retrieval using deformable templates"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This paper presents a technique which takes into account global shape properties and is based on elastic matching of sketched templates over the shapes in the images to evaluate similarity ranks and to rank images to be displayed."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 13th International Conference on Pattern Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50476996"
                        ],
                        "name": "James E. Gary",
                        "slug": "James-E.-Gary",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Gary",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "James E. Gary"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764131"
                        ],
                        "name": "R. Mehrotra",
                        "slug": "R.-Mehrotra",
                        "structuredName": {
                            "firstName": "Rajiv",
                            "lastName": "Mehrotra",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Mehrotra"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123080710,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "52febc8c53a93877035816f41e247dc45160845a",
            "isKey": false,
            "numCitedBy": 55,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "In image database systems, we often want to retrieve images whose contents satisfy certain conditions specified in an iconic query (i.e., queries that involve input images and conditions on them). One type of image data retrieval called shape similarity-based retrieval involves retrieval of images containing one or more shapes similar to the shapes specified in the query or shapes present in the query image. In this paper, a new approach to shape similarity-based retrieval is proposed. The proposed approach is flexible enough to handle images with overlapping or touching parts. In this approach a shape is represented by a set of structural components. Each structural component is encoded as a point in multidimensional space. A similar or identical component (or shape) can be found by organizing the data in any multidimensional point access index structure. A prototype system is described in detail. Some experimental results are also presented to demonstrate the performance of the proposed technique."
            },
            "slug": "Shape-similarity-based-retrieval-in-image-database-Gary-Mehrotra",
            "title": {
                "fragments": [],
                "text": "Shape-similarity-based retrieval in image database systems"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "A new approach to shape similarity-based retrieval is proposed that is flexible enough to handle images with overlapping or touching parts and is described in detail."
            },
            "venue": {
                "fragments": [],
                "text": "Electronic Imaging"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1890284"
                        ],
                        "name": "F. Mokhtarian",
                        "slug": "F.-Mokhtarian",
                        "structuredName": {
                            "firstName": "Farzin",
                            "lastName": "Mokhtarian",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Mokhtarian"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1823411"
                        ],
                        "name": "Sadegh Abbasi",
                        "slug": "Sadegh-Abbasi",
                        "structuredName": {
                            "firstName": "Sadegh",
                            "lastName": "Abbasi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sadegh Abbasi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145801638"
                        ],
                        "name": "J. Kittler",
                        "slug": "J.-Kittler",
                        "structuredName": {
                            "firstName": "Josef",
                            "lastName": "Kittler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kittler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2121487,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "77922051d203b7d8825827e22f2affe152767086",
            "isKey": false,
            "numCitedBy": 308,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The user of an image database often wishes to retrieve all images similar to the one (s)he already has. Using some features like texture, color and shape, we can associate a feature vector to every image in the database. A fast indexing method then can be used to retrieve similar images based on their associated vectors. We use the maxima of curvature zero crossing contours of Curvature Scale Space (CSS) image as a feature vector to represent the shapes of object boundary contours. The matching algorithm which compares two sets of maxima and assigns a matching value as a measure of similarity is presented in this paper. The method is robust with respect to noise, scale and orientation changes of objects. It is also capable to retrieve objects which are similar to the mirror-image of the input boundary. We introduce the aspect ratio of the CSS image as a new parameter which can be used for indexing in conjunction with other parameters like eccentricity and circularity. The method has been tested and evaluated on a prototype database of 450 images of marine animals with a vast variety of shapes with very good results. Since shape similarity is a subjective issue, in order to evaluate the method, we asked a number of volunteers to perform similarity retrieval based on shape on a randomly selected small database. We then compared the results of this experiment to the outputs of our system to the same queries and on the same database. The comparison indicated a promising performance of the system."
            },
            "slug": "Robust-and-Efficient-Shape-Indexing-through-Scale-Mokhtarian-Abbasi",
            "title": {
                "fragments": [],
                "text": "Robust and Efficient Shape Indexing through Curvature Scale Space"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The matching algorithm which compares two sets of maxima and assigns a matching value as a measure of similarity is presented in this paper and introduces the aspect ratio of the CSS image as a new parameter which can be used for indexing in conjunction with other parameters like eccentricity and circularity."
            },
            "venue": {
                "fragments": [],
                "text": "BMVC"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144644545"
                        ],
                        "name": "G. Healey",
                        "slug": "G.-Healey",
                        "structuredName": {
                            "firstName": "Glenn",
                            "lastName": "Healey",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Healey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49326902"
                        ],
                        "name": "D. Slater",
                        "slug": "D.-Slater",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Slater",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Slater"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123174285,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "417223bf6cb49a8c04c07f728322e93298d536f3",
            "isKey": false,
            "numCitedBy": 212,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Color pixel distributions provide a useful cue for object recognition but are dependent on scene illumination. We develop an algorithm that assigns color descriptors to an object that depend on the surface properties of the object and not on the illumination. An object is defined by a set of possibly textured surfaces and gives rise to a color pixel distribution. For a trichromatic system, the algorithm assumes a three-dimensional linear model for surface spectral reflectance. There are no assumptions about the contents of the scene and only weak constraints on the illumination. The global color invariants can be computed in an amount of time that is proportional to the number of pixels that define an object. A set of experiments on complex scenes under various illuminants demonstrates that the global color constancy algorithm performs significantly better than previous recognition algorithms based on color distribution."
            },
            "slug": "Global-color-constancy:-recognition-of-objects-by-Healey-Slater",
            "title": {
                "fragments": [],
                "text": "Global color constancy: recognition of objects by use of illumination-invariant properties of color distributions"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "An algorithm is developed that assigns color descriptors to an object that depend on the surface properties of the object and not on the illumination, and performs significantly better than previous recognition algorithms based on color distribution."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3304188"
                        ],
                        "name": "B. Funt",
                        "slug": "B.-Funt",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Funt",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Funt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1789486"
                        ],
                        "name": "G. Finlayson",
                        "slug": "G.-Finlayson",
                        "structuredName": {
                            "firstName": "Graham",
                            "lastName": "Finlayson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Finlayson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37339880,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "11c4c7af9938b05b366c93aea70ad4e5075f6148",
            "isKey": false,
            "numCitedBy": 694,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Objects can be recognized on the basis of their color alone by color indexing, a technique developed by Swain-Ballard (1991) which involves matching color-space histograms. Color indexing fails, however, when the incident illumination varies either spatially or spectrally. Although this limitation might be overcome by preprocessing with a color constancy algorithm, we instead propose histogramming color ratios. Since the ratios of color RGB triples from neighboring locations are relatively insensitive to changes in the incident illumination, this circumvents the need for color constancy preprocessing. Results of tests with the new color-constant-color-indexing algorithm on synthetic and real images show that it works very well even when the illumination varies spatially in its intensity and color. >"
            },
            "slug": "Color-Constant-Color-Indexing-Funt-Finlayson",
            "title": {
                "fragments": [],
                "text": "Color Constant Color Indexing"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Results of tests with the new color-constant-color-indexing algorithm show that it works very well even when the illumination varies spatially in its intensity and color, which circumvents the need for color constancy preprocessing."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2170732251"
                        ],
                        "name": "Fang Liu",
                        "slug": "Fang-Liu",
                        "structuredName": {
                            "firstName": "Fang",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fang Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719389"
                        ],
                        "name": "Rosalind W. Picard",
                        "slug": "Rosalind-W.-Picard",
                        "structuredName": {
                            "firstName": "Rosalind",
                            "lastName": "Picard",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rosalind W. Picard"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2675336,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b0df54adafa6eb7743e75d5cf0d7d92c1c1eaa72",
            "isKey": false,
            "numCitedBy": 685,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "One of the fundamental challenges in pattern recognition is choosing a set of features appropriate to a class of problems. In applications such as database retrieval, it is important that image features used in pattern comparison provide good measures of image perceptual similarities. We present an image model with a new set of features that address the challenge of perceptual similarity. The model is based on the 2D Wold decomposition of homogeneous random fields. The three resulting mutually orthogonal subfields have perceptual properties which can be described as \"periodicity,\" \"directionality,\" and \"randomness,\" approximating what are indicated to be the three most important dimensions of human texture perception. The method presented improves upon earlier Wold-based models in its tolerance to a variety of local inhomogeneities which arise in natural textures and its invariance under image transformation such as rotation. An image retrieval algorithm based on the new texture model is presented. Different types of image features are aggregated for similarity comparison by using a Bayesian probabilistic approach. The, effectiveness of the Wold model at retrieving perceptually similar natural textures is demonstrated in comparison to that of two other well-known pattern recognition methods. The Wold model appears to offer a perceptually more satisfying measure of pattern similarity while exceeding the performance of these other methods by traditional pattern recognition criteria. Examples of natural scene Wold texture modeling are also presented."
            },
            "slug": "Periodicity,-Directionality,-and-Randomness:-Wold-Liu-Picard",
            "title": {
                "fragments": [],
                "text": "Periodicity, Directionality, and Randomness: Wold Features for Image Modeling and Retrieval"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The Wold model appears to offer a perceptually more satisfying measure of pattern similarity while exceeding the performance of these other methods by traditional pattern recognition criteria."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1919611"
                        ],
                        "name": "Florica Mindru",
                        "slug": "Florica-Mindru",
                        "structuredName": {
                            "firstName": "Florica",
                            "lastName": "Mindru",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Florica Mindru"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2525101"
                        ],
                        "name": "T. Moons",
                        "slug": "T.-Moons",
                        "structuredName": {
                            "firstName": "Theo",
                            "lastName": "Moons",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Moons"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1681236"
                        ],
                        "name": "L. Gool",
                        "slug": "L.-Gool",
                        "structuredName": {
                            "firstName": "Luc",
                            "lastName": "Gool",
                            "middleNames": [
                                "Van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Gool"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15320639,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9c472dda1fdd92de068b3aa060435eff392387e7",
            "isKey": false,
            "numCitedBy": 40,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper contributes to the viewpoint and illumination independent recognition of planar color patterns such as labels, logos, signs, pictograms, etc. by means of moment invariants. It introduces the idea of using powers of the intensities in the different color bands of a color image and combinations thereof for the construction of the moments. First, a complete classification is made of all functions of such moments which are invariant under both affine deformations of the pattern (thus achieving viewpoint invariance) as well as linear changes of the intensity values in the individual color bands (hence, coping with changes in the irradiance pattern due to different lighting conditions and/or viewpoints). The discriminant power and classification performance of these new invariants for color pattern recogniti on has been tested on a data set consisting of images of real outdoors advertising panels. Furthermore, a comparison to moment invariants presented in literature ([1] and [2]) that come closest sto the aimed type of invariants is made and new approaches to improve their performance are presented."
            },
            "slug": "Color-Based-Moment-Invariants-for-Viewpoint-and-of-Mindru-Moons",
            "title": {
                "fragments": [],
                "text": "Color-Based Moment Invariants for Viewpoint and Illumination Independent Recognition of Planar Color Patterns"
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "This paper contributes to the viewpoint and illumination independent recognition of planar color patterns such as labels, logos, signs, pictograms, etc by means of moment invariants by using powers of the intensities in the different color bands of a color image and combinations thereof for the construction of the moments."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1789486"
                        ],
                        "name": "G. Finlayson",
                        "slug": "G.-Finlayson",
                        "structuredName": {
                            "firstName": "Graham",
                            "lastName": "Finlayson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Finlayson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113355723"
                        ],
                        "name": "Subho S. Chatterjee",
                        "slug": "Subho-S.-Chatterjee",
                        "structuredName": {
                            "firstName": "Subho",
                            "lastName": "Chatterjee",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Subho S. Chatterjee"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3304188"
                        ],
                        "name": "B. Funt",
                        "slug": "B.-Funt",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Funt",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Funt"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 8761764,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "59e6bf64f1f489e716ec6857abafa9ff0c9d0a4e",
            "isKey": false,
            "numCitedBy": 132,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "A fast color-based algorithm for recognizing colorful objects and colored textures is presented. Objects and textures are represented by just six numbers. Let r, g and b denote the 3 color bands of the image of an object (stretched out as vectors) then the color angular index comprises the 3 inter-band angles (one per pair of image vectors). The color edge angular index is calculated from the image's color edge map (the Laplacian of the color bands) in a similar way. These angles capture important low-order statistical information about the color and edge distributions and invariant to the spectral power distribution of the scene illuminant. The 6 illumination-invariant angles provide the basis for angular indexing into a database of objects or textures and has been tested on both Swain's database of color objects which were all taken under the same illuminant and Healey and Wang's database of color textures which were taken under several different illuminants. Color angular indexing yields excellent recognition rates for both data sets."
            },
            "slug": "Color-Angular-Indexing-Finlayson-Chatterjee",
            "title": {
                "fragments": [],
                "text": "Color Angular Indexing"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The 6 illumination-invariant angles provide the basis for angular indexing into a database of objects or textures and has been tested on both Swain's database of color objects which were all taken under the same illuminant and Healey and Wang'sdatabase of color textures which were taken under several different illuminants."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1996
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 9,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Content-Based-Image-Retrieval-Based-on-Local-Tuytelaars-Gool/979089260419884b43cfeb3b23df23b6a7734f9f?sort=total-citations"
}