{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1714983"
                        ],
                        "name": "T. Pappas",
                        "slug": "T.-Pappas",
                        "structuredName": {
                            "firstName": "Thrasyvoulos",
                            "lastName": "Pappas",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Pappas"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12256784,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "06cc2b6267a36917bf196be39a7a64393f982023",
            "isKey": false,
            "numCitedBy": 308,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of segmenting images of objects with smooth surfaces is considered. The algorithm we present is a generalization of the ,K-means clustering algorithm to include spatial constraints and to account for local intensity variations in the image. Spatial constraints are included by the use of a Gibbs random field model. Local intensity variations are accounted for in a n iterative procedure involving averaging over a sliding window whose size decreases as the algorithm progresses. Results with an eight-neighbor Gibbs random field model applied to pictures of industrial objects, buildings, aerial photographs, optical characters, and faces, show that the algorithm performs better than the K-means algorithm and its nonadaptive extensions that incorporate spatial constraints by the use of Gibbs random fields. A hierarchical implementation is also presented and results in better performance and faster speed of execution. The segmented images are caricatures of the originals which preserve the most significant features, while removing unimportant details. They can be used in image recognition and as crude representations of the image. The caricatures are easy to display or print using a few grey levels and can be coded very efficiently. In particular, segmentation of faces results in binary sketches which preserve the main characteristics of the face, so that it is easily recognizable. I. INTRODUCTION E present a technique for segmenting a grey-scale image (typically 2.56 levels) into regions of uniform or slowly varying intensity. The segmented image consists of very few levels (typically 2-4). each denoting a different region, as shown in Fig. 1. It is a sketch, or caricature, of the original image which preserves its most significant features, while removing unimportant details. It can thus be the first stage of an image recognition system. However, assuming that the segmented image retains the intelligibility of the original, it can also be used as a crude representation of the image. The caricature has the advantage that it is easy to display or print with very few grey levels. The number of levels is crucial for special display media like paper, cloth, and binary computer screens. Also, the caricature can be coded very efficiently , since we only have to code the transitions between a few grey levels. We develop an algorithm that separates the pixels in the image into clusters based on both their intensity and their"
            },
            "slug": "An-Adaptive-Clustering-Algorithm-For-Image-Pappas",
            "title": {
                "fragments": [],
                "text": "An Adaptive Clustering Algorithm For Image Segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "An algorithm that separates the pixels in the image into clusters based on both their intensity and their clusters is developed, which performs better than the K-means algorithm and its nonadaptive extensions that incorporate spatial constraints by the use of Gibbs random fields."
            },
            "venue": {
                "fragments": [],
                "text": "[1988 Proceedings] Second International Conference on Computer Vision"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685020"
                        ],
                        "name": "D. Comaniciu",
                        "slug": "D.-Comaniciu",
                        "structuredName": {
                            "firstName": "Dorin",
                            "lastName": "Comaniciu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Comaniciu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145776090"
                        ],
                        "name": "P. Meer",
                        "slug": "P.-Meer",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Meer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Meer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 23
                            }
                        ],
                        "text": ", color space analysis [4], face tracking [1])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14402029,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "410abafed76d3ffd075b0e155e7b71e465efd126",
            "isKey": false,
            "numCitedBy": 818,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "A general technique for the recovery of significant image features is presented. The technique is based on the mean shift algorithm, a simple nonparametric procedure for estimating density gradients. Drawbacks of the current methods (including robust clustering) are avoided. Feature space of any nature can be processed, and as an example, color image segmentation is discussed. The segmentation is completely autonomous, only its class is chosen by the user. Thus, the same program can produce a high quality edge image, or provide, by extracting all the significant colors, a preprocessor for content-based query systems. A 512/spl times/512 color image is analyzed in less than 10 seconds on a standard workstation. Gray level images are handled as color images having only the lightness coordinate."
            },
            "slug": "Robust-analysis-of-feature-spaces:-color-image-Comaniciu-Meer",
            "title": {
                "fragments": [],
                "text": "Robust analysis of feature spaces: color image segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 91,
                "text": "A general technique for the recovery of significant image features is presented, based on the mean shift algorithm, a simple nonparametric procedure for estimating density gradients."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145380991"
                        ],
                        "name": "Song-Chun Zhu",
                        "slug": "Song-Chun-Zhu",
                        "structuredName": {
                            "firstName": "Song-Chun",
                            "lastName": "Zhu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Song-Chun Zhu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35561340,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "73bd5c30eb274671c30b8f7222b5e4b03a915a62",
            "isKey": false,
            "numCitedBy": 2286,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a novel statistical and variational approach to image segmentation based on a new algorithm, named region competition. This algorithm is derived by minimizing a generalized Bayes/minimum description length (MDL) criterion using the variational principle. The algorithm is guaranteed to converge to a local minimum and combines aspects of snakes/balloons and region growing. The classic snakes/balloons and region growing algorithms can be directly derived from our approach. We provide theoretical analysis of region competition including accuracy of boundary location, criteria for initial conditions, and the relationship to edge detection using filters. It is straightforward to generalize the algorithm to multiband segmentation and we demonstrate it on gray level images, color images and texture images. The novel color model allows us to eliminate intensity gradients and shadows, thereby obtaining segmentation based on the albedos of objects. It also helps detect highlight regions."
            },
            "slug": "Region-Competition:-Unifying-Snakes,-Region-and-for-Zhu-Yuille",
            "title": {
                "fragments": [],
                "text": "Region Competition: Unifying Snakes, Region Growing, and Bayes/MDL for Multiband Image Segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "A novel statistical and variational approach to image segmentation based on a new algorithm, named region competition, derived by minimizing a generalized Bayes/minimum description length (MDL) criterion using the variational principle is presented."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1714983"
                        ],
                        "name": "T. Pappas",
                        "slug": "T.-Pappas",
                        "structuredName": {
                            "firstName": "Thrasyvoulos",
                            "lastName": "Pappas",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Pappas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143623909"
                        ],
                        "name": "N. Jayant",
                        "slug": "N.-Jayant",
                        "structuredName": {
                            "firstName": "Nikil",
                            "lastName": "Jayant",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Jayant"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32002313,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "484f990d668a5211b78a60d07144df49838c4132",
            "isKey": false,
            "numCitedBy": 246,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of segmenting images of objects with smooth surfaces is considered. The algorithm that is presented is a generalization of the K-means clustering algorithm to include spatial constraints and to account for local intensity variations in the image. Spatial constraints are included by the use of a Gibbs random field model. Local intensity variations are accounted for in an iterative procedure involving averaging over a sliding window whose size decreases as the algorithm progresses. Results with an 8-neighbor Gibbs random field model applied to pictures of industrial objects, buildings, aerial photographs, optical characters, and faces show that the algorithm performs better than the K-means algorithm and its nonadaptive extensions that incorporate spatial constraints by the use of Gibbs random fields. A hierarchical implementation is also presented that results in better performance and faster speed of execution. The segmented images are caricatures of the originals which preserve the most significant features, while removing unimportant details. They can be used in image recognition and as crude representations of the image. >"
            },
            "slug": "An-adaptive-clustering-algorithm-for-image-Pappas-Jayant",
            "title": {
                "fragments": [],
                "text": "An adaptive clustering algorithm for image segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Results with an eight-neighbor Gibbs random field model applied to pictures of industrial objects and a variety of other images show that the algorithm performs better than the K-means algorithm and its nonadaptive extensions."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Signal Process."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685089"
                        ],
                        "name": "Pedro F. Felzenszwalb",
                        "slug": "Pedro-F.-Felzenszwalb",
                        "structuredName": {
                            "firstName": "Pedro",
                            "lastName": "Felzenszwalb",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Pedro F. Felzenszwalb"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713089"
                        ],
                        "name": "D. Huttenlocher",
                        "slug": "D.-Huttenlocher",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Huttenlocher",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Huttenlocher"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8281255,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2f39500bbfbbcfce89d5a1edba18ca76892ee93c",
            "isKey": false,
            "numCitedBy": 277,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new graph-theoretic approach to the problem of image segmentation. Our method uses local criteria and yet produces results that reflect global properties of the image. We develop a framework that provides specific definitions of what it means for an image to be under- or over-segmented. We then present an efficient algorithm for computing a segmentation that is neither under- nor over-segmented according to these definitions. Our segmentation criterion is based on intensity differences between neighboring pixels. An important characteristic of the approach is that it is able to preserve detail in low-variability regions while ignoring detail in high-variability regions, which we illustrate with several examples on both real and synthetic images."
            },
            "slug": "Image-segmentation-using-local-variation-Felzenszwalb-Huttenlocher",
            "title": {
                "fragments": [],
                "text": "Image segmentation using local variation"
            },
            "tldr": {
                "abstractSimilarityScore": 53,
                "text": "A new graph-theoretic approach to the problem of image segmentation that is able to preserve detail in low-variability regions while ignoring detail in high-Variability regions, which is illustrated with several examples on both real and synthetic images."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. 1998 IEEE Computer Society Conference on Computer Vision and Pattern Recognition (Cat. No.98CB36231)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145086151"
                        ],
                        "name": "Carlo Tomasi",
                        "slug": "Carlo-Tomasi",
                        "structuredName": {
                            "firstName": "Carlo",
                            "lastName": "Tomasi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Carlo Tomasi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737048"
                        ],
                        "name": "R. Manduchi",
                        "slug": "R.-Manduchi",
                        "structuredName": {
                            "firstName": "Roberto",
                            "lastName": "Manduchi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Manduchi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 95
                            }
                        ],
                        "text": "We note here two important di erences between the mean shift and bilateral ltering proposed by Tomasi and Manduchi [16]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 48
                            }
                        ],
                        "text": "In addition, the ltering iterations proposed in [16] do not have a stopping criterion."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 155,
                                "start": 151
                            }
                        ],
                        "text": "4 Comparison to Bilateral Filtering We note here two important di erences between the mean shift and bilateral ltering proposed by Tomasi and Manduchi [16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 43
                            }
                        ],
                        "text": "A similar idea was exploited di erently in [16]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 14308539,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "bfeaf424a2ea6ca4702d545c6e959e2caeb68e9b",
            "isKey": true,
            "numCitedBy": 8332,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "Bilateral filtering smooths images while preserving edges, by means of a nonlinear combination of nearby image values. The method is noniterative, local, and simple. It combines gray levels or colors based on both their geometric closeness and their photometric similarity, and prefers near values to distant values in both domain and range. In contrast with filters that operate on the three bands of a color image separately, a bilateral filter can enforce the perceptual metric underlying the CIE-Lab color space, and smooth colors and preserve edges in a way that is tuned to human perception. Also, in contrast with standard filtering, bilateral filtering produces no phantom colors along edges in color images, and reduces phantom colors where they appear in the original image."
            },
            "slug": "Bilateral-filtering-for-gray-and-color-images-Tomasi-Manduchi",
            "title": {
                "fragments": [],
                "text": "Bilateral filtering for gray and color images"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "In contrast with filters that operate on the three bands of a color image separately, a bilateral filter can enforce the perceptual metric underlying the CIE-Lab color space, and smooth colors and preserve edges in a way that is tuned to human perception."
            },
            "venue": {
                "fragments": [],
                "text": "Sixth International Conference on Computer Vision (IEEE Cat. No.98CH36271)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2065808108"
                        ],
                        "name": "Pietro Perona",
                        "slug": "Pietro-Perona",
                        "structuredName": {
                            "firstName": "Pietro",
                            "lastName": "Perona",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Pietro Perona"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143751119"
                        ],
                        "name": "Jitendra Malik",
                        "slug": "Jitendra-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jitendra Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 78,
                                "start": 70
                            }
                        ],
                        "text": "The same observation is valid for other adaptive smoothing techniques [10, 11]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14502908,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "496c3d75b81b336411e53da1ac632a8139655604",
            "isKey": false,
            "numCitedBy": 12585,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "A new definition of scale-space is suggested, and a class of algorithms used to realize a diffusion process is introduced. The diffusion coefficient is chosen to vary spatially in such a way as to encourage intraregion smoothing rather than interregion smoothing. It is shown that the 'no new maxima should be generated at coarse scales' property of conventional scale space is preserved. As the region boundaries in the approach remain sharp, a high-quality edge detector which successfully exploits global information is obtained. Experimental results are shown on a number of images. Parallel hardware implementations are made feasible because the algorithm involves elementary, local operations replicated over the image. >"
            },
            "slug": "Scale-Space-and-Edge-Detection-Using-Anisotropic-Perona-Malik",
            "title": {
                "fragments": [],
                "text": "Scale-Space and Edge Detection Using Anisotropic Diffusion"
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "A new definition of scale-space is suggested, and a class of algorithms used to realize a diffusion process is introduced, chosen to vary spatially in such a way as to encourage intra Region smoothing rather than interregion smoothing."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144697034"
                        ],
                        "name": "M. Tabb",
                        "slug": "M.-Tabb",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Tabb",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Tabb"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145237406"
                        ],
                        "name": "N. Ahuja",
                        "slug": "N.-Ahuja",
                        "structuredName": {
                            "firstName": "Narendra",
                            "lastName": "Ahuja",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Ahuja"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 107,
                                "start": 103
                            }
                        ],
                        "text": "It is interesting to contrast the mean shift segmentation with those based on the attraction force eld [14] and edge ow propagation [8]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 39,
                                "start": 35
                            }
                        ],
                        "text": "The attraction force eld de ned in [14] is computed at each pixel as a vector sum of pairwise a nities between the current pixel and all other pixels."
                    },
                    "intents": []
                }
            ],
            "corpusId": 628238,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "01d8ae06325c95430793a903ffc5cea0145912e9",
            "isKey": false,
            "numCitedBy": 246,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper is concerned with the detection of low-level structure in images. It describes an algorithm for image segmentation at multiple scales. The detected regions are homogeneous and surrounded by closed edge contours. Previous approaches to multiscale segmentation represent an image at different scales using a scale-space. However, structure is only represented implicitly in this representation, structures at coarser scales are inherently smoothed, and the problem of structure extraction is unaddressed. This paper argues that the issues of scale selection and structure detection cannot be treated separately. A new concept of scale is presented that represents image structures at different scales, and not the image itself. This scale is integrated into a nonlinear transform which makes structure explicit in the transformed domain. Structures that are stable (locally invariant) to changes in scale are identified as being perceptually relevant. The transform can be viewed as collecting spatially distributed evidence for edges and regions, and making it available at contour locations, thereby facilitating integrated detection of edges and regions without restrictive models of geometry or homogeneity. In this sense, it performs Gestalt analysis. All scale parameters of the transform are automatically determined, and the structure of any arbitrary geometry can be identified without any smoothing, even at coarse scales."
            },
            "slug": "Multiscale-image-segmentation-by-integrated-edge-Tabb-Ahuja",
            "title": {
                "fragments": [],
                "text": "Multiscale image segmentation by integrated edge and region detection"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is argued that the issues of scale selection and structure detection cannot be treated separately and a new concept of scale is presented that represents image structures at different scales, and not the image itself."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1402187438"
                        ],
                        "name": "P. Saint-Marc",
                        "slug": "P.-Saint-Marc",
                        "structuredName": {
                            "firstName": "Philippe",
                            "lastName": "Saint-Marc",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Saint-Marc"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115896375"
                        ],
                        "name": "Jer-Sen Chen",
                        "slug": "Jer-Sen-Chen",
                        "structuredName": {
                            "firstName": "Jer-Sen",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jer-Sen Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3463966"
                        ],
                        "name": "G. Medioni",
                        "slug": "G.-Medioni",
                        "structuredName": {
                            "firstName": "Gérard",
                            "lastName": "Medioni",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Medioni"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 78,
                                "start": 70
                            }
                        ],
                        "text": "The same observation is valid for other adaptive smoothing techniques [10, 11]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 11541559,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "35e0783d91ab02cf757203c7a26d7982815e4ccf",
            "isKey": false,
            "numCitedBy": 463,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors present a method to smooth a signal-whether it is an intensity image, a range image, or a contour-which preserves discontinuities and thus facilitates their detection. This is achieved by repeatedly convolving the signal with a very small averaging filter modulated by a measure of the signal discontinuity at each point. This process is related to the anisotropic diffusion reported by P. Perona and J. Malik (1987) but it has a much simpler formulation and is not subject to instability or divergence. Real examples show how this approach can be applied to the smoothing of various types of signals. The detected features do not move, and thus no tracking is needed. The last property makes it possible to derive a novel scale-space representation of a signal using a small number of scales. Finally, this process is easily implemented on parallel architectures: the running time on a 16 K connection machine is three orders of magnitude faster than on a serial machine.<<ETX>>"
            },
            "slug": "Adaptive-smoothing:-a-general-tool-for-early-vision-Saint-Marc-Chen",
            "title": {
                "fragments": [],
                "text": "Adaptive smoothing: a general tool for early vision"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "The authors present a method to smooth a signal-whether it is an intensity image, a range image, or a contour-which preserves discontinuities and thus facilitates their detection and makes it possible to derive a novel scale-space representation of a signal using a small number of scales."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings CVPR '89: IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49097100"
                        ],
                        "name": "Yizong Cheng",
                        "slug": "Yizong-Cheng",
                        "structuredName": {
                            "firstName": "Yizong",
                            "lastName": "Cheng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yizong Cheng"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 91
                            }
                        ],
                        "text": "The convergence of the mean shift has been justi ed as a consequence of relation (7), (see [2])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14842224,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1c168275c59ba382588350ee1443537f59978183",
            "isKey": false,
            "numCitedBy": 3718,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "Mean shift, a simple interactive procedure that shifts each data point to the average of data points in its neighborhood is generalized and analyzed in the paper. This generalization makes some k-means like clustering algorithms its special cases. It is shown that mean shift is a mode-seeking process on the surface constructed with a \"shadow\" kernal. For Gaussian kernels, mean shift is a gradient mapping. Convergence is studied for mean shift iterations. Cluster analysis if treated as a deterministic problem of finding a fixed point of mean shift that characterizes the data. Applications in clustering and Hough transform are demonstrated. Mean shift is also considered as an evolutionary strategy that performs multistart global optimization. >"
            },
            "slug": "Mean-Shift,-Mode-Seeking,-and-Clustering-Cheng",
            "title": {
                "fragments": [],
                "text": "Mean Shift, Mode Seeking, and Clustering"
            },
            "tldr": {
                "abstractSimilarityScore": 86,
                "text": "Mean shift, a simple interactive procedure that shifts each data point to the average of data points in its neighborhood is generalized and analyzed and makes some k-means like clustering algorithms its special cases."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712167"
                        ],
                        "name": "Wei-Ying Ma",
                        "slug": "Wei-Ying-Ma",
                        "structuredName": {
                            "firstName": "Wei-Ying",
                            "lastName": "Ma",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Wei-Ying Ma"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50591689"
                        ],
                        "name": "B. S. Manjunath",
                        "slug": "B.-S.-Manjunath",
                        "structuredName": {
                            "firstName": "B.",
                            "lastName": "Manjunath",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. S. Manjunath"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 18,
                                "start": 15
                            }
                        ],
                        "text": "The edge ow in [8] is obtained at each location for a given set of directions as the magnitude of the gradient of a smoothed image."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 132
                            }
                        ],
                        "text": "It is interesting to contrast the mean shift segmentation with those based on the attraction force eld [14] and edge ow propagation [8]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2056985,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "97d9d482881a62253e575ac7ace540181ba55bbf",
            "isKey": false,
            "numCitedBy": 278,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "A novel boundary detection scheme based on \"edge flow\" is proposed in this paper. This scheme utilizes a predictive coding model to identify the direction of change in color and texture at each image location at a given scale, and constructs an edge flow vector. By iteratively propagating the edge flow, the boundaries can be detected at image locations which encounter two opposite directions of flow in the stable state. A user defined image scale is the only significant control parameter that is needed by the algorithm. The scheme facilitates integration of color and texture into a single framework for boundary detection."
            },
            "slug": "Edge-flow:-A-framework-of-boundary-detection-and-Ma-Manjunath",
            "title": {
                "fragments": [],
                "text": "Edge flow: A framework of boundary detection and image segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 85,
                "text": "A novel boundary detection scheme based on \"edge flow\" that utilizes a predictive coding model to identify the direction of change in color and texture at each image location at a given scale, and constructs an edge flow vector."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2111048229"
                        ],
                        "name": "Kyujin Cho",
                        "slug": "Kyujin-Cho",
                        "structuredName": {
                            "firstName": "Kyujin",
                            "lastName": "Cho",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kyujin Cho"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145776090"
                        ],
                        "name": "P. Meer",
                        "slug": "P.-Meer",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Meer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Meer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8967054,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cf6ab0aa66eea68b34fd6d78461b8198a6b7a063",
            "isKey": false,
            "numCitedBy": 91,
            "numCiting": 100,
            "paperAbstract": {
                "fragments": [],
                "text": "A new approach toward image segmentation is proposed. A set of slightly different segmentations is derived from the same input and the final result is based on the consensus among them. The perturbations are introduced by exploiting the probabilistic component of a region adjacency graph (RAG) pyramid-based segmentation. From the set of initial segmentations the cooccurrence probability field is obtained in which global information about the delineated regions becomes locally available. The final segmentation is based on this field and is obtained with the same hierarchical, RAG pyramid technique. No user set parameters or context-dependent thresholds are required."
            },
            "slug": "Image-Segmentation-from-Consensus-Information-Cho-Meer",
            "title": {
                "fragments": [],
                "text": "Image Segmentation from Consensus Information"
            },
            "tldr": {
                "abstractSimilarityScore": 84,
                "text": "A new approach toward image segmentation is proposed in which a set of slightly different segmentations is derived from the same input and the final result is based on the consensus among them, using the hierarchical, RAG pyramid technique."
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Image Underst."
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1720184"
                        ],
                        "name": "G. Bradski",
                        "slug": "G.-Bradski",
                        "structuredName": {
                            "firstName": "Gary",
                            "lastName": "Bradski",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Bradski"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 45,
                                "start": 42
                            }
                        ],
                        "text": ", color space analysis [4], face tracking [1])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 12002813,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2fe88db144825e3fa72a8fae1e307cc7d056db5c",
            "isKey": false,
            "numCitedBy": 666,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "As a step towards a perceptual user interface, an object tracking algorithm is developed and demonstrated tracking human faces. Computer vision algorithms that are intended to form part of a perceptual user interface must be fast and efficient. They must be able to track in real time and yet not absorb a major share of computational resources. An efficient, new algorithm is described here based on the mean shift algorithm. The mean shift algorithm robustly finds the mode (peak) of probability distributions. We first describe histogram based methods of producing object probability distributions. In our case, we want to track the mode of an object's probability distribution within a video scene. Since the probability distribution of the object can change and move dynamically in time, the mean shift algorithm is modified to deal with dynamically changing probability distributions. The modified algorithm is called the Continuously Adaptive Mean Shift (CAMSHIFT) algorithm. CAMSHIFT is then used as an interface for games and graphics."
            },
            "slug": "Real-time-face-and-object-tracking-as-a-component-a-Bradski",
            "title": {
                "fragments": [],
                "text": "Real time face and object tracking as a component of a perceptual user interface"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An efficient, new algorithm is described here based on the mean shift algorithm, which robustly finds the mode (peak) of probability distributions within a video scene and is used as an interface for games and graphics."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings Fourth IEEE Workshop on Applications of Computer Vision. WACV'98 (Cat. No.98EX201)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2295441"
                        ],
                        "name": "K. Fukunaga",
                        "slug": "K.-Fukunaga",
                        "structuredName": {
                            "firstName": "Keinosuke",
                            "lastName": "Fukunaga",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Fukunaga"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2322936"
                        ],
                        "name": "L. Hostetler",
                        "slug": "L.-Hostetler",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Hostetler",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Hostetler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15299210,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "98431da7222ee3fe12d277facf5ca1561c56d4f3",
            "isKey": false,
            "numCitedBy": 2993,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Nonparametric density gradient estimation using a generalized kernel approach is investigated. Conditions on the kernel functions are derived to guarantee asymptotic unbiasedness, consistency, and uniform consistency of the estimates. The results are generalized to obtain a simple mcan-shift estimate that can be extended in a k -nearest-neighbor approach. Applications of gradient estimation to pattern recognition are presented using clustering and intrinsic dimensionality problems, with the ultimate goal of providing further understanding of these problems in terms of density gradients."
            },
            "slug": "The-estimation-of-the-gradient-of-a-density-with-in-Fukunaga-Hostetler",
            "title": {
                "fragments": [],
                "text": "The estimation of the gradient of a density function, with applications in pattern recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "Applications of gradient estimation to pattern recognition are presented using clustering and intrinsic dimensionality problems, with the ultimate goal of providing further understanding of these problems in terms of density gradients."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49800308"
                        ],
                        "name": "B. Silverman",
                        "slug": "B.-Silverman",
                        "structuredName": {
                            "firstName": "Bernard",
                            "lastName": "Silverman",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Silverman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 67073029,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "729cb7a620b4e81b63b281627474020cdfbadd39",
            "isKey": false,
            "numCitedBy": 7449,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Introduction. Survey of Existing Methods. The Kernel Method for Univariate Data. The Kernel Method for Multivariate Data. Three Important Methods. Density Estimation in Action."
            },
            "slug": "Density-Estimation-for-Statistics-and-Data-Analysis-Silverman",
            "title": {
                "fragments": [],
                "text": "Density Estimation for Statistics and Data Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The Kernel Method for Multivariate Data: Three Important Methods and Density Estimation in Action."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2262508"
                        ],
                        "name": "J. Simonoff",
                        "slug": "J.-Simonoff",
                        "structuredName": {
                            "firstName": "Jeffrey",
                            "lastName": "Simonoff",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Simonoff"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118542831,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b61e3381c76dbf0ab5c9e864451dab5b2a7b235f",
            "isKey": false,
            "numCitedBy": 1101,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Exploring and identifying structure is even more important for multivariate data than univariate data, given the difficulties in graphically presenting multivariate data and the comparative lack of parametric models to represent it. Unfortunately, such exploration is also inherently more difficult."
            },
            "slug": "Multivariate-Density-Estimation-Simonoff",
            "title": {
                "fragments": [],
                "text": "Multivariate Density Estimation"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Exploring and identifying structure is even more important for multivariate data than univariate data, given the difficulties in graphically presenting multivariateData and the comparative lack of parametric models to represent it."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "corpusId": 125253656,
            "fieldsOfStudy": [],
            "id": "b211079aac55cd6ddb136e4f37b4f90f2ccefda4",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Density Estimation for Statistics and Data Analysis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "corpusId": 197460482,
            "fieldsOfStudy": [],
            "id": "1fa2aa68ac2c4652c689c03964832d4bf7d1de56",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Density estimation for statistics and data analysis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69499807"
                        ],
                        "name": "G. Terrell",
                        "slug": "G.-Terrell",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Terrell",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Terrell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46345617"
                        ],
                        "name": "D. W. Scott",
                        "slug": "D.-W.-Scott",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Scott",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. W. Scott"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 140,
                                "start": 136
                            }
                        ],
                        "text": "To take into account the nonstationarity of the input adaptive kernel estimation techniques were proposed in the statistical literature [15], however for less complex data."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 121521074,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "cde9f8b8429568da491e741e813253bf46de8421",
            "isKey": false,
            "numCitedBy": 463,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Variable-Kernel-Density-Estimation-Terrell-Scott",
            "title": {
                "fragments": [],
                "text": "Variable Kernel Density Estimation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Unifying Snakes , Region Growing , and Bayes / MDL for Multi - band Image Segmentation \""
            },
            "venue": {
                "fragments": [],
                "text": "The Annals of Statistics"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Segmentation Using Local Variation"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. IEEE Conf. on Comp. Vis. and Pattern Recognition, Santa Barbara,"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Mode Seeking, and Clustering Robust Analysis of Feature Spaces: Color Image Segmentation"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Conf. Comp. Vis. and Pattern Recogn"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 92,
                                "start": 89
                            }
                        ],
                        "text": "In this paper we describe a new application based on the theoretical results obtained in [5]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Distribution Free Decompo-  sition of Multivariate Data"
            },
            "venue": {
                "fragments": [],
                "text": "To appear. Pattern Anal.  and Application"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A F ramework of Boundary Detection and Image Segmentation"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. IEEE Conf. on Comp. Vis. and Pattern Recognition"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Region Competition: Unifying  Snakes"
            },
            "venue": {
                "fragments": [],
                "text": "Region Growing, and Bayes/MDL for Multi-  band Image Segmentation\", IEEE Trans. Pattern Anal.  Machine Intell., vol. 18, 884{900"
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A Framework of Boundary Detection and Image Segmentation"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. IEEE Conf. on Comp. Vis. and Pattern Recognition"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Real Time Face and Object Tracking as a Component o f a P erceptual User Interface"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Workshop Applications of Comp. Vis. Hand image. a Original. b Contours s"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Variable Density Estimation The Annals of Statistics, v ol Bilateral Filtering for Gray and Color Images"
            },
            "venue": {
                "fragments": [],
                "text": "Int'l Conf. Comp. Vis"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\\Variable Density Estimation The Annals of Statistics, v ol"
            },
            "venue": {
                "fragments": [],
                "text": "\\Variable Density Estimation The Annals of Statistics, v ol"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 140,
                                "start": 136
                            }
                        ],
                        "text": "To take into account the nonstationarity of the input adaptive kernel estimation techniques were proposed in the statistical literature [15], however for less complex data."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Variable Density Estima-  tion"
            },
            "venue": {
                "fragments": [],
                "text": "The Annals of Statistics, vol. 20, 1236-1265"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Mode Seeking, and Clustering"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Machine Intell"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Ahuja, \\Multiscale Image Segmentation by I n tegrated Edge and Region Detection"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Edge Flow: A F ramework of Boundary Detection and Image Segmentation"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Conf. Comp. Vis. and Pattern Recogn"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Analysis of Feature Spaces: Color Image Segmentation"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. IEEE Conf. on Comp. Vis. and Pattern Recognition"
            },
            "year": 1997
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 8,
            "methodology": 4
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 34,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Mean-shift-analysis-and-applications-Comaniciu-Meer/cebc494c81f85fa9739b049a9930df6cbd68b587?sort=total-citations"
}