{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61055139,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "f88d8eaaaa6ee02d59c834370b1c8621f1bc6034",
            "isKey": false,
            "numCitedBy": 47,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "29-Optical-character-recognition-Theory-and-Nagy",
            "title": {
                "fragments": [],
                "text": "29 Optical character recognition - Theory and practice"
            },
            "venue": {
                "fragments": [],
                "text": "Classification, Pattern Recognition and Reduction of Dimensionality"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14021419"
                        ],
                        "name": "G. L. Shelton",
                        "slug": "G.-L.-Shelton",
                        "structuredName": {
                            "firstName": "Glenmore",
                            "lastName": "Shelton",
                            "middleNames": [
                                "L."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. L. Shelton"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17307660,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aad32ef13f9c66c413c160ff63571d14690c4279",
            "isKey": false,
            "numCitedBy": 77,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "The output of a simple statistical categorizer is used to improve recognition performance on a homogeneous data set. An array of initial weights contains a coarse description of the various classes; as the system cycles through a set of characters from the same source (a typewritten or printed page), the weights are modified to correspond more closely with the observed distributions. The true identifies of the characters remain inaccessible throughout the training cycle. This experimental study of the effect of the various parameters in the algorithm is based on \\sim 30 000 characters from fourteen different font styles. A fivefold average decrease over the initial rates is obtained in both errors and rejects."
            },
            "slug": "Self-corrective-character-recognition-system-Nagy-Shelton",
            "title": {
                "fragments": [],
                "text": "Self-corrective character recognition system"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "The output of a simple statistical categorizer is used to improve recognition performance on a homogeneous data set and a fivefold average decrease over the initial rates is obtained in both errors and rejects."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26160641,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d31d60611800daa24fc8405e61fd1115e033bf2f",
            "isKey": false,
            "numCitedBy": 63,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The author assesses the current status of the field and places the problem of Chinese recognition into perspective with other areas of optical character recognition. Early experiments are briefly reviewed, and sources of more up-to-date information, including review articles, are indicated, advances in computer technology are discussed that have had a significant impact on the problem, and a sampling of relatively recent research on the classification of both printed and handprinted ideographs is presented. Included in the discussion are techniques of preprocessing (character location and segmentation) and hierarchical classification.<<ETX>>"
            },
            "slug": "Chinese-character-recognition:-a-twenty-five-year-Nagy",
            "title": {
                "fragments": [],
                "text": "Chinese character recognition: a twenty-five-year retrospective"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The author assesses the current status of the field and places the problem of Chinese recognition into perspective with other areas of optical character recognition."
            },
            "venue": {
                "fragments": [],
                "text": "[1988 Proceedings] 9th International Conference on Pattern Recognition"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34896449"
                        ],
                        "name": "R. Casey",
                        "slug": "R.-Casey",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Casey",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Casey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1392835809"
                        ],
                        "name": "C. R. Jih",
                        "slug": "C.-R.-Jih",
                        "structuredName": {
                            "firstName": "Chentung",
                            "lastName": "Jih",
                            "middleNames": [
                                "Robert"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. R. Jih"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 207561038,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "86852f9b2a4bb35fd319fb618867caed9148c890",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "A low-cost optical character recognition (OCR) system can be realized by means of a document scanner connected to a CPU through an interface. The interface performs elementary image processing functions, such as noise filtering and thresholding of the video image from the scanner. The processor receives a binary image of the document, formats the image into individual character patterns, and classifies the patterns one-by-one. A CPU implementation is highly flexible and avoids much of the development and manufacturing costs for special-purpose, parallel circuitry typically used in commercial OCR. A processor-based recognition system has been investigated for reading documents printed in fixed-pitch conventional type fonts, such as occur in routine office typing. Novel, efficient methods for tracking a print line, resolving it into individual character patterns, detecting underscores, and eliminating noise have been devised. A previously developed classification technique, based on decision trees, has been extended in order to improve reading accuracy in an environment of considerable character variation, including the possibility that documents in the same font style may be produced using quite different print technologies. The system has been tested on typical office documents, and also on artificial stress documents, obtained from a variety of typewriters."
            },
            "slug": "A-Processor-Based-OCR-System-Casey-Jih",
            "title": {
                "fragments": [],
                "text": "A Processor-Based OCR System"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A previously developed classification technique, based on decision trees, has been extended in order to improve reading accuracy in an environment of considerable character variation, including the possibility that documents in the same font style may be produced using quite different print technologies."
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. Dev."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1802391"
                        ],
                        "name": "S. Shlien",
                        "slug": "S.-Shlien",
                        "structuredName": {
                            "firstName": "Seymour",
                            "lastName": "Shlien",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Shlien"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 33129286,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ba124e1317e9ef9e561b27f49c9d683371789ecf",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "An optical character reader for processing typeset documents must be able to handle proportional spacing, the presence of touching characters and a wide variety of type fonts. This paper describes the design of a multifont character recognizer which uses a binary decision tree to classify a character on the basis of 197 geometric features. The algorithm for designing the decision tree is based upon an entropy minimization procedure, and makes no assumptions on the distribution or independence of the binary features. The decision tree classifier provides confidence measures which may be used to reduce the substitution error rate at the expense of higher rejection rates. Methods of reducing the overall error rate by combining the decision tree classifier with other classifiers were examined. In particular, the paper evaluates the performance of a classifier using a combination of multiple decision trees, template matching and contextual post-processing. Error rates were highly sensitive to typeface and varied between 10 percent and 0.1 percent. Computer processing times for the various stages of the system are presented."
            },
            "slug": "Multifont-Character-Recognition-for-Typeset-Shlien",
            "title": {
                "fragments": [],
                "text": "Multifont Character Recognition for Typeset Documents"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The design of a multifont character recognizer which uses a binary decision tree to classify a character on the basis of 197 geometric features is described, which was highly sensitive to typeface and error rates varied between 10 percent and 0.1 percent."
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Pattern Recognit. Artif. Intell."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39692564"
                        ],
                        "name": "Simon Kahan",
                        "slug": "Simon-Kahan",
                        "structuredName": {
                            "firstName": "Simon",
                            "lastName": "Kahan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Simon Kahan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145820949"
                        ],
                        "name": "T. Pavlidis",
                        "slug": "T.-Pavlidis",
                        "structuredName": {
                            "firstName": "Theodosios",
                            "lastName": "Pavlidis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Pavlidis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 17307726,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0de98bd19065702bb44b8aa5ad43ef6923fdacb0",
            "isKey": false,
            "numCitedBy": 384,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe the current state of a system that recognizes printed text of various fonts and sizes for the Roman alphabet. The system combines several techniques in order to improve the overall recognition rate. Thinning and shape extraction are performed directly on a graph of the run-length encoding of a binary image. The resulting strokes and other shapes are mapped, using a shape-clustering approach, into binary features which are then fed into a statistical Bayesian classifier. Large-scale trials have shown better than 97 percent top choice correct performance on mixtures of six dissimilar fonts, and over 99 percent on most single fonts, over a range of point sizes. Certain remaining confusion classes are disambiguated through contour analysis, and characters suspected of being merged are broken and reclassified. Finally, layout and linguistic context are applied. The results are illustrated by sample pages."
            },
            "slug": "On-the-Recognition-of-Printed-Characters-of-Any-and-Kahan-Pavlidis",
            "title": {
                "fragments": [],
                "text": "On the Recognition of Printed Characters of Any Font and Size"
            },
            "tldr": {
                "abstractSimilarityScore": 91,
                "text": "The current state of a system that recognizes printed text of various fonts and sizes for the Roman alphabet is described, which combines several techniques in order to improve the overall recognition rate."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145822375"
                        ],
                        "name": "G. Toussaint",
                        "slug": "G.-Toussaint",
                        "structuredName": {
                            "firstName": "Godfried",
                            "lastName": "Toussaint",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Toussaint"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4659657,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "848bf8ed51d0dfbef7f7b06b7728d0aab2ff3dc5",
            "isKey": false,
            "numCitedBy": 144,
            "numCiting": 196,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-use-of-context-in-pattern-recognition-Toussaint",
            "title": {
                "fragments": [],
                "text": "The use of context in pattern recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145470231"
                        ],
                        "name": "Kwan Y. Wong",
                        "slug": "Kwan-Y.-Wong",
                        "structuredName": {
                            "firstName": "Kwan",
                            "lastName": "Wong",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kwan Y. Wong"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34896449"
                        ],
                        "name": "R. Casey",
                        "slug": "R.-Casey",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Casey",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Casey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1880661"
                        ],
                        "name": "F. Wahl",
                        "slug": "F.-Wahl",
                        "structuredName": {
                            "firstName": "Friedrich",
                            "lastName": "Wahl",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Wahl"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 15921038,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7abca302c74d2f5adfd323a28e26d40b019df2b5",
            "isKey": false,
            "numCitedBy": 594,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper outlines the requirements and components for a proposed Document Analysis System, which assists a user in encoding printed documents for computer processing. Several critical functions have been investigated and the technical approaches are discussed. The first is the segmentation and classification of digitized printed documents into regions of text and images. A nonlinear, run-length smoothing algorithm has been used for this purpose. By using the regular features of text lines, a linear adaptive classification scheme discriminates text regions from others. The second technique studied is an adaptive approach to the recognition of the hundreds of font styles and sizes that can occur on printed documents. A preclassifier is constructed during the input process and used to speed up a well-known pattern-matching method for clustering characters from an arbitrary print source into a small sample of prototypes. Experimental results are included."
            },
            "slug": "Document-Analysis-System-Wong-Casey",
            "title": {
                "fragments": [],
                "text": "Document Analysis System"
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "The requirements and components for a proposed Document Analysis System, which assists a user in encoding printed documents for computer processing, are outlined and several critical functions have been investigated and the technical approaches are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. Dev."
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34896449"
                        ],
                        "name": "R. Casey",
                        "slug": "R.-Casey",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Casey",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Casey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69485492"
                        ],
                        "name": "D. R. Ferguson",
                        "slug": "D.-R.-Ferguson",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Ferguson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. R. Ferguson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 29472483,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "45bdf2e5368886fd77f7542d797f58909ce3a169",
            "isKey": false,
            "numCitedBy": 62,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "The automatic reading of optically scanned forms consists of two major components: extraction of the data image from the form and interpretation of the image as coded alphanumerics. The second component is also known as optical character recognition, or OCR. We have implemented a method for entry of a wide variety of forms that contain machine-printed data and that are often produced in business environments. The function, called Intelligent Forms Processing (IFP), accepts conventional forms that call for information to be printed in designated blank areas, but in which the information may exceed boundaries due to poor registration during printing. The human eye easily accommodates data that impinge on form boundaries or on background text; however, the same powers of discrimination applied to machine processing pose a technical challenge. The IFP system uses a setup phase to create a model of each form that is to be read. Scanned forms containing data are compared against the matching form model. Special algorithms are employed to extract data fields while removing background printing (e.g., form lines) intersecting the data. The extracted data images are interpreted by an OCR process that reads typical monospace fonts. New fonts may be added easily in a separate design mode. If the data are alphabetic, a lexicon may be assembled to define the possible entries."
            },
            "slug": "Intelligent-Forms-Processing-Casey-Ferguson",
            "title": {
                "fragments": [],
                "text": "Intelligent Forms Processing"
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "The automatic reading of optically scanned forms consists of two major components: extraction of the data image from the form and interpretation of the image as coded alphanumerics, also known as optical character recognition, or OCR."
            },
            "venue": {
                "fragments": [],
                "text": "IBM Syst. J."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102213388"
                        ],
                        "name": "K. Thompson",
                        "slug": "K.-Thompson",
                        "structuredName": {
                            "firstName": "Kendall",
                            "lastName": "Thompson",
                            "middleNames": [
                                "Milar"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Thompson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26523155,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5298e5b0a3c18f4ef4b3f09eb8bdc2f7e5f3e22f",
            "isKey": false,
            "numCitedBy": 69,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "By applying semantic analysis to images of extended passages of text, several volumes of a chess encyclopedia have been read with high accuracy. Although carefully proofread, the books were poorly printed and posed a severe challenge to conventional page-layout analysis and character-recognition methods. An experimental page-reader system performed strictly top-down layout analysis for identification of columns, lines, words, and characters. This proceeded rapidly and reliably thanks to a recently developed skew-estimation technique. Resegmentation of broken, touching, and dirty characters was handled in an efficient and integrated manner by a heuristic search operating on isolated words. By analyzing the syntax of game descriptions and applying the rules of chess, the error rate was reduced by a factor of 30 from what was achievable through shape analysis alone. Several computer vision systems integration issues suggested by this experience are discussed. >"
            },
            "slug": "Reading-Chess-Baird-Thompson",
            "title": {
                "fragments": [],
                "text": "Reading Chess"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "By applying semantic analysis to images of extended passages of text, several volumes of a chess encyclopedia have been read with high accuracy and the error rate was reduced by a factor of 30 from what was achievable through shape analysis alone."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47471571"
                        ],
                        "name": "Masayuki Okamoto",
                        "slug": "Masayuki-Okamoto",
                        "structuredName": {
                            "firstName": "Masayuki",
                            "lastName": "Okamoto",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Masayuki Okamoto"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1444789148"
                        ],
                        "name": "A. Miyazawa",
                        "slug": "A.-Miyazawa",
                        "structuredName": {
                            "firstName": "Akira",
                            "lastName": "Miyazawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Miyazawa"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59860122,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "edb539fe3fb8a6979ca0f3963ec502d90be04641",
            "isKey": false,
            "numCitedBy": 57,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes the current state of an experimental document recognition system for scientific papers. A scientific paper contains not only text but also tables, pictures, graphics, and mathematical expressions. This system can convert character or symbol strings in text as well as mathematical expressions and tables into coded data. Out of all the functions required for the entire process from document scanning through recognition, these have been investigated and implemented: skew detection and correction, region (block) segmentation, and mathematical expression recognition. The algorithms have been designed for high speed as much as possible. This experimental system is implemented entirely in software on a work station under X-windows. Some experimental results on each stage of the document recognition process are presented."
            },
            "slug": "An-Experimental-Implementation-of-a-Document-System-Okamoto-Miyazawa",
            "title": {
                "fragments": [],
                "text": "An Experimental Implementation of a Document Recognition System for Papers Containing Mathematical Expressions"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "Out of all the functions required for the entire process from document scanning through recognition, these have been investigated and implemented: skew detection and correction, region (block) segmentation, and mathematical expression recognition."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58520344,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ca6a9a4f4f291e2c5e94a7b85f7fc1f8ddfb8aad",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Digitized documents are preprocessed for library archival and distribution. Pages from technical journals scanned at 300 dpi are recursively segmented with multiple alternating horizontal and vertical cuts according to publication-specific layout information. The resulting rectangular blocks are labeled concurrently in terms of functional components such as author block, title, abstract. Three specific applications for integrating paper-based information into an electronic environment are described. The first will allow library users to interactively select and view portions of a page-image, such as illustrations, subtitles, or text paragraphs, when either the screen resolution of their workstation or low transmission rates prevent viewing the bitmap of an entire page. The second application will automate the selection of suitable portions of the document ( e.g., abstracts) for subsequent optical character recognition for full-text search of journals and reports in paper form. The third application will automatically link pixel maps of illustrations with ASCII text files. All three applications are based on syntactic processing of binary document images."
            },
            "slug": "Towards-a-Structured-Document-Image-Utility-Nagy",
            "title": {
                "fragments": [],
                "text": "Towards a Structured-Document-Image Utility"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Three specific applications for integrating paper-based information into an electronic environment are described, which will allow library users to interactively select and view portions of a page-image when either the screen resolution of their workstation or low transmission rates prevent viewing the bitmap of an entire page."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145834077"
                        ],
                        "name": "M. Sabourin",
                        "slug": "M.-Sabourin",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Sabourin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Sabourin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688991"
                        ],
                        "name": "A. Mitiche",
                        "slug": "A.-Mitiche",
                        "structuredName": {
                            "firstName": "Amar",
                            "lastName": "Mitiche",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Mitiche"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 31872813,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a9d2a198f8baf4d1763e986f91fddf99f2e86605",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Optical-character-recognition-by-a-neural-network-Sabourin-Mitiche",
            "title": {
                "fragments": [],
                "text": "Optical character recognition by a neural network"
            },
            "venue": {
                "fragments": [],
                "text": "Neural Networks"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31338632"
                        ],
                        "name": "E. Riseman",
                        "slug": "E.-Riseman",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Riseman",
                            "middleNames": [
                                "M."
                            ],
                            "suffix": ""
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Riseman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143630353"
                        ],
                        "name": "R. Ehrich",
                        "slug": "R.-Ehrich",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Ehrich",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Ehrich"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 206618554,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "372f7c85b49a60b67861f67f62cdca0868574fa9",
            "isKey": false,
            "numCitedBy": 58,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a special-purpose character recognition system which uses contextual information for the recognition of words from any given dictionary of words. Previous techniques that utilized context involved letter transition probabilities of digrams and trigrams. This research introduces the concept of binary digrams which overcomes some of the problems of past approaches. They can be used to extract offectively the \"syntax\" of the dictionary while requiring very modest amounts of storage. A computationally feasible procedure is described which allows the accuracy requirements of the character recognizer to be relaxed if it is followed by a contextual postprocessor. The modified recognition system is allowed to output several alternatives for each character, while the postprocessor selects the proper string of characters by having access to both the dictionary and the dictionary syntax. A theoretical estimate of the recognition rate is derived, and experimental results demonstrate the ability of the system to achieve low error and rejection rates."
            },
            "slug": "Contextual-Word-Recognition-Using-Binary-Digrams-Riseman-Ehrich",
            "title": {
                "fragments": [],
                "text": "Contextual Word Recognition Using Binary Digrams"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The concept of binary digrams is introduced which overcomes some of the problems of past approaches and can be used to extract offectively the \"syntax\" of the dictionary while requiring very modest amounts of storage."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47643817"
                        ],
                        "name": "H. Genchi",
                        "slug": "H.-Genchi",
                        "structuredName": {
                            "firstName": "Hiroshi",
                            "lastName": "Genchi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Genchi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70298192"
                        ],
                        "name": "K. Mori",
                        "slug": "K.-Mori",
                        "structuredName": {
                            "firstName": "Ken-ichi",
                            "lastName": "Mori",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Mori"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746397"
                        ],
                        "name": "S. Watanabe",
                        "slug": "S.-Watanabe",
                        "structuredName": {
                            "firstName": "Sadakazu",
                            "lastName": "Watanabe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Watanabe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153490294"
                        ],
                        "name": "S. Katsuragi",
                        "slug": "S.-Katsuragi",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Katsuragi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Katsuragi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62767133,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0f40577d350eb9f70ece2dfa851023c5aed1e478",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "A prototype of a postal code number reader capable of recognizing handwritten arabic numerals has been developed and tested successfully. Recognition of handwritten arabic numerals requires sufficient system flexibility to cope with both unlimited variations in character shape and a large number of writing instruments. This flexibility has been achieved by combining the use of a stored recognition table and a hardware microprogram. The recognition logic obtained by computer simulation is immediately stored in the core memory as a table. The numerals are recognized by extracting a sequence of the geometrical features in horizontal zones of the character after normalization of the height of the character and the width of the strokes. The use of sequential recognition logic helps reduce the capacity of core memory required to obtain the desired high rate of recognition. The correct recognition rate of a single digit for a large sample of letters averaged 95 percent. For a three-digit sorting with 13 stackers the sorter incorrectly recognized approximately 0.1 percent, a rate of error consistent with manual sorting."
            },
            "slug": "Recognition-of-handwritten-numerical-characters-for-Genchi-Mori",
            "title": {
                "fragments": [],
                "text": "Recognition of handwritten numerical characters for automatic letter sorting"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "A prototype of a postal code number reader capable of recognizing handwritten arabic numerals has been developed and tested successfully and the use of sequential recognition logic helps reduce the capacity of core memory required to obtain the desired high rate of recognition."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69984940"
                        ],
                        "name": "R. B. Hennis",
                        "slug": "R.-B.-Hennis",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Hennis",
                            "middleNames": [
                                "B"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. B. Hennis"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62618744,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "291921ed70a39966d9525e7675dd552d89e65c89",
            "isKey": false,
            "numCitedBy": 30,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "The IBM 1975 Optical Page Reader, specially built for the Social Security Administration, reads over 200 fonts from quarterly employer reports printed by electric and manual typewriters, business machines, and high-speed printers. Since the SSA has no control over the means used by employers to prepare the reports, many variations in print quality present. This paper discusses the problems involved in planning and developing a system to read these reports and summarizes the design of the specialized video signal processing circuits and the character recognition logic that are used in the system. Two companion papers treat the latter topics in more detail. Also discussed in the paper is a management information system that permitted detailed analysis of experimental data and accelerated the development process."
            },
            "slug": "The-IBM-1975-optical-page-reader:-part-I:-system-Hennis",
            "title": {
                "fragments": [],
                "text": "The IBM 1975 optical page reader: part I: system design"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The problems involved in planning and developing a system to read quarterly employer reports are discussed and the design of the specialized video signal processing circuits and the character recognition logic that are used in the system are summarized."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31338632"
                        ],
                        "name": "E. Riseman",
                        "slug": "E.-Riseman",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Riseman",
                            "middleNames": [
                                "M."
                            ],
                            "suffix": ""
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Riseman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733922"
                        ],
                        "name": "A. Hanson",
                        "slug": "A.-Hanson",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Hanson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Hanson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1402380,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5f6070891aa179e1342dfa9d69868ad2c691211e",
            "isKey": false,
            "numCitedBy": 135,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "The effectiveness of various forms of contextual information in a postprocessing system for detection and correction of errors in words is examined. Various algorithms utilizing context are considered, from a dictionary algorithm which has available the maximum amount of information, to a set of contextual algorithms utilizing positional binary n-gram statistics. The latter information differs from the usual n-gram letter statistics in that the probabilities are position-dependent and each is quantized to 1 or 0, depending upon whether or not it is nonzero. This type of information is extremely compact and the computation for error correction is orders of magnitude less than that required by the dictionary algorithm."
            },
            "slug": "A-Contextual-Postprocessing-System-for-Error-Using-Riseman-Hanson",
            "title": {
                "fragments": [],
                "text": "A Contextual Postprocessing System for Error Correction Using Binary n-Grams"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Various algorithms utilizing context are considered, from a dictionary algorithm which has available the maximum amount of information, to a set of contextual algorithms utilizing positional binary n-gram statistics."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5419774,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c8fef60c090f8ec8b1b05d425027aa0d66a43d32",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "eyes are everywhere, scrutinizing documents, blood slides, even pizza crusts. With this potpourri of applications, scanners may become as commonplace as today's photographic camera. Optical scanners, or scanning digitizers, are used to convert a picture into an array of numbers representing the positional distribution of optical density within the picture. The relation between the computer-readable output of the optical scanner and the original image is critical to automatic pattern recognition and digital image processing. Optical scanners can be thought of as eyes for computers. They are used in optical character recognition; computer-aided design and drafting; biomedical applications ; geographic data processing, including remote sensing ; facsimile communications; printing and publishing; and experimental physical science. (See center insert on applications.) Commercially, the most widespread application of optical scanners is optical character recognition. Virtually all earlier products were based on mechanical scanners, but the current trend is solid-state transducers. At the same time, the implementation of recognition algorithms is shifting from special-purpose, hard-wired logic to microprocessor-based software. Consequently, large, high-speed OCR systems designed to displace several hundred data entry specialists are gradually giving way to devices that can be cost-justified even in organizations employing only a few data entry personnel. OCR input devices may eventually be attached to even the smallest computer systems, complementing the standard keyboard for alphanumeric entry. To recognize a single character, we need only examine a 30 x 30 picture element array; the exact spatial relation between successive characters is unimportant. Optical scanners designed for character recognition are, therefore , generally not suitable for image input. Image scanners are, however, finding their way into OCR systems designed for less restrictive applications, such as the processing of documents containing gray-scale illustrations, line drawings, and a mix of type fonts. I Engineering applications require the digitization of line drawings with predominantly straight-line segments, such as detail, assembly, structural, and architectural drawings; logic, circuit, and wiring diagrams; printed circuit , wafer, and chip layouts; and utility maps (in-plant and crosscountry cabling, piping and pipelines, conduits , ducts, transmission lines). Ink on mylar has sufficient contrast to allow use of a scanner with only binary (black and white) amplitude output, but variations in re-flectance make pencil drawings difficult to scan. Many engineering applications require a scanner capable of handling a wide range of drawing sizes and a mix of line and alphabetic information. A typical floor plan for a telephone company central …"
            },
            "slug": "Optical-Scanning-Digitizers-Nagy",
            "title": {
                "fragments": [],
                "text": "Optical Scanning Digitizers"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "Large, high-speed OCR systems designed to displace several hundred data entry specialists are gradually giving way to devices that can be cost-justified even in organizations employing only a few data entry personnel."
            },
            "venue": {
                "fragments": [],
                "text": "Computer"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3240038"
                        ],
                        "name": "M. Holstege",
                        "slug": "M.-Holstege",
                        "structuredName": {
                            "firstName": "Mary",
                            "lastName": "Holstege",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Holstege"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2921799"
                        ],
                        "name": "Yul J. Inn",
                        "slug": "Yul-J.-Inn",
                        "structuredName": {
                            "firstName": "Yul",
                            "lastName": "Inn",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yul J. Inn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2198237"
                        ],
                        "name": "Lance Tokuda",
                        "slug": "Lance-Tokuda",
                        "structuredName": {
                            "firstName": "Lance",
                            "lastName": "Tokuda",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lance Tokuda"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26701636,
            "fieldsOfStudy": [
                "Art",
                "Computer Science"
            ],
            "id": "923cf8c8c955d2ae718eff3e16eb9f6139d8eada",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Conventional layout and typographical information present in documents provide important visual cues for understanding documents. Documents of various types have a wide range of formatting. Computers can make use of this information when anyzing documents in the form of images. In this case layout and typographical cues are available to aid in the analysis. We describe an approach based upon modelling human visual cognition to analyze layout and typesetting in bit-mapped images of documents"
            },
            "slug": "Visual-parsing:-an-aid-to-text-understanding-Holstege-Inn",
            "title": {
                "fragments": [],
                "text": "Visual parsing: an aid to text understanding"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An approach based upon modelling human visual cognition to analyze layout and typesetting in bit-mapped images of documents is described."
            },
            "venue": {
                "fragments": [],
                "text": "RIAO"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34896449"
                        ],
                        "name": "R. Casey",
                        "slug": "R.-Casey",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Casey",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Casey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34555453,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "eb73120b579eceff08cc7308d81839ce50280038",
            "isKey": false,
            "numCitedBy": 68,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "A sequential optical character recognition algorithm, ideally suited for implementation by means of microprocessors with limited storage capabilities, is formulated in terms of a binary decision tree. Upper bounds On the recognition performance are derived in terms of the stability of the digitized picture elements. The design process is described in detail. The algorithm is tested on single-font typewritten characters and the experimental and theoretical results are compared."
            },
            "slug": "Decision-tree-design-using-a-probabilistic-model-Casey-Nagy",
            "title": {
                "fragments": [],
                "text": "Decision tree design using a probabilistic model"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A sequential optical character recognition algorithm, ideally suited for implementation by means of microprocessors with limited storage capabilities, is formulated in terms of a binary decision tree."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145279674"
                        ],
                        "name": "A. Dengel",
                        "slug": "A.-Dengel",
                        "structuredName": {
                            "firstName": "Andreas",
                            "lastName": "Dengel",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Dengel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "92681930"
                        ],
                        "name": "A. Pleyer",
                        "slug": "A.-Pleyer",
                        "structuredName": {
                            "firstName": "Anita",
                            "lastName": "Pleyer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pleyer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36422303"
                        ],
                        "name": "R. Hoch",
                        "slug": "R.-Hoch",
                        "structuredName": {
                            "firstName": "Rainer",
                            "lastName": "Hoch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hoch"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61888183,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5c4467905ae2b6077db08e479baeb0729a310140",
            "isKey": false,
            "numCitedBy": 8,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors propose a dictionary look-up method as a contextual postprocessing for character hypotheses forming word candidates. In particular, a hybrid trie organization is combined with a selective-access-matrix (SAM) that allows an efficient matching of fragmentary input strings against legal words. Experiments prove that the method achieves some respectable results concerning speed. Furthermore, the additional memory needed for the SAM is smaller than the memory saved by the hybrid organization of the trie.<<ETX>>"
            },
            "slug": "Fragmentary-string-matching-by-selective-access-to-Dengel-Pleyer",
            "title": {
                "fragments": [],
                "text": "Fragmentary string matching by selective access to hybrid tries"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "The authors propose a dictionary look-up method as a contextual postprocessing for character hypotheses forming word candidates that allows an efficient matching of fragmentary input strings against legal words."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings., 11th IAPR International Conference on Pattern Recognition. Vol.II. Conference B: Pattern Recognition Methodology and Systems"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145062511"
                        ],
                        "name": "S. Seth",
                        "slug": "S.-Seth",
                        "structuredName": {
                            "firstName": "Sharad",
                            "lastName": "Seth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Seth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2744969"
                        ],
                        "name": "K. L. Einspahr",
                        "slug": "K.-L.-Einspahr",
                        "structuredName": {
                            "firstName": "Kent",
                            "lastName": "Einspahr",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. L. Einspahr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 16502468,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d66e0881695efdef8356d02bd011023bdc24506a",
            "isKey": false,
            "numCitedBy": 56,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "A substitution cipher consists of a block of natural language text where each letter of the alphabet has been replaced by a distinct symbol. As a problem in cryptography, the substitution cipher is of limited interest, but it has an important application in optical character recognition. Recent advances render it quite feasible to scan documents with a fairly complex layout and to classify (cluster) the printed characters into distinct groups according to their shape. However, given the immense variety of type styles and forms in current use, it is not possible to assign alphabetical identities to characters of arbitrary size and typeface. This gap can be bridged by solving the equivalent of a substitution cipher problem, thereby opening up the possibility of automatic translation of a scanned document into a standard character code, such as ASCII. Earlier methods relying on letter n-gram frequencies require a substantial amount of ciphertext for accurate n-gram estimates. A dictionary-based approach solves the problem using relatively small ciphertext samples and a dictionary of fewer than 500 words. Our heuristic backtrack algorithm typically visits only a few hundred among the 26! possible nodes on sample texts ranging from 100 to 600 words."
            },
            "slug": "Decoding-Substitution-Ciphers-by-Means-of-Word-with-Nagy-Seth",
            "title": {
                "fragments": [],
                "text": "Decoding Substitution Ciphers by Means of Word Matching with Application to OCR"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "The heuristic backtrack algorithm typically visits only a few hundred among the 26! possible nodes on sample texts ranging from 100 to 600 words, thereby opening up the possibility of automatic translation of a scanned document into a standard character code, such as ASCII."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69507013"
                        ],
                        "name": "M. Bartz",
                        "slug": "M.-Bartz",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Bartz",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Bartz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60645320,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f69d9c6b9d5c1a0ef629e3027d688b8374af0fce",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "An adaptive video thresholding system is used in the Page Reader to minimize recognition failures due to contrast and line width variation. The main threshold operator is a linear function of the average contrast over a specified area. Adjustments to the threshold level are made by circuits that compute the average line widthin a character, and by circuits that filter out spatial noise in the vicinity of the character. The different types of print quality distortions predominant in typewriter printing and business machine printing are handled by switching between different sets of threshold operators."
            },
            "slug": "The-IBM-1975-optical-page-reader:-part-II:-video-Bartz",
            "title": {
                "fragments": [],
                "text": "The IBM 1975 optical page reader: part II: video thresholding system"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "An adaptive video thresholding system is used in the Page Reader to minimize recognition failures due to contrast and line width variation."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145266621"
                        ],
                        "name": "M. Viswanathan",
                        "slug": "M.-Viswanathan",
                        "structuredName": {
                            "firstName": "Mahesh",
                            "lastName": "Viswanathan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Viswanathan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59828271,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4ccf0521c6375ece7ab78c35595c385e347897ce",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Pages from technical journals are analyzed with a syntactic approach to hierarchically identify the spatial structure of a scanned document image and to assign logical labels to its component blocks. These blocks may be fields of text, tables and figures. Publication-specific knowledge is used in the segmentation and labeling of the blocks. The information is meticulously coded in the form of block-grammars used to describe the relationships between the various entity classes or blocks. Lexical and syntax analysis tools, Lex and Yacc, are used to segment and label the blocks. These block-grammars can be generated manually or from a parameter table. Further extensions involving multiple grammars and backtracking algorithms are also discussed."
            },
            "slug": "Analysis-of-Scanned-Documents-—-a-Syntactic-Viswanathan",
            "title": {
                "fragments": [],
                "text": "Analysis of Scanned Documents — a Syntactic Approach"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Pages from technical journals are analyzed with a syntactic approach to hierarchically identify the spatial structure of a scanned document image and to assign logical labels to its component blocks."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145820949"
                        ],
                        "name": "T. Pavlidis",
                        "slug": "T.-Pavlidis",
                        "structuredName": {
                            "firstName": "Theodosios",
                            "lastName": "Pavlidis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Pavlidis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2061170830"
                        ],
                        "name": "Farhat Ali",
                        "slug": "Farhat-Ali",
                        "structuredName": {
                            "firstName": "Farhat",
                            "lastName": "Ali",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Farhat Ali"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27274958,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "69520acbc778cc5c5e99db4afd84985d052d20e9",
            "isKey": false,
            "numCitedBy": 133,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "The outlines of handwritten numerals are approximated by polygons using a method previously developed by Pavlidis and Horowitz [10]. This enables a simple evaluation of many intuitively descriptive features for numerals, for example, relative position and type of concave arcs. The method was tested on the Munson data (IEEE Data Base 1.2.2), and an overall error rate of 9.4 percent was achieved without any statistical optimization. A characteristic property of this approach is the existence of two steps: the first step (primitive feature generation) is primarily numerical, and the second step (feature selection and classification) makes extensive use of semantics."
            },
            "slug": "Computer-Recognition-of-Handwritten-Numerals-by-Pavlidis-Ali",
            "title": {
                "fragments": [],
                "text": "Computer Recognition of Handwritten Numerals by Polygonal Approximations"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "The outlines of handwritten numerals are approximated by polygons using a method previously developed by Pavlidis and Horowitz, which enables a simple evaluation of many intuitively descriptive features for numerals, for example, relative position and type of concave arcs."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Systems, Man, and Cybernetics"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34896449"
                        ],
                        "name": "R. Casey",
                        "slug": "R.-Casey",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Casey",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Casey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10953667,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "89c1aa693a2be4f38077b0e301e2f92859a328c4",
            "isKey": false,
            "numCitedBy": 54,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract—An unconventional approach to character recognition is developed. The resulting system is based solely on the statistical properties of the language, therefore it can read printed text with no previous training or a priori information about the structure of the characters. The known letter-pair frequencies of the language are used to identify the printed symbols in the following manner."
            },
            "slug": "An-Autonomous-Reading-Machine-Casey-Nagy",
            "title": {
                "fragments": [],
                "text": "An Autonomous Reading Machine"
            },
            "tldr": {
                "abstractSimilarityScore": 86,
                "text": "An unconventional approach to character recognition is developed, based solely on the statistical properties of the language, therefore it can read printed text with no previous training or a priori information about the structure of the characters."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2182944"
                        ],
                        "name": "H. Yashiro",
                        "slug": "H.-Yashiro",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Yashiro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Yashiro"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "71955766"
                        ],
                        "name": "Takuhiro Murakami",
                        "slug": "Takuhiro-Murakami",
                        "structuredName": {
                            "firstName": "Takuhiro",
                            "lastName": "Murakami",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Takuhiro Murakami"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35267953"
                        ],
                        "name": "Y. Shima",
                        "slug": "Y.-Shima",
                        "structuredName": {
                            "firstName": "Yoshihiro",
                            "lastName": "Shima",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Shima"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2061355824"
                        ],
                        "name": "Yasushi Nakano",
                        "slug": "Yasushi-Nakano",
                        "structuredName": {
                            "firstName": "Yasushi",
                            "lastName": "Nakano",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yasushi Nakano"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34878566"
                        ],
                        "name": "H. Fujisawa",
                        "slug": "H.-Fujisawa",
                        "structuredName": {
                            "firstName": "Hiromichi",
                            "lastName": "Fujisawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Fujisawa"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61653815,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "77f36d4534b4687f53d1331cec420aeb9d7a53fb",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "A method of document structure extraction using generic layout knowledge is described. With this method, it is possible to translate images of multimedia documents, i.e. documents that include pictures, graphics, and color information, to hypertext. Hypertext consists of decomposed elements linked with each other through some logical relationship. The principal components of the method are extraction of logical structure elements using a rectangular set operation and generation of hierarchical links of the logical structure between the extracted document elements. It is shown experimentally that the logical structure of a technical paper can be extracted.<<ETX>>"
            },
            "slug": "A-new-method-of-document-structure-extraction-using-Yashiro-Murakami",
            "title": {
                "fragments": [],
                "text": "A new method of document structure extraction using generic layout knowledge"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown experimentally that the logical structure of a technical paper can be extracted and the principal components of the method are extraction of logical structure elements using a rectangular set operation and generation of hierarchical links of the logicalructure between the extracted document elements."
            },
            "venue": {
                "fragments": [],
                "text": "International Workshop on Industrial Applications of Machine Intelligence and Vision,"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48572350"
                        ],
                        "name": "S. Lam",
                        "slug": "S.-Lam",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Lam",
                            "middleNames": [
                                "Wang-Cheung"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Lam"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143987331"
                        ],
                        "name": "D. Wang",
                        "slug": "D.-Wang",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696384"
                        ],
                        "name": "S. Srihari",
                        "slug": "S.-Srihari",
                        "structuredName": {
                            "firstName": "Sargur",
                            "lastName": "Srihari",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Srihari"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61524835,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7ffe0f952f61dc8fc04df0dc38041e24f92b972d",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors describe a method for segmenting a newspaper page image into labeled macro components (blocks) and recognizing the content. Connected component analysis is used to segment a newspaper image into several rectangular blocks and to filter connected components into character and noncharacter components. Textural analysis is then used to classify the remaining noncharacter components into graphics and photographs. Experimental results indicate that these techniques work very well.<<ETX>>"
            },
            "slug": "Reading-newspaper-text-Lam-Wang",
            "title": {
                "fragments": [],
                "text": "Reading newspaper text"
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "The authors describe a method for segmenting a newspaper page image into labeled macro components (blocks) and recognizing the content and Experimental results indicate that these techniques work very well."
            },
            "venue": {
                "fragments": [],
                "text": "[1990] Proceedings. 10th International Conference on Pattern Recognition"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46537743"
                        ],
                        "name": "R. Ascher",
                        "slug": "R.-Ascher",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Ascher",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Ascher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13075721,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "83409db15d39f2d45e8ec16ff2a74e35ceabe433",
            "isKey": false,
            "numCitedBy": 121,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "A method of video compaction based on transmitting only the first instance of each class of digitized patterns is shown to yield a compaction ratio of 16: 1 on a short passage of text from the IEEE SPECTRUM. Refinements to extend the bandwidth reduction to 40: 1 by relatively simple means are proposed but not demonstrated."
            },
            "slug": "A-Means-for-Achieving-a-High-Degree-of-Compaction-Ascher-Nagy",
            "title": {
                "fragments": [],
                "text": "A Means for Achieving a High Degree of Compaction on Scan-Digitized Printed Text"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A method of video compaction based on transmitting only the first instance of each class of digitized patterns is shown to yield a compaction ratio of 16: 1 on a short passage of text from the IEEE SPECTRUM."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 13410801,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dd71fde2df43294606e33b79678ef595ddb1af60",
            "isKey": false,
            "numCitedBy": 69,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The general goal of image pattern recognition is to generate descriptions of images, and relate those descriptions to models characterizing classes of images. This paper reviews the subject from a technique-oriented standpoint. Topics covered include preprocessing; registration and matching; segmentation into parts; representation of the parts; and description in terms of properties of and relationships among the parts."
            },
            "slug": "Image-pattern-recognition-Rosenfeld",
            "title": {
                "fragments": [],
                "text": "Image pattern recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2056931359"
                        ],
                        "name": "J. A. Mulder",
                        "slug": "J.-A.-Mulder",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Mulder",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. A. Mulder"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1690624"
                        ],
                        "name": "Alan K. Mackworth",
                        "slug": "Alan-K.-Mackworth",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Mackworth",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alan K. Mackworth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7830772"
                        ],
                        "name": "W. Havens",
                        "slug": "W.-Havens",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Havens",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Havens"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16996490,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "22f65c4ef5751629e4c09c359ef53993d42dcb5a",
            "isKey": false,
            "numCitedBy": 64,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "Schema-based representations for visual knowledge are integrated with constraint satisfaction techniques. This integration is discussed in a progression of three sketch map interpretation programs: Mapsee-1, Mapsee-2, and Mapsee-3. The programs are evaluated by the criteria of descriptive and procedural adequacy. The evaluation indicates that a schema-based representation used in combination with a hierarchical arc-consistency algorithm constitutes a modular, efficient, and effective approach to the structured representation of visual knowledge. The schemata used in this representation are embedded in composition and specialization hierarchies. Specialization hierarchies are further expanded into discrimination graphs. >"
            },
            "slug": "Knowledge-Structuring-and-Constraint-Satisfaction:-Mulder-Mackworth",
            "title": {
                "fragments": [],
                "text": "Knowledge Structuring and Constraint Satisfaction: The Mapsee Approach"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The evaluation indicates that a schema-based representation used in combination with a hierarchical arc-consistency algorithm constitutes a modular, efficient, and effective approach to the structured representation of visual knowledge."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060267972"
                        ],
                        "name": "R. Lucky",
                        "slug": "R.-Lucky",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Lucky",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Lucky"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62598154,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f89ee1186d0e2fa982b413ecd61dc241144c06f0",
            "isKey": false,
            "numCitedBy": 345,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A previous paper described a simple adjustment algorithm which could be employed to set the tap gains of a transversal filter for the equalization of data transmission systems. An automatic equalizer was shown which used this algorithm during a training period of test pulse transmission prior to actual data transmission. The present paper extends the utility of this automatic equalization system by permitting it to change settings during the data transmission period in response to changes in transmission channel characteristics. Three schemes for accomplishing this adaptive equalization without the use of test signals are described and evaluated analytically. The first such scheme uses periodic estimates of channel response based on the received data signal to adjust or update the transversal filter settings. The second system is entirely digital and employs a sequential testing procedure to make adjustments aperiodically as they are required by changing conditions. The third system uses information obtained from a forward-acting error correction system for the purposes of adaptive equalization. Of the three systems described, the second is not only theoretically superior, but is practically the simplest. Experimental results for this second system are described."
            },
            "slug": "Techniques-for-adaptive-equalization-of-digital-Lucky",
            "title": {
                "fragments": [],
                "text": "Techniques for adaptive equalization of digital communication systems"
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "The utility of an automatic equalizer system used to set the tap gains of a transversal filter for the equalization of data transmission systems is extended by permitting it to change settings during the data transmission period in response to changes in transmission channel characteristics."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 13948283,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c6fa2a069744f7ab4ca58b1177134ca3f88f2601",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "This correspondence calls attention to several frequently used assumptions and techniques culled from the pattern recognition literature."
            },
            "slug": "Candide's-Practical-Principles-of-Experimental-Nagy",
            "title": {
                "fragments": [],
                "text": "Candide's Practical Principles of Experimental Pattern Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This correspondence calls attention to several frequently used assumptions and techniques culled from the pattern recognition literature."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46537743"
                        ],
                        "name": "R. Ascher",
                        "slug": "R.-Ascher",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Ascher",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Ascher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3206689"
                        ],
                        "name": "G. Koppelman",
                        "slug": "G.-Koppelman",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Koppelman",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Koppelman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "121424587"
                        ],
                        "name": "Martha J. Miller",
                        "slug": "Martha-J.-Miller",
                        "structuredName": {
                            "firstName": "Martha",
                            "lastName": "Miller",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Martha J. Miller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14021419"
                        ],
                        "name": "G. L. Shelton",
                        "slug": "G.-L.-Shelton",
                        "structuredName": {
                            "firstName": "Glenmore",
                            "lastName": "Shelton",
                            "middleNames": [
                                "L."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. L. Shelton"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 206618392,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4d731b9f2a8c060de2cfea309db32a2eb31d6125",
            "isKey": false,
            "numCitedBy": 30,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "A system intended to provide input of printed text to computers is applied to published patents, annotated law reports, and technical journals."
            },
            "slug": "An-Interactive-System-for-Reading-Unformatted-Text-Ascher-Koppelman",
            "title": {
                "fragments": [],
                "text": "An Interactive System for Reading Unformatted Printed Text"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A system intended to provide input of printed text to computers is applied to published patents, annotated law reports, and technical journals."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144788516"
                        ],
                        "name": "N. Tuong",
                        "slug": "N.-Tuong",
                        "structuredName": {
                            "firstName": "Nguyen",
                            "lastName": "Tuong",
                            "middleNames": [
                                "Phuoc"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Tuong"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145452404"
                        ],
                        "name": "Y. Ho",
                        "slug": "Y.-Ho",
                        "structuredName": {
                            "firstName": "Yu-Chi",
                            "lastName": "Ho",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Ho"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1770467"
                        ],
                        "name": "A. Agrawala",
                        "slug": "A.-Agrawala",
                        "structuredName": {
                            "firstName": "Ashok",
                            "lastName": "Agrawala",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Agrawala"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60905908,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "44532b068896ccf1250fe5c00bad0503bf5c733a",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "Two versions of an unsupervised learning algorithm for pattern recognition are compared by means of numerical calculations based on two-dimensional ellipsoidal pattern distributions."
            },
            "slug": "On-a-theoretical-pattern-recognition-model-of-Ho-Nagy-Tuong",
            "title": {
                "fragments": [],
                "text": "On a theoretical pattern recognition model of Ho and Agrawala"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145279674"
                        ],
                        "name": "A. Dengel",
                        "slug": "A.-Dengel",
                        "structuredName": {
                            "firstName": "Andreas",
                            "lastName": "Dengel",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Dengel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2070476489"
                        ],
                        "name": "G. Barth",
                        "slug": "G.-Barth",
                        "structuredName": {
                            "firstName": "Gerhard",
                            "lastName": "Barth",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Barth"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5234143,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "985b7609fe5a551c73480d24b1f801a32c17a51b",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Document-Description-and-Analysis-by-Cuts-Dengel-Barth",
            "title": {
                "fragments": [],
                "text": "Document Description and Analysis by Cuts"
            },
            "venue": {
                "fragments": [],
                "text": "RIAO"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34896449"
                        ],
                        "name": "R. Casey",
                        "slug": "R.-Casey",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Casey",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Casey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121638567,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d48744a816b2ff025deff93d95e3e18c45d08143",
            "isKey": false,
            "numCitedBy": 275,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Advances-in-Pattern-Recognition-Casey-Nagy",
            "title": {
                "fragments": [],
                "text": "Advances in Pattern Recognition"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30835476"
                        ],
                        "name": "D. T. Wang",
                        "slug": "D.-T.-Wang",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Wang",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. T. Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1732860"
                        ],
                        "name": "O. Larsen",
                        "slug": "O.-Larsen",
                        "structuredName": {
                            "firstName": "Ole",
                            "lastName": "Larsen",
                            "middleNames": [
                                "Vilhelm"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Larsen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 63913140,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ff91410f48fcccf646a613e3354da28c903e9ff4",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Structured-Document-Image-Analysis,-IAPR-Workshop-Wang-Larsen",
            "title": {
                "fragments": [],
                "text": "Structured Document Image Analysis, IAPR Workshop on Syntactic and Structural Pattern Recognition, 13-15 June 1990, Murray Hill, NJ, USA"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "79764476"
                        ],
                        "name": "加藤 俊一",
                        "slug": "加藤-俊一",
                        "structuredName": {
                            "firstName": "加藤",
                            "lastName": "俊一",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "加藤 俊一"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69523543"
                        ],
                        "name": "下垣 弘行",
                        "slug": "下垣-弘行",
                        "structuredName": {
                            "firstName": "下垣",
                            "lastName": "弘行",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "下垣 弘行"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69499104"
                        ],
                        "name": "藤村 是明",
                        "slug": "藤村-是明",
                        "structuredName": {
                            "firstName": "藤村",
                            "lastName": "是明",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "藤村 是明"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60384964,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "66f2cb21057e19acea9174e779cab1048a325490",
            "isKey": false,
            "numCitedBy": 6,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Architecture-and-User-Interface-of-Intelligent-加藤-下垣",
            "title": {
                "fragments": [],
                "text": "Architecture and User Interface of Intelligent Multimedia Database System TRADEMARK"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35074265"
                        ],
                        "name": "J. Handley",
                        "slug": "J.-Handley",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Handley",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Handley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145750662"
                        ],
                        "name": "Thom Hickey",
                        "slug": "Thom-Hickey",
                        "structuredName": {
                            "firstName": "Thom",
                            "lastName": "Hickey",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Thom Hickey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43652841,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "850747f919728dd6ecaa49fe1a8065dd070ecc70",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Merging-optical-character-recognition-outputs-for-Handley-Hickey",
            "title": {
                "fragments": [],
                "text": "Merging optical character recognition outputs for improved accuracy"
            },
            "venue": {
                "fragments": [],
                "text": "RIAO"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46391416,
            "fieldsOfStudy": [],
            "id": "d6ddc3eec5641b882c3918a94beb9e6d0701a24a",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Block segmentation and text extraction in mixed text/image documents"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Graph. Image Process."
            },
            "year": 1982
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 41,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/At-the-frontiers-of-OCR-Nagy/19b2308e9bbe77d2059706891a757bb90cb73049?sort=total-citations"
}