{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8470693"
                        ],
                        "name": "R. FitzHugh",
                        "slug": "R.-FitzHugh",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "FitzHugh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. FitzHugh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6270661"
                        ],
                        "name": "S. W. Kuffler",
                        "slug": "S.-W.-Kuffler",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Kuffler",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. W. Kuffler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 11126867,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "fe46043144b90dad9d09539f6c9904e578717405",
            "isKey": false,
            "numCitedBy": 116,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "Granit (1943, 1944) observed that the threshold of retinal ganglion cells in the cat drops when they are allowed to dark-adapt after exposure to bright lights, and that there is a shift in spectral sensitivity analogous to the Purkinje shift in the human. The drop in threshold was rather small compared to that found in human dark adaptation, and the final threshold reached was not nearly as low as one would expect in an eye adapted for nocturnal vision. Pirenne (1954) has emphasized that there is a big discrepancy (a factor of 103-106) between the lowest threshold obtained by electro-physiological methods and the much lower thresholds found by psychophysical methods in humans (Hecht, Shlaer & Pirenne, 1942). In addition, the existence of a random maintained discharge from retinal ganglion cells (Kuffler, FitzHugh & Barlow, 1957) raises some doubts about the relative parts played by the retina and the central nervous system in determining thresholds. We therefore set out to measure the absolute threshold of the large type of ganglion cell (Rushton, 1949) isolated by metallic micro-electrodes of the type used by Granit & Svaetichin (1939). The opportunity was taken of following threshold through the period of dark adaptation, and some observations of the Purkinje shift were made."
            },
            "slug": "Dark-adaptation,-absolute-threshold-and-purkinje-in-Barlow-FitzHugh",
            "title": {
                "fragments": [],
                "text": "Dark adaptation, absolute threshold and purkinje shift in single units of the cat's retina"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "To measure the absolute threshold of the large type of ganglion cell (Rushton, 1949) isolated by metallic micro-electrodes of the type used by Granit & Svaetichin (1939), the opportunity was taken of following threshold through the period of dark adaptation, and some observations of the Purkinje shift were made."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6270661"
                        ],
                        "name": "S. W. Kuffler",
                        "slug": "S.-W.-Kuffler",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Kuffler",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. W. Kuffler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 3
                            }
                        ],
                        "text": "2, Kuffier, 1953)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 18591943,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b446e3fb01026b4e5ad978812540f172405fff6f",
            "isKey": false,
            "numCitedBy": 2575,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "THE DISCHARGES carried in the optic nerve fibers contain all the information which the central nervous system receives from the retina. A correct interpretation of discharge patterns therefore constitutes an important step in the analysis of visual events. Further, investigations of nervous activity arising in the eye reveal many aspects of the functional organization of the neural elements within the retina itself. Following studies of discharges in the optic nerve of the eel’s eye by Adrian and Matthews (2,3), Hartline and his colleagues described the discharge pattern in the eye of the Limulus in a series of important and lucid papers (for a summary see 20). In the Limulus the relationship between the stimulus to the primary receptor cell and the nerve discharges proved relatively simple, apparently because the connection between sense cell and nerve fiber was a direct one. Thus, when stimulation is confined to one receptor the discharge in a single Limulus nerve fiber will provide a good indication of excitatory events which take place as a result of photochemical processes. Discharges last for the duration of illumination and their frequency is a measure of stimulus strength. Lately, however, it was shown by Hartline et al. (22) that inhibitory interactions may be revealed when several receptors are excited. On the whole, the Limulus preparation shows many features which are similar to other simple sense organs, for instance, stretch receptors. In the latter, however, instead of photochemical events, stretch-deformation acts as the adequate stimulus on sensory terminals and is translated into a characteristic discharge pattern. The discharge from the cold-blooded vertebrate retina (mainly frogs) proved much more complex. Hartline found three main types when recording from single optic nerve fibers: (i) “on” discharges, similar to those in the Limulus, firing for the duration of the light stimulus, (ii) “off” discharges appearing when a light stimulus was withdrawn, and (iii) ‘con-off” discharges, a combination of the former two, with activity confined mainly to onset and cessation of illumination. The mammalian discharge patterns were studied in a number of species by Granit and his co-workers in the course of their extensive work on the physiology of the visual system (summaries in 13, 15). On the whole, they did not observe any fundamental differences between frog and mammalian discharge types (see later)."
            },
            "slug": "Discharge-patterns-and-functional-organization-of-Kuffler",
            "title": {
                "fragments": [],
                "text": "Discharge patterns and functional organization of mammalian retina."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The Limulus preparation shows many features which are similar to other simple sense organs, for instance, stretch receptors, however, instead of photochemical events, stretch-deformation acts as the adequate stimulus on sensory terminals and is translated into a characteristic discharge pattern."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36983195"
                        ],
                        "name": "B. Matthews",
                        "slug": "B.-Matthews",
                        "structuredName": {
                            "firstName": "Bryan",
                            "lastName": "Matthews",
                            "middleNames": [
                                "Harold",
                                "Cabot"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Matthews"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 101,
                                "start": 88
                            }
                        ],
                        "text": "Maintained activity in single ganglion cells of the cat has frequently been observed by Granit (1947) and Noell (1953), and has been regularly seen by Kuflter (1952; 1953)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 158,
                                "start": 145
                            }
                        ],
                        "text": "…cell potentials were recorded by electrodes of three types: glassinsulated platinum-iridium wires of 10 to 13/z in diameter of the type used by Granit (1947), by indium-filled, gold-and platinum-plated, glass capillaries with a tip to 3 to 5 # as recently described by Dowben and Rose (1953),…"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 32695817,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bd54f87d5d4df56099e08cb236d4938ff0a2b7e9",
            "isKey": false,
            "numCitedBy": 154,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "THIS book is not a general treatise on vision, but in deals with some additions to visual physiology in the last fifteen years that have been derived from the study of action potentials of the retina and the optic nerve, and particularly with work in this field with which the author has been closely associated and in which his laboratory has been notably active. It has been possible in many types of visual sense organ to record nerve impulse discharges set up by the stimulus of light ; in work on a simple eye (Limulus), Hartline showed that visual sense cells, like other sensory nerve endings that have been investigated, set up impulses of frequency related to the strength of the stimulus, and Hartline later confirmed this for single opticnerve fibres from the frog's retina. But here the response was complicated by fibres responding when the light was extinguished—the well-known off-discharge found by Adrian and R. Matthews in the eel's optic nerve. Granit's work has extended this investigation to mammalian eyes ; and the response in single optic-nerve fibres in many eyes has been studied and related to the wave-length of the light evoking it.Sensory Mechanisms of the RetinaWith an Appendix or Electroretinography. By Dr. Ragnar Granit. Pp. xxiii+412. (London, New York and Toronto : Oxford University Press, 1947.) 35s. net."
            },
            "slug": "Sensory-Mechanisms-of-the-Retina-Matthews",
            "title": {
                "fragments": [],
                "text": "Sensory Mechanisms of the Retina"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This book is not a general treatise on vision, but in deals with some additions to visual physiology in the last fifteen years that have been derived from the study of action potentials of the retina and the optic nerve, and particularly with work in this field with which the author has been closely associated and in which his laboratory has been notably active."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1949
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8470693"
                        ],
                        "name": "R. FitzHugh",
                        "slug": "R.-FitzHugh",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "FitzHugh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. FitzHugh"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 130,
                                "start": 116
                            }
                        ],
                        "text": "Such spontaneity is of special interest in the eye because it related to the threshold-noise problem (Barlow, 1956; FitzHugh, 1957) and may be at the basis of \"visual grey\" perception."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6223768,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1cafd6a835be70194ab6aac853888cdaca743fad",
            "isKey": false,
            "numCitedBy": 89,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Photographic records of impulses from single ganglion cells in the cat's retina were made while the retina was stimulated by flashes occurring once a second. Ten flashes at each of several intensities near threshold were used. 2. For the purpose of statistical analysis, the number of impulses (x) falling within a critical period following each flash was used as an index of the response. Histograms of x were plotted and used to calculate rates of transfer of information by the ganglion cell for the case of an ideal experiment, the yes-no choice, in which flashes of intensity I and blanks are to be distinguished. 3. The information rate increased (a) with increasing stimulus intensity and (b) with the number of identical flashes or blanks presented successively in a block. The intensity chosen as threshold by the experimenter, who observed the impulses visually and aurally, corresponded to an average information rate for single flashes of 0.7 bit/flash, compared to the maximum possible rate of 1 bit/flash. A threshold intensity giving 0.4 or more bit/flash, if presented in blocks of six identical flashes, corresponded to 0.95 or more bit/block, or near certainty. Thus the calculation of information rates using the index x provides an estimate of threshold at least as sensitive as those obtained during an experiment, which were made only after observing the responses to five to ten flashes of the same intensity. 4. The index x has statistical properties similar to those of the \"index of neural activity\" used by Tanner and Swets (1954) in their statistical model of human vision, and represents a possible physical interpretation of their index. However, x gave values (0.5 to 1.5) of the parameter called the slope which were consistently smaller than their values (2.1 to 3.1)."
            },
            "slug": "THE-STATISTICAL-DETECTION-OF-THRESHOLD-SIGNALS-IN-FitzHugh",
            "title": {
                "fragments": [],
                "text": "THE STATISTICAL DETECTION OF THRESHOLD SIGNALS IN THE RETINA"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The calculation of information rates using the index x provides an estimate of threshold at least as sensitive as those obtained during an experiment, which were made only after observing the responses to five to ten flashes of the same intensity."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of general physiology"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1755725"
                        ],
                        "name": "A. Buller",
                        "slug": "A.-Buller",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Buller",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Buller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2012683"
                        ],
                        "name": "J. Nicholls",
                        "slug": "J.-Nicholls",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Nicholls",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Nicholls"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060429"
                        ],
                        "name": "G. Ström",
                        "slug": "G.-Ström",
                        "structuredName": {
                            "firstName": "Gunnar",
                            "lastName": "Ström",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Ström"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 5901093,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a88665f0091c48481c98101c09458303927001a1",
            "isKey": false,
            "numCitedBy": 58,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "The discharge of impulses from the muscle spindle of the frog, when subjected to a constant mechanical stimulus (stretch), may show great irregularity. This is most noticeable when the muscle is near its resting length. The mean rate of impulses is then very low, and successive intervals appear to vary in a random manner. As the muscle is stretched, the rate of afferent discharge increases and irregularities become less obvious (Matthews, 1931). A possible explanation of the random discharge at low frequency has been suggested by Katz (1950a, b), on the basis of observations on single sensory nerve endings. Depolarization of the terminal branches of an axon in a muscle spindle was found to be responsible for the initiation of sensory impulses, the rate of the discharges depending upon the intensity of the local potential change. Fluctuations of the level of depolarization would therefore cause irregularity of the intervals between successive impulses. Such fluctuations of potential might be due directly to thermal agitation of ions in the nerve terminals, or they might be produced indirectly by molecular agitation in the mechanical receptor substance. At present, little is known about the mechanical receptor system, but the effects of thermal agitation in nerve endings can be subjected to a tentative theoretical analysis (see Fatt & Katz, 1952). Thus, the finer the diameter of a fibre, the larger will be the amplitude of 'voltage noise' at the terminal. For example, for an extremely fine ending, 0-1 ,u in diameter, a voltage fluctuation of the order of 0 5 mV r.m.s. has been estimated. The present experiments were planned to investigate whether this simple source of physical random disturbance could explain the observed fluctuations of impulse discharge. The irregularity was measured over a large range of frequencies of firing, applying various amounts of stretch to the muscle."
            },
            "slug": "Spontaneous-fluctuations-of-excitability-in-the-of-Buller-Nicholls",
            "title": {
                "fragments": [],
                "text": "Spontaneous fluctuations of excitability in the muscle spindle of the frog"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Depolarization of the terminal branches of an axon in a muscle spindle was found to be responsible for the initiation of sensory impulses, and it was planned to investigate whether this simple source of physical random disturbance could explain the observed fluctuations of impulse discharge."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2863334"
                        ],
                        "name": "I. Tasaki",
                        "slug": "I.-Tasaki",
                        "structuredName": {
                            "firstName": "Ichiji",
                            "lastName": "Tasaki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Tasaki"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116403949"
                        ],
                        "name": "H. Davis",
                        "slug": "H.-Davis",
                        "structuredName": {
                            "firstName": "Hallowell",
                            "lastName": "Davis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Davis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1401583,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "cf44106a5a530f317c1643266687e3207d577a4c",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "IN A RECENT PAPER one of us (7) described the technique and the results of recording impulses from individual auditory nerve fibers in the modiolus of the guinea pig. The present investigation is an extension to the cochlear nucleus in the medulla oblongata of the same technique of recording action potentials with submicroscopic microelectrodes (6). Action potentials from single elements in the cochlear nucleus have already been successfully recorded by Galambos and Davis (2, 3, 4) with an earlier type of microelectrode. The original purpose of the present investigation was to repeat their previous observations with a finer technique. There is a certain difference in behavior between the elements examined in the present investigation and those studied previously. The “response area” of an element is the area on an intensity-frequency plot that includes all tones that evoke a positive response. The response areas of the new elements show a sharp limit on the high-frequency side and very gradual elevation of threshold on the low-frequency side. The elements studied previously had, on the contrary, fairly narrow response areas with a clear maximum of sensitivity for a certain frequency that was characteristic of the element under observation. The new and the previous elements behaved differently in one other aspect: spontaneous discharges of impulses in the new elements were not inhibited by the application of any pure tone, while in the previous elements some tones inhibited and other tones enhanced the spontaneous repetitive activity."
            },
            "slug": "Electric-responses-of-individual-nerve-elements-in-Tasaki-Davis",
            "title": {
                "fragments": [],
                "text": "Electric responses of individual nerve elements in cochlear nucleus to sound stimulation (guinea pig)."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The present investigation is an extension to the cochlear nucleus in the medulla oblongata of the same technique of recording action potentials with submicroscopic microelectrodes, with certain difference in behavior between the elements examined in the present investigation."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1955
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4767554"
                        ],
                        "name": "E. Adrian",
                        "slug": "E.-Adrian",
                        "structuredName": {
                            "firstName": "Edgar",
                            "lastName": "Adrian",
                            "middleNames": [
                                "Douglas"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adrian"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 27,
                                "start": 24
                            }
                        ],
                        "text": "at tempt to fit formula (1) to the histograms, the parameter d was chosen as"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "(1) The maintained activity was decreased or suppressed but generally returned to its original level within a few minutes."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 49
                            }
                        ],
                        "text": "the following formula, which can be derived from (1):"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 23,
                                "start": 20
                            }
                        ],
                        "text": "represents equation (1) as fitted to the data."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 25
                            }
                        ],
                        "text": "f ( t ) ~ 0 0 <--_ t < d (1) --~ m e -m(~-d), d ~ l ~"
                    },
                    "intents": []
                }
            ],
            "corpusId": 40102371,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0f2db0e938d4ee33bc1d8efd307b99a7fe8d6afd",
            "isKey": true,
            "numCitedBy": 64,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "THE electrical activity of the optic ganglion of the Water Beetle (Dytiscus marginalis) was studied some years ago and the main results were summarized in a note [Adrian, 1932]. One feature of particular interest was the occurrence of rhythmic potential oscillations in the ganglion and of rhythmic bursts of impulses in the nerve, due apparently to synchronous activity in the nerve cells. The tendency to synchronization is now recognized to play a considerable part in the reactions of the cerebral cortex, and it has become important to know more about the conditions which promote it. The optic ganglion of Dytiscus is in some ways an ideal preparation for a study of this kind. It has a relatively complex structureindeed according to Zawarzin [1914] it is equivalent to the retina and optic lobes of a vertebrate-but its electrical reactions are simple and there is the great advantage that its activity can be readily controlled. It has therefore been re-examined in the hope that the results would show what might be expected of nerve cells in general. Although they illustrate a principle which has been invoked before, many of the results can be simply explained and they suggest an explanation for some of the reactions of the cerebral cortex."
            },
            "slug": "Synchronized-reactions-in-the-optic-ganglion-of-Adrian",
            "title": {
                "fragments": [],
                "text": "Synchronized reactions in the optic ganglion of dytiscus"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The optic ganglion of Dytiscus is re-examined in the hope that the results would show what might be expected of nerve cells in general and suggest an explanation for some of the reactions of the cerebral cortex."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1937
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50431698"
                        ],
                        "name": "S. A. Talbot",
                        "slug": "S.-A.-Talbot",
                        "structuredName": {
                            "firstName": "Samuel",
                            "lastName": "Talbot",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. A. Talbot"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6270661"
                        ],
                        "name": "S. W. Kuffler",
                        "slug": "S.-W.-Kuffler",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Kuffler",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. W. Kuffler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30421657,
            "fieldsOfStudy": [
                "Medicine",
                "Biology"
            ],
            "id": "df7b6ce93159e91cd042e3f32daf3911cf1bd037",
            "isKey": false,
            "numCitedBy": 34,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "An ophthalmoscope is described for electrophysiological research on the retina. It adds to the usual viewing and illuminating beam two stimulating beams whose patterns may also be viewed and photographed. A large region of the mammalian fundus can be surveyed, the eye being in the center of a spherical coordinate system.The design provides measured adaptive and stimulating parameters over the photopic range, sufficient to study intensity, color, timing, and spatial interaction in the retinal mechanisms. Extension to mesopia and scotopia is possible.Associated optically and mechanically are devices for locating, holding, and directing the eye and head of anaesthetized cats (or monkeys). The eye holder carries a small micromanipulator to control the direction and feed of microelectrodes. This arrangement provides stable electrical contact with single optic ganglion cells for long periods.The method does not interfere with normal metabolism and optical functioning of the eye."
            },
            "slug": "A-multibeam-ophthalmoscope-for-the-study-of-retinal-Talbot-Kuffler",
            "title": {
                "fragments": [],
                "text": "A multibeam ophthalmoscope for the study of retinal physiology."
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "An ophthalmoscope is described for electrophysiological research on the retina, providing measured adaptive and stimulating parameters over the photopic range, sufficient to study intensity, color, timing, and spatial interaction in the retinal mechanisms."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1952
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "93601549"
                        ],
                        "name": "B. Katz",
                        "slug": "B.-Katz",
                        "structuredName": {
                            "firstName": "Bernhard",
                            "lastName": "Katz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Katz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 207,
                                "start": 196
                            }
                        ],
                        "text": "It might arise either in the photoreceptors, by the spontaneous decomposition of visual pigment, or in an excitation of fine dendritic terminals by random electrical noise of the sort proposed by Katz (1950)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 3083603,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "72c8f305df36716a048aea3db25eefc20df710d9",
            "isKey": false,
            "numCitedBy": 143,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The initiation of sensory impulses presents a series of problems: (a) the transmission of the stimulus from its external source to the receptor cell; (b) the mechanism whereby the stimulus is transformed into an electrical membrane change capable of exciting nerve terminals; (c) the initiation of impulses at the nerve ending and their propagation into the afferent axon trunk. An attempt has been made here to throw further light on these problems by studying the electrical changes in a sensory nerve fibre at a point close to its peripheral terminals. It is clear that only the last aspect of the problem (c) is directly amenable to electrical investigation, but such a study may also provide important clues to the preceding links of the process (a and b). A suitable preparation was obtained from the muscle spindle of the frog. The electric response in the sensory axon close to the spindle differs in certain respects from a simple nerve spike, and some of these features can be related to the local events which take place in the sense organ. In the present paper the action potential in the terminal portions of the fibre will be described. It will also be shown that the initiation of an impulse at a sensory nerve ending does not invariably lead to a propagated message in the main axon. In the following paper, stretching of the muscle will be shown to depolarize the sensory nerve endings and thereby give rise to a repetitive discharge of impulses."
            },
            "slug": "Action-potentials-from-a-sensory-nerve-ending-Katz",
            "title": {
                "fragments": [],
                "text": "Action potentials from a sensory nerve ending"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "It is shown that the initiation of an impulse at a sensory nerve ending does not invariably lead to a propagated message in the main axon, and stretching of the muscle will be shown to depolarize the sensory nerve endings and thereby give rise to a repetitive discharge of impulses."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1950
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2026379"
                        ],
                        "name": "Y. Katsuki",
                        "slug": "Y.-Katsuki",
                        "structuredName": {
                            "firstName": "Yasuji",
                            "lastName": "Katsuki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Katsuki"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "88372124"
                        ],
                        "name": "S. Yoshino",
                        "slug": "S.-Yoshino",
                        "structuredName": {
                            "firstName": "Shizuo",
                            "lastName": "Yoshino",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Yoshino"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115629513"
                        ],
                        "name": "Jung Chen",
                        "slug": "Jung-Chen",
                        "structuredName": {
                            "firstName": "Jung",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jung Chen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 92944862,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "7c1d4560ed7afb5917048602885ff1b49e174d5d",
            "isKey": false,
            "numCitedBy": 66,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "The function of the lateral-line organ of Japanese eel has been examined precisely by means of recording the impulse discharges from a single nerve fiber supplying the organ, which was activated by various kinds of natural and artificial stimulations. The results obtained are summarised, as follows.1) Examinations by water flow.With a calm water flow only thin nerve fibers could be excited. Somewhat higher rates of flow first excite the thicker fibers. The aspect of discharges was not changed by the direction of the water flow. The number of discharges from a single nerve fiber increased with increase of the flow rate. The maximum discharge frequency attained was different in fibers with different diameters. The relation between the average number of spikes and the logarithm of the flow rate was nearly linear in every single fiber examined.2) Examinations by pressure and touch.Applying pressures of various grades on the skin surface along the lateralline, results were obtained, which were similar to those above mentioned qualitatively and quantitatively. However, some very thick fibers of phasic nature were' very sensitive to the impulse shock and had a relatively low thresholds. They showed sometimes inhibitory phenomena during stimulation, and facilitatoryeffect after the cessation of the stimulation. The lateral-line organ of fish has, too, a dual innervation of slow and phasic fibers, as many other sensory organs have.3) Examination by mechanical vibrations.In all fibers examined, the discharges were seen to appear in every cycle of mechanical vibrations, provided that the vibration frequency was relatively low. With very low frequencies we had generally a few spikes in each cycle, which changed into one-for-one relation in the middle range of frequency (20-50 cps.). When the stimulus frequency was further increased, there appeared the discharge deficit oftener, the more frequent the stimulus. The largest frequency producing one-for-one appearance of the spikes was different in different fibers, owing to the different diameters. The thicker the fiber the higher it was. The thinnest fiber could follow the vibrations of under 10 cps. only. On the contrary most of the thicker fibers could follow those of 50 cps., and the thickest one even to those near 100 cps.4) The D. C. stimulation of the receptor easily evokes the iterative firing of the nerve fiber. The average number of spikes had a linear relationship with the logarithm of the current strength. The threshold for repetitive discharges could not be determined precisely, but it was certain that weak currents made the thinner fibers discharge more easily than the thicker fibers. Many fibers were excited by the ingoing current and a few by the outgoing one.5) The A. C. stimulation of the receptor evoked, also, discharges in every stimulus cycle. For the low stimulus frequency there were a few spikes in the negative phase only. With the increase of the stimulus frequency the number of spikes in one stimulus cycle decreased gradually, to become the one-for-one appearance, to random falling out of the spikes, and finally to a stage where there resulted only one impulse in many stimulus cycles. The maximum frequency for one-for-one appearance of the spikes was related to the fiber diameter, the thicker fiber being able to follow a higher frequency. The upper limit could not be determined owing to the disturbances brought by the stimulus current itself.The strength of the stimulating current caused changes in the aspect of the discharges. Namely, an increase in strength brought more spikes to appear in the negative phase. With very low frequency it resulted in some spikes appearing in the positive phase, too. If the stimulus frequency is high, and if the current is sufficiently strong, then the one-for-one appearance of the spikes continued to follow much higher frequency, than when it is weak."
            },
            "slug": "Action-currents-of-the-single-lateral-line-nerve-of-Katsuki-Yoshino",
            "title": {
                "fragments": [],
                "text": "Action currents of the single lateral-line nerve fiber of fish〔1〕on the spontaneous discharge-"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1950
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4160446"
                        ],
                        "name": "Y. Zotterman",
                        "slug": "Y.-Zotterman",
                        "structuredName": {
                            "firstName": "Yngve",
                            "lastName": "Zotterman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Zotterman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41253181,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c278bcf6c9e053e57670ce077faa240ac29dca4a",
            "isKey": false,
            "numCitedBy": 93,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "an en­ entirely new view of the peripheral afferent part of the thermoregulatory system, as well as of many sensory phenomena hitherto the subject of much debate. For that reason it was considered justified to limit this review en­ tirely to thermal receptors. The temperature movements in the skin have been subject to theoretical as well as experimental investigations by Hensel (2, 3), who has developed effective methods for recording the intracutaneous temperature gradient in stationary conditions as well as a precision-flow-ca lorimeter for measuring the steady heat flow given off from small skin areas, the mean error of the method being only ± 0.0001 cal. cm.2 sec.-1 The new \"Stromungskalorime ter\" constructed by Hensel (4) can be used clinically also for the determination of the blood flow through the skin. For details, see Hensel's monograph \"Physiologie der Thermoreception\" in Ergebnisse der Physiologie (5). The depths of cold receptors in the tongue of the cat have been recorded in aIi objective way by Hensel, Strom, and Zotterman (6). This method is based on the recording of the spike potential of specific cold fibres in the lingual nerve set up by applying rapid cold jumps to the tongue and by simul­ taneous recording of the temperature changes. The depth of the cold recep­ tors was calculated from determinations of (a) the threshold, (b) the tempera­ ture change of the thermode, (c) the latency of the specific cold spikes, (d) the thermal diffusion coefficient of the tongue. From a great number of meas­ urements on the tongue of the cat, a mean value of 0.18 mm. ±0.04 was ob­ tained. The cold receptors are thus situated closely beneath the epithelium. At this depth an abundance of afferent nerve endings of various configura­ tions have been described by histologists (ef. Sanders (7)). The investigations of the receptive field for thermoceptors has often led to much debate. The question is, as Jenkins (8) formulates it, whether it should be compared with an unsensitive surface with spread circumscript sensitive spots or rather as a continuum with peaks, valleys, and plateaus. The peaks should then cor­ respond to the spots according to the classical view. Hensel (5) maintains 1 The survey of the literature pertaining to this review was concluded in June,"
            },
            "slug": "Special-senses:-thermal-receptors.-Zotterman",
            "title": {
                "fragments": [],
                "text": "Special senses: thermal receptors."
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "An entirely new view of the peripheral afferent part of the thermoregulatory system, as well as of many sensory phenomena hitherto the subject of much debate, is considered justified to limit this review to thermal receptors."
            },
            "venue": {
                "fragments": [],
                "text": "Annual review of physiology"
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 102
                            }
                        ],
                        "text": "Such spontaneity is of special interest in the eye because it related to the threshold-noise problem (Barlow, 1956; FitzHugh, 1957) and may be at the basis of \"visual grey\" perception."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 10
                            }
                        ],
                        "text": "Equations (4), it is true, do not provide a maximum likelihood estimate for the two parameters (as was true for the exponential distribution), although this condition may actually be necessary to justify our procedure (Kendall, 1945)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 38871475,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "a4904e88d0ae48937db30e8ebd75abe176988161",
            "isKey": false,
            "numCitedBy": 418,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown that the absorption of one quantum can excite a rod in the human retina, but that at least two, and probably many more, excited rods are needed to give a sensation of light. It is suggested that noise in the optic pathway limits its sensitivity, and this idea is subjected to an experimental test. The hypothesis is then formulated quantitatively, and shown to be able to account for the above experiment, and also the disagreement in the literature between those who believe that the absorption of two quanta can cause a sensation, and those who believe that 5 or more are required. The formulation of the hypothesis is used to calculate the maximum allowable noise (expressed as a number x of random, independent events confusable with the absorption of a quantum of light) in the optic pathway for the absorption of various fractions of the total number of quanta incident at the cornea."
            },
            "slug": "Retinal-noise-and-absolute-threshold.-Barlow",
            "title": {
                "fragments": [],
                "text": "Retinal noise and absolute threshold."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The hypothesis that noise in the optic pathway limits its sensitivity is formulated quantitatively, and shown to be able to account for the above experiment, and also the disagreement in the literature between those who believe that the absorption of two quanta can cause a sensation, and thosewho believe that 5 or more are required."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40390803"
                        ],
                        "name": "M. Cohen",
                        "slug": "M.-Cohen",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Cohen",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Cohen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 45461691,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "df4984e00f56a701466bcd5b83fba4313872454c",
            "isKey": false,
            "numCitedBy": 123,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "The great majority of animals normally maintain a definite attitude within the gravitational field which Fraenkel & Gunn (1940) term the primary orientation. It is the characteristic position an animal assumes when at rest and from which all active movements originate. Such a normal position is generally not defined by the organism's physical centre of gravity, but is actively achieved and maintained. An orientation of this type is possible only if receptors are available which are sensitive to the magnitude and relative direction of gravitational force. It is the purpose of this study to investigate such receptors in the invertebrate statocyst by recording action potentials from the primary afferent neurones. The organ classically associated with geo-Qrientation is the statocyst, a term which has been applied to the vertebrate utriculus and sacculus as well as to the invertebrate equilibrium organ (Fraenkel & Gunn, 1940; von Buddenbrock, 1952). For the purpose of clarity, the vertebrate utriculus and sacculus will be referred to as otolith organs, following the usage of Lowenstein (1950), and the analogous invertebrate structure as a statocyst. The statocyst can be described as an ectodermal sac, fluid-filled and lined by hairs which are in contact with a relatively dense mass, the statolith. Such structures occur in all major metazoan phyla (Plate, 1924; Kolmer, 1926) and their appearance in the Hydromedusae, which are still at a tissue level of organization, qualify them in a real sense as the first organ to appear in the animal kingdom. The most intensive investigation of statocysts, both from a morphological and physiological standpoint, has occurred in the decapod crustacea. Within this group, including lobsters, shrimps and crabs, a statocyst occurs in the basal segment of each antennule, thereby being readily accessible to experimental manipulation with a minimum of trauma to the animal. Following the"
            },
            "slug": "The-function-of-receptors-in-the-statocyst-of-the-Cohen",
            "title": {
                "fragments": [],
                "text": "The function of receptors in the statocyst of the lobster Homarus americanus"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The purpose of this study is to investigate receptors in the invertebrate statocyst by recording action potentials from the primary afferent neurones by investigating the most intensive investigation of statocysts, both from a morphological and physiological standpoint."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1955
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4004047"
                        ],
                        "name": "S. Hagiwara",
                        "slug": "S.-Hagiwara",
                        "structuredName": {
                            "firstName": "Susumu",
                            "lastName": "Hagiwara",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Hagiwara"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 15,
                                "start": 0
                            }
                        ],
                        "text": "Hagiwara (1954), studying afferent discharges from muscle spindles, used a different formula, but his curves look similar to the gamma distribution."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 151,
                                "start": 136
                            }
                        ],
                        "text": "The first problem has been studied for the afferent discharge from the frog's muscle spindle by Buller, Nicholls, and Striim (1953) and Hagiwara (1954)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 70,
                                "start": 55
                            }
                        ],
                        "text": "However, in the frog muscle spindle afferent discharge Hagiwara (1954) found no significant serial correlation."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 44353627,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "30c7e38b92d3abfc6f5686b16d41573a66b916fd",
            "isKey": true,
            "numCitedBy": 89,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "(1) The interval fluctuation of impulses of the tonic nerve fiber from the muscle spindle of a Japanese toad is investigated by method of the time series analysis.(2) Dividing the interval series into several stationary subseries and computing the serial correlation coefficients, we find that these subseries can be considered as a random process.(3) In these stationary subseries, not only the absolute value of the standard deviation but also its relative value to the mean interval becomes larger with the increase of the mean interval.(4) High correlation among the moments of the interval distribution makes us conclude that each of the distributions obtained from the same preparation can be characterized by a single parameter.(5) Assuming a random fluctuation such as that due to the thermal agitation the equation of distribution is calculated. And comparison is made between the observed and the calculated histograms."
            },
            "slug": "Analysis-of-interval-fluctuation-of-the-sensory-Hagiwara",
            "title": {
                "fragments": [],
                "text": "Analysis of interval fluctuation of the sensory nerve impulse."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "High correlation among the moments of the interval distribution makes it conclude that each of the distributions obtained from the same preparation can be characterized by a single parameter."
            },
            "venue": {
                "fragments": [],
                "text": "The Japanese journal of physiology"
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6477650"
                        ],
                        "name": "P. L. du Noüy",
                        "slug": "P.-L.-du-Noüy",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "du Noüy",
                            "middleNames": [
                                "Lecomte"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. L. du Noüy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3243204,
            "fieldsOfStudy": [
                "Physics",
                "Education"
            ],
            "id": "7a072146327f54c4fba45b6a459043907f3d8621",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "THE interesting researches of Prof. S. P. Langley on energy and vision have recently been published in the Memoirs of the American National Academy of Sciences. From this we gather that he was led to in- vestigate the question by the fact that it was not generally recognized how totally different effects may be produced by the same amount of energy in different parts of the spectrum. Two series of experiments were necessary, the first to determine the amount of energy in each ray, the second to observe the corresponding visual effect. The energy was determined as heat by the use of the bolometer, the heat dispersed by a prism being very nearly proportionate to the energy."
            },
            "slug": "ENERGY-AND-VISION-Noüy",
            "title": {
                "fragments": [],
                "text": "ENERGY AND VISION"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Prof. S. P. Langley was led to in- vestigate the question by the fact that it was not generally recognized how totally different effects may be produced by the same amount of energy in different parts of the spectrum."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1893
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36004540"
                        ],
                        "name": "W. P. Tanner",
                        "slug": "W.-P.-Tanner",
                        "structuredName": {
                            "firstName": "Wilson",
                            "lastName": "Tanner",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. P. Tanner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2498246"
                        ],
                        "name": "J. Swets",
                        "slug": "J.-Swets",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Swets",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Swets"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26612649,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "09dc4bc616b83dcdea522ca261bb8b360571e056",
            "isKey": false,
            "numCitedBy": 50,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of visual detection is developed, based on the model provided by the theory of signal detectability,2 and, more generally, by the theory of statistical decision. Two experiments are reported which test some predictions of the theory for the case of the signal-known-exactly. These experiments demonstrate that the human observer tends toward optimum behavior, where optimum behavior is defined as that behavior which maximizes the expected gain from the decision. Their results show the proportion of correct detections to be dependent upon the proportion of false alarms; they indicate that neural activity is a power function of signal intensity. The data also demand a re-evaluation of the threshhold concept. Predictions are made for the data obtained using two different methods of response, forced-choice end yes-no, and the internal consistency of the theory is demonstrated. The predictions of the theory are compared with contrasting predictions of conventional sensory theory; the data are also related to conventional theory."
            },
            "slug": "The-human-use-of-information-I:-Signal-detection-of-Tanner-Swets",
            "title": {
                "fragments": [],
                "text": "The human use of information-I: Signal detection for the case of the signal known exactly"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "These experiments demonstrate that the human observer tends toward optimum behavior, where optimum behavior is defined as that behavior which maximizes the expected gain from the decision."
            },
            "venue": {
                "fragments": [],
                "text": "Trans. IRE Prof. Group Inf. Theory"
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16193459"
                        ],
                        "name": "J. Lebensohn",
                        "slug": "J.-Lebensohn",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Lebensohn",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lebensohn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 79611199,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "873b1b19e2604e5e9ddb04f003b5e11814e27bed",
            "isKey": false,
            "numCitedBy": 459,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Sensory-Mechanisms-of-the-Retina-Lebensohn",
            "title": {
                "fragments": [],
                "text": "Sensory Mechanisms of the Retina"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1947
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48444003"
                        ],
                        "name": "Adrian",
                        "slug": "Adrian",
                        "structuredName": {
                            "firstName": "",
                            "lastName": "Adrian",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Adrian"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 31454001,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "d29620c2ee1113f80c2f8a833b91634173f5db70",
            "isKey": false,
            "numCitedBy": 192,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Receptors and Sensory PerceptionA Discussion of Aims, Means, and Results of Electrophysiological Research into the Process of Reception. (Mrs. Hepsa Ely Silliman Memorial Lectures.) By Dr. Ragnar Granit. Pp. xii + 369. (New Haven, Conn.: Yale University Press; London: Oxford University Press, 1955.) 5 dollars; 40s. net."
            },
            "slug": "Receptors-and-Sensory-Perception-Adrian",
            "title": {
                "fragments": [],
                "text": "Receptors and Sensory Perception"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Receptors and Sensory PerceptionA Discussion of Aims, Means, and Results of Electrophysiological Research into the Process of Reception."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1955
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40692782"
                        ],
                        "name": "M. Kendall",
                        "slug": "M.-Kendall",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Kendall",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Kendall"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 81
                            }
                        ],
                        "text": "This mean value was found to be significantly different from zero by the t-test (Fisher, 1948), which gave a P of less than 0.1 per cent."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 4018463,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "28a215515d10b0ccadef846c61894e2e8a4ff65a",
            "isKey": true,
            "numCitedBy": 7266,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "THIS book has done more than any other to popularize the use of modern statistical methods. Thousands of workers have been taught to use statistical machinery without the burdensome necessity of knowing exactly how it works. Six editions have appeared in twelve years, and the number of pages has been steadily increasing. To facilitate reference the numbering of the sections has been kept constant. It would be convenient if the numbers of the sections could be printed at the top of each page. The book maintains its place as the standard work on its subject for the ordinary scientific worker.Statistical Methods for Research WorkersProf.R. A.FisherBy. (Biological Monographs and Manuals.) Sixth edition, revised and enlarged. Pp. xiv + 339. (Edinburgh and London: Oliver and Boyd, 1936.) 15s. net."
            },
            "slug": "Statistical-Methods-for-Research-Workers-Kendall",
            "title": {
                "fragments": [],
                "text": "Statistical Methods for Research Workers"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "This book has done more than any other to popularize the use of modern statistical methods and maintains its place as the standard work on its subject for the ordinary scientific worker."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1937
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49353544"
                        ],
                        "name": "R. Fisher",
                        "slug": "R.-Fisher",
                        "structuredName": {
                            "firstName": "Rory",
                            "lastName": "Fisher",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Fisher"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 159,
                                "start": 146
                            }
                        ],
                        "text": "…all strongly skewed (asymmetrical about the mean value) and since the interval ¢ is a positive number, the gamma distribution (Pearson's type III: Kendall, 1945) was tried: kata-le...-kt f(t) ~--r(a) ' 0  t  co (3) A satisfactory fit was found, although this expression does not contain the…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 166
                            }
                        ],
                        "text": "Since the histograms were all strongly skewed (asymmetrical about the mean value) and since the interval ¢ is a positive number, the gamma distribution (Pearson's type III: Kendall, 1945) was tried: kata-le...-kt f(t) ~--r(a) ' 0  t  co (3) A satisfactory fit was found, although this expression does not contain the minimum interval d."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 159,
                                "start": 146
                            }
                        ],
                        "text": "The jth serial correlation coefficient ri is a measure of the correlation between the duration of any interval and that of the jth preceding one (Kendall, 1945; Yule and Kendall, 1950)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 174,
                                "start": 171
                            }
                        ],
                        "text": "A statistical analysis of the impulse intervals of the maintained discharge showed: (a) the intervals were distributed according to the gamma distribution (Pearson's type III), (b) the first serial correlation coefficient of the intervals was between -0.10 and -0.24, with a mean value of -0.17, which is significantly different from zero, (c) the higher order serial correlation coefficients were not significantly different from zero."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 136
                            }
                        ],
                        "text": "Light from the stimulator passed through a contact lens on the cat's cornea and the natural pupil which was dilated by section of nerve III."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 232,
                                "start": 219
                            }
                        ],
                        "text": "Equations (4), it is true, do not provide a maximum likelihood estimate for the two parameters (as was true for the exponential distribution), although this condition may actually be necessary to justify our procedure (Kendall, 1945)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 1125653,
            "fieldsOfStudy": [
                "History"
            ],
            "id": "f1e6b11ef644581754765342b4fc4fdebb686ea7",
            "isKey": true,
            "numCitedBy": 2459,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "THIS very handsomely produced volume is one which it will be a pleasure to any mathematical statistician to possess. Mr. Kendall is indeed to be congratulated on the energy and, unswerving perseverance needed to complete his heavy task, and encouraged in the still unflagging energy which will be needed for the second volume. So far as he has carried, his work, he has certainly done something to sustain the credit of Great Britain in mathematical scholarship.The Advanced Theory of StatisticsBy Maurice G. Kendall. Vol. 1. Pp. xii + 457. (London: Charles Griffin and Co., Ltd., 1943.) 42s. net."
            },
            "slug": "The-Advanced-Theory-of-Statistics-Fisher",
            "title": {
                "fragments": [],
                "text": "The Advanced Theory of Statistics"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1943
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69857560"
                        ],
                        "name": "A. Mood",
                        "slug": "A.-Mood",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Mood",
                            "middleNames": [
                                "McFarlane"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Mood"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 183,
                                "start": 161
                            }
                        ],
                        "text": "The jth serial correlation coefficient ri is a measure of the correlation between the duration of any interval and that of the jth preceding one (Kendall, 1945; Yule and Kendall, 1950)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 3973811,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "3da8684050df72c07731c030f7669a920ccfffde",
            "isKey": false,
            "numCitedBy": 2373,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "1 probability 2 Random variables, distribution functions, and expectation 3 Special parametric families of univariate distributions 4 Joint and conditional distributions, stochastic independence, more expectation 5 Distributions of functions of random variables 6 Sampling and sampling distributions 7 Parametric point estimation 8 Parametric interval estimation 9 Tests of hypotheses 10 Linear models 11 Nonparametric method Appendix A Mathematical Addendum Appendix B tabular summary of parametric families of distributions Appendix C References and related reading Appendix D Tables"
            },
            "slug": "An-Introduction-to-the-Theory-of-Statistics-Mood",
            "title": {
                "fragments": [],
                "text": "An Introduction to the Theory of Statistics"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1911
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 159,
                                "start": 146
                            }
                        ],
                        "text": "…all strongly skewed (asymmetrical about the mean value) and since the interval ¢ is a positive number, the gamma distribution (Pearson's type III: Kendall, 1945) was tried: kata-le...-kt f(t) ~--r(a) ' 0  t  co (3) A satisfactory fit was found, although this expression does not contain the…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 166
                            }
                        ],
                        "text": "Since the histograms were all strongly skewed (asymmetrical about the mean value) and since the interval ¢ is a positive number, the gamma distribution (Pearson's type III: Kendall, 1945) was tried: kata-le...-kt f(t) ~--r(a) ' 0  t  co (3) A satisfactory fit was found, although this expression does not contain the minimum interval d."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 159,
                                "start": 146
                            }
                        ],
                        "text": "The jth serial correlation coefficient ri is a measure of the correlation between the duration of any interval and that of the jth preceding one (Kendall, 1945; Yule and Kendall, 1950)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 174,
                                "start": 171
                            }
                        ],
                        "text": "A statistical analysis of the impulse intervals of the maintained discharge showed: (a) the intervals were distributed according to the gamma distribution (Pearson's type III), (b) the first serial correlation coefficient of the intervals was between -0.10 and -0.24, with a mean value of -0.17, which is significantly different from zero, (c) the higher order serial correlation coefficients were not significantly different from zero."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 136
                            }
                        ],
                        "text": "Light from the stimulator passed through a contact lens on the cat's cornea and the natural pupil which was dilated by section of nerve III."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 232,
                                "start": 219
                            }
                        ],
                        "text": "Equations (4), it is true, do not provide a maximum likelihood estimate for the two parameters (as was true for the exponential distribution), although this condition may actually be necessary to justify our procedure (Kendall, 1945)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The advanced theory of statistics, London"
            },
            "venue": {
                "fragments": [],
                "text": "Griffin and Co., 1945,"
            },
            "year": 1945
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 81
                            }
                        ],
                        "text": "This mean value was found to be significantly different from zero by the t-test (Fisher, 1948), which gave a P of less than 0.1 per cent."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Statistical Methods for Research Workers, New York: I-Iafner Publishing Co., Inc"
            },
            "venue": {
                "fragments": [],
                "text": "10th edition,"
            },
            "year": 1948
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 15,
                                "start": 0
                            }
                        ],
                        "text": "Hagiwara (1949), studying the discharge of human motor units during voluntary contraction, found an rl of about -0.5; the higher order coefficients were nearly zero."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the fluctuations of the interval of the rhythmic excitation. I. The efferent impulse of the human motor unit during the voluntary contraction, (in Japanese, with English summary)"
            },
            "venue": {
                "fragments": [],
                "text": "Bull. Physiograph. Sc. Re. search Inst. Tokyo Uni% 1949,"
            },
            "year": 1949
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 15,
                                "start": 0
                            }
                        ],
                        "text": "Hagiwara (1949), studying the discharge of human motor units during voluntary contraction, found an rl of about -0.5; the higher order coefficients were nearly zero."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the fluctuations of the interval of the rhythmic excitation. I. The efferent impulse of the human motor unit during the voluntary contraction"
            },
            "venue": {
                "fragments": [],
                "text": "Bull. Physiograph. Sc. Re. search Inst. Tokyo Uni%"
            },
            "year": 1949
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "corpusId": 155709311,
            "fieldsOfStudy": [],
            "id": "61d8c85e5d486d7016ba9a88439fd3031cb4adf6",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Statistical Methods for Research Workers"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1952
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16974196"
                        ],
                        "name": "L. Alaoglu",
                        "slug": "L.-Alaoglu",
                        "structuredName": {
                            "firstName": "Leonidas",
                            "lastName": "Alaoglu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Alaoglu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50463426"
                        ],
                        "name": "N. M. Smith",
                        "slug": "N.-M.-Smith",
                        "structuredName": {
                            "firstName": "Nicholas",
                            "lastName": "Smith",
                            "middleNames": [
                                "M."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. M. Smith"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 162,
                                "start": 139
                            }
                        ],
                        "text": "The distribution curve of intervals (t) in a Geiger counter discharge with dead time d is closely approximated by an exponential function (Alaoglu and Smith, 1938) : In order to compare the ganglion cell discharge statistically with that from a Geiger counter, the values of the intervals were…"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 119994525,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "c245a2ddcb6c561995b56dd09e69f1c334445286",
            "isKey": false,
            "numCitedBy": 32,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Statistical-Theory-of-a-Scaling-Circuit-Alaoglu-Smith",
            "title": {
                "fragments": [],
                "text": "Statistical Theory of a Scaling Circuit"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1938
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5801079"
                        ],
                        "name": "E. MacNichol",
                        "slug": "E.-MacNichol",
                        "structuredName": {
                            "firstName": "Edward F.",
                            "lastName": "MacNichol",
                            "middleNames": [],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. MacNichol"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153334844"
                        ],
                        "name": "H. Wagner",
                        "slug": "H.-Wagner",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Wagner",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wagner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "The increased baseline disturbance on touching the retina is therefore not due to an increased input resistance."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 110609036,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "54ad86d8c1df8a8c50aae24718855df25b1a0931",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-HIGH-IMPEDANCE-INPUT-CIRCUIT-SUITABLE-FOR-FROM-MacNichol-Wagner",
            "title": {
                "fragments": [],
                "text": "A HIGH IMPEDANCE INPUT CIRCUIT SUITABLE FOR ELECTROPHYSIOLOGICAL RECORDING FROM MICRO-PIPETTE ELECTRODES"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8470693"
                        ],
                        "name": "R. FitzHugh",
                        "slug": "R.-FitzHugh",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "FitzHugh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. FitzHugh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6270661"
                        ],
                        "name": "S. W. Kuffler",
                        "slug": "S.-W.-Kuffler",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Kuffler",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. W. Kuffler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 41651429,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "929f33d2c4ede915b830e5a47b5007cd4c870386",
            "isKey": false,
            "numCitedBy": 762,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Change-of-organization-in-the-receptive-fields-of-Barlow-FitzHugh",
            "title": {
                "fragments": [],
                "text": "Change of organization in the receptive fields of the cat's retina during dark adaptation"
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6270661"
                        ],
                        "name": "S. W. Kuffler",
                        "slug": "S.-W.-Kuffler",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Kuffler",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. W. Kuffler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 151
                            }
                        ],
                        "text": "Maintained activity in single ganglion cells of the cat has frequently been observed by Granit (1947) and Noell (1953), and has been regularly seen by Kuflter (1952; 1953)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 104
                            }
                        ],
                        "text": "The optical equipment and general experimental set up have already been described in detail (Talbot and Kuflter, 1952)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 41143324,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1c253ba1d9619ead06c2cab151aeef6aabbe0be6",
            "isKey": false,
            "numCitedBy": 202,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Neurons-in-the-retina;-organization,-inhibition-and-Kuffler",
            "title": {
                "fragments": [],
                "text": "Neurons in the retina; organization, inhibition and excitation problems."
            },
            "venue": {
                "fragments": [],
                "text": "Cold Spring Harbor symposia on quantitative biology"
            },
            "year": 1952
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39495075"
                        ],
                        "name": "O. Löwenstein",
                        "slug": "O.-Löwenstein",
                        "structuredName": {
                            "firstName": "Otto",
                            "lastName": "Löwenstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Löwenstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47209612"
                        ],
                        "name": "A. Sand",
                        "slug": "A.-Sand",
                        "structuredName": {
                            "firstName": "Alec",
                            "lastName": "Sand",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Sand"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 22620399,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "79d6c9ef94173c2938f691bf2336d7a9c558cc29",
            "isKey": false,
            "numCitedBy": 177,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-individual-and-integrated-activity-of-the-of-Löwenstein-Sand",
            "title": {
                "fragments": [],
                "text": "The individual and integrated activity of the semicircular canals of the elasmobranch labyrinth"
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1940
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 112
                            }
                        ],
                        "text": "experimental mean t and the standard deviation ~t by the following formulas, which can be derived from equation (3) (Weatherburn, 1946):"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "~ber zeitliches Aufl6sungsverm6gen und PrimRrvorg'~nge im Insektenauge,  Naturu"
            },
            "venue": {
                "fragments": [],
                "text": "i~sensct~fl~,n,"
            },
            "year": 1952
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Receptors and Sensory Perception, New Haven, Yale"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1955
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Maintained activity in the cat ' s retina in light and darkness"
            },
            "venue": {
                "fragments": [],
                "text": "J . Gen . Physiol ."
            },
            "year": 1957
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "~ber zeitliches Aufl6sungsverm6gen und PrimRrvorg'~nge im Insektenauge"
            },
            "venue": {
                "fragments": [],
                "text": "~ber zeitliches Aufl6sungsverm6gen und PrimRrvorg'~nge im Insektenauge"
            },
            "year": 290
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Considerations sur l'origine et la nature des 'ondes' c6r6brales"
            },
            "venue": {
                "fragments": [],
                "text": "EEG. Clin. Neurophysiol.,"
            },
            "year": 1949
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 118,
                                "start": 106
                            }
                        ],
                        "text": "Maintained activity in single ganglion cells of the cat has frequently been observed by Granit (1947) and Noell (1953), and has been regularly seen by Kuflter (1952; 1953)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Studies on the electrophysiology and metabolism of the retina"
            },
            "venue": {
                "fragments": [],
                "text": "United States Air Force School of Aviation Medicine Project No. 21-12010004,"
            },
            "year": 1953
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 151
                            }
                        ],
                        "text": "Maintained activity in single ganglion cells of the cat has frequently been observed by Granit (1947) and Noell (1953), and has been regularly seen by Kuflter (1952; 1953)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 104
                            }
                        ],
                        "text": "The optical equipment and general experimental set up have already been described in detail (Talbot and Kuflter, 1952)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Nenrones in the retln ~ : organization , inhibition and excitation problems , Cold Spring Harbor Syrup"
            },
            "venue": {
                "fragments": [],
                "text": "Quant . Biol"
            },
            "year": 1952
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Spontaneous activity and behavior"
            },
            "venue": {
                "fragments": [],
                "text": "Scient. Month"
            },
            "year": 1955
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 151
                            }
                        ],
                        "text": "Maintained activity in single ganglion cells of the cat has frequently been observed by Granit (1947) and Noell (1953), and has been regularly seen by Kuflter (1952; 1953)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 104
                            }
                        ],
                        "text": "The optical equipment and general experimental set up have already been described in detail (Talbot and Kuflter, 1952)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Nenrones in the retln~: organization, inhibition and excitation problems,  Cold Spring Harbor Syrup"
            },
            "venue": {
                "fragments": [],
                "text": "Quant. Biol.,"
            },
            "year": 1952
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 151
                            }
                        ],
                        "text": "Maintained activity in single ganglion cells of the cat has frequently been observed by Granit (1947) and Noell (1953), and has been regularly seen by Kuflter (1952; 1953)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 104
                            }
                        ],
                        "text": "The optical equipment and general experimental set up have already been described in detail (Talbot and Kuflter, 1952)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Nenrones in the retln~: organization, inhibition and excitation problems,  Cold Spring Harbor Syrup"
            },
            "venue": {
                "fragments": [],
                "text": "Quant. Biol.,"
            },
            "year": 1952
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Considerations sur l ' origine et la nature des ' ondes ' c 6 r 6 brales , EEG"
            },
            "venue": {
                "fragments": [],
                "text": "Clin . Neurophysiol ."
            },
            "year": 1949
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Action currents of the single iateralline nerve fiber of fish. 1. On the spontaneous discharge,  Japan"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol.,"
            },
            "year": 1950
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Properties of an infrared receptor"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol.,"
            },
            "year": 1956
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Considerations sur l'origine et la nature des 'ondes' c6r6brales, EEG"
            },
            "venue": {
                "fragments": [],
                "text": "Clin. Neurophysiol"
            },
            "year": 1949
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Energy and vision, in Science in Progress"
            },
            "venue": {
                "fragments": [],
                "text": "(G. A. Baitsell, editor),"
            },
            "year": 1945
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A high-impedance input circuit suitable for electrophysiological recording from micropipette electrodes,  Research Report, Naval Med"
            },
            "venue": {
                "fragments": [],
                "text": "Research Inst. (Bethesda),"
            },
            "year": 1954
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Maintained activity in the cat ' s retina in light and darkness"
            },
            "venue": {
                "fragments": [],
                "text": "J . Gen . Physiol ."
            },
            "year": 1957
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A highimpedance input circuit suitable for electrophysiological recording from micropipette electrodes ,"
            },
            "venue": {
                "fragments": [],
                "text": "Research Report , Naval Med . Research Inst . ( Bethesda )"
            },
            "year": 1954
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 118,
                                "start": 106
                            }
                        ],
                        "text": "Maintained activity in single ganglion cells of the cat has frequently been observed by Granit (1947) and Noell (1953), and has been regularly seen by Kuflter (1952; 1953)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 2
                            }
                        ],
                        "text": "Deterioration in the cat's condition could frequently be detected in this way prior to the onset of more obvious general symptoms."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Studies on the electrophysiology and metabolism of the retina, United States Air Force School of Aviation Medicine Project No. 21-1201- 0004"
            },
            "venue": {
                "fragments": [],
                "text": "Studies on the electrophysiology and metabolism of the retina, United States Air Force School of Aviation Medicine Project No. 21-1201- 0004"
            },
            "year": 1953
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 217,
                                "start": 195
                            }
                        ],
                        "text": "…platinum-iridium wires of 10 to 13/z in diameter of the type used by Granit (1947), by indium-filled, gold-and platinum-plated, glass capillaries with a tip to 3 to 5 # as recently described by Dowben and Rose (1953), and by micropipettes of less than 1 tt tip diameter, filled with 3 x¢ KCI."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A metal-filled mieroelectrode"
            },
            "venue": {
                "fragments": [],
                "text": "Science,"
            },
            "year": 1953
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A statistical theory of visual threshold"
            },
            "venue": {
                "fragments": [],
                "text": "N~ure,"
            },
            "year": 1955
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 97
                            }
                        ],
                        "text": "The 3 M KCl-fiiled capillaries were connected through a negative capacity feed back input stage (MacNichol and Wagner, 1954) to a direct coupled amplifier."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A highimpedance input circuit suitable for electrophysiological recording from micropipette electrodes ,"
            },
            "venue": {
                "fragments": [],
                "text": "Research Report , Naval Med . Research Inst . ( Bethesda )"
            },
            "year": 1954
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Spontaneous activity and behavior, Scient"
            },
            "venue": {
                "fragments": [],
                "text": "Month., 1955,"
            },
            "year": 1955
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 17,
            "methodology": 8,
            "result": 5
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 54,
        "totalPages": 6
    },
    "page_url": "https://www.semanticscholar.org/paper/MAINTAINED-ACTIVITY-IN-THE-CAT'S-RETINA-IN-LIGHT-Kuffler-FitzHugh/83cf69db1a2897e0bf0a250cfe64a0fcf1835eb7?sort=total-citations"
}