{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5110598"
                        ],
                        "name": "S. Dornič",
                        "slug": "S.-Dornič",
                        "structuredName": {
                            "firstName": "Stanislav",
                            "lastName": "Dornič",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Dornič"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144574274,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "310fb07c2d535fabd6a861e6eff77a0d02aa6441",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The world becomes increasingly bilingual, and the non-balanced bilingual (in whom one language system is dominant) represents the most typical group of bilinguals. For a vast number of people using their nondominant languages for decoding (comprehension) and encoding (production) the information processing capacity is considerably reduced. The imbalance between the bilingual's language systems is typically enhanced by high mental load and stress. In many cases, however, performance criteria do not reveal this imbalance. This study presents an experimental illustration of the use of more subtle measures of information processing capacity in bilinguals. “Spare” capacity was measured by using a subsidiary task technique, and perceived effort was rated by means of psychophysical scales. These measures indicate the “hidden cost” behind the overt performance, thus revealing the latent imbalance between the bilinguals two language systems. The main aim of the paper is to draw attention lo this sort of research a..."
            },
            "slug": "Language-dominance,-spare-capacity-and-perceived-in-Dornič",
            "title": {
                "fragments": [],
                "text": "Language dominance, spare capacity and perceived effort in bilinguals"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 1,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Syntactic-Process-Kay/ce8cca19455e8d3055c57a9bafe882984c95a201?sort=total-citations"
}