{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49372965"
                        ],
                        "name": "S. Pappu",
                        "slug": "S.-Pappu",
                        "structuredName": {
                            "firstName": "Suguna",
                            "lastName": "Pappu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Pappu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35380459"
                        ],
                        "name": "S. Gold",
                        "slug": "S.-Gold",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Gold",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Gold"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145257017"
                        ],
                        "name": "Anand Rangarajan",
                        "slug": "Anand-Rangarajan",
                        "structuredName": {
                            "firstName": "Anand",
                            "lastName": "Rangarajan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anand Rangarajan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 165,
                                "start": 145
                            }
                        ],
                        "text": "The decomposition of A in the above is not required, since A could be left as a 2x2 matrix and solved for directly in the algorithm that follows (Pappu et al., 1995)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 13164547,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "acbb07ec6f194391412363176fb75e520793fbb5",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "Matching feature point sets lies at the core of many approaches to object recognition. We present a framework for non-rigid matching that begins with a skeleton module, affine point matching, and then integrates multiple features to improve correspondence and develops an object representation based on spatial regions to model local transformations. The algorithm for feature matching iteratively updates the transformation parameters and the correspondence solution, each in turn. The affine mapping is solved in closed form, which permits its use for data of any dimension. The correspondence is set via a method for two-way constraint satisfaction, called softassign, which has recently emerged from the neural network/statistical physics realm. The complexity of the non-rigid matching algorithm with multiple features is the same as that of the affine point matching algorithm. Results for synthetic and real world data are provided for point sets in 2D and 3D, and for 2D data with multiple types of features and parts."
            },
            "slug": "A-Framework-for-Non-rigid-Matching-and-Pappu-Gold",
            "title": {
                "fragments": [],
                "text": "A Framework for Non-rigid Matching and Correspondence"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "This work presents a framework for non-rigid matching that begins with a skeleton module, affine point matching, and then integrates multiple features to improve correspondence and develops an object representation based on spatial regions to model local transformations."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1390908654"
                        ],
                        "name": "Stan Z. Li",
                        "slug": "Stan-Z.-Li",
                        "structuredName": {
                            "firstName": "Stan Z.",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Stan Z. Li"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 21
                            }
                        ],
                        "text": "A more recent attempt(38) uses a form of deterministic annealing (graduated nonconvexity) within the relaxation labeling framework,"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 30561013,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b7cd8333d1bcb9ef2b619961b4913aeee040cbcd",
            "isKey": false,
            "numCitedBy": 151,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Matching:-Invariant-to-translations,-rotations-and-Li",
            "title": {
                "fragments": [],
                "text": "Matching: Invariant to translations, rotations and scale changes"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3050737"
                        ],
                        "name": "P. Besl",
                        "slug": "P.-Besl",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Besl",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Besl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144856117"
                        ],
                        "name": "N. McKay",
                        "slug": "N.-McKay",
                        "structuredName": {
                            "firstName": "Neil",
                            "lastName": "McKay",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. McKay"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 72,
                                "start": 50
                            }
                        ],
                        "text": "A related distance measure and matching method in (Besl and McKay, 1992) also uses closest points."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 21874346,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8458412282496da39f71c9f80b266a173e26027e",
            "isKey": false,
            "numCitedBy": 16391,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors describe a general-purpose, representation-independent method for the accurate and computationally efficient registration of 3-D shapes including free-form curves and surfaces. The method handles the full six degrees of freedom and is based on the iterative closest point (ICP) algorithm, which requires only a procedure to find the closest point on a geometric entity to a given point. The ICP algorithm always converges monotonically to the nearest local minimum of a mean-square distance metric, and the rate of convergence is rapid during the first few iterations. Therefore, given an adequate set of initial rotations and translations for a particular class of objects with a certain level of 'shape complexity', one can globally minimize the mean-square distance metric over all six degrees of freedom by testing each initial registration. One important application of this method is to register sensed data from unfixtured rigid objects with an ideal geometric model, prior to shape inspection. Experimental results show the capabilities of the registration algorithm on point sets, curves, and surfaces. >"
            },
            "slug": "A-Method-for-Registration-of-3-D-Shapes-Besl-McKay",
            "title": {
                "fragments": [],
                "text": "A Method for Registration of 3-D Shapes"
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "A general-purpose, representation-independent method for the accurate and computationally efficient registration of 3-D shapes including free-form curves and surfaces based on the iterative closest point (ICP) algorithm."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34734622"
                        ],
                        "name": "D. Jacobs",
                        "slug": "D.-Jacobs",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Jacobs",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Jacobs"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 89,
                                "start": 47
                            }
                        ],
                        "text": "rigid Euclidean, a ne, perspective, and so on) (Weinshall and Tomasi, 1995; Jacobs, 1994) and which can then be used in matching and indexing algorithms, such as geometric hashing (Califano and Mohan, 1994; Lamdan et al."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 32600101,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "31cd8ca9451df32afc7351531f46209bbaa4f48b",
            "isKey": false,
            "numCitedBy": 5,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "Invariant representations of images have proven useful in performing a variety of vision tasks. However, there are no general invariant functions when one considers a single 2-D image of a 3-D scene. One possible response to the lack of true invariants is to attempt to generalize the notion of an invariant by finding the most economical characterization possible of the set of all 2-D images that a group of 3-D features may produce. A true invariant exists when, for each model, we can represent all its images at a single point in some representational space. When this is not possible, it is still very useful to find the simplest and lowest-dimensional representation of each model's images."
            },
            "slug": "Generalizing-Invariants-for-3-D-to-2-D-Matching-Jacobs",
            "title": {
                "fragments": [],
                "text": "Generalizing Invariants for 3-D to 2-D Matching"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "There are no general invariant functions when one considers a single 2-D image of a 3-D scene, so it is still very useful to find the simplest and lowest-dimensional representation of each model's images."
            },
            "venue": {
                "fragments": [],
                "text": "Applications of Invariance in Computer Vision"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 12
                            }
                        ],
                        "text": "For example (Baird, 1984)'s original tree-pruning method was of exponential time complexity when missing and extra points were considered."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 178,
                                "start": 118
                            }
                        ],
                        "text": "Tree-pruning methods involve searching over a tree of possible matches while eliminating portions of the search space (Baird, 1984; Grimson and Lozano-Perez, 1987; Umeyama, 1993)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 118953780,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "32e4ca6a657dfc43c4a77186fcae80e9a35b5712",
            "isKey": false,
            "numCitedBy": 201,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This work deals with the computer vision problem of recognizing and locating rigid shapes in the plane which have been subjected to unknown rotation, scaling, and noise. The recognition task includes both locating the overall pattern and identifying each of its features. Location is achieved by finding a geometric registration function that does a good job of superimposing the instance and the model. Identifying the features requires matching each model feature with the corresponding instance feature.A pruned tree-search algorithm is developed which makes effective use of the Soviet ellipsoid algorithm for feasibility of linear constraints. An interesting blend of theoretical analysis and practical implementation shows that the resulting algorithm has an expected runtime that is theoretically asymptotically quadratic in the number of feature points, but practically linear in n for patterns with fewer than 100 points.Contents: Introduction; Task Abstraction; Prior Approaches; A Linear Programming Approach; Geometry of Registrations and Ellipsoids; Worst-Case Number of Feasible Matchings; Random Patterns; Expected Cost of Feasibility Testing; Expected Size of Search Tree; Monte Carlo Trials; Conclusions.Henry S. Baird received his doctorate from Princeton University. He is currently a technical staff member et AT & T Bell Laboratories. \"Model-Based Image Matching Using Location \"is a 1984 ACM Distinguished Dissertation."
            },
            "slug": "Model-Based-Image-Matching-Using-Location-Baird",
            "title": {
                "fragments": [],
                "text": "Model-Based Image Matching Using Location"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "This work deals with the computer vision problem of recognizing and locating rigid shapes in the plane which have been subjected to unknown rotation, scaling, and noise and develops a pruned tree-search algorithm which makes effective use of the Soviet ellipsoid algorithm for feasibility of linear constraints."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 26
                            }
                        ],
                        "text": "Deformable template models(31,32) provide a physically-based non-linear optimization approach to matching but must be separately related"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 45670932,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "59fbb0b127de1ea9be27d5f8c1e30d0cf394a503",
            "isKey": false,
            "numCitedBy": 251,
            "numCiting": 63,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe how to formulate matching and combinatorial problems of vision and neural network theory by generalizing elastic and deformable templates models to include binary matching elements. Techniques from statistical physics, which can be interpreted as computing marginal probability distributions, are then used to analyze these models and are shown to (1) relate them to existing theories and (2) give insight into the relations between, and relative effectivenesses of, existing theories. In particular we exploit the power of statistical techniques to put global constraints on the set of allowable states of the binary matching elements. The binary elements can then be removed analytically before minimization. This is demonstrated to be preferable to existing methods of imposing such constraints by adding bias terms in the energy functions. We give applications to winner-take-all networks, correspondence for stereo and long-range motion, the traveling salesman problem, deformable template matching, learning, content addressable memories, and models of brain development. The biological plausibility of these networks is briefly discussed."
            },
            "slug": "Generalized-Deformable-Models,-Statistical-Physics,-Yuille",
            "title": {
                "fragments": [],
                "text": "Generalized Deformable Models, Statistical Physics, and Matching Problems"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "Techniques from statistical physics are used to exploit the power of statistical techniques to put global constraints on the set of allowable states of the binary matching elements and be preferable to existing methods of imposing such constraints by adding bias terms in the energy functions."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14489533"
                        ],
                        "name": "D. Geiger",
                        "slug": "D.-Geiger",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Geiger",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geiger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804489"
                        ],
                        "name": "F. Girosi",
                        "slug": "F.-Girosi",
                        "structuredName": {
                            "firstName": "Federico",
                            "lastName": "Girosi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Girosi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 45,
                                "start": 40
                            }
                        ],
                        "text": "The proximity matrix is a function of a Gaussian weighted distance metric, with a parameter p which controls the degree of interaction between the two sets of features."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 70,
                                "start": 65
                            }
                        ],
                        "text": "To create an image point set from a model point set, independent Gaussian noise N(0, p) is added to each of the model points creating jittered image points."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 42,
                                "start": 26
                            }
                        ],
                        "text": "Subsequently the best such pose is chosen."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 118,
                                "start": 95
                            }
                        ],
                        "text": "The positions of each point in 2D space are noisy; they may be considered as arising from Gaussian distributions, whose means correspond to the exact x—y coordinates in the absence of noise."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 5,
                                "start": 0
                            }
                        ],
                        "text": "Gaussian noise N(0, p) is added to the points."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 221,
                                "start": 216
                            }
                        ],
                        "text": "Each experimental trial for 3D point matching involves generating a random 3D point set as the model point set, and then generating an image point set by applying a random transformation, adding noise of independent Gaussian jitter and then randomly adding and deleting points."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 50,
                                "start": 45
                            }
                        ],
                        "text": "Raising the noise in the form of independent Gaussian jitter and/or missing and extra points increases the error measure monotonically."
                    },
                    "intents": []
                }
            ],
            "corpusId": 46023735,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8d5a193fdbf9d34118f136935cfd07a81b3e0d77",
            "isKey": true,
            "numCitedBy": 502,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Deterministic approximations to Markov random field (MRF) models are derived. One of the models is shown to give in a natural way the graduated nonconvexity (GNC) algorithm proposed by A. Blake and A. Zisserman (1987). This model can be applied to smooth a field preserving its discontinuities. A class of more complex models is then proposed in order to deal with a variety of vision problems. All the theoretical results are obtained in the framework of statistical mechanics and mean field techniques. A parallel, iterative algorithm to solve the deterministic equations of the two models is presented, together with some experiments on synthetic and real images. >"
            },
            "slug": "Parallel-and-Deterministic-Algorithms-from-MRFs:-Geiger-Girosi",
            "title": {
                "fragments": [],
                "text": "Parallel and Deterministic Algorithms from MRFs: Surface Reconstruction"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "Deterministic approximations to Markov random field (MRF) models are derived and one of the models is shown to give in a natural way the graduated nonconvexity (GNC) algorithm proposed by A. Blake and A. Zisserman (1987)."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1789171"
                        ],
                        "name": "D. Weinshall",
                        "slug": "D.-Weinshall",
                        "structuredName": {
                            "firstName": "Daphna",
                            "lastName": "Weinshall",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Weinshall"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145086151"
                        ],
                        "name": "Carlo Tomasi",
                        "slug": "Carlo-Tomasi",
                        "structuredName": {
                            "firstName": "Carlo",
                            "lastName": "Tomasi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Carlo Tomasi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1673652,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "ada6208b40be9f11f8e7b8745f86af22e364bce2",
            "isKey": false,
            "numCitedBy": 123,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors show how to automatically acquire similarity-invariant shape representations of objects from noisy image sequences under a weak perspective. The incremental nature of the method makes it possible to process images one at a time, moving away from the storage-intensive batch methods of the past. It is based on the observation that the trajectories that points on the object form in weak-perspective image sequences are linear combinations of three of the trajectories themselves, and that the coefficients of the linear combinations represent shape in an affine-invariant basis. A nonlinear but numerically sound preprocessing state is added to improve the accuracy of the results even further. Experiments showed that attention to noise and computational techniques improved the shape results substantially with respect to previous methods.<<ETX>>"
            },
            "slug": "Linear-and-incremental-acquisition-of-invariant-Weinshall-Tomasi",
            "title": {
                "fragments": [],
                "text": "Linear and incremental acquisition of invariant shape models from image sequences"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "The authors show how to automatically acquire similarity-invariant shape representations of objects from noisy image sequences under a weak perspective, based on the observation that the trajectories that points on the object form in weak-perspective image sequences are linear combinations of three of the trajectory themselves."
            },
            "venue": {
                "fragments": [],
                "text": "1993 (4th) International Conference on Computer Vision"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145189573"
                        ],
                        "name": "M. Walker",
                        "slug": "M.-Walker",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Walker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Walker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38423999"
                        ],
                        "name": "L. Shao",
                        "slug": "L.-Shao",
                        "structuredName": {
                            "firstName": "Lejun",
                            "lastName": "Shao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Shao"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1757200"
                        ],
                        "name": "R. Volz",
                        "slug": "R.-Volz",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Volz",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Volz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10669730,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "80b25be3067a2422e9caebe04f9b67bbc4fe176b",
            "isKey": false,
            "numCitedBy": 408,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Estimating-3-D-location-parameters-using-dual-Walker-Shao",
            "title": {
                "fragments": [],
                "text": "Estimating 3-D location parameters using dual number quaternions"
            },
            "venue": {
                "fragments": [],
                "text": "CVGIP Image Underst."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2663129"
                        ],
                        "name": "G. Stockman",
                        "slug": "G.-Stockman",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Stockman",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Stockman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 213,
                                "start": 182
                            }
                        ],
                        "text": "The generalized Hough transform requires the division of the parameter space of possible poses into discrete bins wherein good matches are registered as votes in the appropriate bin (Ballard, 1981; Stockman, 1987)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 255,
                                "start": 203
                            }
                        ],
                        "text": ", 1993) neural net method is O(n4) (equal point sets), Hough transforms or geometric hashing can be of high polynomial complexity or use an impractical number of bins when a ne transforms are considered (Lamdan et al., 1988; Stockman, 1987; Grimson, 1990)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 38720960,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "232170a2268e2958e10d51c9561137bb291cd909",
            "isKey": false,
            "numCitedBy": 269,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Object-recognition-and-localization-via-pose-Stockman",
            "title": {
                "fragments": [],
                "text": "Object recognition and localization via pose clustering"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2405721"
                        ],
                        "name": "V. V. Vinod",
                        "slug": "V.-V.-Vinod",
                        "structuredName": {
                            "firstName": "Vasudevan",
                            "lastName": "Vinod",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. V. Vinod"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1865410"
                        ],
                        "name": "S. Ghose",
                        "slug": "S.-Ghose",
                        "structuredName": {
                            "firstName": "Sujoy",
                            "lastName": "Ghose",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ghose"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 147,
                                "start": 106
                            }
                        ],
                        "text": "Similar problems related to two-way constraint satisfaction beset the objective function based methods of (Vinod and Ghose, 1993; Gee et al., 1993)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 13167122,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "012ebc17816b76710e793733c73ba6392a204108",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Point-matching-using-asymmetric-neural-networks-Vinod-Ghose",
            "title": {
                "fragments": [],
                "text": "Point matching using asymmetric neural networks"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2158095820"
                        ],
                        "name": "Chien-Ping Lu",
                        "slug": "Chien-Ping-Lu",
                        "structuredName": {
                            "firstName": "Chien-Ping",
                            "lastName": "Lu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chien-Ping Lu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705072"
                        ],
                        "name": "E. Mjolsness",
                        "slug": "E.-Mjolsness",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Mjolsness",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Mjolsness"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7392539,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4927b96f767985995fec4472c55317f1cc02448e",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a Mean Field Theory method for locating two-dimensional objects that have undergone rigid transformations. The resulting algorithm is a form of coarse-to-fine correlation matching. We first consider problems of matching synthetic point data, and derive a point matching objective function. A tractable line segment matching objective function is derived by considering each line segment as a dense collection of points, and approximating it by a sum of Gaussians. The algorithm is tested on real images from which line segments are extracted and matched."
            },
            "slug": "Two-Dimensional-Object-Localization-by-Correlation-Lu-Mjolsness",
            "title": {
                "fragments": [],
                "text": "Two-Dimensional Object Localization by Coarse-to-Fine Correlation Matching"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A tractable line segment matching objective function is derived by considering each line segment as a dense collection of points, and approximating it by a sum of Gaussians."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749590"
                        ],
                        "name": "S. Sclaroff",
                        "slug": "S.-Sclaroff",
                        "structuredName": {
                            "firstName": "Stan",
                            "lastName": "Sclaroff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sclaroff"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144994682"
                        ],
                        "name": "A. Pentland",
                        "slug": "A.-Pentland",
                        "structuredName": {
                            "firstName": "Alex",
                            "lastName": "Pentland",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pentland"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 74
                            }
                        ],
                        "text": "By formulating it in this manner we are able to combine the estimation of both pose and correspondence by minimizing a single non-linear objective function."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1269370,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "61a3ec03aff72b00ef17fbcf8577cbacd629a7f6",
            "isKey": false,
            "numCitedBy": 549,
            "numCiting": 74,
            "paperAbstract": {
                "fragments": [],
                "text": "Modal matching is a new method for establishing correspondences and computing canonical descriptions. The method is based on the idea of describing objects in terms of generalized symmetries, as defined by each object's eigenmodes. The resulting modal description is used for object recognition and categorization, where shape similarities are expressed as the amounts of modal deformation energy needed to align the two objects. In general, modes provide a global-to-local ordering of shape deformation and thus allow for selecting which types of deformations are used in object alignment and comparison. In contrast to previous techniques, which required correspondence to be computed with an initial or prototype shape, modal matching utilizes a new type of finite element formulation that allows for an object's eigenmodes to be computed directly from available image information. This improved formulation provides greater generality and accuracy, and is applicable to data of any dimensionality. Correspondence results with 2D contour and point feature data are shown, and recognition experiments with 2D images of hand tools and airplanes are described. >"
            },
            "slug": "Modal-Matching-for-Correspondence-and-Recognition-Sclaroff-Pentland",
            "title": {
                "fragments": [],
                "text": "Modal Matching for Correspondence and Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Improved formulation of modal matching utilizes a new type of finite element formulation that allows for an object's eigenmodes to be computed directly from available image information, and is applicable to data of any dimensionality."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1388700951"
                        ],
                        "name": "Tomas Lozano-Perez",
                        "slug": "Tomas-Lozano-Perez",
                        "structuredName": {
                            "firstName": "Tomas",
                            "lastName": "Lozano-Perez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tomas Lozano-Perez"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 178,
                                "start": 118
                            }
                        ],
                        "text": "Tree-pruning methods involve searching over a tree of possible matches while eliminating portions of the search space (Baird, 1984; Grimson and Lozano-Perez, 1987; Umeyama, 1993)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 14484943,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1230072567fed362e7a39bb8bc83c867c0c1a9f5",
            "isKey": false,
            "numCitedBy": 550,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper discusses how local measurements of positions and surface normals may be used to identify and locate overlapping objects. The objects are modeled as polyhedra (or polygons) having up to six degrees of positional freedom relative to the sensors. The approach operates by examining all hypotheses about pairings between sensed data and object surfaces and efficiently discarding inconsistent ones by using local constraints on: distances between faces, angles between face normals, and angles (relative to the surface normals) of vectors between sensed points. The method described here is an extension of a method for recognition and localization of nonoverlapping parts previously described in [18] and [15]."
            },
            "slug": "Localizing-Overlapping-Parts-by-Searching-the-Tree-Grimson-Lozano-Perez",
            "title": {
                "fragments": [],
                "text": "Localizing Overlapping Parts by Searching the Interpretation Tree"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The approach operates by examining all hypotheses about pairings between sensed data and object surfaces and efficiently discarding inconsistent ones by using local constraints on distances between faces, angles between face normals, and angles of vectors between sensed points."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3096453"
                        ],
                        "name": "Y. Lamdan",
                        "slug": "Y.-Lamdan",
                        "structuredName": {
                            "firstName": "Yehezkel",
                            "lastName": "Lamdan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Lamdan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144035149"
                        ],
                        "name": "J. Schwartz",
                        "slug": "J.-Schwartz",
                        "structuredName": {
                            "firstName": "Jacob",
                            "lastName": "Schwartz",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Schwartz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1756534"
                        ],
                        "name": "H. Wolfson",
                        "slug": "H.-Wolfson",
                        "structuredName": {
                            "firstName": "Haim",
                            "lastName": "Wolfson",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wolfson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 83
                            }
                        ],
                        "text": "ing,(14) alignment,(21) neural networks,(43) Hough transforms,(1) geometric hashing(19) and pose clustering."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 153,
                                "start": 146
                            }
                        ],
                        "text": "rigid Euclidean, affine, perspective, and so on)(23,24) and which can then be used in matching and indexing algorithms, such as geometric hashing.(19,25) Efficient matching algorithms between point sets have resulted from minimizing their Haus-"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 158,
                                "start": 151
                            }
                        ],
                        "text": "(17,18) Geometric hashing is another voting scheme where discrete bins are created for the possible bases that can be used to represent the point sets.(19,20) In the alignment method(21) each alignment feature (defined as a set of three distinctive points) in the image is matched against each align-"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 36500949,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1f314b8066e4b8248172e0b9c1e73a31588e73f6",
            "isKey": false,
            "numCitedBy": 325,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Novel techniques are described for model-based recognition of 3-D objects from unknown viewpoints using single-gray-scale images. The objects in the scene may be overlapping and partially occluded. Efficient matching algorithms, which assume affine approximation to the perspective viewing transformation, are proposed. The study is currently restricted to flat rigid 3-D objects. Point, line and curve matching algorithms are presented. The study especially emphasizes the curve matching problem. Experimental results are included.<<ETX>>"
            },
            "slug": "Object-recognition-by-affine-invariant-matching-Lamdan-Schwartz",
            "title": {
                "fragments": [],
                "text": "Object recognition by affine invariant matching"
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "Novel techniques are described for model-based recognition of 3-D objects from unknown viewpoints using single-gray-scale images and efficient matching algorithms are proposed, which assume affine approximation to the perspective viewing transformation."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings CVPR '88: The Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14489533"
                        ],
                        "name": "D. Geiger",
                        "slug": "D.-Geiger",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Geiger",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geiger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804489"
                        ],
                        "name": "F. Girosi",
                        "slug": "F.-Girosi",
                        "structuredName": {
                            "firstName": "Federico",
                            "lastName": "Girosi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Girosi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 45
                            }
                        ],
                        "text": ") We now use deterministic annealing methods (Peterson and Soderberg, 1989; Geiger and Girosi, 1991) to turn our discrete problem into a continuous one in order to reduce the chances of getting trapped in local minima."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 7164862,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d3ac6aee145606abe44d1374d9550a378adf768c",
            "isKey": false,
            "numCitedBy": 89,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "In recent years many researchers have investigated the use of Markov random fields (MRFs) for computer vision. The computational complexity of the implementation has been a drawback of MRFs. In this paper we derive deterministic approximations to MRFs models. All the theoretical results are obtained in the framework of the mean field theory from statistical mechanics. Because we use MRFs models the mean field equations lead to parallel and iterative algorithms. One of the considered models for image reconstruction is shown to give in a natural way the graduate non-convexity algorithm proposed by Blake and Zisserman."
            },
            "slug": "Parallel-and-deterministic-algorithms-from-MRFs:-Geiger-Girosi",
            "title": {
                "fragments": [],
                "text": "Parallel and deterministic algorithms from MRFs: surface reconstruction and integration"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Deterministic approximations to MRFs models are derived and one of the considered models for image reconstruction is shown to give in a natural way the graduate non-convexity algorithm proposed by Blake and Zisserman."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1530384,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4462c82748d81489f4f453f516754438b35a8cec",
            "isKey": false,
            "numCitedBy": 961,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "With contributions from Tomas LozanoPerez and Daniel P. Huttenlocher.An intelligent system must know \"what \"the objects are and \"where \"they are in its environment. Examples of this ubiquitous problem in computer vision arise in tasks involving hand-eye coordination (such as assembling or sorting), inspection tasks, gauging operations, and in navigation and localization of mobile robots. This book describes an extended series of experiments into the role of geometry in the critical area of object recognition. It provides precise definitions of the recognition and localization problems, describes the methods used to address them, analyzes the solutions to these problems, and addresses the implications of this analysis.The solution to problems of object recognition are of fundamental importance in many real applications and versions of the techniques described here are already being used in industrial settings. Although a number of questions remain to be solved, the authors provide a valuable framework for understanding both the strengths and limitations of using object shape to guide recognition.W. Eric L. Grimson is Matsushita Associate Professor in the Department of Electrical Engineering and Computer Science at MIT.Contents: Introduction. Recognition as a Search Problem. Searching for Correspondences. Two-Dimensional Constraints. Three-Dimensional Constraints. Verifying Hypotheses. Controlling the Search Explosion. Selecting Subspaces of the Search Space. Empirical Testing. The Combinatorics of the Matching Process. The Combinatorics of Hough Transforms. The Combinatorics of Verification. The Combinatorics of Indexing. Evaluating the Methods. Recognition from Libraries. Parameterized Objects. The Role of Grouping. Sensing Strategies. Applications. The Next Steps."
            },
            "slug": "Object-recognition-by-computer-the-role-of-Grimson",
            "title": {
                "fragments": [],
                "text": "Object recognition by computer - the role of geometric constraints"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This book describes an extended series of experiments into the role of geometry in the critical area of object recognition, providing precise definitions of the recognition and localization problems, the methods used to address them, the solutions to these problems, and the implications of this analysis."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701931"
                        ],
                        "name": "G. Scott",
                        "slug": "G.-Scott",
                        "structuredName": {
                            "firstName": "Guy",
                            "lastName": "Scott",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Scott"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "92269846"
                        ],
                        "name": "H. C. Longuet-Higgins",
                        "slug": "H.-C.-Longuet-Higgins",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Longuet-Higgins",
                            "middleNames": [
                                "Christopher"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. C. Longuet-Higgins"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 78
                            }
                        ],
                        "text": "work includes modal shape information to address the weaknesses of the earlier(28) algorithm, primarily its inability to recover large rotations in the transformations, and also that the assumption of large p may result in algorithmic instabilities."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 12,
                                "start": 8
                            }
                        ],
                        "text": "A recent(28) formulation for point matching that is similar to ours uses a pairing matrix that indicates matches and a proximity matrix whose elements are the pairwise distance between points."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 13011932,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "281a3859b8ead503067f52e653dff28ed534d6d2",
            "isKey": false,
            "numCitedBy": 491,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we describe an algorithm that operates on the distances between features in the two related images and delivers a set of correspondences between them. The algorithm maximizes the inner product of two matrices, one of which is the desired ‘pairing matrix ’ and the other a ‘proximity matrix ’ with elements exp (– r2ij/2σ2), where rij is the distance between two features, one in each image, and σ is an adjustable scale parameter. The output of the algorithm may be compared with the movements that people perceive when viewing two images in quick succession, and it is found that an increase in σ affects the computed correspondences in much the same way as an increase in interstimulus interval alters the perceived displacements. Provided that σ is not too small the algorithm will recover the feature mappings that result from image translation, expansion or shear deformation – transformations of common occurrence in image sequences – even when the displacements of individual features depart slightly from the general trend."
            },
            "slug": "An-algorithm-for-associating-the-features-of-two-Scott-Longuet-Higgins",
            "title": {
                "fragments": [],
                "text": "An algorithm for associating the features of two images"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "An algorithm that operates on the distances between features in the two related images and delivers a set of correspondences between them and will recover the feature mappings that result from image translation, expansion or shear deformation even when the displacements of individual features depart slightly from the general trend."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B: Biological Sciences"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50193605"
                        ],
                        "name": "J. Ton",
                        "slug": "J.-Ton",
                        "structuredName": {
                            "firstName": "Jezching",
                            "lastName": "Ton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Ton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145295483"
                        ],
                        "name": "Anil K. Jain",
                        "slug": "Anil-K.-Jain",
                        "structuredName": {
                            "firstName": "Anil",
                            "lastName": "Jain",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anil K. Jain"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 0
                            }
                        ],
                        "text": "(Ton and Jain, 1989) attempt to impose such a two-way constraint within the relaxation labeling framework but do not use other key techniques such as deterministic annealing, incorporated in algorithms described in this paper."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 119723972,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "c45996eaaf7b12b4fb5b447d2350ba07c9730290",
            "isKey": false,
            "numCitedBy": 236,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "Image registration of Landsat Thematic Mapper scenes with translational and rotational differences is studied. Two major steps of image registration, control-point selection and control-point matching, are emphasized. In control-point selection, the properties that a good control point should satisfy are defined. Several potential control-point candidates are suggested, and methods are discussed for extracting them from the input image. In control-point matching, a relaxation algorithm proposed in the literature is improved by reducing its time complexity from O(n/sup 4/) to O(n/sup 3/), where n is the number of control points. The matching algorithm also uses a two-way matching concept which utilizes the inherent symmetry property of the point-matching problem. The robustness of the proposed algorithm was demonstrated through simulation experiments by evaluating a matching index. Experimental results on Landsat images show that the proposed method produces results comparable to those obtained by an experienced photointerpreter. >"
            },
            "slug": "Registering-Landsat-images-by-point-matching-Ton-Jain",
            "title": {
                "fragments": [],
                "text": "Registering Landsat images by point matching"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "Experimental results on Landsat images show that the proposed method produces results comparable to those obtained by an experienced photointerpreter, and the robustness of the proposed algorithm was demonstrated through simulation experiments."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35380459"
                        ],
                        "name": "S. Gold",
                        "slug": "S.-Gold",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Gold",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Gold"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145257017"
                        ],
                        "name": "Anand Rangarajan",
                        "slug": "Anand-Rangarajan",
                        "structuredName": {
                            "firstName": "Anand",
                            "lastName": "Rangarajan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anand Rangarajan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705072"
                        ],
                        "name": "E. Mjolsness",
                        "slug": "E.-Mjolsness",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Mjolsness",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Mjolsness"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 159,
                                "start": 153
                            }
                        ],
                        "text": "(12,40,45,58) Finally the algorithm may be used as a distance measure and incorporated within a clustering algorithm to learn prototypical object shapes.(9,12)"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 3075273,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "29017216d926309d2b428991ac1e9b0b2d261a2f",
            "isKey": false,
            "numCitedBy": 80,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "Prior knowledge constraints are imposed upon a learning problem in the form of distance measures. Prototypical 2D point sets and graphs are learned by clustering with point-matching and graph-matching distance measures. The point-matching distance measure is approximately invariant under affine transformationstranslation, rotation, scale, and shearand permutations. It operates between noisy images with missing and spurious points. The graph-matching distance measure operates on weighted graphs and is invariant under permutations. Learning is formulated as an optimization problem. Large objectives so formulated ( million variables) are efficiently minimized using a combination of optimization techniquessoftassign, algebraic transformations, clocked objectives, and deterministic annealing."
            },
            "slug": "Learning-with-Preknowledge:-Clustering-with-Point-Gold-Rangarajan",
            "title": {
                "fragments": [],
                "text": "Learning with Preknowledge: Clustering with Point and Graph Matching Distance Measures"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The point-matching distance measure is approximately invariant under affine transformationstranslation, rotation, scale, and shearand permutations, and it operates between noisy images with missing and spurious points."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35380459"
                        ],
                        "name": "S. Gold",
                        "slug": "S.-Gold",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Gold",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Gold"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 31
                            }
                        ],
                        "text": "These new optimization methods (Rangarajan et al., 1996; Gold and Rangarajan, 1996b; Gold, 1995), not previously applied to point-matching, result in an accurate and fast algorithm in the presence of substantial noise and a high percentage of missing or spurious features."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 296,
                                "start": 184
                            }
                        ],
                        "text": "It has since been applied to much more di cult optimization problems, including many special cases of quadratic assignment problems such as graph matching, TSP, and graph partitioning (Gold et al., 1996; Rangarajan et al., 1996; Gold and Rangarajan, 1996a; Gold, 1995; Gold and Rangarajan, 1996b)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 116832136,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4fa4855a7039d46fc1a497b392cd4a86a6d55cc4",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The matching and learning of structural and spatial representations with Hopfield like recurrent neural networks is explored, by formulating and minimizing different energy functions. Building upon recent techniques from statistical physics, such as deterministic annealing which helps avoid some local minima, and the softmax which enforces a one-way constraint without a penalty term, a new optimization technique is introduced--the softassign. The softassign is specifically geared to the types of problems being examined--matching problems--which often require two-way (assignment) constraints. It eliminates the need for penalty terms in these objective functions. \nThe softassign is applied to three types of problems, the first of which is the matching of structural representations--graphs, A new algorithm is introduced which can match unweighted, weighted and attributed relational graphs. This algorithm employs a sparse distance measure between the links of the two graphs. Experiments on randomly generated graphs, and on graphs generated from images are presented. \nThe second problem is the matching of spatial representations--two sets of feature points located in two dimensional space. The feature points may be specified solely by their Cartesian coordinates, or there may be a feature vector associated with them. It is assumed the two sets of feature points are related by an affine transformation. Within Computer Vision this is known as a pose estimation and correspondence problem. A new algorithm is introduced and experiments on randomly generated point sets are run. Experiments on hand-written characters are presented. \nFinally the problem of learning spatial and structural representations is addressed. A new algorithm for clustering is introduced, which uses as distance measures versions of the point matching and graph matching algorithms. Point set and graph prototypes are learned in an unsupervised fashion. Experiments on randomly generated data sets, and data sets generated from hand-written characters are run."
            },
            "slug": "Matching-and-learning-structural-and-spatial-with-Gold",
            "title": {
                "fragments": [],
                "text": "Matching and learning structural and spatial representations with neural networks"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The matching and learning of structural and spatial representations with Hopfield like recurrent neural networks is explored, by formulating and minimizing different energy functions."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1744999"
                        ],
                        "name": "S. Umeyama",
                        "slug": "S.-Umeyama",
                        "structuredName": {
                            "firstName": "Shinji",
                            "lastName": "Umeyama",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Umeyama"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1757584,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d9210c1875ea7aede31929da23b88684f6bcab6a",
            "isKey": false,
            "numCitedBy": 91,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of recognizing and localizing objects that can vary in parameterized ways is considered. To achieve this goal, a concept of parameterized point pattern is introduced to model parameterized families of such objects, and a parameterized point pattern matching algorithm is proposed. A parameterized point pattern is a very flexible concept that can be used to model a large class of parameterized objects, such as a pair of scissors with rotating blades. The proposed matching algorithm is formulated as a tree search procedure, and it generates all maximum matchings satisfying a condition called delta -boundedness. Several pruning methods based on the condition of delta -boundedness and their efficient computing techniques are given. The proposed matching algorithm is applied to a real shape matching problem in order to check the validity of the approach. >"
            },
            "slug": "Parameterized-Point-Pattern-Matching-and-Its-to-of-Umeyama",
            "title": {
                "fragments": [],
                "text": "Parameterized Point Pattern Matching and Its Application to Recognition of Object Families"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "The problem of recognizing and localizing objects that can vary in parameterized ways is considered, and a parameterized point pattern matching algorithm is proposed that generates all maximum matchings satisfying a condition called delta -boundedness."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2790045"
                        ],
                        "name": "L. S. Shapiro",
                        "slug": "L.-S.-Shapiro",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Shapiro",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. S. Shapiro"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "120971205"
                        ],
                        "name": "M. Brady",
                        "slug": "M.-Brady",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brady",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brady"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 0
                            }
                        ],
                        "text": "(Shapiro and Brady, 1992) continue this work by including modal shape information to address the weaknesses of (Scott and Longuet-Higgins, 1991)'s algorithm, primarily its inability to recover large rotations in the transformations, and also that the assumption of large may result in algorithmic instabilities."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 12135448,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fd73144d04cdb5440160a06f1962e34509388f8b",
            "isKey": false,
            "numCitedBy": 485,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Feature-based-correspondence:-an-eigenvector-Shapiro-Brady",
            "title": {
                "fragments": [],
                "text": "Feature-based correspondence: an eigenvector approach"
            },
            "venue": {
                "fragments": [],
                "text": "Image Vis. Comput."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705072"
                        ],
                        "name": "E. Mjolsness",
                        "slug": "E.-Mjolsness",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Mjolsness",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Mjolsness"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37123238"
                        ],
                        "name": "Charles Garrett",
                        "slug": "Charles-Garrett",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Garrett",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Charles Garrett"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 23
                            }
                        ],
                        "text": "In a series of papers, (Mjolsness and Garrett, 1990; Mjolsness, 1991; Lu and Mjolsness, 1994), several closely related objective functions containing correspondence and pose parameters were minimized."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 43144545,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7d9b251a729004e468680c55c99435dd8dd15b78",
            "isKey": false,
            "numCitedBy": 70,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Algebraic-transformations-of-objective-functions-Mjolsness-Garrett",
            "title": {
                "fragments": [],
                "text": "Algebraic transformations of objective functions"
            },
            "venue": {
                "fragments": [],
                "text": "Neural Networks"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46356930"
                        ],
                        "name": "Petar D. Simic",
                        "slug": "Petar-D.-Simic",
                        "structuredName": {
                            "firstName": "Petar",
                            "lastName": "Simic",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Petar D. Simic"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 333,
                                "start": 255
                            }
                        ],
                        "text": "These include deterministic annealing which convexi es the energy function in order to avoid some local minima and the Potts glass approximation which results in a hard enforcement of one-way (one set of) winner-take-all constraints (WTA) via the softmax (Peterson and Soderberg, 1989; Van den Bout and Miller III, 1990; Simic, 1991)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 18106757,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2dfc18acbdbdc1767968fcde31bae9fbcd63e2a7",
            "isKey": false,
            "numCitedBy": 77,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "Some time ago Durbin and Willshaw proposed an interesting parallel algorithm (the \"elastic net\") for approximately solving some geometric optimization problems, such as the Traveling Salesman Problem. Recently it has been shown that their algorithm is related to neural networks of Hopfield and Tank, and that they both can be understood as the semiclassical approximation to statistical mechanics of related physical models. The main point of the elastic net algorithm is seen to be in the way one deals with the constraints when evaluating the effective cost function (free energy in the thermodynamic analogy), and not in its geometric foundation emphasized originally by Durbin and Willshaw. As a consequence, the elastic net algorithm is a special case of the more general physically based computations and can be generalized to a large class of nongeometric problems. In this paper we further elaborate on this observation, and generalize the elastic net to the quadratic assignment problem. We work out in detail its special case, the graph matching problem, because it is an important problem with many applications in computational vision and neural modeling. Simulation results on random graphs, and on structured (hand-designed) graphs of moderate size (20-100 nodes) are discussed."
            },
            "slug": "Constrained-Nets-for-Graph-Matching-and-Other-Simic",
            "title": {
                "fragments": [],
                "text": "Constrained Nets for Graph Matching and Other Quadratic Assignment Problems"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The main point of the elastic net algorithm is seen to be in the way one deals with the constraints when evaluating the effective cost function (free energy in the thermodynamic analogy), and not in its geometric foundation emphasized originally by Durbin and Willshaw."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Comput."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698040"
                        ],
                        "name": "C. Olson",
                        "slug": "C.-Olson",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Olson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Olson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 104
                            }
                        ],
                        "text": "More recently, probabilistic techniques have been applied to enhance the speed of this alignment method (Olson, 1995)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 20026141,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "23c881534b2d8f00e9b24298d2b07556091985b6",
            "isKey": false,
            "numCitedBy": 50,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Recent papers have indicated that indexing is a promising approach to fast model-based object recognition because it allows most of the possible matches between sets of image features and sets of model features to be quickly eliminated from consideration. This correspondence describes a system that is capable of indexing using sets of three points undergoing 3D transformations and projection by taking advantage of the probabilistic peaking effect. To be able to index using sets of three points, we must allow false negatives. These are overcome by ensuring that we examine several correct hypotheses. The use of these techniques to speed up the alignment method is described. Results are given on real and synthetic data. >"
            },
            "slug": "Probabilistic-Indexing-for-Object-Recognition-Olson",
            "title": {
                "fragments": [],
                "text": "Probabilistic Indexing for Object Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This correspondence describes a system that is capable of indexing using sets of three points undergoing 3D transformations and projection by taking advantage of the probabilistic peaking effect."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713089"
                        ],
                        "name": "D. Huttenlocher",
                        "slug": "D.-Huttenlocher",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Huttenlocher",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Huttenlocher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2901136"
                        ],
                        "name": "G. Klanderman",
                        "slug": "G.-Klanderman",
                        "structuredName": {
                            "firstName": "Gregory",
                            "lastName": "Klanderman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Klanderman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116003"
                        ],
                        "name": "W. Rucklidge",
                        "slug": "W.-Rucklidge",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Rucklidge",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Rucklidge"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 31,
                                "start": 6
                            }
                        ],
                        "text": "Assignment matrix constraints may also be described as two-way interlocking winner-take-all (WTA) constraints."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8027136,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "85efeeb25d8e363606d94c8fadaa922ba9b93a37",
            "isKey": false,
            "numCitedBy": 3913,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "The Hausdorff distance measures the extent to which each point of a model set lies near some point of an image set and vice versa. Thus, this distance can be used to determine the degree of resemblance between two objects that are superimposed on one another. Efficient algorithms for computing the Hausdorff distance between all possible relative positions of a binary image and a model are presented. The focus is primarily on the case in which the model is only allowed to translate with respect to the image. The techniques are extended to rigid motion. The Hausdorff distance computation differs from many other shape comparison methods in that no correspondence between the model and the image is derived. The method is quite tolerant of small position errors such as those that occur with edge detectors and other feature extraction methods. It is shown that the method extends naturally to the problem of comparing a portion of a model against an image. >"
            },
            "slug": "Comparing-Images-Using-the-Hausdorff-Distance-Huttenlocher-Klanderman",
            "title": {
                "fragments": [],
                "text": "Comparing Images Using the Hausdorff Distance"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Efficient algorithms for computing the Hausdorff distance between all possible relative positions of a binary image and a model are presented and it is shown that the method extends naturally to the problem of comparing a portion of a model against an image."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695689"
                        ],
                        "name": "Geoffrey E. Hinton",
                        "slug": "Geoffrey-E.-Hinton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Hinton",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Geoffrey E. Hinton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145715698"
                        ],
                        "name": "Christopher K. I. Williams",
                        "slug": "Christopher-K.-I.-Williams",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Williams",
                            "middleNames": [
                                "K.",
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher K. I. Williams"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2713302"
                        ],
                        "name": "M. Revow",
                        "slug": "M.-Revow",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Revow",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Revow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15052186,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "15034107f195f625922881ef197515a7997b4c0d",
            "isKey": false,
            "numCitedBy": 123,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Hand-printed digits can be modeled as splines that are governed by about 8 control points. For each known digit, the control points have preferred \"home\" locations, and deformations of the digit are generated by moving the control points away from their home locations. Images of digits can be produced by placing Gaussian ink generators uniformly along the spline. Real images can be recognized by finding the digit model most likely to have generated the data. For each digit model we use an elastic matching algorithm to minimize an energy function that includes both the deformation energy of the digit model and the log probability that the model would generate the inked pixels in the image. The model with the lowest total energy wins. If a uniform noise process is included in the model of image generation, some of the inked pixels can be rejected as noise as a digit model is fitting a poorly segmented image. The digit models learn by modifying the home locations of the control points."
            },
            "slug": "Adaptive-Elastic-Models-for-Hand-Printed-Character-Hinton-Williams",
            "title": {
                "fragments": [],
                "text": "Adaptive Elastic Models for Hand-Printed Character Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "An elastic matching algorithm is used to minimize an energy function that includes both the deformation energy of the digit model and the log probability that the model would generate the inked pixels in the image."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 38,
                                "start": 24
                            }
                        ],
                        "text": "In the alignment method (Ullman, 1989) each alignment feature (de ned as a set of three distinctive points) in the image is matched against each alignment feature in the model, from which a pose is obtained."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 0
                            }
                        ],
                        "text": "(Ullman, 1989)'s alignment method is O(n4m3 logm), (Gee et al."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 41895215,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1844c55a8f76c09257c84e886a7bf10fc7e98e3f",
            "isKey": false,
            "numCitedBy": 654,
            "numCiting": 88,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Aligning-pictorial-descriptions:-An-approach-to-Ullman",
            "title": {
                "fragments": [],
                "text": "Aligning pictorial descriptions: An approach to object recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Cognition"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35380459"
                        ],
                        "name": "S. Gold",
                        "slug": "S.-Gold",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Gold",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Gold"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705072"
                        ],
                        "name": "E. Mjolsness",
                        "slug": "E.-Mjolsness",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Mjolsness",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Mjolsness"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145257017"
                        ],
                        "name": "Anand Rangarajan",
                        "slug": "Anand-Rangarajan",
                        "structuredName": {
                            "firstName": "Anand",
                            "lastName": "Rangarajan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anand Rangarajan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7586792,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "78893dd60308791d3acd4ed5ee207af6515c9a6a",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "With a point matching distance measure which is invariant under translation, rotation and permutation, we learn 2-D point-set objects, by clustering noisy point-set images. Unlike traditional clustering methods which use distance measures that operate on feature vectors - a representation common to most problem domains - this object-based clustering technique employs a distance measure specific to a type of object within a problem domain. Formulating the clustering problem as two nested objective functions, we derive optimization dynamics similar to the Expectation-Maximization algorithm used in mixture models."
            },
            "slug": "Clustering-with-a-Domain-Specific-Distance-Measure-Gold-Mjolsness",
            "title": {
                "fragments": [],
                "text": "Clustering with a Domain-Specific Distance Measure"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This work forms the clustering problem as two nested objective functions, and derives optimization dynamics similar to the Expectation-Maximization algorithm used in mixture models."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35380459"
                        ],
                        "name": "S. Gold",
                        "slug": "S.-Gold",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Gold",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Gold"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145257017"
                        ],
                        "name": "Anand Rangarajan",
                        "slug": "Anand-Rangarajan",
                        "structuredName": {
                            "firstName": "Anand",
                            "lastName": "Rangarajan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anand Rangarajan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 296,
                                "start": 184
                            }
                        ],
                        "text": "It has since been applied to much more di cult optimization problems, including many special cases of quadratic assignment problems such as graph matching, TSP, and graph partitioning (Gold et al., 1996; Rangarajan et al., 1996; Gold and Rangarajan, 1996a; Gold, 1995; Gold and Rangarajan, 1996b)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 10369341,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9899003369af99d02f699cbcbf48b79019666158",
            "isKey": false,
            "numCitedBy": 1159,
            "numCiting": 91,
            "paperAbstract": {
                "fragments": [],
                "text": "A graduated assignment algorithm for graph matching is presented which is fast and accurate even in the presence of high noise. By combining graduated nonconvexity, two-way (assignment) constraints, and sparsity, large improvements in accuracy and speed are achieved. Its low order computational complexity [O(lm), where l and m are the number of links in the two graphs] and robustness in the presence of noise offer advantages over traditional combinatorial approaches. The algorithm, not restricted to any special class of graph, is applied to subgraph isomorphism, weighted graph matching, and attributed relational graph matching. To illustrate the performance of the algorithm, attributed relational graphs derived from objects are matched. Then, results from twenty-five thousand experiments conducted on 100 mode random graphs of varying types (graphs with only zero-one links, weighted graphs, and graphs with node attributes and multiple link types) are reported. No comparable results have been reported by any other graph matching algorithm before in the research literature. Twenty-five hundred control experiments are conducted using a relaxation labeling algorithm and large improvements in accuracy are demonstrated."
            },
            "slug": "A-Graduated-Assignment-Algorithm-for-Graph-Matching-Gold-Rangarajan",
            "title": {
                "fragments": [],
                "text": "A Graduated Assignment Algorithm for Graph Matching"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "A graduated assignment algorithm for graph matching is presented which is fast and accurate even in the presence of high noise, and not restricted to any special class of graph, is applied to subgraph isomorphism, weighted graph matching, and attributed relational graph matching."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2070677950"
                        ],
                        "name": "A. Califano",
                        "slug": "A.-Califano",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "Califano",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Califano"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2057667806"
                        ],
                        "name": "R. Mohan",
                        "slug": "R.-Mohan",
                        "structuredName": {
                            "firstName": "Rakesh",
                            "lastName": "Mohan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Mohan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 227,
                                "start": 180
                            }
                        ],
                        "text": "rigid Euclidean, a ne, perspective, and so on) (Weinshall and Tomasi, 1995; Jacobs, 1994) and which can then be used in matching and indexing algorithms, such as geometric hashing (Califano and Mohan, 1994; Lamdan et al., 1988)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 10403106,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "62f6a99f6749262f6dc6cc8b3d6f2f2c16a1aefb",
            "isKey": false,
            "numCitedBy": 120,
            "numCiting": 68,
            "paperAbstract": {
                "fragments": [],
                "text": "A homogeneous approach for acquisition, storage, and recognition of nonparametric shapes from images, using a novel shape representation based on shape autocorrelation operators is presented. A theoretical and experimental analysis of the computational complexity, recognition performance with increasing database size, and fault tolerance of the approach is presented. The system has been tested extensively with more than 300 arbitrary shapes in the database. Using a set of complex shapes, the recognition behavior with respect to occlusion, geometric transformation, and cluttered environments is studied. Unsupervised shape and subpart acquisition is demonstrated.<<ETX>>"
            },
            "slug": "Multidimensional-indexing-for-recognizing-visual-Califano-Mohan",
            "title": {
                "fragments": [],
                "text": "Multidimensional Indexing for Recognizing Visual Shapes"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A homogeneous approach for acquisition, storage, and recognition of nonparametric shapes from images, using a novel shape representation based on shape autocorrelation operators is presented."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145257017"
                        ],
                        "name": "Anand Rangarajan",
                        "slug": "Anand-Rangarajan",
                        "structuredName": {
                            "firstName": "Anand",
                            "lastName": "Rangarajan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anand Rangarajan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35380459"
                        ],
                        "name": "S. Gold",
                        "slug": "S.-Gold",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Gold",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Gold"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1705072"
                        ],
                        "name": "E. Mjolsness",
                        "slug": "E.-Mjolsness",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Mjolsness",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Mjolsness"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 160519,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7b782c8204b8b8c86a088a443a948221a239ec26",
            "isKey": false,
            "numCitedBy": 95,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a novel optimizing network architecture with applications in vision, learning, pattern recognition, and combinatorial optimization. This architecture is constructed by combining the following techniques: (1) deterministic annealing, (2) self-amplification, (3) algebraic transformations, (4) clocked objectives, and (5) softassign. Deterministic annealing in conjunction with self-amplification avoids poor local minima and ensures that a vertex of the hypercube is reached. Algebraic transformations and clocked objectives help partition the relaxation into distinct phases. The problems considered have doubly stochastic matrix constraints or minor variations thereof. We introduce a new technique, softassign, which is used to satisfy this constraint. Experimental results on different problems are presented and discussed."
            },
            "slug": "A-Novel-Optimizing-Network-Architecture-with-Rangarajan-Gold",
            "title": {
                "fragments": [],
                "text": "A Novel Optimizing Network Architecture with Applications"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "A novel optimizing network architecture with applications in vision, learning, pattern recognition, and combinatorial optimization is presented and a new technique, softassign, is introduced, which is used to satisfy this constraint."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1678170728"
                        ],
                        "name": "J. Kosowsky",
                        "slug": "J.-Kosowsky",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Kosowsky",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kosowsky"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5200734,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ed223a6a3f853a6720406d6c22680e02e3953b9c",
            "isKey": false,
            "numCitedBy": 135,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "In recent years there has been significant interest in adapting techniques from statistical physics, in particular mean field theory, to provide deterministic heuristic algorithms for obtaining approximate solutions to optimization problems. Although these algorithms have been shown experimentally to be successful there has been little theoretical analysis of them. In this paper we demonstrate connections between mean field theory methods and other approaches, in particular, barrier function and interior point methods. As an explicit example, we summarize our work on the linear assignment problem. In this previous work we defined a number of algorithms, including deterministic annealing, for solving the assignment problem. We proved convergence, gave bounds on the convergence times, and showed relations to other optimization algorithms."
            },
            "slug": "Statistical-Physics-Algorithms-That-Converge-Yuille-Kosowsky",
            "title": {
                "fragments": [],
                "text": "Statistical Physics Algorithms That Converge"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "Close connections are demonstrated between mean field theory methods and other approaches, in particular, barrier function and interior point methods, for obtaining approximate solutions to optimization problems."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2055557361"
                        ],
                        "name": "C. Peterson",
                        "slug": "C.-Peterson",
                        "structuredName": {
                            "firstName": "Carsten",
                            "lastName": "Peterson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Peterson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2097406"
                        ],
                        "name": "B. Söderberg",
                        "slug": "B.-Söderberg",
                        "structuredName": {
                            "firstName": "Bo",
                            "lastName": "Söderberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Söderberg"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 7651654,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "234a5ffb9973ac2a4b2081dc57877df64116c777",
            "isKey": false,
            "numCitedBy": 521,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "A novel modified method for obtaining approximate solutions to difficult optimization problems within the neural network paradigm is presented. We consider the graph partition and the travelling salesman problems. The key new ingredient is a reduction of solution space by one dimension by using graded neurons, thereby avoiding the destructive redundancy that has plagued these problems when using straightforward neural network techniques. This approach maps the problems onto Potts glass rather than spin glass theories. A systematic prescription is given for estimating the phase transition temperatures in advance, which facilitates the choice of optimal parameters. This analysis, which is performed for both serial and synchronous updating of the mean field theory equations, makes it possible to consistently avoid chaotic behavior.When exploring this new technique numerically we find the results very encouraging; the quality of the solutions are in parity with those obtained by using optimally tuned simulated annealing heuristics. Our numerical study, which for TSP extends to 200-city problems, exhibits an impressive level of parameter insensitivity. (Less)"
            },
            "slug": "A-New-Method-for-Mapping-Optimization-Problems-Onto-Peterson-Söderberg",
            "title": {
                "fragments": [],
                "text": "A New Method for Mapping Optimization Problems Onto Neural Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 84,
                "text": "A novel modified method for obtaining approximate solutions to difficult optimization problems within the neural network paradigm is presented, which considers the graph partition and the travelling salesman problems and exhibits an impressive level of parameter insensitivity."
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Neural Syst."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144421140"
                        ],
                        "name": "S. Ranade",
                        "slug": "S.-Ranade",
                        "structuredName": {
                            "firstName": "Sanjay",
                            "lastName": "Ranade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ranade"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 77,
                                "start": 49
                            }
                        ],
                        "text": "Relaxation labeling algorithms rst introduced by (Ranade and Rosenfeld, 1980) have also been widely applied to point matching."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 20370658,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "3f6224569bb447952d80281783ba03d18b6cd7a8",
            "isKey": false,
            "numCitedBy": 329,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Point-pattern-matching-by-relaxation-Ranade-Rosenfeld",
            "title": {
                "fragments": [],
                "text": "Point pattern matching by relaxation"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1678170728"
                        ],
                        "name": "J. Kosowsky",
                        "slug": "J.-Kosowsky",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Kosowsky",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kosowsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6967348,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "429b1cf154d3d5e24d98b6d83f875cd91aab72fd",
            "isKey": false,
            "numCitedBy": 146,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-invisible-hand-algorithm:-Solving-the-problem-Kosowsky-Yuille",
            "title": {
                "fragments": [],
                "text": "The invisible hand algorithm: Solving the assignment problem with statistical physics"
            },
            "venue": {
                "fragments": [],
                "text": "Neural Networks"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47246616"
                        ],
                        "name": "R. Brunelli",
                        "slug": "R.-Brunelli",
                        "structuredName": {
                            "firstName": "Roberto",
                            "lastName": "Brunelli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Brunelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 140,
                                "start": 113
                            }
                        ],
                        "text": "Relating models to image intensities rather than to feature points is favored in face recognition experiments of (Brunelli and Poggio, 1993) and in the more neural network like approach of (Hinton et al."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 16859093,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "239beb3861ceceb4c7c7f229234d97198d5c7697",
            "isKey": false,
            "numCitedBy": 2828,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "Two new algorithms for computer recognition of human faces, one based on the computation of a set of geometrical features, such as nose width and length, mouth position, and chin shape, and the second based on almost-gray-level template matching, are presented. The results obtained for the testing sets show about 90% correct recognition using geometrical features and perfect recognition using template matching. >"
            },
            "slug": "Face-Recognition:-Features-Versus-Templates-Brunelli-Poggio",
            "title": {
                "fragments": [],
                "text": "Face Recognition: Features Versus Templates"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Two new algorithms for computer recognition of human faces, one based on the computation of a set of geometrical features, such as nose width and length, mouth position, and chin shape, and the second based on almost-gray-level template matching are presented."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35380459"
                        ],
                        "name": "S. Gold",
                        "slug": "S.-Gold",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Gold",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Gold"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145257016"
                        ],
                        "name": "A. Rangarajan",
                        "slug": "A.-Rangarajan",
                        "structuredName": {
                            "firstName": "Anand",
                            "lastName": "Rangarajan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rangarajan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 428114,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8b9ca3c24d89851f276a7b13413bd047b8577999",
            "isKey": false,
            "numCitedBy": 100,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "A new technique termed softassign, is applied to three combinatorial optimization problems|weighted graph matching, the traveling salesman problem and graph partitioning. Softassign, which has emerged from the recurrent neural network/statistical physics framework, enforces two-way (assignment) constraints without the use of penalty terms in the energy functions. The softassign can also be generalized from two-way winner-take-all constraints to multiple membership constraints which are required for graph partitioning. The softassign technique is compared to softmax (Potts glass) dynamics. Within the statistical physics framework, softmax and a penalty term has been a widely used method for enforcing the two-way constraints common to many combinatorial optimization problems. The benchmarks present evidence that softas-sign has clear advantages in accuracy, speed, parallelizability and al-gorithmic simplicity over softmax and a penalty term in optimization problems with two-way constraints."
            },
            "slug": "Softmax-to-Softassign:-neural-network-algorithms-Gold-Rangarajan",
            "title": {
                "fragments": [],
                "text": "Softmax to Softassign: neural network algorithms for combinatorial optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "The benchmarks present evidence that softas-sign has clear advantages in accuracy, speed, parallelizability and al-gorithmic simplicity over softmax and a penalty term in optimization problems with two-way constraints."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35380459"
                        ],
                        "name": "S. Gold",
                        "slug": "S.-Gold",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Gold",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Gold"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145257017"
                        ],
                        "name": "Anand Rangarajan",
                        "slug": "Anand-Rangarajan",
                        "structuredName": {
                            "firstName": "Anand",
                            "lastName": "Rangarajan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anand Rangarajan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 26976467,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2b45b49624aad340f185babe7857410bc1a3b6fa",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "A new technique, termed soft assign, is applied for the first time to two classic combinatorial optimization problems, the traveling salesman problem and graph partitioning. Soft assign, which has emerged from the recurrent neural network/statistical physics framework, enforces two-way (assignment) constraints without the use of penalty terms in the energy functions. The soft assign can also be generalized from two-way winner-take-all constraints to multiple membership constraints which are required for graph partitioning. The soft assign technique is compared to the softmax (Potts glass). Within the statistical physics framework, softmax and a penalty term has been a widely used method for enforcing the two-way constraints common within many combinatorial optimization problems. The benchmarks present evidence that soft assign has clear advantages in accuracy, speed, parallelizability and algorithmic simplicity over softmax and a penalty term in optimization problems with two-way constraints."
            },
            "slug": "Softassign-versus-Softmax:-Benchmarks-in-Gold-Rangarajan",
            "title": {
                "fragments": [],
                "text": "Softassign versus Softmax: Benchmarks in Combinatorial Optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The benchmarks present evidence that soft assign has clear advantages in accuracy, speed, parallelizability and algorithmic simplicity over softmax and a penalty term in optimization problems with two-way constraints."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804489"
                        ],
                        "name": "F. Girosi",
                        "slug": "F.-Girosi",
                        "structuredName": {
                            "firstName": "Federico",
                            "lastName": "Girosi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Girosi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145319478"
                        ],
                        "name": "Michael J. Jones",
                        "slug": "Michael-J.-Jones",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Jones",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Jones"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 26
                            }
                        ],
                        "text": "g (A) serves to regularize(44) the affine transformation by penalizing large values of the scale and shear components."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 49743910,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "eae2430d9a984120bf511655a03c15089b007499",
            "isKey": false,
            "numCitedBy": 1366,
            "numCiting": 198,
            "paperAbstract": {
                "fragments": [],
                "text": "We had previously shown that regularization principles lead to approximation schemes that are equivalent to networks with one layer of hidden units, called regularization networks. In particular, standard smoothness functionals lead to a subclass of regularization networks, the well known radial basis functions approximation schemes. This paper shows that regularization networks encompass a much broader range of approximation schemes, including many of the popular general additive models and some of the neural networks. In particular, we introduce new classes of smoothness functionals that lead to different classes of basis functions. Additive splines as well as some tensor product splines can be obtained from appropriate classes of smoothness functionals. Furthermore, the same generalization that extends radial basis functions (RBF) to hyper basis functions (HBF) also leads from additive models to ridge approximation models, containing as special cases Breiman's hinge functions, some forms of projection pursuit regression, and several types of neural networks. We propose to use the term generalized regularization networks for this broad class of approximation schemes that follow from an extension of regularization. In the probabilistic interpretation of regularization, the different classes of basis functions correspond to different classes of prior probabilities on the approximating function spaces, and therefore to different types of smoothness assumptions. In summary, different multilayer networks with one hidden layer, which we collectively call generalized regularization networks, correspond to different classes of priors and associated smoothness functionals in a classical regularization principle. Three broad classes are (1) radial basis functions that can be generalized to hyper basis functions, (2) some tensor product splines, and (3) additive splines that can be generalized to schemes of the type of ridge approximation, hinge functions, and several perceptron-like neural networks with one hidden layer."
            },
            "slug": "Regularization-Theory-and-Neural-Networks-Girosi-Jones",
            "title": {
                "fragments": [],
                "text": "Regularization Theory and Neural Networks Architectures"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "This paper shows that regularization networks encompass a much broader range of approximation schemes, including many of the popular general additive models and some of the neural networks, and introduces new classes of smoothness functionals that lead to different classes of basis functions."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1786249"
                        ],
                        "name": "D. Bertsekas",
                        "slug": "D.-Bertsekas",
                        "structuredName": {
                            "firstName": "Dimitri",
                            "lastName": "Bertsekas",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Bertsekas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144224173"
                        ],
                        "name": "J. Tsitsiklis",
                        "slug": "J.-Tsitsiklis",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsitsiklis",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tsitsiklis"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 152,
                                "start": 148
                            }
                        ],
                        "text": "However, the point matching problem we are trying to solve is much harder than the linear assignment problem which can be solved in polynomial time.(52)"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 60492634,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "638df1b831feb3647a9bf5496780b38890573d4d",
            "isKey": false,
            "numCitedBy": 5436,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "gineering, computer science, operations research, and applied mathematics. It is essentially a self-contained work, with the development of the material occurring in the main body of the text and excellent appendices on linear algebra and analysis, graph theory, duality theory, and probability theory and Markov chains supporting it. The introduction discusses parallel and distributed architectures, complexity measures, and communication and synchronization issues, and it presents both Jacobi and Gauss-Seidel iterations, which serve as algorithms of reference for many of the computational approaches addressed later. After the introduction, the text is organized in two parts: synchronous algorithms and asynchronous algorithms. The discussion of synchronous algorithms comprises four chapters, with Chapter 2 presenting both direct methods (converging to the exact solution within a finite number of steps) and iterative methods for linear"
            },
            "slug": "Parallel-and-Distributed-Computation:-Numerical-Bertsekas-Tsitsiklis",
            "title": {
                "fragments": [],
                "text": "Parallel and Distributed Computation: Numerical Methods"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This work discusses parallel and distributed architectures, complexity measures, and communication and synchronization issues, and it presents both Jacobi and Gauss-Seidel iterations, which serve as algorithms of reference for many of the computational approaches addressed later."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398687533"
                        ],
                        "name": "B. Kamgar-Parsi",
                        "slug": "B.-Kamgar-Parsi",
                        "structuredName": {
                            "firstName": "Behzad",
                            "lastName": "Kamgar-Parsi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Kamgar-Parsi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398687530"
                        ],
                        "name": "B. Kamgar-Parsi",
                        "slug": "B.-Kamgar-Parsi",
                        "structuredName": {
                            "firstName": "Behrooz",
                            "lastName": "Kamgar-Parsi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Kamgar-Parsi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2203224,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "56fe30324975701848adf18e3ee4817805a35ec8",
            "isKey": false,
            "numCitedBy": 79,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Hopfield and Tank have shown that neural networks can be used to solve certain computationally hard problems, in particular they studied the Traveling Salesman Problem (TSP). Based on network simulation results they conclude that analog VLSI neural nets can be promising in solving these problems. Recently, Wilson and Pawley presented the results of their simulations which contradict the original results and cast doubts on the usefulness of neural nets. In this paper we give the results of our simulations that clarify some of the discrepancies. We also investigate the scaling of TSP solutions found by neural nets as the size of the problem increases. Further, we consider the neural net solution of the Clustering Problem, also a computationally hard problem, and discuss the types of problems that appear to be well suited for a neural net approach."
            },
            "slug": "On-problem-solving-with-Hopfield-neural-networks-Kamgar-Parsi-Kamgar-Parsi",
            "title": {
                "fragments": [],
                "text": "On problem solving with Hopfield neural networks"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The results of the simulations that clarify some of the discrepancies in the original TSP results are given, and the scaling of TSP solutions found by neural nets as the size of the problem increases are investigated."
            },
            "venue": {
                "fragments": [],
                "text": "International 1989 Joint Conference on Neural Networks"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35106875"
                        ],
                        "name": "R. Duda",
                        "slug": "R.-Duda",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Duda",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Duda"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3108177"
                        ],
                        "name": "P. Hart",
                        "slug": "P.-Hart",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Hart",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Hart"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Over thirty-thousand experiments, on randomly generated points sets with varying amounts of noise and missing and spurious points, as well as on hand-written character sets demonstrate the robustness of the algorithm."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 12946615,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b07ce649d6f6eb636872527104b0209d3edc8188",
            "isKey": false,
            "numCitedBy": 16926,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Provides a unified, comprehensive and up-to-date treatment of both statistical and descriptive methods for pattern recognition. The topics treated include Bayesian decision theory, supervised and unsupervised learning, nonparametric techniques, discriminant analysis, clustering, preprosessing of pictorial data, spatial filtering, shape description techniques, perspective transformations, projective invariants, linguistic procedures, and artificial intelligence techniques for scene analysis."
            },
            "slug": "Pattern-classification-and-scene-analysis-Duda-Hart",
            "title": {
                "fragments": [],
                "text": "Pattern classification and scene analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "The topics treated include Bayesian decision theory, supervised and unsupervised learning, nonparametric techniques, discriminant analysis, clustering, preprosessing of pictorial data, spatial filtering, shape description techniques, perspective transformations, projective invariants, linguistic procedures, and artificial intelligence techniques for scene analysis."
            },
            "venue": {
                "fragments": [],
                "text": "A Wiley-Interscience publication"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110094"
                        ],
                        "name": "J. Bridle",
                        "slug": "J.-Bridle",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Bridle",
                            "middleNames": [
                                "Scott"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bridle"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 237,
                                "start": 223
                            }
                        ],
                        "text": "be formulated as a continuous problem by introducing a control parameter > 0 and then setting m as follows (Peterson and Soderberg, 1989; Geiger and Yuille, 1991) : mĵ = exp( Qĵ) PJj=1 exp( Qj) This is known as the softmax (Bridle, 1990)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 18865663,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "830ccb44084d9d6cdcb70d623df5012ae4835142",
            "isKey": false,
            "numCitedBy": 388,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "One of the attractions of neural network approaches to pattern recognition is the use of a discrimination-based training method. We show that once we have modified the output layer of a multilayer perceptron to provide mathematically correct probability distributions, and replaced the usual squared error criterion with a probability-based score, the result is equivalent to Maximum Mutual Information training, which has been used successfully to improve the performance of hidden Markov models for speech recognition. If the network is specially constructed to perform the recognition computations of a given kind of stochastic model based classifier then we obtain a method for discrimination-based training of the parameters of the models. Examples include an HMM-based word discriminator, which we call an 'Alphanet'."
            },
            "slug": "Training-Stochastic-Model-Recognition-Algorithms-as-Bridle",
            "title": {
                "fragments": [],
                "text": "Training Stochastic Model Recognition Algorithms as Networks can Lead to Maximum Mutual Information Estimation of Parameters"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "It is shown that once the output layer of a multilayer perceptron is modified to provide mathematically correct probability distributions, and the usual squared error criterion is replaced with a probability-based score, the result is equivalent to Maximum Mutual Information training."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1679011"
                        ],
                        "name": "A. Gee",
                        "slug": "A.-Gee",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Gee",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Gee"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2897157"
                        ],
                        "name": "Sreeram V. B. Aiyer",
                        "slug": "Sreeram-V.-B.-Aiyer",
                        "structuredName": {
                            "firstName": "Sreeram",
                            "lastName": "Aiyer",
                            "middleNames": [
                                "V.",
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sreeram V. B. Aiyer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680968"
                        ],
                        "name": "R. Prager",
                        "slug": "R.-Prager",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Prager",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Prager"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 51
                            }
                        ],
                        "text": "(Ullman, 1989)'s alignment method is O(n4m3 logm), (Gee et al., 1993) neural net method is O(n4) (equal point sets), Hough transforms or geometric hashing can be of high polynomial complexity or use an impractical number of bins when a ne transforms are considered (Lamdan et al."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 147,
                                "start": 106
                            }
                        ],
                        "text": "Similar problems related to two-way constraint satisfaction beset the objective function based methods of (Vinod and Ghose, 1993; Gee et al., 1993)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6240607,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f65e97d0de9025db081a888740de9f7c93908cdd",
            "isKey": false,
            "numCitedBy": 83,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-analytical-framework-for-optimizing-neural-Gee-Aiyer",
            "title": {
                "fragments": [],
                "text": "An analytical framework for optimizing neural networks"
            },
            "venue": {
                "fragments": [],
                "text": "Neural Networks"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2445984"
                        ],
                        "name": "D. V. D. Bout",
                        "slug": "D.-V.-D.-Bout",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Bout",
                            "middleNames": [
                                "E.",
                                "van",
                                "den"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. V. D. Bout"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153268068"
                        ],
                        "name": "T. Miller",
                        "slug": "T.-Miller",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Miller",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Miller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6708112,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e4ec9cc6f9169b4eb37c16a9f76835a7094e5e5d",
            "isKey": false,
            "numCitedBy": 230,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "A new algorithm, called mean field annealing (MFA), is applied to the graph partitioning problem. The MFA algorithm combines characteristics of the simulated annealing algorithm and the Hopfield neural network. MFA exhibits the rapid convergence of the neural network while preserving the solution quality afforded by stochastic simulated annealing (SSA). The MFA algorithm is developed in the context of the graph partitioning problem. The rate of convergence of MFA on graph bipartitioning problems is as much as 50 times that of SSA, yet does not degrade the quality of the final solution. The temperature behavior of MFA during bipartitioning is analyzed and shown to have an impact on the tuning of neural networks for improved performance. Also presented is a new modification to MFA that supports partitioning of random or structured graphs into three or more bins-a problem that has previously shown resistance to solution by neural networks.<<ETX>>"
            },
            "slug": "Graph-partitioning-using-annealed-neural-networks-Bout-Miller",
            "title": {
                "fragments": [],
                "text": "Graph partitioning using annealed neural networks"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The temperature behavior of MFA during bipartitioning is analyzed and shown to have an impact on the tuning of neural networks for improved performance, and a new modification to MFA is presented that supports partitioning of random or structured graphs into three or more bins-a problem that has previously shown resistance to solution by neural networks."
            },
            "venue": {
                "fragments": [],
                "text": "International 1989 Joint Conference on Neural Networks"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1786249"
                        ],
                        "name": "D. Bertsekas",
                        "slug": "D.-Bertsekas",
                        "structuredName": {
                            "firstName": "Dimitri",
                            "lastName": "Bertsekas",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Bertsekas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144224173"
                        ],
                        "name": "J. Tsitsiklis",
                        "slug": "J.-Tsitsiklis",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Tsitsiklis",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tsitsiklis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 180,
                                "start": 148
                            }
                        ],
                        "text": "However, the point matching problem we are trying to solve is much harder than the linear assignment problem which can be solved in polynomial time (Bertsekas and Tsitsiklis, 1989)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 31538876,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ee0da26f307bf890590cabfb70a9660a3e38a25d",
            "isKey": false,
            "numCitedBy": 1504,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This book focuses on numerical algorithms suited for parallelization for solving systems of equations and optimization problems. Emphasis on relaxation methods of the Jacobi and Gauss-Seidel type, and issues of communication and synchronization. Topics covered include: Algorithms for systems of linear equations and matrix inversion; Herative methods for nonlinear problems; and Shortest paths and dynamic programming."
            },
            "slug": "Parallel-and-distributed-computation-Bertsekas-Tsitsiklis",
            "title": {
                "fragments": [],
                "text": "Parallel and distributed computation"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "This book focuses on numerical algorithms suited for parallelization for solving systems of equations and optimization problems, with emphasis on relaxation methods of the Jacobi and Gauss-Seidel type."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 296,
                                "start": 184
                            }
                        ],
                        "text": "It has since been applied to much more di cult optimization problems, including many special cases of quadratic assignment problems such as graph matching, TSP, and graph partitioning (Gold et al., 1996; Rangarajan et al., 1996; Gold and Rangarajan, 1996a; Gold, 1995; Gold and Rangarajan, 1996b)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 31
                            }
                        ],
                        "text": "These new optimization methods (Rangarajan et al., 1996; Gold and Rangarajan, 1996b; Gold, 1995), not previously applied to point-matching, result in an accurate and fast algorithm in the presence of substantial noise and a high percentage of missing or spurious features."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 223,
                                "start": 80
                            }
                        ],
                        "text": "The objective (2) can be derived from using techniques from statistical physics (Rangarajan et al., 1996; Elfadel and Yuille, 1993; Yuille and Kosowsky, 1994; Van den Bout and Miller III, 1990; Peterson and Soderberg, 1989)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 62
                            }
                        ],
                        "text": "Iterated row and column normalization can be directly related (Rangarajan et al., 1996) to solving for the Lagrange parameters ( and ) in (2)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 265,
                                "start": 240
                            }
                        ],
                        "text": "The row normalization, column normalization, and geometric update phases of this algorithm can also be formalized as a \\clocked\" objective function, related to (2), which optimizes di erent subsets of the variables in di erent clock phases (Rangarajan et al., 1996)."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A novel optimizing network architecture"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743045"
                        ],
                        "name": "S. Ullman",
                        "slug": "S.-Ullman",
                        "structuredName": {
                            "firstName": "Shimon",
                            "lastName": "Ullman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ullman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124299488,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5d767b0b5361f70e8af8fb43262d3d50e88da4fc",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Aligning-pictorial-descriptions-Ullman",
            "title": {
                "fragments": [],
                "text": "Aligning pictorial descriptions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102566654"
                        ],
                        "name": "Richard Sinkhorn",
                        "slug": "Richard-Sinkhorn",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Sinkhorn",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Richard Sinkhorn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 120846714,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "441f33fab0614fa0696be54a046cbc692b7e70a2",
            "isKey": false,
            "numCitedBy": 830,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Relationship-Between-Arbitrary-Positive-Matrices-Sinkhorn",
            "title": {
                "fragments": [],
                "text": "A Relationship Between Arbitrary Positive Matrices and Doubly Stochastic Matrices"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1964
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105795"
                        ],
                        "name": "Michael J. Black",
                        "slug": "Michael-J.-Black",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Black",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Black"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145257017"
                        ],
                        "name": "Anand Rangarajan",
                        "slug": "Anand-Rangarajan",
                        "structuredName": {
                            "firstName": "Anand",
                            "lastName": "Rangarajan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anand Rangarajan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 145
                            }
                        ],
                        "text": "By incorporating slack variables, the point matching algorithm can handle outliers (spurious or missing points) in a statistically robust manner.(54)"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 115233100,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b6889fe22f23e953d670839e45bf8c3c266118da",
            "isKey": false,
            "numCitedBy": 151,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-the-unification-of-line-processes-Black-Rangarajan",
            "title": {
                "fragments": [],
                "text": "On the unification of line processes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 173,
                                "start": 145
                            }
                        ],
                        "text": "By incorporating slack variables, the point matching algorithm can handle outliers (spurious or missing points) in a statistically robust manner (Black and Rangarajan, 1996)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the uni cation of line processes, outlier rejection"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "D. degrees in Computer Science from Yale University in 1982"
            },
            "venue": {
                "fragments": [],
                "text": "respectively. His research interests are neural networks, computational biology, neurobiological modeling, artificial intelligence and software development"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 176,
                                "start": 161
                            }
                        ],
                        "text": "This has traditionally been considered a hard problem - especially when the issues of noise, missing or spurious data, and non-rigid transformations are tackled [Grimson, 1990] ."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Object Recognition by Computer, Cambridge, MA"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 36
                            }
                        ],
                        "text": "For example elastic ‘‘snake’’ models(33) are now commonly used to represent unknown curves and to pick them out of intensity or gradient images."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Snakes: active contour models, Internat"
            },
            "venue": {
                "fragments": [],
                "text": "J. Comput. »ision"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 227,
                                "start": 180
                            }
                        ],
                        "text": "rigid Euclidean, a ne, perspective, and so on) (Weinshall and Tomasi, 1995; Jacobs, 1994) and which can then be used in matching and indexing algorithms, such as geometric hashing (Califano and Mohan, 1994; Lamdan et al., 1988)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 255,
                                "start": 203
                            }
                        ],
                        "text": ", 1993) neural net method is O(n4) (equal point sets), Hough transforms or geometric hashing can be of high polynomial complexity or use an impractical number of bins when a ne transforms are considered (Lamdan et al., 1988; Stockman, 1987; Grimson, 1990)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 190,
                                "start": 143
                            }
                        ],
                        "text": "Geometric hashing is another voting scheme where discrete bins are created for the possible bases that can be used to represent the point sets (Lamdan et al., 1988; Hummel and Wolfson, 1988)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Object recognition by a ne invariant matching"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Conf . Comp . Vision , Patt . Recog ."
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 108,
                                "start": 104
                            }
                        ],
                        "text": "More recently, probabilistic techniques have been applied to enhance the speed of this alignment method.(22) Considerable attention has focused on the computation of invariants which characterize small"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Probabilistic indexing for object recognition, IEEE 1rans"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Anal. Mach. Intell"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Comparing images usingthe hausdor distance"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans . Patt . Anal . Mach . Intell ."
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Feature-based correspondence"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Deformable templates Active Vision"
            },
            "venue": {
                "fragments": [],
                "text": "Deformable templates Active Vision"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Connectionist grammars for high-level vision"
            },
            "venue": {
                "fragments": [],
                "text": "Artificial Intelligence and Neural Networks: Steps ¹oward Principled Integration"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 49,
                                "start": 46
                            }
                        ],
                        "text": "m(2n`1) jk \"exp (b(Q jk !k(n`1) j !l(n) k )), (3)"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 42,
                                "start": 37
                            }
                        ],
                        "text": "traveling salesman problem, was poor.(3,4) More recently, a number of techniques from statistical physics have been adopted to mitigate these problems."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the stability of the traveling salesman problem algorithm of Hopfield and Tank, Biological Cybernet"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On problem solving with Hopfield networks"
            },
            "venue": {
                "fragments": [],
                "text": "Biological Cybernet"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Graph partitioning using annealed networks, IEEE ¹rans"
            },
            "venue": {
                "fragments": [],
                "text": "Neural Networks"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On problem solving with Hoppeld networks"
            },
            "venue": {
                "fragments": [],
                "text": "Biological Cybernetics"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 180,
                                "start": 133
                            }
                        ],
                        "text": "hashing is another voting scheme where discrete bins are created for the possible bases that can be used to represent the point sets (Lamdan et al., 1988; Hummel and Wolfson, 1988)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A ne invariant matching"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the DARPA"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 84,
                                "start": 65
                            }
                        ],
                        "text": "(1)\nUsing a new technique—the softassign—which has emerged from the recurrent neural network/statistical physics framework, we develop new algorithms for 2D and 3D point matching."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Object recognition by aane invariant matching"
            },
            "venue": {
                "fragments": [],
                "text": "Object recognition by aane invariant matching"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The invisible hand algorithm"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 296,
                                "start": 184
                            }
                        ],
                        "text": "It has since been applied to much more di cult optimization problems, including many special cases of quadratic assignment problems such as graph matching, TSP, and graph partitioning (Gold et al., 1996; Rangarajan et al., 1996; Gold and Rangarajan, 1996a; Gold, 1995; Gold and Rangarajan, 1996b)."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Learning with preknowledge: clustering"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 158,
                                "start": 151
                            }
                        ],
                        "text": "(17,18) Geometric hashing is another voting scheme where discrete bins are created for the possible bases that can be used to represent the point sets.(19,20) In the alignment method(21) each alignment feature (defined as a set of three distinctive points) in the image is matched against each align-"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Affine invariant matching"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. DARPA Image onderstanding 1⁄4orkshop,"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Point-matching Pose estimation Correspondence Neural networks Optimization Softassign Deterministic annealing Affine transformation"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the stability of the traveling salesman problem algorithm of Hoppeld and Tank"
            },
            "venue": {
                "fragments": [],
                "text": "Biological Cybernetics"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 223,
                                "start": 80
                            }
                        ],
                        "text": "The objective (2) can be derived from using techniques from statistical physics (Rangarajan et al., 1996; Elfadel and Yuille, 1993; Yuille and Kosowsky, 1994; Van den Bout and Miller III, 1990; Peterson and Soderberg, 1989)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Mean- eld phase transitions and correlation functions for"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 213,
                                "start": 182
                            }
                        ],
                        "text": "The generalized Hough transform requires the division of the parameter space of possible poses into discrete bins wherein good matches are registered as votes in the appropriate bin (Ballard, 1981; Stockman, 1987)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Generalized hough transform to detect arbitrary patterns"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE ¹rans. Pattern Anal. Mach. Intell"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 110,
                                "start": 86
                            }
                        ],
                        "text": "(1)\nUsing a new technique—the softassign—which has emerged from the recurrent neural network/statistical physics framework, we develop new algorithms for 2D and 3D point matching."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "AAne invariant matching"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the DARPA Image Understanding Workshop"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Mean--eld phase transitions and correlation functions for Gibbs random elds"
            },
            "venue": {
                "fragments": [],
                "text": "J. Math. Imaging Vision"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the stability of the traveling salesman problemalgorithm of Hop eld and Tank"
            },
            "venue": {
                "fragments": [],
                "text": "Biological Cybernetics"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 26
                            }
                        ],
                        "text": "Deformable template models(31,32) provide a physically-based non-linear optimization approach to matching but must be separately related"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Deformable templates, in Active »ision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 108
                            }
                        ],
                        "text": "ing,(14) alignment,(21) neural networks,(43) Hough transforms,(1) geometric hashing(19) and pose clustering.(18) It is robust—its use of slack variables permit the handling of outliers in a statistically robust manner."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 27,
                                "start": 20
                            }
                        ],
                        "text": "the appropriate bin.(17,18) Geometric hashing is another voting scheme where discrete bins are created for the possible bases that can be used to represent the point sets."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Object recognition and localization via pose clustering, Comput. »ision"
            },
            "venue": {
                "fragments": [],
                "text": "Graphics Image Process"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 26
                            }
                        ],
                        "text": "g(A) serves to regularize (Girosi et al., 1995) the a ne transformation by penalizing large values of the scale and shear components."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Regularization theory and neural network"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 26
                            }
                        ],
                        "text": "g(A) serves to regularize (Girosi et al., 1995) the a ne transformation by penalizing large values of the scale and shear components."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Regularization theory and neural network"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 42,
                                "start": 37
                            }
                        ],
                        "text": "traveling salesman problem, was poor.(3,4) More recently, a number of techniques from statistical physics have been adopted to mitigate these problems."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On problem solving with Hopfield networks, Biological Cybernet"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 165,
                                "start": 145
                            }
                        ],
                        "text": "The decomposition of A in the above is not required, since A could be left as a 2x2 matrix and solved for directly in the algorithm that follows (Pappu et al., 1996)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A framework for nonrigid matching and corre"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Graph partitioning using annealed networks"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 46,
                                "start": 39
                            }
                        ],
                        "text": "face and digit recognition experiments.(34,35) Relaxation labeling algorithms(36) have also been widely applied to point matching."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Face recognition: Features versus templates, IEEE 1rans"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Anal. Mach. Intell"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 190,
                                "start": 128
                            }
                        ],
                        "text": "As a result the quality of the solutions obtained for many optimization problems, like the traveling salesman problem, was poor (Wilson and Pawley, 1988; Kamgar-Parsi and Kamgar-Parsi, 1990)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the stability of the traveling salesman problem"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 190,
                                "start": 128
                            }
                        ],
                        "text": "As a result the quality of the solutions obtained for many optimization problems, like the traveling salesman problem, was poor (Wilson and Pawley, 1988; Kamgar-Parsi and Kamgar-Parsi, 1990)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On problem solving with Hop eld networks"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Graph partitioning using annealed networks"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Neural Networks"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 29
                            }
                        ],
                        "text": "This is known as the softmax.(49) The exponentiation"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Training stochastic model recognition algorithms as networks can lead to maximum mutual in formation estimation of parameters, in Advances in Neural Information"
            },
            "venue": {
                "fragments": [],
                "text": "Processing Systems,"
            },
            "year": 1990
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 35,
            "methodology": 26
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 89,
        "totalPages": 9
    },
    "page_url": "https://www.semanticscholar.org/paper/New-Algorithms-for-2D-and-3D-Point-Matching:-Pose-Gold-Lu/22cccd1bb0bfb2fe01c8db5e3859ac214fcf9542?sort=total-citations"
}