{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144864352"
                        ],
                        "name": "M. Maron",
                        "slug": "M.-Maron",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Maron",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Maron"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "29579066"
                        ],
                        "name": "J. L. Kuhns",
                        "slug": "J.-L.-Kuhns",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Kuhns",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. L. Kuhns"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11592162,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5e52c6ff85ac6d53cb0dac8581c0a76edc6fade7",
            "isKey": false,
            "numCitedBy": 972,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper reports on a novel technique for literature indexing and searching in a mechanized library system. The notion of relevance is taken as the key concept in the theory of information retrieval and a comparative concept of relevance is explicated in terms of the theory of probability. The resulting technique called “Probabilistic Indexing,” allows a computing machine, given a request for information, to make a statistical inference and derive a number (called the “relevance number”) for each document, which is a measure of the probability that the document will satisfy the given request. The result of a search is an ordered list of those documents which satisfy the request ranked according to their probable relevance.\nThe paper goes on to show that whereas in a conventional library system the cross-referencing (“see” and “see also”) is based solely on the “semantical closeness” between index terms, statistical measures of closeness between index terms can be defined and computed. Thus, given an arbitrary request consisting of one (or many) index term(s), a machine can elaborate on it to increase the probability of selecting relevant documents that would not otherwise have been selected.\nFinally, the paper suggests an interpretation of the whole library problem as one where the request is considered as a clue on the basis of which the library system makes a concatenated statistical inference in order to provide as an output an ordered list of those documents which most probably satisfy the information needs of the user."
            },
            "slug": "On-Relevance,-Probabilistic-Indexing-and-Retrieval-Maron-Kuhns",
            "title": {
                "fragments": [],
                "text": "On Relevance, Probabilistic Indexing and Information Retrieval"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The paper suggests an interpretation of the whole library problem as one where the request is considered as a clue on the basis of which the library system makes a concatenated statistical inference in order to provide as an output an ordered list of those documents which most probably satisfy the information needs of the user."
            },
            "venue": {
                "fragments": [],
                "text": "JACM"
            },
            "year": 1960
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 1,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Automatic-Indexing:-An-Experimental-Inquiry-Maron/c390dbf06af49d3691bc7b906f5fd9b909c2f89b?sort=total-citations"
}