{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1856724"
                        ],
                        "name": "R. Haber",
                        "slug": "R.-Haber",
                        "structuredName": {
                            "firstName": "Ralph",
                            "lastName": "Haber",
                            "middleNames": [
                                "Norman"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haber"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3128372,
            "fieldsOfStudy": [
                "Psychology",
                "Art"
            ],
            "id": "8b9e3e98fece654f6c542f66933267620bbb46cf",
            "isKey": false,
            "numCitedBy": 1079,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "People are visually oriented beings. Knowledge of our environment is mainly garnered through visually deciphering forms and symbols that convey meanings. As with hearing, the quality of eyesight is not always a factor in a person's ability to interpret what is seen. Children with no sight impairment (i.e., 20/20 vision) can fail to develop visual perception skills that are necessary for learning in general and that are particularly crucial for learning how to read and write. Just as there is a difference between hearing and listening in auditory perception, so also there is a difference between looking and seeing in visual perception. Visual perception is training in seeing and interpreting visual stimuli. Efficient visual functioning normally takes some time to develop, hence the use of oversized and brightly colored visual materials in primary level classrooms. Although the majority of children successfully develop the ability to focus visually and to make fine discriminations in visual materials during the primary years, some will be well into the intermediate grades before these skills are adequately developed for visual learning tasks. Often these children will need special help. Children who are inefficiently processing visual stimuli may have some of the following difficulties. The inability to • Get meaning from visual clues • Focus on a stationary object • Discriminate characteristic differences in visual stimuli (i.e., color, shape, size/quantity, direction/distance) • Perceive individual parts as constituting a whole • Judge distance • Relate symbol to object • Separate foreground from background in a picture • Recognize and remember visual information • Track a moving object with the eyes • Reproduce simple visual patterns • Recognize familiar visual images when reduced or embellished • Direct an extremity to a specific target"
            },
            "slug": "Visual-perception.-Haber",
            "title": {
                "fragments": [],
                "text": "Visual perception."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Although the majority of children successfully develop the ability to focus visually and to make fine discriminations in visual materials during the primary years, some will be well into the intermediate grades before these skills are adequately developed for visual learning tasks."
            },
            "venue": {
                "fragments": [],
                "text": "Annual review of psychology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 37243954,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "1b5d4fce73175c371e30a5572309457063e5aae3",
            "isKey": false,
            "numCitedBy": 87,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "The present literature on quantum efficiency is confusing and contains contradictions partly because definitions of efficiency have differed, partly because false assumptions about the working of the eye have been implicit in the method of calculation used, and partly because the experimental results chosen for the calculations were obtained under different conditions. The present paper defines overall quantum efficiency, reviews the literature leading up to the present work, points out the difficulties that have arisen, and describes a new method for determining the efficiency that is simpler and more accurate than previous methods. The range of application and significance of quantum efficiency as a measure of visual performance are discussed. In the following paper (Barlow, 1962) some results obtained with the method will be presented. Definition. The overall quantum efficiency (F) of vision is most simply defined as the following ratio:"
            },
            "slug": "A-method-of-determining-the-overall-quantum-of-Barlow",
            "title": {
                "fragments": [],
                "text": "A method of determining the overall quantum efficiency of visual discriminations"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The present paper defines overall quantum efficiency, reviews the literature leading up to the present work, points out the difficulties that have arisen, and describes a new method for determining the efficiency that is simpler and more accurate than previous methods."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40164810"
                        ],
                        "name": "S. Hecht",
                        "slug": "S.-Hecht",
                        "structuredName": {
                            "firstName": "Selig",
                            "lastName": "Hecht",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Hecht"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39082917"
                        ],
                        "name": "S. Shlaer",
                        "slug": "S.-Shlaer",
                        "structuredName": {
                            "firstName": "Simon",
                            "lastName": "Shlaer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Shlaer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152498384"
                        ],
                        "name": "M. Pirenne",
                        "slug": "M.-Pirenne",
                        "structuredName": {
                            "firstName": "Maurice",
                            "lastName": "Pirenne",
                            "middleNames": [
                                "Henri"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Pirenne"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9452166,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "c34da3fd5d71b3a00fcc68801382aa9d0316417e",
            "isKey": false,
            "numCitedBy": 1012,
            "numCiting": 51,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Direct measurements of the minimum energy required for threshold vision under optimal physiological conditions yield values between 2.1 and 5.7 x 10–10 ergs at the cornea, which correspond to between 54 and 148 quanta of blue-green light. 2. These values are at the cornea. To yield physiologically significant data they must be corrected for corneal reflection, which is 4 per cent; for ocular media absorption, which is almost precisely 50 per cent; and for retinal transmission, which is at least 80 per cent. Retinal transmission is derived from previous direct measurements and from new comparisons between the percentage absorption spectrum of visual purple with the dim-vision luminosity function. With these three corrections, the range of 54 to 148 quanta at the cornea becomes as an upper limit 5 to 14 quanta actually absorbed by the retinal rods. 3. This small number of quanta, in comparison with the large number of rods (500) involved, precludes any significant two quantum absorptions per rod, and means that in order to produce a visual effect, one quantum must be absorbed by each of 5 to 14 rods in the retina. 4. Because this number of individual events is so small, it may be derived from an independent statistical study of the relation between the intensity of a light flash and the frequency with which it is seen. Such experiments give values of 5 to 8 for the number of critical events involved at the threshold of vision. Biological variation does not alter these numbers essentially, and the agreement between the values measured directly and those derived from statistical considerations is therefore significant. 5. The results clarify the nature of the fluctuations shown by an organism in response to a stimulus. The general assumption has been that the stimulus is constant and the organism variable. The present considerations show, however, that at the threshold it is the stimulus which is variable, and that the properties of its variation determine the fluctuations found between response and stimulus."
            },
            "slug": "ENERGY,-QUANTA,-AND-VISION-Hecht-Shlaer",
            "title": {
                "fragments": [],
                "text": "ENERGY, QUANTA, AND VISION"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "The results clarify the nature of the fluctuations shown by an organism in response to a stimulus, and show that at the threshold it is the stimulus which is variable, and that the properties of its variation determine the fluctuations found between response and stimulus."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of general physiology"
            },
            "year": 1942
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "51088915"
                        ],
                        "name": "A. Rose",
                        "slug": "A.-Rose",
                        "structuredName": {
                            "firstName": "Albert",
                            "lastName": "Rose",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rose"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 19483439,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "5a6b9a541caf1210b0fc52e3e94892ee07cb7f91",
            "isKey": false,
            "numCitedBy": 870,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "An absolute scale of performance is set up in terms of the performance of an ideal picture pickup device, that is, one limited only by random fluctuations in the primary photo process. Only one parameter, the quantum efficiency of the primary photo process, locates position on this scale. The characteristic equation for the performance of an ideal device has the form BC2α2=constantwhere B is the luminance of the scene, and C and α are respectively the threshold contrast and angular size of a test object in the scene. This ideal type of performance is shown to be satisfied by a simple experimental television pickup arrangement. By means of the arrangement, two parameters, storage time of the eye and threshold signal-to-noise ratio are determined to be 0.2 seconds and five respectively. Published data on the performance of the eye are compared with ideal performance. In the ranges of B(10−6 to 102 footlamberts), C(2 to 100 percent) and α(2′ to 100′), the performance of the eye may be matched by an ideal device having a quantum efficiency of 5 percent at low lights and 0.5 percent at high lights. This is of considerable technical importance in simplifying the analysis of problems involving comparisons of the performance of the eye and man-made devices. To the extent that independent measurements of the quantum efficiency of the eye confirm the values (0.5 percent to 5.0 percent), the performance of the eye is limited by fluctuations in the primary photo process. To the same extent, other mechanisms for describing the eye that do not take these fluctuations into account are ruled out. It is argued that the phenomenon of dark adaptation can be ascribed only in small part to the primary photo-process and must be mainly controlled by a variable gain mechanism located between the primary photo-process and the nerve fibers carrying pulses to the brain."
            },
            "slug": "The-sensitivity-performance-of-the-human-eye-on-an-Rose",
            "title": {
                "fragments": [],
                "text": "The sensitivity performance of the human eye on an absolute scale."
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "It is argued that the phenomenon of dark adaptation can be ascribed only in small part to thePrimary photo-process and must be mainly controlled by a variable gain mechanism located between the primary photo- process and the nerve fibers carrying pulses to the brain."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1948
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4327771"
                        ],
                        "name": "D. Baylor",
                        "slug": "D.-Baylor",
                        "structuredName": {
                            "firstName": "Denis",
                            "lastName": "Baylor",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Baylor"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32441703"
                        ],
                        "name": "T. Lamb",
                        "slug": "T.-Lamb",
                        "structuredName": {
                            "firstName": "Trevor",
                            "lastName": "Lamb",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Lamb"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144005795"
                        ],
                        "name": "K. Yau",
                        "slug": "K.-Yau",
                        "structuredName": {
                            "firstName": "King-Wai",
                            "lastName": "Yau",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Yau"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 92,
                                "start": 72
                            }
                        ],
                        "text": "A little less than 40 years after Hecht et al. published their results, Baylor et al. (1979) were able to suck single toad rods into electrodes and measure current responses to single photon events (see figure)\n‡ Rods and cones schematic\n20 2_LimitsToVision.nb\n‡ Photon \"bumps\" in rod current\nFrom:…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 19860374,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "2ecd763fc2994ac27d87179784ecd57aa4d5dbaf",
            "isKey": false,
            "numCitedBy": 823,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "1. A suction electrode was used to record the membrane current of single rod outer segments in pieces of toad retina. During dim illumination the membrane current showed pronounced fluctuations. 2. Amplitude histograms of responses to dim flashes of fixed intensity exhibited two discrete peaks, one at 0 pA and one near 1 pA, suggesting that the response was quantized. By setting a criterion amplitude level, flash responses could be classed as 'failures' (no response) or as 'successes' (at least one quantal event). 3. The variation of fraction of successes with flash intensity was consistent with the hypothesis that each quantal electrical event resulted from a single photoisomerization. 4. The quantal event had a mean amplitude of about 1 pA (5% of the standing dark current) and a standard deviation of 0.2 pA. Dispersion in the event amplitude prevented identification of histogram peaks corresponding to two or more photoisomerizations. 5. Individual quantal responses exhibited a smooth shape very similar to that of the average quantal response. This suggests that a single photoisomerization releases many particles of transmitter and that radial diffusion of internal transmitter is not a major source of delay in the light response. 6. The 'quantum efficiency' with which an absorbed photon generated an electrical event was measured as 0.5 +/‐ 0.1 (S.E. of mean, n = 4). This is slightly lower than the quantum efficiency of photoisomerization obtained previously for rhodopsin in solution. 7. At wavelengths between 420 and 700 nm the quantal event was invariant in size, although the cell's sensitivity varied over a range of 10(5). 8. The power spectrum of the fluctuations in dim steady light was predicted by assuming that a random series of quantal events occurred independently. 9. In brighter light the fluctuations were faster, and the response to an incremental flash was reduced in size and duration. The power spectrum could be predicted by assuming random superposition of events with the shape of the incremental flash response."
            },
            "slug": "Responses-of-retinal-rods-to-single-photons.-Baylor-Lamb",
            "title": {
                "fragments": [],
                "text": "Responses of retinal rods to single photons."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Individual quantal responses exhibited a smooth shape very similar to that of the average quantal response, which suggests that a single photoisomerization releases many particles of transmitter and that radial diffusion of internal transmitter is not a major source of delay in the light response."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145897550"
                        ],
                        "name": "D. M. Green",
                        "slug": "D.-M.-Green",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Green",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. M. Green"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2498246"
                        ],
                        "name": "J. Swets",
                        "slug": "J.-Swets",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Swets",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Swets"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60579107,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "faf2933887410cb110cd7c68487cb0dd81d363ee",
            "isKey": false,
            "numCitedBy": 11741,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Book on statistical decision theory and sensory processes in signal detection theory and psychophysics"
            },
            "slug": "Signal-detection-theory-and-psychophysics-Green-Swets",
            "title": {
                "fragments": [],
                "text": "Signal detection theory and psychophysics"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "This book discusses statistical decision theory and sensory processes in signal detection theory and psychophysics and describes how these processes affect decision-making."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1966
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 6,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Computational-vision-Barrow-Tenenbaum/c40f7154273016993f4ed617ebe8c332d18f46a7?sort=total-citations"
}