{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "73282614"
                        ],
                        "name": "Y. Hirayama",
                        "slug": "Y.-Hirayama",
                        "structuredName": {
                            "firstName": "Y.",
                            "lastName": "Hirayama",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Hirayama"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45360202,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cac66edcb6a8d8ee34293183af5f0b2bfc6d0879",
            "isKey": false,
            "numCitedBy": 23,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Presents a novel block segmentation method for document images which can be applied to various document formats. Some documents have complicated column structures, in which some figure areas have no surrounding rectangles and others cut across text areas. In the approach presented, in order to segment documents into text and figure areas, the text areas are analyzed first, and the figure areas are then detected by analyzing information on the text areas. The overall process is as follows. First, character strings are merged into text groups by analyzing regularity in the text areas. Next, border lines of columns are detected by linking the edges of the text groups. After that, the whole page is segmented into small blocks according to the border lines. The blocks are then unified by using the column information, and some unified blocks are detected. Finally, a projection profile method is applied to the unified blocks in order to detect text areas and figure areas. This method was applied to 61 pages of Japanese technical papers and magazines, and 93.3% of the text areas and 93.2% of the figure areas were detected correctly.<<ETX>>"
            },
            "slug": "A-block-segmentation-method-for-document-images-Hirayama",
            "title": {
                "fragments": [],
                "text": "A block segmentation method for document images with complicated column structures"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "Presents a novel block segmentation method for document images which can be applied to various document formats and was applied to 61 pages of Japanese technical papers and magazines correctly."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2066251026"
                        ],
                        "name": "T. Saitoh",
                        "slug": "T.-Saitoh",
                        "structuredName": {
                            "firstName": "Takashi",
                            "lastName": "Saitoh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Saitoh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2147734"
                        ],
                        "name": "Michiyoshi Tachikawa",
                        "slug": "Michiyoshi-Tachikawa",
                        "structuredName": {
                            "firstName": "Michiyoshi",
                            "lastName": "Tachikawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michiyoshi Tachikawa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40073528"
                        ],
                        "name": "Toshifumi Yamaai",
                        "slug": "Toshifumi-Yamaai",
                        "structuredName": {
                            "firstName": "Toshifumi",
                            "lastName": "Yamaai",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Toshifumi Yamaai"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35158310,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c5c32f8cbf6183b8214f08c947c77a51769b8029",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "A system for document image segmentation and ordering text areas is described and applied to both Japanese and English complex printed page layouts. There is no need to make any assumption about the shape of blocks, hence the segmentation technique can handle not only skewed images without skew-correction but also documents where column are not rectangular. In this technique, on the bottom-up strategy, the connected components are extracted from the reduced image, and classified according to their local information. The connected components are merged into lines, and lines are merged into areas. Extracted text areas are classified as body, caption, header, and footer. A tree graph of the layout of body texts is made, and we get the order of texts by preorder traversal on the graph. The authors introduce the influence range of each node, a procedure for the title part, and extraction of the white horizontal separator. Making it possible to get good results on various documents. The total system is fast and compact.<<ETX>>"
            },
            "slug": "Document-image-segmentation-and-text-area-ordering-Saitoh-Tachikawa",
            "title": {
                "fragments": [],
                "text": "Document image segmentation and text area ordering"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "A system for document image segmentation and ordering text areas is described and applied to both Japanese and English complex printed page layouts that can handle not only skewed images without skew-correction but also documents where column are not rectangular."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1500661115"
                        ],
                        "name": "Toyohide Watanabe",
                        "slug": "Toyohide-Watanabe",
                        "structuredName": {
                            "firstName": "Toyohide",
                            "lastName": "Watanabe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Toyohide Watanabe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2074293587"
                        ],
                        "name": "Q. Luo",
                        "slug": "Q.-Luo",
                        "structuredName": {
                            "firstName": "Qin",
                            "lastName": "Luo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Q. Luo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1692608"
                        ],
                        "name": "N. Sugie",
                        "slug": "N.-Sugie",
                        "structuredName": {
                            "firstName": "Noboru",
                            "lastName": "Sugie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Sugie"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27626504,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9b8ec3847c2cdbb50aca64d310703b5d89c81a4b",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "A framework of four-layer recognition processes is proposed for understanding documents, and a knowledge representation method adaptable to the understanding of table-form documents is addressed. Although Y. Nakano et al. (1986) looked upon the recognition of multi-kinds of table-form documents as an important subject from a practical point of view, they could not report any successful approach because their knowledge was based only on the physical coordinate data. In the approach presented, this recognition issue was solved, using both the classification tree based on the physical characteristics and the structure description tree based on the logical characteristics. At least, it is not so difficult to classify various kinds of documents into appropriate document classes since table-form documents are well designed on the basis of vertical and horizontal line segments. However, it is not easy in the case of the other documents because the geometric and spatial characteristics of documents are not well specified. It is necessary to investigate the application techniques for the other documents from the viewpoint of the knowledge representation.<<ETX>>"
            },
            "slug": "Toward-a-practical-document-understanding-of-its-Watanabe-Luo",
            "title": {
                "fragments": [],
                "text": "Toward a practical document understanding of table-form documents: its framework and knowledge representation"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A framework of four-layer recognition processes is proposed for understanding documents, and a knowledge representation method adaptable to the understanding of table-form documents is addressed."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2741958"
                        ],
                        "name": "Katsuhiko Itonori",
                        "slug": "Katsuhiko-Itonori",
                        "structuredName": {
                            "firstName": "Katsuhiko",
                            "lastName": "Itonori",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Katsuhiko Itonori"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2755403,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a924e8096b3bd1b287cb4d07cc27a93b33fdfd07",
            "isKey": false,
            "numCitedBy": 54,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "Describes a new method to recognize table structures from document images. Each cell of a table is arranged regularly in two dimensions and is represented by a row-column pair. Even in the absence of ruled lines, its coordinates are explicitly found. Thus, it is assumed that an arrangement of textblocks defines the table structure, which is an arrangement of rows and columns, and ruled lines make clear their relationship. This process is composed of two procedures: the expansion of cell bounding boxes and the assignment of row-column numbers to each edge. It is shown that the method can be applied to partially ruled tables with some experimental results.<<ETX>>"
            },
            "slug": "Table-structure-recognition-based-on-textblock-and-Itonori",
            "title": {
                "fragments": [],
                "text": "Table structure recognition based on textblock arrangement and ruled line position"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "A new method to recognize table structures from document images is described, which is composed of the expansion of cell bounding boxes and the assignment of row-column numbers to each edge."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "25727408"
                        ],
                        "name": "Surekha Chandran",
                        "slug": "Surekha-Chandran",
                        "structuredName": {
                            "firstName": "Surekha",
                            "lastName": "Chandran",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Surekha Chandran"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3110392"
                        ],
                        "name": "R. Kasturi",
                        "slug": "R.-Kasturi",
                        "structuredName": {
                            "firstName": "Rangachar",
                            "lastName": "Kasturi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kasturi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30719791,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "4c8cb8fd8a87ff2e60094385492a13c30977554b",
            "isKey": false,
            "numCitedBy": 55,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "A system for extraction of structural information of a table from its image is discussed. Following the initial binarization and deskewing operations, the image is scanned to extract all horizontal and vertical lines that are present. The table's dimensions are estimated based on these lines. Unlike other systems, the procedure described does not depend on the sole existence of lines to mark the item blocks. White streams are recognized in both the horizontal and vertical direction as substitutes for any missing demarcation lines. A structure interpretation procedure uses the extracted demarcation information to identify each of the item blocks in the table. Subsequently, the interrelations of these item blocks are used to recognize the structure of the tabulated data.<<ETX>>"
            },
            "slug": "Structural-recognition-of-tabulated-data-Chandran-Kasturi",
            "title": {
                "fragments": [],
                "text": "Structural recognition of tabulated data"
            },
            "tldr": {
                "abstractSimilarityScore": 64,
                "text": "A system for extraction of structural information of a table from its image using white streams as substitutes for any missing demarcation lines to identify each of the item blocks in the table."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2706492"
                        ],
                        "name": "Tomio Amano",
                        "slug": "Tomio-Amano",
                        "structuredName": {
                            "firstName": "Tomio",
                            "lastName": "Amano",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tomio Amano"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39789530"
                        ],
                        "name": "Akio Yamashita",
                        "slug": "Akio-Yamashita",
                        "structuredName": {
                            "firstName": "Akio",
                            "lastName": "Yamashita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Akio Yamashita"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3061813"
                        ],
                        "name": "N. Itoh",
                        "slug": "N.-Itoh",
                        "structuredName": {
                            "firstName": "Nobuyasu",
                            "lastName": "Itoh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Itoh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2112500722"
                        ],
                        "name": "Yoshinao Kobayashi",
                        "slug": "Yoshinao-Kobayashi",
                        "structuredName": {
                            "firstName": "Yoshinao",
                            "lastName": "Kobayashi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yoshinao Kobayashi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2092508"
                        ],
                        "name": "Shin Katoh",
                        "slug": "Shin-Katoh",
                        "structuredName": {
                            "firstName": "Shin",
                            "lastName": "Katoh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Shin Katoh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40393216"
                        ],
                        "name": "Kazuharu Toyokawa",
                        "slug": "Kazuharu-Toyokawa",
                        "structuredName": {
                            "firstName": "Kazuharu",
                            "lastName": "Toyokawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kazuharu Toyokawa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47284935"
                        ],
                        "name": "Hiroyasu Takahashi",
                        "slug": "Hiroyasu-Takahashi",
                        "structuredName": {
                            "firstName": "Hiroyasu",
                            "lastName": "Takahashi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hiroyasu Takahashi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10045538,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "43ac57689bc8313e1cf23191a6c058197f3bbe7d",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "Document recognition system (DRS), a workstation-based prototype document analysis system that uses optical character recognition (OCR), is described. The system provides functions for image capture, block segmentation, page structure analysis, and character recognition with contextual postprocessing, as well as a user interface for error correction. All the functions except image capture and character recognition have been implemented by means of software for the Japanese edition of OS/2.<<ETX>>"
            },
            "slug": "DRS:-a-workstation-based-document-recognition-for-Amano-Yamashita",
            "title": {
                "fragments": [],
                "text": "DRS: a workstation-based document recognition system for text entry"
            },
            "tldr": {
                "abstractSimilarityScore": 81,
                "text": "A workstation-based prototype document analysis system that uses optical character recognition (OCR) and provides functions for image capture, block segmentation, page structure analysis, and character recognition with contextual postprocessing, as well as a user interface for error correction."
            },
            "venue": {
                "fragments": [],
                "text": "Computer"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Extraction of Ruled Lines and Frame Segmentation for Understanding the Table Structure,"
            },
            "venue": {
                "fragments": [],
                "text": "IEICE PRU9O-73,"
            },
            "year": 1990
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 7,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/A-method-for-table-structure-analysis-using-DP-Hirayama/dcf75b367f24919a8a4b0f627960f6d6bf5ae33f?sort=total-citations"
}