{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3008836"
                        ],
                        "name": "K. Nickels",
                        "slug": "K.-Nickels",
                        "structuredName": {
                            "firstName": "Kevin",
                            "lastName": "Nickels",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Nickels"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144193296"
                        ],
                        "name": "S. Hutchinson",
                        "slug": "S.-Hutchinson",
                        "structuredName": {
                            "firstName": "Seth",
                            "lastName": "Hutchinson",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Hutchinson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14630335,
            "fieldsOfStudy": [
                "Computer Science",
                "Environmental Science"
            ],
            "id": "f04f83e2a659ef411cc6c0ce43d835a3bee422c2",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Textured-image-segmentation:-returning-multiple-Nickels-Hutchinson",
            "title": {
                "fragments": [],
                "text": "Textured image segmentation: returning multiple solutions"
            },
            "venue": {
                "fragments": [],
                "text": "Image Vis. Comput."
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745655"
                        ],
                        "name": "C. Bouman",
                        "slug": "C.-Bouman",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Bouman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Bouman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153530088"
                        ],
                        "name": "M. Shapiro",
                        "slug": "M.-Shapiro",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Shapiro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Shapiro"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5571990,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "1dc2443a955a6d3ef06c10d1071998c267e3a229",
            "isKey": false,
            "numCitedBy": 724,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "Many approaches to Bayesian image segmentation have used maximum a posteriori (MAP) estimation in conjunction with Markov random fields (MRF). Although this approach performs well, it has a number of disadvantages. In particular, exact MAP estimates cannot be computed, approximate MAP estimates are computationally expensive to compute, and unsupervised parameter estimation of the MRF is difficult. The authors propose a new approach to Bayesian image segmentation that directly addresses these problems. The new method replaces the MRF model with a novel multiscale random field (MSRF) and replaces the MAP estimator with a sequential MAP (SMAP) estimator derived from a novel estimation criteria. Together, the proposed estimator and model result in a segmentation algorithm that is not iterative and can be computed in time proportional to MN where M is the number of classes and N is the number of pixels. The also develop a computationally efficient method for unsupervised estimation of model parameters. Simulations on synthetic images indicate that the new algorithm performs better and requires much less computation than MAP estimation using simulated annealing. The algorithm is also found to improve classification accuracy when applied to the segmentation of multispectral remotely sensed images with ground truth data."
            },
            "slug": "A-multiscale-random-field-model-for-Bayesian-image-Bouman-Shapiro",
            "title": {
                "fragments": [],
                "text": "A multiscale random field model for Bayesian image segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Simulations on synthetic images indicate that the new algorithm performs better and requires much less computation than MAP estimation using simulated annealing, and is found to improve classification accuracy when applied to the segmentation of multispectral remotely sensed images with ground truth data."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "15139039"
                        ],
                        "name": "Jean-Marc Laferté",
                        "slug": "Jean-Marc-Laferté",
                        "structuredName": {
                            "firstName": "Jean-Marc",
                            "lastName": "Laferté",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jean-Marc Laferté"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34617817"
                        ],
                        "name": "F. Heitz",
                        "slug": "F.-Heitz",
                        "structuredName": {
                            "firstName": "Fabrice",
                            "lastName": "Heitz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Heitz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144565371"
                        ],
                        "name": "P. Pérez",
                        "slug": "P.-Pérez",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Pérez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Pérez"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1770320"
                        ],
                        "name": "É. Fabre",
                        "slug": "É.-Fabre",
                        "structuredName": {
                            "firstName": "Éric",
                            "lastName": "Fabre",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "É. Fabre"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 18938481,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "39af12a7cb27a47b813ad5a5188c15ec19e4430f",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a class of nonlinear hierarchical algorithms for the fusion of multiresolution image data in low-level vision. The approach combines nonlinear causal Markov models defined on hierarchical graph structures, with standard bayesian estimation theory. Two random processes defined on simple hierarchical graphs (quadtrees or \"ternary graphs\") are introduced to represent the multiresolution observations at hand and the hidden labels to be estimated. An optimal algorithm (inspired from the Viterbi algorithm) is developed to compute the bayesian estimates on the hierarchical graph structures. Estimates are obtained within two passes on the graph structure. This algorithm is non-iterative and yields a per pixel computational complexity which is independent of image size. This approach is compared to the multiscale algorithm proposed by (Bouman et al., 1994) for single-resolution image segmentation (that we have extended for multiresolution data fusion).<<ETX>>"
            },
            "slug": "Hierarchical-statistical-models-for-the-fusion-of-Laferté-Heitz",
            "title": {
                "fragments": [],
                "text": "Hierarchical statistical models for the fusion of multiresolution image data"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "This paper presents a class of nonlinear hierarchical algorithms for the fusion of multiresolution image data in low-level vision that combines nonlinear causal Markov models defined on hierarchical graph structures, with standard bayesian estimation theory."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE International Conference on Computer Vision"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "15139039"
                        ],
                        "name": "Jean-Marc Laferté",
                        "slug": "Jean-Marc-Laferté",
                        "structuredName": {
                            "firstName": "Jean-Marc",
                            "lastName": "Laferté",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jean-Marc Laferté"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144565371"
                        ],
                        "name": "P. Pérez",
                        "slug": "P.-Pérez",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Pérez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Pérez"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34617817"
                        ],
                        "name": "F. Heitz",
                        "slug": "F.-Heitz",
                        "structuredName": {
                            "firstName": "Fabrice",
                            "lastName": "Heitz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Heitz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16683871,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1e2c6713a4f8eecb28b98d613fed93084dbab5eb",
            "isKey": false,
            "numCitedBy": 206,
            "numCiting": 59,
            "paperAbstract": {
                "fragments": [],
                "text": "Noncasual Markov (or energy-based) models are widely used in early vision applications for the representation of images in high-dimensional inverse problems. Due to their noncausal nature, these models generally lead to iterative inference algorithms that are computationally demanding. In this paper, we consider a special class of nonlinear Markov models which allow one to circumvent this drawback. These models are defined as discrete Markov random fields (MRF) attached to the nodes of a quadtree. The quadtree induces causality properties which enable the design of exact, noniterative inference algorithms, similar to those used in the context of Markov chain models. We first introduce an extension of the Viterbi algorithm which enables exact maximum a posteriori (MAP) estimation on the quadtree. Two other algorithms, related to the MPM criterion and to Bouman and Shapiro's (1994) sequential-MAP (SMAP) estimator are derived on the same hierarchical structure. The estimation of the model hyper parameters is also addressed. Two expectation-maximization (EM)-type algorithms, allowing unsupervised inference with these models are defined. The practical relevance of the different models and inference algorithms is investigated in the context of image classification problem, on both synthetic and natural images."
            },
            "slug": "Discrete-Markov-image-modeling-and-inference-on-the-Laferté-Pérez",
            "title": {
                "fragments": [],
                "text": "Discrete Markov image modeling and inference on the quadtree"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "An extension of the Viterbi algorithm is introduced which enables exact maximum a posteriori (MAP) estimation on the quadtree, and two expectation-maximization (EM)-type algorithms, allowing unsupervised inference with these models are defined."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "146876323"
                        ],
                        "name": "Hui Cheng",
                        "slug": "Hui-Cheng",
                        "structuredName": {
                            "firstName": "Hui",
                            "lastName": "Cheng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hui Cheng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745655"
                        ],
                        "name": "C. Bouman",
                        "slug": "C.-Bouman",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Bouman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Bouman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1593494,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cc36171e540f3bf78cc927e2ddf2a34fa516931c",
            "isKey": false,
            "numCitedBy": 43,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Most previous approaches to Bayesian segmentation have used simple prior models, such as Markov random fields (MRF), to enforce regularity in the segmentation. While these methods improve classification accuracy, they are not well suited to modeling complex contextual structure. In this paper, we propose a context model for multiscale segmentation which can capture very complex behaviors on both local and global scales. Our method works by using binary classification trees to model the transition probabilities between segmentations at adjacent scales. The classification trees can be efficiently trained to model essential aspects of contextual behavior. In addition, the data model in our approach is novel in the sense that it can incorporate the correlation among the wavelet feature vectors across scales. We apply our method to the problem of document segmentation to illustrate its usefulness."
            },
            "slug": "Trainable-context-model-for-multiscale-segmentation-Cheng-Bouman",
            "title": {
                "fragments": [],
                "text": "Trainable context model for multiscale segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A context model for multiscale segmentation which can capture very complex behaviors on both local and global scales is proposed and can incorporate the correlation among the wavelet feature vectors across scales."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings 1998 International Conference on Image Processing. ICIP98 (Cat. No.98CB36269)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2812671"
                        ],
                        "name": "M. Luettgen",
                        "slug": "M.-Luettgen",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Luettgen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Luettgen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145325413"
                        ],
                        "name": "W. Karl",
                        "slug": "W.-Karl",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Karl",
                            "middleNames": [
                                "Clem"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Karl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701607"
                        ],
                        "name": "A. Willsky",
                        "slug": "A.-Willsky",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Willsky",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Willsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7162863,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "ab4f258c7a6543948e068871b5ba38e8146803c6",
            "isKey": false,
            "numCitedBy": 173,
            "numCiting": 87,
            "paperAbstract": {
                "fragments": [],
                "text": "A new approach to regularization methods for image processing is introduced and developed using as a vehicle the problem of computing dense optical flow fields in an image sequence. The solution of the new problem formulation is computed with an efficient multiscale algorithm. Experiments on several image sequences demonstrate the substantial computational savings that can be achieved due to the fact that the algorithm is noniterative and in fact has a per pixel computational complexity that is independent of image size. The new approach also has a number of other important advantages. Specifically, multiresolution flow field estimates are available, allowing great flexibility in dealing with the tradeoff between resolution and accuracy. Multiscale error covariance information is also available, which is of considerable use in assessing the accuracy of the estimates. In particular, these error statistics can be used as the basis for a rational procedure for determining the spatially-varying optimal reconstruction resolution. Furthermore, if there are compelling reasons to insist upon a standard smoothness constraint, the new algorithm provides an excellent initialization for the iterative algorithms associated with the smoothness constraint problem formulation. Finally, the usefulness of the approach should extend to a wide variety of ill-posed inverse problems in which variational techniques seeking a \"smooth\" solution are generally used."
            },
            "slug": "Efficient-multiscale-regularization-with-to-the-of-Luettgen-Karl",
            "title": {
                "fragments": [],
                "text": "Efficient multiscale regularization with applications to the computation of optical flow"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The new algorithm provides an excellent initialization for the iterative algorithms associated with the smoothness constraint problem formulation and should extend to a wide variety of ill-posed inverse problems in which variational techniques seeking a \"smooth\" solution are generally used."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3072213"
                        ],
                        "name": "J. Besag",
                        "slug": "J.-Besag",
                        "structuredName": {
                            "firstName": "Julian",
                            "lastName": "Besag",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Besag"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15128952,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "47865b56fee61d9c9ff477f7c79f090cc6663d3a",
            "isKey": false,
            "numCitedBy": 4634,
            "numCiting": 79,
            "paperAbstract": {
                "fragments": [],
                "text": "may 7th, 1986, Professor A. F. M. Smith in the Chair] SUMMARY A continuous two-dimensional region is partitioned into a fine rectangular array of sites or \"pixels\", each pixel having a particular \"colour\" belonging to a prescribed finite set. The true colouring of the region is unknown but, associated with each pixel, there is a possibly multivariate record which conveys imperfect information about its colour according to a known statistical model. The aim is to reconstruct the true scene, with the additional knowledge that pixels close together tend to have the same or similar colours. In this paper, it is assumed that the local characteristics of the true scene can be represented by a nondegenerate Markov random field. Such information can be combined with the records by Bayes' theorem and the true scene can be estimated according to standard criteria. However, the computational burden is enormous and the reconstruction may reflect undesirable largescale properties of the random field. Thus, a simple, iterative method of reconstruction is proposed, which does not depend on these large-scale characteristics. The method is illustrated by computer simulations in which the original scene is not directly related to the assumed random field. Some complications, including parameter estimation, are discussed. Potential applications are mentioned briefly."
            },
            "slug": "On-the-Statistical-Analysis-of-Dirty-Pictures-Besag",
            "title": {
                "fragments": [],
                "text": "On the Statistical Analysis of Dirty Pictures"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1773556"
                        ],
                        "name": "M. Basseville",
                        "slug": "M.-Basseville",
                        "structuredName": {
                            "firstName": "Michèle",
                            "lastName": "Basseville",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Basseville"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1770186"
                        ],
                        "name": "A. Benveniste",
                        "slug": "A.-Benveniste",
                        "structuredName": {
                            "firstName": "Albert",
                            "lastName": "Benveniste",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Benveniste"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "80641325"
                        ],
                        "name": "K. C. Chou",
                        "slug": "K.-C.-Chou",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Chou",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. C. Chou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32336062"
                        ],
                        "name": "S. Golden",
                        "slug": "S.-Golden",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Golden",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Golden"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50376126"
                        ],
                        "name": "R. Nikoukhah",
                        "slug": "R.-Nikoukhah",
                        "structuredName": {
                            "firstName": "Ramine",
                            "lastName": "Nikoukhah",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Nikoukhah"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701607"
                        ],
                        "name": "A. Willsky",
                        "slug": "A.-Willsky",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Willsky",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Willsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16976531,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "09cdb8512d64bec57dd79d1b22326085d3d5f4c6",
            "isKey": false,
            "numCitedBy": 345,
            "numCiting": 56,
            "paperAbstract": {
                "fragments": [],
                "text": "An overview is provided of the several components of a research effort aimed at the development of a theory of multiresolution stochastic modeling and associated techniques for optimal multiscale statistical signal and image processing. A natural framework for developing such a theory is the study of stochastic processes indexed by nodes on lattices or trees in which different depths in the tree or lattice correspond to different spatial scales in representing a signal or image. In particular, it is shown how the wavelet transform directly suggests such a modeling paradigm. This perspective then leads directly to the investigation of several classes of dynamic models and related notions of multiscale stationarity in which scale plays the role of a time-like variable. The investigation of models on homogeneous trees is emphasized. The framework examined here allows for consideration, in a very natural way, of the fusion of data from sensors with differing resolutions. Also, thanks to the fact that wavelet transforms do an excellent job of 'compressing' large classes of covariance kernels, it is seen that these modeling paradigms appear to have promise in a far broader context than one might expect. >"
            },
            "slug": "Modeling-and-estimation-of-multiresolution-Basseville-Benveniste",
            "title": {
                "fragments": [],
                "text": "Modeling and estimation of multiresolution stochastic processes"
            },
            "tldr": {
                "abstractSimilarityScore": 53,
                "text": "It is shown how the wavelet transform directly suggests a modeling paradigm for multiresolution stochastic modeling and related notions of multiscale stationarity in which scale plays the role of a time-like variable."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1731893"
                        ],
                        "name": "S. Krishnamachari",
                        "slug": "S.-Krishnamachari",
                        "structuredName": {
                            "firstName": "Santhana",
                            "lastName": "Krishnamachari",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Krishnamachari"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9215658"
                        ],
                        "name": "R. Chellappa",
                        "slug": "R.-Chellappa",
                        "structuredName": {
                            "firstName": "Rama",
                            "lastName": "Chellappa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Chellappa"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 7225358,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "1feb3fd66e7ede0a5614413ac23913f50a244688",
            "isKey": false,
            "numCitedBy": 270,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents multiresolution models for Gauss-Markov random fields (GMRFs) with applications to texture segmentation. Coarser resolution sample fields are obtained by subsampling the sample field at fine resolution. Although the Markov property is lost under such resolution transformation, coarse resolution non-Markov random fields can be effectively approximated by Markov fields. We present two techniques to estimate the GMRF parameters at coarser resolutions from the fine resolution parameters, one by minimizing the Kullback-Leibler distance and another based on local conditional distribution invariance. We also allude to the fact that different GMRF parameters at the fine resolution can result in the same probability measure after subsampling and present the results for first- and second-order cases. We apply this multiresolution model to texture segmentation. Different texture regions in an image are modeled by GMRFs and the associated parameters are assumed to be known. Parameters at lower resolutions are estimated from the fine resolution parameters. The coarsest resolution data is first segmented and the segmentation results are propagated upward to the finer resolution. We use the iterated conditional mode (ICM) minimization at all resolutions. Our experiments with synthetic, Brodatz texture, and real satellite images show that the multiresolution technique results in a better segmentation and requires lesser computation than the single resolution algorithm."
            },
            "slug": "Multiresolution-Gauss-Markov-random-field-models-Krishnamachari-Chellappa",
            "title": {
                "fragments": [],
                "text": "Multiresolution Gauss-Markov random field models for texture segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The experiments with synthetic, Brodatz texture, and real satellite images show that the multiresolution technique results in a better segmentation and requires lesser computation than the single resolution algorithm."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680622"
                        ],
                        "name": "H. Lucke",
                        "slug": "H.-Lucke",
                        "structuredName": {
                            "firstName": "Helmut",
                            "lastName": "Lucke",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Lucke"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32689660,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6c6bfc13e26795ee594218a1382196e3e44519d6",
            "isKey": false,
            "numCitedBy": 20,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Bayesian-Belief-Networks-as-a-tool-for-stochastic-Lucke",
            "title": {
                "fragments": [],
                "text": "Bayesian Belief Networks as a tool for stochastic parsing"
            },
            "venue": {
                "fragments": [],
                "text": "Speech Commun."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34865602"
                        ],
                        "name": "D. McKeown",
                        "slug": "D.-McKeown",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "McKeown",
                            "middleNames": [
                                "M."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. McKeown"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46559289"
                        ],
                        "name": "W. Harvey",
                        "slug": "W.-Harvey",
                        "structuredName": {
                            "firstName": "Wilson",
                            "lastName": "Harvey",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Harvey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14828509"
                        ],
                        "name": "J. McDermott",
                        "slug": "J.-McDermott",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "McDermott",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. McDermott"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1155371,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4d844f45b56657f9b34d5765a5718b910b603d0b",
            "isKey": false,
            "numCitedBy": 295,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we describe the organization of a rule-based system, SPAM, that uses map and domain-specific knowledge to interpret airport scenes. This research investigates the use of a rule-based system for the control of image processing and interpretation of results with respect to a world model, as well as the representation of the world model within an image/map database. We present results on the interpretation of a high-resolution airport scene wvhere the image segmentation has been performed by a human, and by a region-based image segmentation program. The results of the system's analysis is characterized by the labeling of individual regions in the image and the collection of these regions into consistent interpretations of the major components of an airport model. These interpretations are ranked on the basis of their overall spatial and structural consistency. Some evaluations based on the results from three evolutionary versions of SPAM are presented."
            },
            "slug": "Rule-Based-Interpretation-of-Aerial-Imagery-McKeown-Harvey",
            "title": {
                "fragments": [],
                "text": "Rule-Based Interpretation of Aerial Imagery"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "The organization of a rule-based system, SPAM, that uses map and domain-specific knowledge to interpret airport scenes is described, characterized by the labeling of individual regions in the image and the collection of these regions into consistent interpretations of the major components of an airport model."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2812671"
                        ],
                        "name": "M. Luettgen",
                        "slug": "M.-Luettgen",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Luettgen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Luettgen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701607"
                        ],
                        "name": "A. Willsky",
                        "slug": "A.-Willsky",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Willsky",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Willsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8785261,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6473dc4ee95e6f0b40b96d988c246011d202564f",
            "isKey": false,
            "numCitedBy": 95,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "A class of multiscale stochastic models based on scale-recursive dynamics on trees has previously been introduced. Theoretical and experimental results have shown that these models provide an extremely rich framework for representing both processes which are intrinsically multiscale, e.g., 1/f processes, as well as 1D Markov processes and 2D Markov random fields. Moreover, efficient optimal estimation algorithms have been developed for these models by exploiting their scale-recursive structure. The authors exploit this structure in order to develop a computationally efficient and parallelizable algorithm for likelihood calculation. They illustrate one possible application to texture discrimination and demonstrate that likelihood-based methods using the algorithm achieve performance comparable to that of Gaussian Markov random field based techniques, which in general are prohibitively complex computationally."
            },
            "slug": "Likelihood-calculation-for-a-class-of-multiscale-to-Luettgen-Willsky",
            "title": {
                "fragments": [],
                "text": "Likelihood calculation for a class of multiscale stochastic models, with application to texture discrimination"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The authors illustrate one possible application to texture discrimination and demonstrate that likelihood-based methods using the algorithm achieve performance comparable to that of Gaussian Markov random field based techniques, which in general are prohibitively complex computationally."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3194361"
                        ],
                        "name": "S. Geman",
                        "slug": "S.-Geman",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Geman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707642"
                        ],
                        "name": "D. Geman",
                        "slug": "D.-Geman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5837272,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "459b30a9a960080f3b313e41886b1aa0e51e882c",
            "isKey": false,
            "numCitedBy": 18707,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "We make an analogy between images and statistical mechanics systems. Pixel gray levels and the presence and orientation of edges are viewed as states of atoms or molecules in a lattice-like physical system. The assignment of an energy function in the physical system determines its Gibbs distribution. Because of the Gibbs distribution, Markov random field (MRF) equivalence, this assignment also determines an MRF image model. The energy function is a more convenient and natural mechanism for embodying picture attributes than are the local characteristics of the MRF. For a range of degradation mechanisms, including blurring, nonlinear deformations, and multiplicative or additive noise, the posterior distribution is an MRF with a structure akin to the image model. By the analogy, the posterior distribution defines another (imaginary) physical system. Gradual temperature reduction in the physical system isolates low energy states (``annealing''), or what is the same thing, the most probable states under the Gibbs distribution. The analogous operation under the posterior distribution yields the maximum a posteriori (MAP) estimate of the image given the degraded observations. The result is a highly parallel ``relaxation'' algorithm for MAP estimation. We establish convergence properties of the algorithm and we experiment with some simple pictures, for which good restorations are obtained at low signal-to-noise ratios."
            },
            "slug": "Stochastic-Relaxation,-Gibbs-Distributions,-and-the-Geman-Geman",
            "title": {
                "fragments": [],
                "text": "Stochastic Relaxation, Gibbs Distributions, and the Bayesian Restoration of Images"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The analogy between images and statistical mechanics systems is made and the analogous operation under the posterior distribution yields the maximum a posteriori (MAP) estimate of the image given the degraded observations, creating a highly parallel ``relaxation'' algorithm for MAP estimation."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3631473"
                        ],
                        "name": "M. Levine",
                        "slug": "M.-Levine",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Levine",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Levine"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32112881"
                        ],
                        "name": "A. Nazif",
                        "slug": "A.-Nazif",
                        "structuredName": {
                            "firstName": "Ahmed",
                            "lastName": "Nazif",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Nazif"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1361818,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ffe4d35adf193ce8b12f2b48017cc6656fa6a6f1",
            "isKey": false,
            "numCitedBy": 392,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper introduces a general purpose performance measurement scheme for image segmentation algorithms. Performance parameters that function in real-time distinguish this method from previous approaches that depended on an a priori knowledge of the correct segmentation. A low level, context independent definition of segmentation is used to obtain a set of optimization criteria for evaluating performance. Uniformity within each region and contrast between adjacent regions serve as parameters for region analysis. Contrast across lines and connectivity between them represent measures for line analysis. Texture is depicted by the introduction of focus of attention areas as groups of regions and lines. The performance parameters are then measured separately for each area. The usefulness of this approach lies in the ability to adjust the strategy of a system according to the varying characteristics of different areas. This feedback path provides the means for more efficient and error-free processing. Results from areas with dissimilar properties show a diversity in the measurements that is utilized for dynamic strategy setting."
            },
            "slug": "Dynamic-Measurement-of-Computer-Generated-Image-Levine-Nazif",
            "title": {
                "fragments": [],
                "text": "Dynamic Measurement of Computer Generated Image Segmentations"
            },
            "tldr": {
                "abstractSimilarityScore": 79,
                "text": "A general purpose performance measurement scheme for image segmentation algorithms that function in real-time distinguish this method from previous approaches that depended on an a priori knowledge of the correct segmentation."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49819964"
                        ],
                        "name": "M. Richard",
                        "slug": "M.-Richard",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Richard",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Richard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144990248"
                        ],
                        "name": "R. Lippmann",
                        "slug": "R.-Lippmann",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Lippmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Lippmann"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37584437,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8a6d820385527df2183a36ae1615f426ba894c5d",
            "isKey": false,
            "numCitedBy": 1166,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "Many neural network classifiers provide outputs which estimate Bayesian a posteriori probabilities. When the estimation is accurate, network outputs can be treated as probabilities and sum to one. Simple proofs show that Bayesian probabilities are estimated when desired network outputs are 1 of M (one output unity, all others zero) and a squared-error or cross-entropy cost function is used. Results of Monte Carlo simulations performed using multilayer perceptron (MLP) networks trained with backpropagation, radial basis function (RBF) networks, and high-order polynomial networks graphically demonstrate that network outputs provide good estimates of Bayesian probabilities. Estimation accuracy depends on network complexity, the amount of training data, and the degree to which training data reflect true likelihood distributions and a priori class probabilities. Interpretation of network outputs as Bayesian probabilities allows outputs from multiple networks to be combined for higher level decision making, simplifies creation of rejection thresholds, makes it possible to compensate for differences between pattern class probabilities in training and test data, allows outputs to be used to minimize alternative risk functions, and suggests alternative measures of network performance."
            },
            "slug": "Neural-Network-Classifiers-Estimate-Bayesian-a-Richard-Lippmann",
            "title": {
                "fragments": [],
                "text": "Neural Network Classifiers Estimate Bayesian a posteriori Probabilities"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Results of Monte Carlo simulations performed using multilayer perceptron (MLP) networks trained with backpropagation, radial basis function (RBF) networks, and high-order polynomial networks graphically demonstrate that network outputs provide good estimates of Bayesian probabilities."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1796044"
                        ],
                        "name": "L. Saul",
                        "slug": "L.-Saul",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Saul",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Saul"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1694621"
                        ],
                        "name": "Michael I. Jordan",
                        "slug": "Michael-I.-Jordan",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Jordan",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael I. Jordan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 17467575,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2d663c3792a6a5ea8974bd8073e4e714e2ffccbc",
            "isKey": false,
            "numCitedBy": 30,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "We introduce a learning algorithm for unsupervised neural networks based on ideas from statistical mechanics. The algorithm is derived from a mean field approximation for large,layered sigmoid belief networks. We show how to (approximately) infer the statistics of these networks without resort to sampling. This is done by solving the mean field equations, which relate the statistics of each unit to those of its Markov blanket. Using these statistics as target values, the weights in the network are adapted by a local delta rule. We evaluate the strengths and weaknesses of these networks for problems in statistical pattern recognition."
            },
            "slug": "A-Mean-Field-Learning-Algorithm-for-Unsupervised-Saul-Jordan",
            "title": {
                "fragments": [],
                "text": "A Mean Field Learning Algorithm for Unsupervised Neural Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 85,
                "text": "A learning algorithm for unsupervised neural networks based on ideas from statistical mechanics, derived from a mean field approximation for large,layered sigmoid belief networks, is introduced."
            },
            "venue": {
                "fragments": [],
                "text": "Learning in Graphical Models"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145801638"
                        ],
                        "name": "J. Kittler",
                        "slug": "J.-Kittler",
                        "structuredName": {
                            "firstName": "Josef",
                            "lastName": "Kittler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kittler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120716606,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e1b6b232132da49b6f5186f0ebf2adf7b750095c",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "Many tasks in image analysis can be formulated as problems of discrimination or, generally, of pattern recognition. A pattern-recognition system is normally considered to comprise two processing stages: the feature selection and extraction stage, which attempts to reduce the dimensionality of the pattern to be classified, and the classification stage, the purpose of which is to assign the pattern into its perceptually meaningful category. This paper gives an overview of the various approaches to designing statistical pattern recognition schemes. The problem of feature selection and extraction is introduced. The discussion then focuses on statistical decision theoretic rules and their implementation. Both parametric and non-parametric classification methods are covered. The emphasis then switches to decision making in context. Two basic formulations of contextual pattern classification are put forward, and the various methods developed from these two formulations are reviewed. These include the method of h..."
            },
            "slug": "Statistical-pattern-recognition-in-image-analysis-Kittler",
            "title": {
                "fragments": [],
                "text": "Statistical pattern recognition in image analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This paper gives an overview of the various approaches to designing statistical pattern recognition schemes and two basic formulations of contextual pattern classification are put forward, and the various methods developed from these two formulations are reviewed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764325"
                        ],
                        "name": "Radford M. Neal",
                        "slug": "Radford-M.-Neal",
                        "structuredName": {
                            "firstName": "Radford",
                            "lastName": "Neal",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Radford M. Neal"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 60809283,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "db869fa192a3222ae4f2d766674a378e47013b1b",
            "isKey": false,
            "numCitedBy": 3642,
            "numCiting": 92,
            "paperAbstract": {
                "fragments": [],
                "text": "Artificial \"neural networks\" are widely used as flexible models for classification and regression applications, but questions remain about how the power of these models can be safely exploited when training data is limited. This book demonstrates how Bayesian methods allow complex neural network models to be used without fear of the \"overfitting\" that can occur with traditional training methods. Insight into the nature of these complex Bayesian models is provided by a theoretical investigation of the priors over functions that underlie them. A practical implementation of Bayesian neural network learning using Markov chain Monte Carlo methods is also described, and software for it is freely available over the Internet. Presupposing only basic knowledge of probability and statistics, this book should be of interest to researchers in statistics, engineering, and artificial intelligence."
            },
            "slug": "Bayesian-Learning-for-Neural-Networks-Neal",
            "title": {
                "fragments": [],
                "text": "Bayesian Learning for Neural Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Bayesian Learning for Neural Networks shows that Bayesian methods allow complex neural network models to be used without fear of the \"overfitting\" that can occur with traditional neural network learning methods."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1731709"
                        ],
                        "name": "P. Fieguth",
                        "slug": "P.-Fieguth",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Fieguth",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Fieguth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145325413"
                        ],
                        "name": "W. Karl",
                        "slug": "W.-Karl",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Karl",
                            "middleNames": [
                                "Clem"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Karl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701607"
                        ],
                        "name": "A. Willsky",
                        "slug": "A.-Willsky",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Willsky",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Willsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6187343,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "ea68b4a1e97650b47f46d588a4088844d648f002",
            "isKey": false,
            "numCitedBy": 34,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "Variational methods have been employed with considerable success in computer vision, particularly for surface reconstruction problems. Formulations of this type require the solution of computationally complex Euler?Lagrange partial differential equations (PDEs) to obtain the desired reconstructions. Further, the calculation of reconstruction error covariances for such approaches are usually neglected.In this paper we describe a computationally efficient multiscale approach to surface reconstruction which differs fundamentally from other multiresolution methods that are used to solve the Euler?Lagrange PDEs. Instead, we interpret the variational problem as a statistical estimation problem in order to define a nearby, but slightlydifferent, multiscale estimation problem that admits efficient solutions for both surface reconstructionandthe calculation of error statistics. In particular, the membrane and thin-plate variational models for surfaces are interpreted as 1/f2prior statistical models for the surface and its gradients, respectively. Such 1/f2behavior is then achieved using a recently introduced class of multiresolution models that admits algorithms with constant per-pixel computational complexity."
            },
            "slug": "Efficient-Multiresolution-Counterparts-to-Methods-Fieguth-Karl",
            "title": {
                "fragments": [],
                "text": "Efficient Multiresolution Counterparts to Variational Methods for Surface Reconstruction"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "A computationally efficient multiscale approach to surface reconstruction which differs fundamentally from other multiresolution methods that are used to solve the Euler?Lagrange PDEs."
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Image Underst."
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144935847"
                        ],
                        "name": "W. A. Wright",
                        "slug": "W.-A.-Wright",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Wright",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. A. Wright"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13360683,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "49d08d5d847bc83434d41d63d07eac668a9f1c09",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "The lack of contextual integrity in region labelling schemes for segmented visual images has been a long standing problem in computer vision. In the past it has been common to adopt some form of relaxation scheme, such as relaxation labelling, to remove both labelling ambiguities and labellings which, usually, are obviously contextually incorrect. So far no general region labelling system has been found."
            },
            "slug": "Image-Labelling-with-a-Neural-Network-Wright",
            "title": {
                "fragments": [],
                "text": "Image Labelling with a Neural Network"
            },
            "tldr": {
                "abstractSimilarityScore": 79,
                "text": "The lack of contextual integrity in region labelling schemes for segmented visual images has been a long standing problem in computer vision and so far no general regionlabelling system has been found."
            },
            "venue": {
                "fragments": [],
                "text": "Alvey Vision Conference"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1722325"
                        ],
                        "name": "J. Bonet",
                        "slug": "J.-Bonet",
                        "structuredName": {
                            "firstName": "Jeremy",
                            "lastName": "Bonet",
                            "middleNames": [
                                "S.",
                                "De"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bonet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1731948"
                        ],
                        "name": "Paul A. Viola",
                        "slug": "Paul-A.-Viola",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Viola",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Paul A. Viola"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7033097,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f172121b1f64dd4ae120df8e66fd59a6cacad9d1",
            "isKey": false,
            "numCitedBy": 114,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "The observed distribution of natural images is far from uniform. On the contrary, real images have complex and important structure that can be exploited for image processing, recognition and analysis. There have been many proposed approaches to the principled statistical modeling of images, but each has been limited in either the complexity of the models or the complexity of the images. We present a non-parametric multi-scale statistical model for images that can be used for recognition, image de-noising, and in a \"generative mode\" to synthesize high quality textures."
            },
            "slug": "A-Non-Parametric-Multi-Scale-Statistical-Model-for-Bonet-Viola",
            "title": {
                "fragments": [],
                "text": "A Non-Parametric Multi-Scale Statistical Model for Natural Images"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This work presents a non-parametric multi-scale statistical model for images that can be used for recognition, image de-noising, and in a \"generative mode\" to synthesize high quality textures."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145715698"
                        ],
                        "name": "Christopher K. I. Williams",
                        "slug": "Christopher-K.-I.-Williams",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Williams",
                            "middleNames": [
                                "K.",
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher K. I. Williams"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143903619"
                        ],
                        "name": "Nicholas J. Adams",
                        "slug": "Nicholas-J.-Adams",
                        "structuredName": {
                            "firstName": "Nicholas",
                            "lastName": "Adams",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nicholas J. Adams"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1985128,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0a90a9f8f1084b3ce5bede83bdb909d4db7edd0c",
            "isKey": false,
            "numCitedBy": 40,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we introduce a new class of image models, which we call dynamic trees or DTs. A dynamic tree model specifies a prior over a large number of trees, each one of which is a tree-structured belief net (TSBN). Experiments show that DTs are capable of generating images that are less blocky, and the models have better translation invariance properties than a fixed, \"balanced\" TSBN. We also show that Simulated Annealing is effective at finding trees which have high posterior probability."
            },
            "slug": "DTs:-Dynamic-Trees-Williams-Adams",
            "title": {
                "fragments": [],
                "text": "DTs: Dynamic Trees"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Experiments show that dynamic trees are capable of generating images that are less blocky, and the models have better translation invariance properties than a fixed, \"balanced\" TSBN."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30400079"
                        ],
                        "name": "Yair Weiss",
                        "slug": "Yair-Weiss",
                        "structuredName": {
                            "firstName": "Yair",
                            "lastName": "Weiss",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yair Weiss"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768236"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Freeman",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10624764,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2b7201afa6727252aa4d00cfed508249a637df67",
            "isKey": false,
            "numCitedBy": 646,
            "numCiting": 72,
            "paperAbstract": {
                "fragments": [],
                "text": "Graphical models, such as Bayesian networks and Markov random fields, represent statistical dependencies of variables by a graph. Local belief propagation rules of the sort proposed by Pearl (1988) are guaranteed to converge to the correct posterior probabilities in singly connected graphs. Recently, good performance has been obtained by using these same rules on graphs with loops, a method we refer to as loopy belief propagation. Perhaps the most dramatic instance is the near Shannon-limit performance of Turbo codes, whose decoding algorithm is equivalent to loopy propagation. Except for the case of graphs with a single loop, there has been little theoretical understanding of loopy propagation. Here we analyze belief propagation in networks with arbitrary topologies when the nodes in the graph describe jointly gaussian random variables. We give an analytical formula relating the true posterior probabilities with those calculated using loopy propagation. We give sufficient conditions for convergence and show that when belief propagation converges, it gives the correct posterior means for all graph topologies, not just networks with a single loop. These results motivate using the powerful belief propagation algorithm in a broader class of networks and help clarify the empirical performance results."
            },
            "slug": "Correctness-of-Belief-Propagation-in-Gaussian-of-Weiss-Freeman",
            "title": {
                "fragments": [],
                "text": "Correctness of Belief Propagation in Gaussian Graphical Models of Arbitrary Topology"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This work analyzes belief propagation in networks with arbitrary topologies when the nodes in the graph describe jointly gaussian random variables and gives an analytical formula relating the true posterior probabilities with those calculated using loopy propagation."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145468098"
                        ],
                        "name": "M. Møller",
                        "slug": "M.-Møller",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Møller",
                            "middleNames": [
                                "Fodslette"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Møller"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8029054,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2f4a097b2131784d7ac3fc3c47d1e9283e9ac207",
            "isKey": false,
            "numCitedBy": 3757,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-scaled-conjugate-gradient-algorithm-for-fast-Møller",
            "title": {
                "fragments": [],
                "text": "A scaled conjugate gradient algorithm for fast supervised learning"
            },
            "venue": {
                "fragments": [],
                "text": "Neural Networks"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113861474"
                        ],
                        "name": "C. Bishop",
                        "slug": "C.-Bishop",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Bishop",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Bishop"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 60563397,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b9b1b1654ce0eea729c4160bfedcbb3246460b1d",
            "isKey": false,
            "numCitedBy": 8595,
            "numCiting": 250,
            "paperAbstract": {
                "fragments": [],
                "text": "From the Publisher: \nThis is the first comprehensive treatment of feed-forward neural networks from the perspective of statistical pattern recognition. After introducing the basic concepts, the book examines techniques for modelling probability density functions and the properties and merits of the multi-layer perceptron and radial basis function network models. Also covered are various forms of error functions, principal algorithms for error function minimalization, learning and generalization in neural networks, and Bayesian techniques and their applications. Designed as a text, with over 100 exercises, this fully up-to-date work will benefit anyone involved in the fields of neural computation and pattern recognition."
            },
            "slug": "Neural-networks-for-pattern-recognition-Bishop",
            "title": {
                "fragments": [],
                "text": "Neural networks for pattern recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "This is the first comprehensive treatment of feed-forward neural networks from the perspective of statistical pattern recognition, and is designed as a text, with over 100 exercises, to benefit anyone involved in the fields of neural computation and pattern recognition."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3190179"
                        ],
                        "name": "S. Riis",
                        "slug": "S.-Riis",
                        "structuredName": {
                            "firstName": "Søren",
                            "lastName": "Riis",
                            "middleNames": [
                                "Kamaric"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Riis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144197258"
                        ],
                        "name": "A. Krogh",
                        "slug": "A.-Krogh",
                        "structuredName": {
                            "firstName": "Anders",
                            "lastName": "Krogh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Krogh"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18821577,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fdd5b52a97ac2f149b6eca6e3cd3efd9601c20aa",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a general framework for hybrids of hidden Markov models (HMM) and neural networks (NN). In the new framework called hidden neural networks (HNN) the usual HMM probability parameters are replaced by neural network outputs. To ensure a probabilistic interpretation the HNN is normalized globally as opposed to the local normalization enforced on parameters in standard HMMs. Furthermore, all parameters in the HNN are estimated simultaneously according to the discriminative conditional maximum likelihood (CML) criterion. The HNNs show clear performance gains compared to standard HMMs on TIMIT continuous speech recognition benchmarks. On the task of recognizing five broad phoneme classes an accuracy of 84% is obtained compared to 76% for a standard HMM. Additionally, we report a preliminary result of 69% accuracy on the TIMIT 39 phoneme task."
            },
            "slug": "Hidden-neural-networks:-a-framework-for-HMM/NN-Riis-Krogh",
            "title": {
                "fragments": [],
                "text": "Hidden neural networks: a framework for HMM/NN hybrids"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "In the new framework called hidden neural networks (HNN), the usual HMM probability parameters are replaced by neural network outputs and all parameters in the HNN are estimated simultaneously according to the discriminative conditional maximum likelihood (CML) criterion."
            },
            "venue": {
                "fragments": [],
                "text": "1997 IEEE International Conference on Acoustics, Speech, and Signal Processing"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31071542"
                        ],
                        "name": "M. Crouse",
                        "slug": "M.-Crouse",
                        "structuredName": {
                            "firstName": "Matthew",
                            "lastName": "Crouse",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Crouse"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50033772"
                        ],
                        "name": "R. Nowak",
                        "slug": "R.-Nowak",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Nowak",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Nowak"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144908066"
                        ],
                        "name": "Richard Baraniuk",
                        "slug": "Richard-Baraniuk",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Baraniuk",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Richard Baraniuk"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 5630861,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aed0004e4d52d48ff39681fd0bb6b5483608b00a",
            "isKey": false,
            "numCitedBy": 1777,
            "numCiting": 75,
            "paperAbstract": {
                "fragments": [],
                "text": "Wavelet-based statistical signal processing techniques such as denoising and detection typically model the wavelet coefficients as independent or jointly Gaussian. These models are unrealistic for many real-world signals. We develop a new framework for statistical signal processing based on wavelet-domain hidden Markov models (HMMs) that concisely models the statistical dependencies and non-Gaussian statistics encountered in real-world signals. Wavelet-domain HMMs are designed with the intrinsic properties of the wavelet transform in mind and provide powerful, yet tractable, probabilistic signal models. Efficient expectation maximization algorithms are developed for fitting the HMMs to observational signal data. The new framework is suitable for a wide range of applications, including signal estimation, detection, classification, prediction, and even synthesis. To demonstrate the utility of wavelet-domain HMMs, we develop novel algorithms for signal denoising, classification, and detection."
            },
            "slug": "Wavelet-based-statistical-signal-processing-using-Crouse-Nowak",
            "title": {
                "fragments": [],
                "text": "Wavelet-based statistical signal processing using hidden Markov models"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "A new framework for statistical signal processing based on wavelet-domain hidden Markov models (HMMs) that concisely models the statistical dependencies and non-Gaussian statistics encountered in real-world signals is developed."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Signal Process."
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144798098"
                        ],
                        "name": "N. Morgan",
                        "slug": "N.-Morgan",
                        "structuredName": {
                            "firstName": "Nelson",
                            "lastName": "Morgan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Morgan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733733"
                        ],
                        "name": "H. Bourlard",
                        "slug": "H.-Bourlard",
                        "structuredName": {
                            "firstName": "Hervé",
                            "lastName": "Bourlard",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Bourlard"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62754891,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d531dc3d20d35b69b9962c2bedeb60fda89e8a72",
            "isKey": false,
            "numCitedBy": 150,
            "numCiting": 71,
            "paperAbstract": {
                "fragments": [],
                "text": "In recent years there has been a significant body of work, both theoretical and experimental, that has established the viability of artificial neural networks (ANN's) as a useful technology for speech recognition. It has been shown that neural networks can be used to augment speech recognizers whose underlying structure is essentially that of hidden Markov models (HMM's). In particular, we have demonstrated that fairly simple layered structures, which we lately have termed big dumb neural networks (BDNN's), can be discriminatively trained to estimate emission probabilities for an HMM. Recently simple speech recognition systems (using context-independent phone models) based on this approach have been proved on controlled tests, to be both effective in terms of accuracy (i.e., comparable or better than equivalent state-of-the-art systems) and efficient in terms of CPU and memory run-time requirements. Research is continuing on extending these results to somewhat more complex systems. In this paper, we first give a brief overview of automatic speech recognition (ASR) and statistical pattern recognition in general. We also include a very brief review of HMM's, and then describe the use of ANN's as statistical estimators. We then review the basic principles of our hybrid HMM/ANN approach and describe some experiments. We discuss some current research topics, including new theoretical developments in training ANN's to maximize the posterior probabilities of the correct models for speech utterances. We also discuss some issues of system resources required for training and recognition. Finally, we conclude with some perspectives about fundamental limitations in the current technology and some speculations about where we can go from here. >"
            },
            "slug": "Neural-networks-for-statistical-recognition-of-Morgan-Bourlard",
            "title": {
                "fragments": [],
                "text": "Neural networks for statistical recognition of continuous speech"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "It is demonstrated that fairly simple layered structures, which the authors lately have termed big dumb neural networks (BDNN's), can be discriminatively trained to estimate emission probabilities for an HMM."
            },
            "venue": {
                "fragments": [],
                "text": "Proc. IEEE"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144197258"
                        ],
                        "name": "A. Krogh",
                        "slug": "A.-Krogh",
                        "structuredName": {
                            "firstName": "Anders",
                            "lastName": "Krogh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Krogh"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15267366,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d2b11c62653c0d0270127874f0e42886e06b3b13",
            "isKey": false,
            "numCitedBy": 85,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "A hidden Markov model for labeled observations, called a class HMM, is introduced and a maximum likelihood method is developed for estimating the parameters of the model. Instead of training it to model the statistics of the training sequences it is trained to optimize recognition. It resembles MMI training, but is more general, and has MMI as a special case. The standard forward-backward procedure for estimating the model cannot be generalized directly, but an \"incremental EM\" method is proposed."
            },
            "slug": "Hidden-Markov-models-for-labeled-sequences-Krogh",
            "title": {
                "fragments": [],
                "text": "Hidden Markov models for labeled sequences"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A hidden Markov model for labeled observations, called a class HMM, is introduced and a maximum likelihood method is developed for estimating the parameters of the model."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 12th IAPR International Conference on Pattern Recognition, Vol. 3 - Conference C: Signal Processing (Cat. No.94CH3440-5)"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1790646"
                        ],
                        "name": "P. Dayan",
                        "slug": "P.-Dayan",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Dayan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Dayan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695689"
                        ],
                        "name": "Geoffrey E. Hinton",
                        "slug": "Geoffrey-E.-Hinton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Hinton",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Geoffrey E. Hinton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764325"
                        ],
                        "name": "Radford M. Neal",
                        "slug": "Radford-M.-Neal",
                        "structuredName": {
                            "firstName": "Radford",
                            "lastName": "Neal",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Radford M. Neal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804104"
                        ],
                        "name": "R. Zemel",
                        "slug": "R.-Zemel",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Zemel",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Zemel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1890561,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "605402e235bd62437baf3c9ebefe77fb4d92ee95",
            "isKey": false,
            "numCitedBy": 1173,
            "numCiting": 58,
            "paperAbstract": {
                "fragments": [],
                "text": "Discovering the structure inherent in a set of patterns is a fundamental aim of statistical inference or learning. One fruitful approach is to build a parameterized stochastic generative model, independent draws from which are likely to produce the patterns. For all but the simplest generative models, each pattern can be generated in exponentially many ways. It is thus intractable to adjust the parameters to maximize the probability of the observed patterns. We describe a way of finessing this combinatorial explosion by maximizing an easily computed lower bound on the probability of the observations. Our method can be viewed as a form of hierarchical self-supervised learning that may relate to the function of bottom-up and top-down cortical processing pathways."
            },
            "slug": "The-Helmholtz-Machine-Dayan-Hinton",
            "title": {
                "fragments": [],
                "text": "The Helmholtz Machine"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A way of finessing this combinatorial explosion by maximizing an easily computed lower bound on the probability of the observations is described, viewed as a form of hierarchical self-supervised learning that may relate to the function of bottom-up and top-down cortical processing pathways."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16272378"
                        ],
                        "name": "J. D. McCauley",
                        "slug": "J.-D.-McCauley",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "McCauley",
                            "middleNames": [
                                "Darrell"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. D. McCauley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48910269"
                        ],
                        "name": "B. Engel",
                        "slug": "B.-Engel",
                        "structuredName": {
                            "firstName": "Bernard",
                            "lastName": "Engel",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Engel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34080017,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "f32bbff0d6dea9d59fa156a9da7979c062769ec4",
            "isKey": false,
            "numCitedBy": 33,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Sequential maximum a posteriori (SMAP) and the extraction and classification of homogeneous objects (ECHO), two spectral/spatial scene segmentation algorithms, were compared with traditional maximum likelihood (ML) estimation in a supervised classification of multispectral data. SMAP generalized better than both ECHO and ML. Significant differences were found in all mean class classification accuracies: SMAP>ECHO>ML."
            },
            "slug": "Comparison-of-scene-segmentations:-SMAP,-ECHO,-and-McCauley-Engel",
            "title": {
                "fragments": [],
                "text": "Comparison of scene segmentations: SMAP, ECHO, and maximum likelihood"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Geosci. Remote. Sens."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3022994"
                        ],
                        "name": "Orith Toledo-Ronen",
                        "slug": "Orith-Toledo-Ronen",
                        "structuredName": {
                            "firstName": "Orith",
                            "lastName": "Toledo-Ronen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Orith Toledo-Ronen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2803620"
                        ],
                        "name": "J. R. Rohlicek",
                        "slug": "J.-R.-Rohlicek",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Rohlicek",
                            "middleNames": [
                                "Robin"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. R. Rohlicek"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144339506"
                        ],
                        "name": "Mari Ostendorf",
                        "slug": "Mari-Ostendorf",
                        "structuredName": {
                            "firstName": "Mari",
                            "lastName": "Ostendorf",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mari Ostendorf"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 13934008,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "556af22166bb4ad5b9be8e225b74726e9bc757ac",
            "isKey": false,
            "numCitedBy": 72,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "A dependence tree is a model for the joint probability distribution of an n-dimensional random vector, which requires a relatively small number of free parameters by making Markov-like assumptions on the tree. The authors address the problem of maximum likelihood estimation of dependence tree models with missing observations, using the expectation-maximization algorithm. The solution involves computing observation probabilities with an iterative \"upward-downward\" algorithm, which is similar to an algorithm proposed for belief propagation in causal trees, a special case of Bayesian networks.<<ETX>>"
            },
            "slug": "Parameter-estimation-of-dependence-tree-models-the-Toledo-Ronen-Rohlicek",
            "title": {
                "fragments": [],
                "text": "Parameter estimation of dependence tree models using the EM algorithm"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The authors address the problem of maximum likelihood estimation of dependence tree models with missing observations, using the expectation-maximization algorithm, which involves computing observation probabilities with an iterative \"upward-downward\" algorithm."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Signal Processing Letters"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40942330"
                        ],
                        "name": "R. Welch",
                        "slug": "R.-Welch",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Welch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Welch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46726677"
                        ],
                        "name": "M. Navar",
                        "slug": "M.-Navar",
                        "structuredName": {
                            "firstName": "Murgesh",
                            "lastName": "Navar",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Navar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152857367"
                        ],
                        "name": "S. Sengupta",
                        "slug": "S.-Sengupta",
                        "structuredName": {
                            "firstName": "Sailes",
                            "lastName": "Sengupta",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sengupta"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 130845324,
            "fieldsOfStudy": [
                "Environmental Science",
                "Mathematics"
            ],
            "id": "5cc8f86521a2e6543efea637f3ef3e723ac1e87d",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "The previous cloud classification investigations in parts 1–3 of this study have been conducted using 1/16-km Landsat Multispectral Scanner (MSS) imagery. However, for global monitoring, much lower spatial resolutions of the order of 1–8 km generally are used. The present study examines the loss of cloud classification accuracy as a function of spatial resolution by degrading the imagery through progressive averaging. Textural measures are computed using the Gray Level Difference Vector approach. Significant improvement in cloud classification accuracy can be obtained using 1/2-km spatial resolution data rather than the current 1-km resolution data available today from AVHRR and GOES. Cirrus classification accuracy is especially compromised as the spatial resolution is degraded. However, the use of texture measures defined at the combination of pixel separations d = 1, 4 improves classification accuracies by several percent even for 1-km spatial resolution data. Cirrus accuracy is significantly improved by use of multiple distance features. Classification accuracies using 1/8-km spatial resolution data are similar to those obtained using the full spatial resolution features. The implications are that there are no advantages to be gained in cloud classification accuracies by using even higher spatial resolutions available from Landsat Thematic Mapper or SPOT imagery. Finally, it is found that multiple resolution imagery can be used to improve classification accuracy. Indeed, the “global” rather than the “local” aspects of texture appear to be most important to the classifier."
            },
            "slug": "The-effect-of-spatial-resolution-upon-texture-based-Welch-Navar",
            "title": {
                "fragments": [],
                "text": "The effect of spatial resolution upon texture-based cloud field classifications"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9434892"
                        ],
                        "name": "M. Weinberger",
                        "slug": "M.-Weinberger",
                        "structuredName": {
                            "firstName": "Marcelo",
                            "lastName": "Weinberger",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Weinberger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729539"
                        ],
                        "name": "G. Seroussi",
                        "slug": "G.-Seroussi",
                        "structuredName": {
                            "firstName": "Gadiel",
                            "lastName": "Seroussi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Seroussi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699339"
                        ],
                        "name": "G. Sapiro",
                        "slug": "G.-Sapiro",
                        "structuredName": {
                            "firstName": "Guillermo",
                            "lastName": "Sapiro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Sapiro"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14799914,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2a95da4ec0cd9ff9974cdd6a753edeb39c77ee19",
            "isKey": false,
            "numCitedBy": 616,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "LOCO-I (low complexity lossless compression for images) is a novel lossless compression algorithm for continuous-tone images which combines the simplicity of Huffman coding with the compression potential of context models, thus \"enjoying the best of both worlds.\" The algorithm is based on a simple fixed context model, which approaches the capability of the more complex universal context modeling techniques for capturing high-order dependencies. The model is tuned for efficient performance in conjunction with a collection of (context-conditioned) Huffman codes, which is realized with an adaptive, symbol-wise, Golomb-Rice code. LOCO-I attains, in one pass, and without recourse to the higher complexity arithmetic coders, compression ratios similar or superior to those obtained with state-of-the-art schemes based on arithmetic coding. In fact, LOCO-I is being considered by the ISO committee as a replacement for the current lossless standard in low-complexity applications."
            },
            "slug": "LOCO-I:-a-low-complexity,-context-based,-lossless-Weinberger-Seroussi",
            "title": {
                "fragments": [],
                "text": "LOCO-I: a low complexity, context-based, lossless image compression algorithm"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of Data Compression Conference - DCC '96"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9434892"
                        ],
                        "name": "M. Weinberger",
                        "slug": "M.-Weinberger",
                        "structuredName": {
                            "firstName": "Marcelo",
                            "lastName": "Weinberger",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Weinberger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729539"
                        ],
                        "name": "G. Seroussi",
                        "slug": "G.-Seroussi",
                        "structuredName": {
                            "firstName": "Gadiel",
                            "lastName": "Seroussi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Seroussi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699339"
                        ],
                        "name": "G. Sapiro",
                        "slug": "G.-Sapiro",
                        "structuredName": {
                            "firstName": "Guillermo",
                            "lastName": "Sapiro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Sapiro"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4619302,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4cb8320aacbe52db5a3b28db7439c9b5a8dc95fd",
            "isKey": false,
            "numCitedBy": 1607,
            "numCiting": 129,
            "paperAbstract": {
                "fragments": [],
                "text": "LOCO-I (LOw COmplexity LOssless COmpression for Images) is the algorithm at the core of the new ISO/ITU standard for lossless and near-lossless compression of continuous-tone images, JPEG-LS. It is conceived as a \"low complexity projection\" of the universal context modeling paradigm, matching its modeling unit to a simple coding unit. By combining simplicity with the compression potential of context models, the algorithm \"enjoys the best of both worlds.\" It is based on a simple fixed context model, which approaches the capability of the more complex universal techniques for capturing high-order dependencies. The model is tuned for efficient performance in conjunction with an extended family of Golomb-type codes, which are adaptively chosen, and an embedded alphabet extension for coding of low-entropy image regions. LOCO-I attains compression ratios similar or superior to those obtained with state-of-the-art schemes based on arithmetic coding. Moreover, it is within a few percentage points of the best available compression ratios, at a much lower complexity level. We discuss the principles underlying the design of LOCO-I, and its standardization into JPEC-LS."
            },
            "slug": "The-LOCO-I-lossless-image-compression-algorithm:-Weinberger-Seroussi",
            "title": {
                "fragments": [],
                "text": "The LOCO-I lossless image compression algorithm: principles and standardization into JPEG-LS"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145430701"
                        ],
                        "name": "J. Pearl",
                        "slug": "J.-Pearl",
                        "structuredName": {
                            "firstName": "Judea",
                            "lastName": "Pearl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pearl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 32583695,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "70ef29e6f0ce082bb8a47fd85b9bfb7cc0f20c93",
            "isKey": false,
            "numCitedBy": 18218,
            "numCiting": 230,
            "paperAbstract": {
                "fragments": [],
                "text": "From the Publisher: \nProbabilistic Reasoning in Intelligent Systems is a complete andaccessible account of the theoretical foundations and computational methods that underlie plausible reasoning under uncertainty. The author provides a coherent explication of probability as a language for reasoning with partial belief and offers a unifying perspective on other AI approaches to uncertainty, such as the Dempster-Shafer formalism, truth maintenance systems, and nonmonotonic logic. The author distinguishes syntactic and semantic approaches to uncertainty\u0097and offers techniques, based on belief networks, that provide a mechanism for making semantics-based systems operational. Specifically, network-propagation techniques serve as a mechanism for combining the theoretical coherence of probability theory with modern demands of reasoning-systems technology: modular declarative inputs, conceptually meaningful inferences, and parallel distributed computation. Application areas include diagnosis, forecasting, image interpretation, multi-sensor fusion, decision support systems, plan recognition, planning, speech recognition\u0097in short, almost every task requiring that conclusions be drawn from uncertain clues and incomplete information. \nProbabilistic Reasoning in Intelligent Systems will be of special interest to scholars and researchers in AI, decision theory, statistics, logic, philosophy, cognitive psychology, and the management sciences. Professionals in the areas of knowledge-based systems, operations research, engineering, and statistics will find theoretical and computational tools of immediate practical use. The book can also be used as an excellent text for graduate-level courses in AI, operations research, or applied probability."
            },
            "slug": "Probabilistic-reasoning-in-intelligent-systems-of-Pearl",
            "title": {
                "fragments": [],
                "text": "Probabilistic reasoning in intelligent systems - networks of plausible inference"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The author provides a coherent explication of probability as a language for reasoning with partial belief and offers a unifying perspective on other AI approaches to uncertainty, such as the Dempster-Shafer formalism, truth maintenance systems, and nonmonotonic logic."
            },
            "venue": {
                "fragments": [],
                "text": "Morgan Kaufmann series in representation and reasoning"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3209910"
                        ],
                        "name": "K. Mardia",
                        "slug": "K.-Mardia",
                        "structuredName": {
                            "firstName": "Kanti",
                            "lastName": "Mardia",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Mardia"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2735711"
                        ],
                        "name": "A. Baczkowski",
                        "slug": "A.-Baczkowski",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Baczkowski",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Baczkowski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107149624"
                        ],
                        "name": "X. Feng",
                        "slug": "X.-Feng",
                        "structuredName": {
                            "firstName": "X.",
                            "lastName": "Feng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Feng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2054455054"
                        ],
                        "name": "T. J. Hainsworth",
                        "slug": "T.-J.-Hainsworth",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Hainsworth",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. J. Hainsworth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 46098890,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "842912730c58c1ed2aa7abb74f0ebf34f8900f65",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Statistical-methods-for-automatic-interpretation-of-Mardia-Baczkowski",
            "title": {
                "fragments": [],
                "text": "Statistical methods for automatic interpretation of digitally scanned finger prints"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit. Lett."
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2165973"
                        ],
                        "name": "J. Feldman",
                        "slug": "J.-Feldman",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Feldman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Feldman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3071950"
                        ],
                        "name": "Y. Yakimovsky",
                        "slug": "Y.-Yakimovsky",
                        "structuredName": {
                            "firstName": "Yoram",
                            "lastName": "Yakimovsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Yakimovsky"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 39119295,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a0d2a5a6098218772e5772ebf8de6efc194c7596",
            "isKey": false,
            "numCitedBy": 129,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Decision-Theory-and-Artificial-Intelligence:-I.-A-Feldman-Yakimovsky",
            "title": {
                "fragments": [],
                "text": "Decision Theory and Artificial Intelligence: I. A Semantics-Based Region Analyzer"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50860274"
                        ],
                        "name": "Padhraic Smyth",
                        "slug": "Padhraic-Smyth",
                        "structuredName": {
                            "firstName": "Padhraic",
                            "lastName": "Smyth",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Padhraic Smyth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 38328710,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "879a9fc701e0b856aa012b8a3a7108e0ec9875f9",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Hidden-Markov-models-for-fault-detection-in-dynamic-Smyth",
            "title": {
                "fragments": [],
                "text": "Hidden Markov models for fault detection in dynamic system"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1684010"
                        ],
                        "name": "P. Gopalakrishnan",
                        "slug": "P.-Gopalakrishnan",
                        "structuredName": {
                            "firstName": "Ponani",
                            "lastName": "Gopalakrishnan",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Gopalakrishnan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749064"
                        ],
                        "name": "D. Kanevsky",
                        "slug": "D.-Kanevsky",
                        "structuredName": {
                            "firstName": "Dimitri",
                            "lastName": "Kanevsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Kanevsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "150023694"
                        ],
                        "name": "A. Nádas",
                        "slug": "A.-Nádas",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Nádas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Nádas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713978"
                        ],
                        "name": "D. Nahamoo",
                        "slug": "D.-Nahamoo",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Nahamoo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Nahamoo"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14827986,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "b3f258f923da64f99c11610ed13fedd3827ea5f6",
            "isKey": false,
            "numCitedBy": 247,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "The well-known Baum-Eagon inequality (1967) provides an effective iterative scheme for finding a local maximum for homogeneous polynomials with positive coefficients over a domain of probability values. However, in many applications the goal is to maximize a general rational function. In view of this, the Baum-Eagon inequality is extended to rational functions. Some of the applications of this inequality to statistical estimation problems are briefly described. >"
            },
            "slug": "An-inequality-for-rational-functions-with-to-some-Gopalakrishnan-Kanevsky",
            "title": {
                "fragments": [],
                "text": "An inequality for rational functions with applications to some statistical estimation problems"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "The well-known Baum-Eagon inequality provides an effective iterative scheme for finding a local maximum for homogeneous polynomials with positive coefficients over a domain of probability values."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3239677"
                        ],
                        "name": "J. Weszka",
                        "slug": "J.-Weszka",
                        "structuredName": {
                            "firstName": "Joan",
                            "lastName": "Weszka",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Weszka"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1724754"
                        ],
                        "name": "C. Dyer",
                        "slug": "C.-Dyer",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Dyer",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Dyer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23801707,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b10c0e4b91271622e4a98342645b8e2a2f26cea5",
            "isKey": false,
            "numCitedBy": 1691,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Three standard approaches to automatic texture classification make use of features based on the Fourier power spectrum, on second-order gray level statistics, and on first-order statistics of gray level differences, respectively. Feature sets of these types, all designed analogously, were used to classify two sets of terrain samples. It was found that the Fourier features generally performed more poorly, while the other feature sets all performned comparably."
            },
            "slug": "A-Comparative-Study-of-Texture-Measures-for-Terrain-Weszka-Dyer",
            "title": {
                "fragments": [],
                "text": "A Comparative Study of Texture Measures for Terrain Classification"
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "Three standard approaches to automatic texture classification make use of features based on the Fourier power spectrum, on second-order gray level statistics, and on first-order statistics of gray level differences, respectively; it was found that the Fouriers generally performed more poorly, while the other feature sets all performned comparably."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Systems, Man, and Cybernetics"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749650"
                        ],
                        "name": "B. Frey",
                        "slug": "B.-Frey",
                        "structuredName": {
                            "firstName": "Brendan",
                            "lastName": "Frey",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Frey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145852650"
                        ],
                        "name": "D. Mackay",
                        "slug": "D.-Mackay",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mackay",
                            "middleNames": [
                                "J.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mackay"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6518359,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b8871254256b95f52fe6a2c0edeee0fa706c1117",
            "isKey": false,
            "numCitedBy": 370,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Until recently, artificial intelligence researchers have frowned upon the application of probability propagation in Bayesian belief networks that have cycles. The probability propagation algorithm is only exact in networks that are cycle-free. However, it has recently been discovered that the two best error-correcting decoding algorithms are actually performing probability propagation in belief networks with cycles."
            },
            "slug": "A-Revolution:-Belief-Propagation-in-Graphs-with-Frey-Mackay",
            "title": {
                "fragments": [],
                "text": "A Revolution: Belief Propagation in Graphs with Cycles"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "Until recently, artificial intelligence researchers have frowned upon the application of probability propagation in Bayesian belief networks that have cycles, but it has recently been discovered that the two best error-correcting decoding algorithms are actually performing probability propagation with cycles."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712517"
                        ],
                        "name": "L. Rabiner",
                        "slug": "L.-Rabiner",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Rabiner",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Rabiner"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13618539,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "8fe2ea0a67954f1380b3387e3262f1cdb9f9b3e5",
            "isKey": false,
            "numCitedBy": 24804,
            "numCiting": 98,
            "paperAbstract": {
                "fragments": [],
                "text": "The fabric comprises a novel type of netting which will have particular utility in screening out mosquitoes and like insects and pests. The fabric is defined of voids having depth as well as width and length. The fabric is usable as a material from which to form clothing for wear, or bed coverings, or sleeping bags, etc., besides use simply as a netting."
            },
            "slug": "A-Tutorial-on-Hidden-Markov-Models-and-Selected-Rabiner",
            "title": {
                "fragments": [],
                "text": "A Tutorial on Hidden Markov Models and Selected Applications"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The fabric comprises a novel type of netting which will have particular utility in screening out mosquitoes and like insects and pests."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35191477"
                        ],
                        "name": "F. V. Jensen",
                        "slug": "F.-V.-Jensen",
                        "structuredName": {
                            "firstName": "Finn",
                            "lastName": "Jensen",
                            "middleNames": [
                                "Verner"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. V. Jensen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 61412478,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3febde16cb99b8107fecff79905ca61a5e8cd170",
            "isKey": false,
            "numCitedBy": 1493,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Computational modelling of probability has become a major part of automated decision support systems. In this book, the principal ideas of probabilistic reasoning - known as Bayesian networks - are outlined and their practical implications illustrated. The book is intended for MSc students in knowledge-based systems, artificial intelligence and statistics, and for professionals in decision support systems applications and research."
            },
            "slug": "An-introduction-to-Bayesian-networks-Jensen",
            "title": {
                "fragments": [],
                "text": "An introduction to Bayesian networks"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "The principal ideas of probabilistic reasoning - known as Bayesian networks - are outlined and their practical implications illustrated and are intended for MSc students in knowledge-based systems, artificial intelligence and statistics, and for professionals in decision support systems applications and research."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1722219"
                        ],
                        "name": "Y. Ohta",
                        "slug": "Y.-Ohta",
                        "structuredName": {
                            "firstName": "Yuichi",
                            "lastName": "Ohta",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Ohta"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 129481902,
            "fieldsOfStudy": [
                "Geography"
            ],
            "id": "e57026398c890b7c74ea57a90256850d93af3b4f",
            "isKey": false,
            "numCitedBy": 115,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Knowledge-based-interpretation-of-outdoor-natural-Ohta",
            "title": {
                "fragments": [],
                "text": "Knowledge-based interpretation of outdoor natural color scenes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728216"
                        ],
                        "name": "A. Storkey",
                        "slug": "A.-Storkey",
                        "structuredName": {
                            "firstName": "Amos",
                            "lastName": "Storkey",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Storkey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145715698"
                        ],
                        "name": "Christopher K. I. Williams",
                        "slug": "Christopher-K.-I.-Williams",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Williams",
                            "middleNames": [
                                "K.",
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher K. I. Williams"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44699574,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ad1d9abff10ce4af7419398acf48ae0fd167c8c0",
            "isKey": false,
            "numCitedBy": 6,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Dynamic-Positional-Trees-for-Structural-Image-Storkey-Williams",
            "title": {
                "fragments": [],
                "text": "Dynamic Positional Trees for Structural Image Analysis"
            },
            "venue": {
                "fragments": [],
                "text": "AISTATS"
            },
            "year": 2001
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 46,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/Combining-Belief-Networks-and-Neural-Networks-for-Feng-Williams/05caa78856d6723b2b3ad3f1213bd2caad0c870a?sort=total-citations"
}