{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49493808"
                        ],
                        "name": "W. Bayliss",
                        "slug": "W.-Bayliss",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Bayliss",
                            "middleNames": [
                                "Maddock",
                                "Sir"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Bayliss"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 99581112,
            "fieldsOfStudy": [
                "Chemistry"
            ],
            "id": "fb7c94ad2527302c26d4a64083628991faea0ea5",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-action-of-light.-Bayliss",
            "title": {
                "fragments": [],
                "text": "The action of light."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1915
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "12928214"
                        ],
                        "name": "S. R. Bruesch",
                        "slug": "S.-R.-Bruesch",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Bruesch",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. R. Bruesch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6087130"
                        ],
                        "name": "L. B. Arey",
                        "slug": "L.-B.-Arey",
                        "structuredName": {
                            "firstName": "Leslie",
                            "lastName": "Arey",
                            "middleNames": [
                                "Brainerd"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. B. Arey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 83482346,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "53f87bc75fea6c87309273d67ccba97bde846f10",
            "isKey": false,
            "numCitedBy": 174,
            "numCiting": 68,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-number-of-myelinated-and-unmyelinated-fibers-in-Bruesch-Arey",
            "title": {
                "fragments": [],
                "text": "The number of myelinated and unmyelinated fibers in the optic nerve of vertebrates"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1942
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16193459"
                        ],
                        "name": "J. Lebensohn",
                        "slug": "J.-Lebensohn",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Lebensohn",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lebensohn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 79611199,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "873b1b19e2604e5e9ddb04f003b5e11814e27bed",
            "isKey": false,
            "numCitedBy": 459,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Sensory-Mechanisms-of-the-Retina-Lebensohn",
            "title": {
                "fragments": [],
                "text": "Sensory Mechanisms of the Retina"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1947
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4767554"
                        ],
                        "name": "E. Adrian",
                        "slug": "E.-Adrian",
                        "structuredName": {
                            "firstName": "Edgar",
                            "lastName": "Adrian",
                            "middleNames": [
                                "Douglas"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adrian"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "97629828"
                        ],
                        "name": "R. Matthews",
                        "slug": "R.-Matthews",
                        "structuredName": {
                            "firstName": "R",
                            "lastName": "Matthews",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Matthews"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 33138854,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d7d386d39f7ca8aa98015c59b90ef26f6f83ba1e",
            "isKey": false,
            "numCitedBy": 100,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "IN Part I of this series(l) we gave a general account of the discharge of impulses in the optic nerve of the conger eel when the eye is exposed to light. In the present paper we are concerned more particularly with the initial stages of the process, i.e. with the excitation of the retinal elements, and we shall have little to say about the subsequent nervous changes. The latter have shown themselves to be of great interest from the neurological point of view, but before we dealt with them at length it seemed worth while to try and gain a little more information about the action of light as a stimulus to the retina. We have attempted to do this by studying the effect of flashes of light of short duration. In Part I we were mainly concerned with relatively long exposures and it was possible that some of the phenomena we found might be considerably modified with flashes. In any case a study of the response to flashes ought to give us data bearing on retinal excitation and it ought, in particular, to show how far we can liken the mechanism of the vertebrate eye to that of the much simpler organs investigated with the same method by Hecht(2)."
            },
            "slug": "The-action-of-light-on-the-eye-Adrian-Matthews",
            "title": {
                "fragments": [],
                "text": "The action of light on the eye"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A study of the response to flashes of light of short duration is attempted to show how far the mechanism of the vertebrate eye can be likened to that of the much simpler organs investigated with the same method by Hecht(2)."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1927
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 31934706,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5379306b770f4e61c30c365c474ac6f05a352c74",
            "isKey": false,
            "numCitedBy": 96,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "The retina contains three layers of cells, of which only one is directly responsive to light. Even histological inspection suggests that the other two layers do more than simply pass on the pattern of activity aroused by the light without modifying it in any way. The work of Adrian & Matthews (1927 a, b, 1928), Hartline (1938, 1940a, b), and Granit (1947), has shown that this is so. The pattern of light and shade cast on the retina by the optical system of the eye gives rise to a pattern of nerve impulses in the optic nerve, but neither the temporal nor the spatial features of this pattern of impulses are accurate copies of the pattern of light. The present work was undertaken with the idea that these distortions might amount to some integrative action of the nervous layers of the retina analogous to the integrative action of the spinal cord studied by Sherrington. This paper is concerned mainly with the technical problems encountered in detecting the electrical activity of single retinal units in the frog's retina.The results of other experiments with this preparation are described in a second paper. Some preliminary results have already been published (Barlow, 1950)."
            },
            "slug": "Action-potentials-from-the-frog's-retina-Barlow",
            "title": {
                "fragments": [],
                "text": "Action potentials from the frog's retina"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The present work was undertaken with the idea that the technical problems encountered in detecting the electrical activity of single retinal units in the frog's retina might amount to some integrativeaction of the nervous layers of the retina analogous to the integrative action of the spinal cord studied by Sherrington."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36983195"
                        ],
                        "name": "B. Matthews",
                        "slug": "B.-Matthews",
                        "structuredName": {
                            "firstName": "Bryan",
                            "lastName": "Matthews",
                            "middleNames": [
                                "Harold",
                                "Cabot"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Matthews"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 32695817,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bd54f87d5d4df56099e08cb236d4938ff0a2b7e9",
            "isKey": false,
            "numCitedBy": 154,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "THIS book is not a general treatise on vision, but in deals with some additions to visual physiology in the last fifteen years that have been derived from the study of action potentials of the retina and the optic nerve, and particularly with work in this field with which the author has been closely associated and in which his laboratory has been notably active. It has been possible in many types of visual sense organ to record nerve impulse discharges set up by the stimulus of light ; in work on a simple eye (Limulus), Hartline showed that visual sense cells, like other sensory nerve endings that have been investigated, set up impulses of frequency related to the strength of the stimulus, and Hartline later confirmed this for single opticnerve fibres from the frog's retina. But here the response was complicated by fibres responding when the light was extinguished—the well-known off-discharge found by Adrian and R. Matthews in the eel's optic nerve. Granit's work has extended this investigation to mammalian eyes ; and the response in single optic-nerve fibres in many eyes has been studied and related to the wave-length of the light evoking it.Sensory Mechanisms of the RetinaWith an Appendix or Electroretinography. By Dr. Ragnar Granit. Pp. xxiii+412. (London, New York and Toronto : Oxford University Press, 1947.) 35s. net."
            },
            "slug": "Sensory-Mechanisms-of-the-Retina-Matthews",
            "title": {
                "fragments": [],
                "text": "Sensory Mechanisms of the Retina"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This book is not a general treatise on vision, but in deals with some additions to visual physiology in the last fifteen years that have been derived from the study of action potentials of the retina and the optic nerve, and particularly with work in this field with which the author has been closely associated and in which his laboratory has been notably active."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1949
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4249397"
                        ],
                        "name": "H. Hartline",
                        "slug": "H.-Hartline",
                        "structuredName": {
                            "firstName": "Haldan",
                            "lastName": "Hartline",
                            "middleNames": [
                                "Keffer"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Hartline"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14394803,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "ec71953a116a869a063cf516fe5e57700fff6567",
            "isKey": false,
            "numCitedBy": 393,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Appreciation of the form of the retinal image depends upon a correspondence between the distribution of light on the retina and the distribution of activity among the fibers of the optic nerve. This correspondence may be studied directly by recording the activity in single optic nerve fibers in response to illuminating various parts of the retina. A given optic nerve fiber responds to light only if a particular region of the retina receives illumination. This region is termed the receptive field of that fiber. In a previous paper describing the responses in single optic nerve fibers from the cold-blooded vertebrate eye (Hartline, 1938) it was noted that the receptive fields of the optic nerve fibers are of small but appreciable extent, and that their locations on the retina are fixed. It is the purpose of the present paper to describe further the characteristics of receptive fields, and to discuss some of the spatial factors involved in the excitation of the fibers of the optic nerve. METHOD. The method for recording the activity in single optic nerve fibers from the eyes of cold-blooded vertebrates has been described in the previous paper (lot. cit.). An eye is excised, cut open, and small bundles of optic nerve fibers are dissected from the anterior surface of the exposed retina. The action potentials in these bundles are amplified and recorded with an oscillograph. When such a bundle has been split successfully , until only a single active fiber remains, the retina must be searched with a small spot of light to determine the region supplying that fiber. This search is aided by noting the direction, on the retina, from which the nerve fibers in the small bundle come, and by using large spots of light at first to locate the approximate position of the sensitive region. The optical system employed in these experiments has likewise been described. A spot of light of suitable size is projected upon the exposed retina; the coordinates of its position, referred to an arbitrary point of origin on the retina, are obtained from readings of crossed micrometers which control its location. The micrometer readings are reduced to millimeters on the retina by multiplying them by the magnification of the optical system (0.32 or 0.15). Sharpness of focus of the spot on the retina 690"
            },
            "slug": "THE-RECEPTIVE-FIELDS-OF-OPTIC-NERVE-FIBERS-Hartline",
            "title": {
                "fragments": [],
                "text": "THE RECEPTIVE FIELDS OF OPTIC NERVE FIBERS"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "The purpose of the present paper is to describe further the characteristics of receptive fields, and to discuss some of the spatial factors involved in the excitation of the fibers of the optic nerve."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1940
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4249397"
                        ],
                        "name": "H. Hartline",
                        "slug": "H.-Hartline",
                        "structuredName": {
                            "firstName": "Haldan",
                            "lastName": "Hartline",
                            "middleNames": [
                                "Keffer"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Hartline"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9010362,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7eef73a0e100bd61fb88acf0b42db739efb928d8",
            "isKey": false,
            "numCitedBy": 137,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "In a previous paper (Hartline, 1940) it was shown that a ganglion cell in the peripheral retina of the vertebrate eye is excited by activity in many convergent pathways, from sensory elements distributed over a receptive field covering approximately a square millimeter of retinal area. Illumination of any portion of the receptive field of a retinal ganglion cell will accordingly produce a discharge of impulses in its axon, the strength of the response to illumination of a fixed retinal area usually being greater the higher the intensity of the stimulating light. The present paper will show that the discharge of impulses in a single optic nerve fiber also depends upon the size of the illuminated area. The excitation of a ganglion cell is therefore controlled by the number of active pathways which converge upon it, as well as by the degree of activity in the individual pathways. Spatial summation in the vertebrate retina has previously been demonstrated by Adrian and Matthews (1927-1928). They showed that the latency of the discharge of impulses in the whole optic nerve of the eel was shorter the larger the area of the retina illuminated, and the latency of the response to four spots of light was shorter than the shortest latency obtained with any of the spots singly. This summation was enhanced by the application of strychnine, indicating that it depended upon the nervous interconnections within the retina. The study of the activity in single optic nerve fibers has now furnished more direct evidence for the convergence of excitatory effects within the retina; the present paper is concerned with the extension of this study to an analysis of spatial summation, in terms of the activity of the individual units of the retina. METHOD. The method for studying the activity of single optic nerve fibers in the retinas of cold-blooded vertebrates, and for determining the location and extent of their receptive fields has been described in previous papers (Hartline, 1938, 1940). In the present experiments the eyes from"
            },
            "slug": "THE-EFFECTS-OF-SPATIAL-SUMMATION-IN-THE-RETINA-ON-Hartline",
            "title": {
                "fragments": [],
                "text": "THE EFFECTS OF SPATIAL SUMMATION IN THE RETINA ON THE EXCITATION OF THE FIBERS OF THE OPTIC NERVE"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that the discharge of impulses in a single optic nerve fiber also depends upon the size of the illuminated area, and this study is concerned with an analysis of spatial summation, in terms of the activity of the individual units of the retina."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1940
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The instincts , habits and reactions of the frog . Pt . I . The associative processes of the green frog"
            },
            "venue": {
                "fragments": [],
                "text": "Psychol . Rev . Monogr . Suppl ."
            },
            "year": 1903
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The instincts , habits and reactions of the frog . Pt . 1 . The associative processes of the green frog"
            },
            "venue": {
                "fragments": [],
                "text": "Psychol . Rev . Monogr . Suppl ."
            },
            "year": 1903
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Principles and technique of the electrophysiological analysis of colour reception with the . aid · of microelectrodes"
            },
            "venue": {
                "fragments": [],
                "text": "Upsala LiikFOren . FOrk ."
            },
            "year": 1939
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Principles and technique ofthe electrophysiological analysis of colour reception with the aid of micro-electrodes"
            },
            "venue": {
                "fragments": [],
                "text": "Upsala LdkForen. Forh"
            },
            "year": 1939
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Principles and technique of the electrophysiological analysis of colour reception with the"
            },
            "venue": {
                "fragments": [],
                "text": "aid· of micro-electrodes. Upsala LiikFOren. FOrk"
            },
            "year": 1939
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The action of light on the eve . III . The interaction of retinal neurones"
            },
            "venue": {
                "fragments": [],
                "text": "J . Physiol"
            },
            "year": 1928
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 14,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Summation-and-inhibition-in-the-frog's-retina-Barlow/5d977ee72fd0aaf8c2ac2808c9dd522cdef8b4b7?sort=total-citations"
}