{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2281877"
                        ],
                        "name": "J. Atick",
                        "slug": "J.-Atick",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Atick",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Atick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144513847"
                        ],
                        "name": "A. Redlich",
                        "slug": "A.-Redlich",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Redlich",
                            "middleNames": [
                                "Norman"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Redlich"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Recently, a number of studies have proposed that spatial coding by the mammalian visual system is well described by codes that make use of the correlations to reduce the redundancy of the sensory representation (e.g.,  Atick and Redlich 1990, 1992;  Atick 1992; Barlow and Foldiak 1989; Daugman 1988,1991; Linsker 1988; Foldiak 1990; Sanger 1989).,To develop an understanding of the functional properties of the mammalian visual system, a number of recent studies have proposed that one must understand the statistical regularity of the mammalian visual environment and its relation to the visual code (eg, Field 1987, 1989, 1993;  Atick and Redlich 1990, 1992;  Bialek et al. 1991; Eckert and Buchsbaum 1993; Hancock et al. 1992; van Hateren 1992; Kersten 1987).,A number of recent studies have discussed the similarities between the principal components of natural scenes and the receptive fields of cells in the visual pathway (Bossomaier and Snyder 1986;  Atick and Redlich 1990, 1992;  Atick 1992; Hancock et al. 1992; Baddeley and Hancock 1991; MacKay and Miller 1990; Derrico and Buchsbaum 1991)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 28154878,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "03128ecdd3c3dfb9752861d8555b97535e1cfc14",
            "isKey": false,
            "numCitedBy": 531,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a theory of the early processing in the mammalian visual pathway. The theory is formulated in the language of information theory and hypothesizes that the goal of this processing is to recode in order to reduce a generalized redundancy subject to a constraint that specifies the amount of average information preserved. In the limit of no noise, this theory becomes equivalent to Barlow's redundancy reduction hypothesis, but it leads to very different computational strategies when noise is present. A tractable approach for finding the optimal encoding is to solve the problem in successive stages where at each stage the optimization is performed within a restricted class of transfer functions. We explicitly find the solution for the class of encodings to which the parvocellular retinal processing belongs, namely linear and nondivergent transformations. The solution shows agreement with the experimentally observed transfer functions at all levels of signal to noise."
            },
            "slug": "Towards-a-Theory-of-Early-Visual-Processing-Atick-Redlich",
            "title": {
                "fragments": [],
                "text": "Towards a Theory of Early Visual Processing"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "A theory of the early processing in the mammalian visual pathway is proposed and the solution for the class of encodings to which the parvocellular retinal processing belongs, namely linear and nondivergent transformations is found."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48351139"
                        ],
                        "name": "C. J. Webber",
                        "slug": "C.-J.-Webber",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Webber",
                            "middleNames": [
                                "J.",
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. J. Webber"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122063137,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "72df42ffeec815bb2e4b8a9fd6fc9fa7dcd703b1",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "It has been suggested that the paradigm of competitive learning might constitute a viable mechanism by which the response properties of the cells of the visual cortex could develop to form coding units suitable for representing the visual stimuli encountered in natural life. This suggestion was founded on the observation that, in computational simulation, competitive adaptation to stimuli which have the character of natural images can give rise to receptive fields that are primarily sensitive to simple oriented features. In the paper it is argued that the winner-take-all paradigm of competitive learning is not adequate to account for the distribution of responses in the domain of spatial frequency that is necessary to form a complete representation of the information contained in images. The competitive mechanism gives rise to a gross imbalance in the distribution of spatial frequency responses in favour of the lowest spatial frequencies, as a consequence of the form of the spatial frequency spectra of na..."
            },
            "slug": "Competitive-learning,-natural-images-and-cortical-Webber",
            "title": {
                "fragments": [],
                "text": "Competitive learning, natural images and cortical cells"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "It is argued that the winner-take-all paradigm of competitive learning is not adequate to account for the distribution of responses in the domain of spatial frequency that is necessary to form a complete representation of the information contained in images."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2281877"
                        ],
                        "name": "J. Atick",
                        "slug": "J.-Atick",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Atick",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Atick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144513847"
                        ],
                        "name": "A. Redlich",
                        "slug": "A.-Redlich",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Redlich",
                            "middleNames": [
                                "Norman"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Redlich"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17515861,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "841cd4a6cac86fa0cfb0e8542eac5ed164f23f50",
            "isKey": false,
            "numCitedBy": 711,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "By examining the experimental data on the statistical properties of natural scenes together with (retinal) contrast sensitivity data, we arrive at a first principle, theoretical hypothesis for the purpose of retinal processing and its relationship to an animal's environment. We argue that the retinal goal is to transform the visual input as much as possible into a statistically independent basis as the first step in creating a redundancy reduced representation in the cortex, as suggested by Barlow. The extent of this whitening of the input is limited, however, by the need to suppress input noise. Our explicit theoretical solutions for the retinal filters also show a simple dependence on mean stimulus luminance: they predict an approximate Weber law at low spatial frequencies and a De Vries-Rose law at high frequencies. Assuming that the dominant source of noise is quantum, we generate a family of contrast sensitivity curves as a function of mean luminance. This family is compared to psychophysical data."
            },
            "slug": "What-Does-the-Retina-Know-about-Natural-Scenes-Atick-Redlich",
            "title": {
                "fragments": [],
                "text": "What Does the Retina Know about Natural Scenes?"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is argued that the retinal goal is to transform the visual input as much as possible into a statistically independent basis as the first step in creating a redundancy reduced representation in the cortex, as suggested by Barlow."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49649079"
                        ],
                        "name": "D. Field",
                        "slug": "D.-Field",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Field",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Field"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15485143,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "04e896d03b598c97dfbd887dd86f991b804f37b8",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Why does the mammalian visual system represent information as it does? If we assume that visual systems have evolved to cope with the natural environment then we might expect the coding properties of the visual system to be related to the statistical structure of our environment. Indeed, images of the natural environment do not have random statistics. The first-order statistics (e.g., distribution of pixel values) and second-order statistics (e.g., power spectra) of natural images have been discussed previously and they bear important relations to visual coding. Statistics higher than second-order are difficult to measure but provide crucial information about the image. For example, it can be shown that the lines and edges found in natural images are a function of these higher-order statistics. In this paper, these higher-order statistics will be discussed in relation to the coding properties of the mammalian visual system. It is suggested that the spatial parameters of the cortical 'filters' (e.g., bandwidths of simple and complex cells) are closely related to these higher-order statistics. In particular, it will be shown that the spatial non-linearities shown by cortical complex cells provide the early visual system with the information required to learn about these statistics."
            },
            "slug": "What-The-Statistics-Of-Natural-Images-Tell-Us-About-Field",
            "title": {
                "fragments": [],
                "text": "What The Statistics Of Natural Images Tell Us About Visual Coding"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is suggested that the spatial parameters of the cortical 'filters' (e.g., bandwidths of simple and complex cells) are closely related to these higher-order statistics that bear important relations to visual coding."
            },
            "venue": {
                "fragments": [],
                "text": "Photonics West - Lasers and Applications in Science and Engineering"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49649079"
                        ],
                        "name": "D. Field",
                        "slug": "D.-Field",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Field",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Field"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1600874,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aeb37769d72999bcbfb0582b73607fd8d23f4545",
            "isKey": false,
            "numCitedBy": 3274,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "The relative efficiency of any particular image-coding scheme should be defined only in relation to the class of images that the code is likely to encounter. To understand the representation of images by the mammalian visual system, it might therefore be useful to consider the statistics of images from the natural environment (i.e., images with trees, rocks, bushes, etc). In this study, various coding schemes are compared in relation to how they represent the information in such natural images. The coefficients of such codes are represented by arrays of mechanisms that respond to local regions of space, spatial frequency, and orientation (Gabor-like transforms). For many classes of image, such codes will not be an efficient means of representing information. However, the results obtained with six natural images suggest that the orientation and the spatial-frequency tuning of mammalian simple cells are well suited for coding the information in such images if the goal of the code is to convert higher-order redundancy (e.g., correlation between the intensities of neighboring pixels) into first-order redundancy (i.e., the response distribution of the coefficients). Such coding produces a relatively high signal-to-noise ratio and permits information to be transmitted with only a subset of the total number of cells. These results support Barlow's theory that the goal of natural vision is to represent the information in the natural environment with minimal redundancy."
            },
            "slug": "Relations-between-the-statistics-of-natural-images-Field",
            "title": {
                "fragments": [],
                "text": "Relations between the statistics of natural images and the response properties of cortical cells."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The results obtained with six natural images suggest that the orientation and the spatial-frequency tuning of mammalian simple cells are well suited for coding the information in such images if the goal of the code is to convert higher-order redundancy into first- order redundancy."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1994273"
                        ],
                        "name": "R. Shapley",
                        "slug": "R.-Shapley",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Shapley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Shapley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4433870"
                        ],
                        "name": "P. Lennie",
                        "slug": "P.-Lennie",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Lennie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Lennie"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This is believed to produce a more accurate representation of cells in the visual pathway since cells are know to produce a more linear response to contrast (e.g., see  Shapley and Lennie 1985 ) rather than amplitude."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 967753,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "72dafa24626298cf09f8c96c8aeb6508ff1ff27c",
            "isKey": false,
            "numCitedBy": 303,
            "numCiting": 94,
            "paperAbstract": {
                "fragments": [],
                "text": "Within the last 15 years, a method called \"spatial frequency analysis\" has been applied widely to the study of receptive fields of neurons in the visual pathway. Out of this work have emerged new concepts of how the brain analyzes and recognizes visual images. The aim of this paper is to explain why \"spatial frequency analysis\" is useful, and to review the insights into visual function that have resulted from its application. It is important to note at the outset that while spatial frequency analysis can provide a comprehensive description of the behavior of neurons in which signals are summed linearly (see below), it has much more limited application to the behavior of neurons that combine signals nonlinearly. Because of this, the greatest insights into visual information processing have come and probably will continue to come from a combined use of space, time, spatial frequency, and temporal frequency measurements. The earliest applications of spatial frequency analysis were motivated by the idea that visual physiology and psychophysics could be more closely related by a uniform approach to the problems of spatial vision. This approach has continued to bind together the psychophysics and physiology of spatial vision, and the interested reader will find relevant psychophysical work discussed in reviews by Braddick et al (1978), De Valois & De Valois (1980), Robson (1980), Westheimer (1984), and Kelly & Burbeck (1984)."
            },
            "slug": "Spatial-frequency-analysis-in-the-visual-system.-Shapley-Lennie",
            "title": {
                "fragments": [],
                "text": "Spatial frequency analysis in the visual system."
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "The aim of this paper is to explain why \"spatial frequency analysis\" is useful, and to review the insights into visual function that have resulted from its application."
            },
            "venue": {
                "fragments": [],
                "text": "Annual review of neuroscience"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49649079"
                        ],
                        "name": "D. Field",
                        "slug": "D.-Field",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Field",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Field"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145957449"
                        ],
                        "name": "A. Hayes",
                        "slug": "A.-Hayes",
                        "structuredName": {
                            "firstName": "Anthony",
                            "lastName": "Hayes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Hayes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32477129"
                        ],
                        "name": "R. Hess",
                        "slug": "R.-Hess",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Hess",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hess"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "However, it has recently been proposed ( Field et al. 1993 ) that the visual system may make use of this redundancy by using connections between locally oriented units along the lines of the lateral connections found in the primary visual cortex (e.g., Rockland and Lund 1983; Blasdel et al. 1985; see Gilbert 1992 for a review)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 205016575,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "4bc789a006fa0b8a1e4f2cf51c021328fc8886cc",
            "isKey": false,
            "numCitedBy": 1623,
            "numCiting": 68,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Contour-integration-by-the-human-visual-system:-for-Field-Hayes",
            "title": {
                "fragments": [],
                "text": "Contour integration by the human visual system: Evidence for a local “association field”"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2577641"
                        ],
                        "name": "R. Linsker",
                        "slug": "R.-Linsker",
                        "structuredName": {
                            "firstName": "Ralph",
                            "lastName": "Linsker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Linsker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15546068,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "214574b7eda0a9e3a8c4501fd2007e6b87b3047a",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "An information-theoretic optimization principle ('infomax') has previously been used for unsupervised learning of statistical regularities in an input ensemble. The principle states that the input-output mapping implemented by a processing stage should be chosen so as to maximize the average mutual information between input and output patterns, subject to constraints and in the presence of processing noise. In the present work I show how infomax, when applied to a class of nonlinear input-output mappings, can under certain conditions generate optimal filters that have additional useful properties: (1) Output activity (for each input pattern) tends to be concentrated among a relatively small number of nodes. (2) The filters are sensitive to higher-order statistical structure (beyond pairwise correlations). If the input features are localized, the filters' receptive fields tend to be localized as well. (3) Multiresolution sets of filters with subsampling at low spatial frequencies - related to pyramid coding and wavelet representations - emerge as favored solutions for certain types of input ensembles."
            },
            "slug": "Deriving-Receptive-Fields-Using-an-Optimal-Encoding-Linsker",
            "title": {
                "fragments": [],
                "text": "Deriving Receptive Fields Using an Optimal Encoding Criterion"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown how infomax, when applied to a class of nonlinear input-output mappings, can under certain conditions generate optimal filters that have additional useful properties."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49649079"
                        ],
                        "name": "D. Field",
                        "slug": "D.-Field",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Field",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Field"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "When gaussian windowed, the first few coefficients do show some resemblance to cortical receptive fields-but this is expected since a gaussianwindowed low-frequency sinusoid (the first Fourier coefficients with the greatest amplitude) will produce the popular “Gabor function” shown to provide good models of cortical receptive fields (e.g.,  Field and Tolhurst 1986 ).,Cortical simple cells, for example, have been shown to have a high degree of phase alignment at the center of the receptive field ( Field and Tolhurst 1986 ).,Although the Gabor function has found some support in the physiology (Webster and DeValois 1985;  Field and Tolhurst 1986;  Jones and Palmer 1987), other functions have been proposed such as the Cauchy (Klein and Levi 1985) and the log-Gabor used in this study (Field 1987).,Since these receptive fields are localized, they can be defined in Fourier terms by an alignment in the phase at the center of the receptive field (e.g.,  Field and Tolhurst 1986;  Field 1993)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 22746793,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d315e72c4226997edeb5940255f2996e483e1356",
            "isKey": false,
            "numCitedBy": 183,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "Receptive fields of simple cells in the cat visual cortex have recently been discussed in relation to the ‘theory of communication' proposed by Gabor (1946). A number of investigators have suggested that the line-weighting functions, as measured orthogonal to the preferred orientation, may be best described as the product of a Gaussian envelope and a sinusoid (i.e. a Gabor function). Following Gabor’s theory of ‘basis’ functions, it has also been suggested that simple cells can be categorized into even-and odd-symmetric categories. Based on the receptive field profiles of 46 simple cells recorded from cat visual cortex, our analysis provides a quantitative description of both the receptive-field envelope and the receptive-field ‘symmetry’ of each of the 46 cells. The results support the notion that, to a first approximation, Gabor functions with three free parameters (envelope width, carrier frequency and carrier phase) provide a good description of the receptive-field profiles. However, our analysis does not support the notion that simple cells generally fit into even- and odd-symmetric categories."
            },
            "slug": "The-structure-and-symmetry-of-simple-cell-profiles-Field-Tolhurst",
            "title": {
                "fragments": [],
                "text": "The structure and symmetry of simple-cell receptive-field profiles in the cat’s visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "The results support the notion that, to a first approximation, Gabor functions with three free parameters (envelope width, carrier frequency and carrier phase) provide a good description of the receptive-field profiles, but do not support the idea that simple cells generally fit into even- and odd-symmetric categories."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2577641"
                        ],
                        "name": "R. Linsker",
                        "slug": "R.-Linsker",
                        "structuredName": {
                            "firstName": "Ralph",
                            "lastName": "Linsker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Linsker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 344,
                                "start": 211
                            }
                        ],
                        "text": "Recently, a number of studies have proposed that spatial coding by the mammalian visual system is well described by codes that make use of the correlations to reduce the redundancy of the sensory representation (e.g., Atick and Redlich 1990, 1992; Atick 1992; Barlow and Foldiak 1989; Daugman 1988,1991; Linsker 1988; Foldiak 1990; Sanger 1989)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 223,
                                "start": 164
                            }
                        ],
                        "text": "And there have been a number of studies that have shown that under the right constraints, units in competitive networks can develop large oriented receptive fields (e.g., Lehky and Sejnowski 1990; Linsker 1988; Sanger 1989)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1527671,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "16d70e8af45ca0ae2c1bb73f3be6628518d40b8f",
            "isKey": false,
            "numCitedBy": 1417,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "The emergence of a feature-analyzing function from the development rules of simple, multilayered networks is explored. It is shown that even a single developing cell of a layered network exhibits a remarkable set of optimization properties that are closely related to issues in statistics, theoretical physics, adaptive signal processing, the formation of knowledge representation in artificial intelligence, and information theory. The network studied is based on the visual system. These results are used to infer an information-theoretic principle that can be applied to the network as a whole, rather than a single cell. The organizing principle proposed is that the network connections develop in such a way as to maximize the amount of information that is preserved when signals are transformed at each processing stage, subject to certain constraints. The operation of this principle is illustrated for some simple cases.<<ETX>>"
            },
            "slug": "Self-organization-in-a-perceptual-network-Linsker",
            "title": {
                "fragments": [],
                "text": "Self-organization in a perceptual network"
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "It is shown that even a single developing cell of a layered network exhibits a remarkable set of optimization properties that are closely related to issues in statistics, theoretical physics, adaptive signal processing, the formation of knowledge representation in artificial intelligence, and information theory."
            },
            "venue": {
                "fragments": [],
                "text": "Computer"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3741160"
                        ],
                        "name": "J. V. van Hateren",
                        "slug": "J.-V.-van-Hateren",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "van Hateren",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. V. van Hateren"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "To develop an understanding of the functional properties of the mammalian visual system, a number of recent studies have proposed that one must understand the statistical regularity of the mammalian visual environment and its relation to the visual code (eg, Field 1987, 1989, 1993; Atick and Redlich 1990, 1992; Bialek et al. 1991; Eckert and Buchsbaum 1993; Hancock et al. 1992;  van Hateren 1992;  Kersten 1987)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 26113779,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "1517e86853a3c431bcf0f45facf23ebcd6dee4e1",
            "isKey": false,
            "numCitedBy": 62,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "IT has been suggested1–3 that the first steps in visual processing strive to compress as much information as possible about the outside world into the limited dynamic range of the visual channels. Here I compare measured neural images with theoretical calculations based on maximizing information, taking into account the statistical structure of natural images. Neural images were obtained by scanning an image while recording from a second-order neuron in the fly visual system. Over a 5.5-log-units-wide range of mean intensities, experiment and theory correspond well. At high mean intensities, redundancy in the image is reduced by spatial and temporal antagonism. At low mean intensities, spatial and temporal low-pass filtering combat noise and increase signal reliability."
            },
            "slug": "Real-and-optimal-neural-images-in-early-vision-Hateren",
            "title": {
                "fragments": [],
                "text": "Real and optimal neural images in early vision"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Compared neural images obtained by scanning an image while recording from a second-order neuron in the fly visual system are compared with theoretical calculations based on maximizing information, taking into account the statistical structure of natural images."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1762240"
                        ],
                        "name": "W. Bialek",
                        "slug": "W.-Bialek",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Bialek",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Bialek"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1829021"
                        ],
                        "name": "D. Ruderman",
                        "slug": "D.-Ruderman",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Ruderman",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ruderman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143860433"
                        ],
                        "name": "A. Zee",
                        "slug": "A.-Zee",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Zee",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Zee"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15218126,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "aa5601be49c9450528dcbdbfc1a9fa05b55155fd",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "We formulate the problem of optimizing the sampling of natural images using an array of linear filters. Optimization of information capacity is constrained by the noise levels of the individual channels and by a penalty for the construction of long-range interconnections in the array. At low signal-to-noise ratios the optimal filter characteristics correspond to bound states of a Schrodinger equation in which the signal spectrum plays the role of the potential. The resulting optimal filters are remarkably similar to those observed in the mammalian visual cortex and the retinal ganglion cells of lower vertebrates. The observed scale invariance of natural images plays an essential role in this construction."
            },
            "slug": "Optimal-Sampling-of-Natural-Images:-A-Design-for-Bialek-Ruderman",
            "title": {
                "fragments": [],
                "text": "Optimal Sampling of Natural Images: A Design Principle for the Visual System"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The resulting optimal filters are remarkably similar to those observed in the mammalian visual cortex and the retinal ganglion cells of lower vertebrates."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS 1990"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32056095"
                        ],
                        "name": "C. Gilbert",
                        "slug": "C.-Gilbert",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Gilbert",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Gilbert"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "However, it has recently been proposed (Field et al. 1993) that the visual system may make use of this redundancy by using connections between locally oriented units along the lines of the lateral connections found in the primary visual cortex (e.g., Rockland and Lund 1983; Blasdel et al. 1985; see  Gilbert 1992  for a review)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 30149117,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "4ba1fb051af90fc53e4042703e0a3f33ae85c7e4",
            "isKey": false,
            "numCitedBy": 561,
            "numCiting": 88,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Horizontal-integration-and-cortical-dynamics-Gilbert",
            "title": {
                "fragments": [],
                "text": "Horizontal integration and cortical dynamics"
            },
            "venue": {
                "fragments": [],
                "text": "Neuron"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38361753"
                        ],
                        "name": "M. Concetta Morrone",
                        "slug": "M.-Concetta-Morrone",
                        "structuredName": {
                            "firstName": "Maria",
                            "lastName": "Concetta Morrone",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Concetta Morrone"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2299127"
                        ],
                        "name": "D. Burr",
                        "slug": "D.-Burr",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Burr",
                            "middleNames": [
                                "Charles"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Burr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "One recent model of complex cells describes the response of a complex cell as a vector sum of two quadrature-phase cortical cells (Field 1987;  Morrone and Burr 1988 )."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 32945737,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "992f61cd4b86fd5f1415308cacda7cdc0280511b",
            "isKey": false,
            "numCitedBy": 741,
            "numCiting": 63,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a simple and biologically plausible model of how mammalian visual systems could detect and identify features in an image. We suggest that the points in a waveform that have unique perceptual significance as ‘lines’ and ‘edges’ are the points where the Fourier components of the waveform come into phase with each other. At these points ‘local energy’ is maximal. Local energy is defined as the square root of the sum of the squared response of sets of matched filters, of identical amplitude spectrum but differing in phase spectrum by 90°: one filter type has an even-symmetric line-spread function, the other an odd-symmetric line-spread function. For a line the main contribution to the local energy peak is in the output of the even-symmetric filters, whereas for edges it is in the output of the odd-symmetric filters. If both filter types respond at the peak of local energy, both edges and lines are seen, either simultaneously or alternating in time. The model was tested with a series of images, and shown to predict well the position of perceived features and the organization of the images."
            },
            "slug": "Feature-detection-in-human-vision:-a-energy-model-Morrone-Burr",
            "title": {
                "fragments": [],
                "text": "Feature detection in human vision: a phase-dependent energy model"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "A simple and biologically plausible model of how mammalian visual systems could detect and identify features in an image is presented and it is suggested that the points in a waveform that have unique perceptual significance as ‘lines’ and ‘edges’ are the points where the Fourier components of the waveform come into phase with each other."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107584303"
                        ],
                        "name": "J. P. Jones",
                        "slug": "J.-P.-Jones",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Jones",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. P. Jones"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3459632"
                        ],
                        "name": "L. Palmer",
                        "slug": "L.-Palmer",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Palmer",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Palmer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Although the Gabor function has found some support in the physiology (Webster and DeValois 1985; Field and Tolhurst 1986;  Jones and Palmer 1987 ), other functions have been proposed such as the Cauchy (Klein and Levi 1985) and the log-Gabor used in this study (Field 1987)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 16809045,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "0dbf797d5b34f40d16eeadfa7a5b4543c2af2c11",
            "isKey": false,
            "numCitedBy": 1709,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Using the two-dimensional (2D) spatial and spectral response profiles described in the previous two reports, we test Daugman's generalization of Marcelja's hypothesis that simple receptive fields belong to a class of linear spatial filters analogous to those described by Gabor and referred to here as 2D Gabor filters. 2. In the space domain, we found 2D Gabor filters that fit the 2D spatial response profile of each simple cell in the least-squared error sense (with a simplex algorithm), and we show that the residual error is devoid of spatial structure and statistically indistinguishable from random error. 3. Although a rigorous statistical approach was not possible with our spectral data, we also found a Gabor function that fit the 2D spectral response profile of each simple cell and observed that the residual errors are everywhere small and unstructured. 4. As an assay of spatial linearity in two dimensions, on which the applicability of Gabor theory is dependent, we compare the filter parameters estimated from the independent 2D spatial and spectral measurements described above. Estimates of most parameters from the two domains are highly correlated, indicating that assumptions about spatial linearity are valid. 5. Finally, we show that the functional form of the 2D Gabor filter provides a concise mathematical expression, which incorporates the important spatial characteristics of simple receptive fields demonstrated in the previous two reports. Prominent here are 1) Cartesian separable spatial response profiles, 2) spatial receptive fields with staggered subregion placement, 3) Cartesian separable spectral response profiles, 4) spectral response profiles with axes of symmetry not including the origin, and 5) the uniform distribution of spatial phase angles. 6. We conclude that the Gabor function provides a useful and reasonably accurate description of most spatial aspects of simple receptive fields. Thus it seems that an optimal strategy has evolved for sampling images simultaneously in the 2D spatial and spatial frequency domains."
            },
            "slug": "An-evaluation-of-the-two-dimensional-Gabor-filter-Jones-Palmer",
            "title": {
                "fragments": [],
                "text": "An evaluation of the two-dimensional Gabor filter model of simple receptive fields in cat striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It seems that an optimal strategy has evolved for sampling images simultaneously in the 2D spatial and spatial frequency domains and the Gabor function provides a useful and reasonably accurate description of most spatial aspects of simple receptive fields."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3182659"
                        ],
                        "name": "S. R. Lehky",
                        "slug": "S.-R.-Lehky",
                        "structuredName": {
                            "firstName": "Sidney",
                            "lastName": "Lehky",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. R. Lehky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1714528"
                        ],
                        "name": "T. Sejnowski",
                        "slug": "T.-Sejnowski",
                        "structuredName": {
                            "firstName": "Terrence",
                            "lastName": "Sejnowski",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Sejnowski"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "And there have been a number of studies that have shown that under the right constraints, units in competitive networks can develop large oriented receptive fields (e.g.,  Lehky and Sejnowski 1990;  Linsker 1988; Sanger 1989)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 4271254,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "38a6ffc6a1698b935910ef25336cce07677d6a77",
            "isKey": false,
            "numCitedBy": 431,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "It is not known how the visual system is organized to extract information about shape from the continuous gradations of light and dark found on shaded surfaces of three-dimensional objects1,2. To investigate this question3,4, we used a learning algorithm to construct a neural network model which determines surface curvatures from images of simple geometrical surfaces. The receptive fields developed by units in the network were surprisingly similar to the actual receptive fields of neurons observed in the visual cortex5,6 which are commonly believed to be 'edge' or 'bar' detectors, but have never previously been associated with shading. Thus, our study illustrates the difficulty of trying to deduce neuronal function solely from determination of their receptive fields. It is also important to consider the connections a neuron makes with other neurons in subsequent stages of processing, which we call its 'projective field'."
            },
            "slug": "Network-model-of-shape-from-shading:-neural-arises-Lehky-Sejnowski",
            "title": {
                "fragments": [],
                "text": "Network model of shape-from-shading: neural function arises from both receptive and projective fields"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This study illustrates the difficulty of trying to deduce neuronal function solely from determination of their receptive fields, and it is also important to consider the connections a neuron makes with other neurons in subsequent stages of processing, which it is called its 'projective field'."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39409429"
                        ],
                        "name": "R. L. Valois",
                        "slug": "R.-L.-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "Valois",
                            "middleNames": [
                                "L.",
                                "de"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2129244"
                        ],
                        "name": "D. G. Albrecht",
                        "slug": "D.-G.-Albrecht",
                        "structuredName": {
                            "firstName": "Duane",
                            "lastName": "Albrecht",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. G. Albrecht"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40471674"
                        ],
                        "name": "Lisa G. Thorell",
                        "slug": "Lisa-G.-Thorell",
                        "structuredName": {
                            "firstName": "Lisa",
                            "lastName": "Thorell",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lisa G. Thorell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16496844,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e2f74bec30cc4e471919de4dfd27c45dbc7b4b9d",
            "isKey": false,
            "numCitedBy": 1118,
            "numCiting": 53,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Spatial-frequency-selectivity-of-cells-in-macaque-Valois-Albrecht",
            "title": {
                "fragments": [],
                "text": "Spatial frequency selectivity of cells in macaque visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2055557"
                        ],
                        "name": "R. Hingorani",
                        "slug": "R.-Hingorani",
                        "structuredName": {
                            "firstName": "Rajesh",
                            "lastName": "Hingorani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hingorani"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7863995,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "daa74351eb212549288ab08cbaae015aaab49adf",
            "isKey": false,
            "numCitedBy": 367,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a set of pyramid transforms that decompose an image into a set of basis functions that are (a) spatial frequency tuned, (b) orientation tuned, (c) spatially localized, and (d) self-similar. For computational reasons the set is also (e) orthogonal and lends itself to (f) rapid computation. The systems are derived from concepts in matrix algebra, but are closely connected to decompositions based on quadrature mirror filters. Our computations take place hierarchically, leading to a pyramid representation in which all of the basis functions have the same basic shape, and appear at many scales. By placing the high-pass and low-pass kernels on staggered grids, we can derived odd-tap QMF kernels that are quite compact. We have developed pyramids using separable, quincunx, and hexagonal kernels. Image data compression with the pyramids gives excellent results, both in terms of MSE and visual appearance. A non-orthogonal variant allows good performance with 3-tap basis kernels and the appropriate inverse sampling kernels."
            },
            "slug": "Orthogonal-Pyramid-Transforms-For-Image-Coding.-Adelson-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Orthogonal Pyramid Transforms For Image Coding."
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "A set of pyramid transforms that decompose an image into a set of basis functions that are spatial frequency tuned, orientation tuned, spatially localized, and self-similar are described, leading to a pyramid representation in which all of the basis functions have the same basic shape, and appear at many scales."
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31671308"
                        ],
                        "name": "D. Kersten",
                        "slug": "D.-Kersten",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Kersten",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Kersten"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 415,
                                "start": 254
                            }
                        ],
                        "text": "To develop an understanding of the functional properties of the mammalian visual system, a number of recent studies have proposed that one must understand the statistical regularity of the mammalian visual environment and its relation to the visual code ( e g , Field 1987, 1989, 1993; Atick and Redlich 1990, 1992; Bialek et al. 1991; Eckert and Buchsbaum 1993; Hancock et al. 1992; van Hateren 1992; Kersten 1987)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 18275764,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ded1e8ac4ed8150337c1c33eb2823924bce65285",
            "isKey": false,
            "numCitedBy": 147,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "One aspect of human image understanding is the ability to estimate missing parts of a natural image. This ability depends on the redundancy of the representation used to describe the class of images. In 1951, Shannon [Bell. Syst. Tech. J. 30, 50 (1951)] showed how to estimate bounds on the entropy and redundancy of an information source from predictability data. The entropy, in turn, gives a measure of the limits to error-free information compaction. An experiment was devised in which human observers interactively restored missing gray levels from 128 X 128 pixel pictures with 16 gray levels. For eight images, the redundancy ranged from 46%, for a complicated picture of foliage, to 74%, for a picture of a face. For almost-complete pictures, but not for noisy pictures, this performance can be matched by a nearest-neighbor predictor."
            },
            "slug": "Predictability-and-redundancy-of-natural-images.-Kersten",
            "title": {
                "fragments": [],
                "text": "Predictability and redundancy of natural images."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "An experiment was devised in which human observers interactively restored missing gray levels from 128 X 128 pixel pictures with 16 gray levels, and found that for almost-complete pictures, but not for noisy pictures, this performance can be matched by a nearest-neighbor predictor."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2302358"
                        ],
                        "name": "P. Burt",
                        "slug": "P.-Burt",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Burt",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Burt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8018433,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "83074157d165b6245915508d891b2d0cd066f3ad",
            "isKey": false,
            "numCitedBy": 6693,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a technique for image encoding in which local operators of many scales but identical shape serve as the basis functions. The representation differs from established techniques in that the code elements are localized in spatial frequency as well as in space. Pixel-to-pixel correlations are first removed by subtracting a lowpass filtered copy of the image from the image itself. The result is a net data compression since the difference, or error, image has low variance and entropy, and the low-pass filtered image may represented at reduced sample density. Further data compression is achieved by quantizing the difference image. These steps are then repeated to compress the low-pass image. Iteration of the process at appropriately expanded scales generates a pyramid data structure. The encoding process is equivalent to sampling the image with Laplacian operators of many scales. Thus, the code tends to enhance salient image features. A further advantage of the present code is that it is well suited for many image analysis tasks as well as for image compression. Fast algorithms are described for coding and decoding."
            },
            "slug": "The-Laplacian-Pyramid-as-a-Compact-Image-Code-Burt-Adelson",
            "title": {
                "fragments": [],
                "text": "The Laplacian Pyramid as a Compact Image Code"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A technique for image encoding in which local operators of many scales but identical shape serve as the basis functions, which tends to enhance salient image features and is well suited for many image analysis tasks as well as for image compression."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Commun."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1807117"
                        ],
                        "name": "T. Sanger",
                        "slug": "T.-Sanger",
                        "structuredName": {
                            "firstName": "Terence",
                            "lastName": "Sanger",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Sanger"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10138295,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "709b4bfc5198336ba5d70da987889a157f695c1e",
            "isKey": false,
            "numCitedBy": 1524,
            "numCiting": 92,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Optimal-unsupervised-learning-in-a-single-layer-Sanger",
            "title": {
                "fragments": [],
                "text": "Optimal unsupervised learning in a single-layer linear feedforward neural network"
            },
            "venue": {
                "fragments": [],
                "text": "Neural Networks"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8288524"
                        ],
                        "name": "M. Eckert",
                        "slug": "M.-Eckert",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Eckert",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Eckert"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2668183"
                        ],
                        "name": "G. Buchsbaum",
                        "slug": "G.-Buchsbaum",
                        "structuredName": {
                            "firstName": "Gershon",
                            "lastName": "Buchsbaum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Buchsbaum"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 415,
                                "start": 254
                            }
                        ],
                        "text": "To develop an understanding of the functional properties of the mammalian visual system, a number of recent studies have proposed that one must understand the statistical regularity of the mammalian visual environment and its relation to the visual code ( e g , Field 1987, 1989, 1993; Atick and Redlich 1990, 1992; Bialek et al. 1991; Eckert and Buchsbaum 1993; Hancock et al. 1992; van Hateren 1992; Kersten 1987)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 24130916,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "3b2a951b9dfc6afd424cc490eef05fdb3b0bb2e4",
            "isKey": false,
            "numCitedBy": 45,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "We investigate the hypothesis that the early visual system efficiently codes natural time varying images, first by tracking part of the image, then by matching the spatiotemporal properties of the neural pathway to those of the tracked image. A representation for the time varying image is formulated which consists of two spatiotemporal components, a velocity field component and a stationary component. We show, using digitized sequences of natural images, that the spatiotemporal spectrum and other attributes of the image markedly differ before and after tracking. The temporal frequency bandwidth and velocity distribution of the velocity field component are diminished in the region of tracking and broaden with increasing eccentricity from this region. On the other hand, the spectrum of the stationary component is unaffected by tracking. Comparison of the properties of the tracked image to those of the M and P pathways suggests that each pathway transmits different attributes of the tracked image. A retinal architecture which varies with eccentricity also matches the properties of the tracked image."
            },
            "slug": "Efficient-coding-of-natural-time-varying-images-in-Eckert-Buchsbaum",
            "title": {
                "fragments": [],
                "text": "Efficient coding of natural time varying images in the early visual system."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown, using digitized sequences of natural images, that the spatiotemporal spectrum and other attributes of the image markedly differ before and after tracking."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1935795"
                        ],
                        "name": "I. Thompson",
                        "slug": "I.-Thompson",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Thompson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Thompson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Visual neurons are known to show a range of bandwidths which average around 1.5 octaves but become somewhat narrower at higher frequencies (eg,  Tolhurst and Thompson 1982;  DeValois et ul. 1982).,This falls within the range of bandwidths that are most commonly found in the mammalian visual system (e.g.,  Tolhurst and Thompson 1982 )."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 24690002,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c9f07d97053908103b85fd2b771dd1fc92abf158",
            "isKey": true,
            "numCitedBy": 148,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "The amplitudes of the responses of over 300 neurons in area 17 of the cat were examined as a function of the spatial frequency of moving sinusoidal gratings. The optimal spatial frequency and the bandwidth of the tuning curves were determined. The bandwidth varied considerably from neuron to neuron. Neurons optimally responsive to high spatial frequencies tended to have narrower tuning curves than those responsive to lower frequencies. Neurons with narrow spatial frequency tuning curves also tended to have narrow orientation tuning curves. These observations suggest that linear spatial summation tends to occur over a relatively constant area of visual field despite marked differences in each neuron’s optimal spatial frequency, a prediction of one model of visual analysis. There was little difference in either the optimal spatial frequencies or the bandwidths of tuning for different functional classes of neuron. Neurons with broad tuning curves tended to be restricted to lamina IV and its environs, being concentrated in the deep part of lamina II–III and the upper part of lamina IV ab. Neurons with very low optimal spatial frequencies were uncommon and tended to be found either at the border of laminae II–III and IV or in lamina V. These laminar distributions are discussed with respect to the laminar differences in the projection of l. g. n. X- and Y- cells to the visual cortex."
            },
            "slug": "On-the-variety-of-spatial-frequency-selectivities-Tolhurst-Thompson",
            "title": {
                "fragments": [],
                "text": "On the variety of spatial frequency selectivities shown by neurons in area 17 of the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "The amplitudes of the responses of over 300 neurons in area 17 of the cat were examined and suggest that linear spatial summation tends to occur over a relatively constant area of visual field despite marked differences in each neuron’s optimal spatial frequency, a prediction of one model of visual analysis."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2151235171"
                        ],
                        "name": "S. Klein",
                        "slug": "S.-Klein",
                        "structuredName": {
                            "firstName": "Stanley",
                            "lastName": "Klein",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Klein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2595304"
                        ],
                        "name": "D. Levi",
                        "slug": "D.-Levi",
                        "structuredName": {
                            "firstName": "Dennis",
                            "lastName": "Levi",
                            "middleNames": [
                                "Michael"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Levi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11973345,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "4e9cc33cccf01a7fb6994d61f9ca3997307ef92b",
            "isKey": false,
            "numCitedBy": 285,
            "numCiting": 77,
            "paperAbstract": {
                "fragments": [],
                "text": "Bisection thresholds were measured as a function of the separation of the lines. For separations of less than 1.5 min, the addition of flanking lines facilitates bisection so that thresholds of less than 1 sec for discriminating the direction of offset could be reliably obtained. For larger separations an interval could be bisected to an accuracy of 1 part in 60. Experiments varying the length, luminance, and overlap of the lines suggest that different cues are used in these two regimes. A dual space-size analysis is presented that can account for these bisection thresholds over a wide range of experimental conditions. This quantitative analysis produces viewprints of the stimuli (analogous to the voiceprint of audition). Each viewprint shows the output of many spatial filters of different positions and sizes. A new filter shape is introduced that has advantages for modeling the visual system. The sensitivity of each filter is fixed by the contrast-response function. The analysis further shows that the limiting factors in spatial hyperacuity are both the contrast-response function and the spatial grain."
            },
            "slug": "Hyperacuity-thresholds-of-1-sec:-theoretical-and-Klein-Levi",
            "title": {
                "fragments": [],
                "text": "Hyperacuity thresholds of 1 sec: theoretical predictions and empirical validation."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A dual space-size analysis is presented that can account for these bisection thresholds over a wide range of experimental conditions and shows that the limiting factors in spatial hyperacuity are both the contrast-response function and the spatial grain."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2668183"
                        ],
                        "name": "G. Buchsbaum",
                        "slug": "G.-Buchsbaum",
                        "structuredName": {
                            "firstName": "Gershon",
                            "lastName": "Buchsbaum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Buchsbaum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3485613"
                        ],
                        "name": "A. Gottschalk",
                        "slug": "A.-Gottschalk",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Gottschalk",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Gottschalk"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23369551,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a641c50f2f3c5e5dd7814af62e0b8b0f15259d09",
            "isKey": false,
            "numCitedBy": 507,
            "numCiting": 86,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a systematic analysis of the role of opponent type processing in colour vision and the relation between opponent type colour transformations and the initial three colour mechanisms. It is shown that efficient information transmission is achieved by a transformation of the initial three colour mechanisms into an achromatic and two opponent chromatic channels. The derivation of the transformation is dependent solely on criteria from information theory. Thus it provides a logical rationale reconciling opponent type processing as an optimal necessary step after the initial three colour mechanisms, unifying respectively the Hering and Young-Helmholtz approaches to colour vision. The effects of chromatic adaptation on the spectral response of the achromatic and two chromatic channels are discussed from the point of view of information theory. It is argued that adaptation serves as a dynamic readjustment of these responses, necessary to meet criteria of efficient colour information transmission. The results are confronted with empirical observations to test the principles of the theory and the relation to other theories is discussed. Within the same framework the issue of trichromacy is discussed. It is argued that a broad class of typical colour spectra can effectively be represented by three significant degrees of freedom that make up a trichromatic system."
            },
            "slug": "Trichromacy,-opponent-colours-coding-and-optimum-in-Buchsbaum-Gottschalk",
            "title": {
                "fragments": [],
                "text": "Trichromacy, opponent colours coding and optimum colour information transmission in the retina"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "It is shown that efficient information transmission is achieved by a transformation of the initial three colour mechanisms into an achromatic and two opponent chromatic channels, providing a logical rationale reconciling opponent type processing as an optimal necessary step after the initialThree colour mechanisms."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "150259524"
                        ],
                        "name": "P. Foldiak",
                        "slug": "P.-Foldiak",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Foldiak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Foldiak"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 144,
                                "start": 107
                            }
                        ],
                        "text": "And it has been noted that Hebbian learning can, under the right conditions, find the principal components (Oja 1982; Foldiak 1989; Sanger 1989)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8917254,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "076e5a741d0c7485b1cf43b5c3ec4cde08e73ec0",
            "isKey": false,
            "numCitedBy": 296,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "A network of highly interconnected linear neuron-like processing units and a simple, local, unsupervised rule for the modification of connection strengths between these units are proposed. After training the network on a high (m) dimensional distribution of input vectors, the lower (n) dimensional output will be a projection into the subspace of the n largest principal components (the subspace spanned by the n eigenvectors of the largest eigenvalues of the input covariance matrix) and maximize the mutual information between the input and the output in the same way as principal component analysis does. The purely local nature of the synaptic modification rule (simple Hebbian and anti-Hebbian) makes the implementation of the network easier, faster, and biologically more plausible than rules depending on error propagation.<<ETX>>"
            },
            "slug": "Adaptive-network-for-optimal-linear-feature-Foldiak",
            "title": {
                "fragments": [],
                "text": "Adaptive network for optimal linear feature extraction"
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "A network of highly interconnected linear neuron-like processing units and a simple, local, unsupervised rule for the modification of connection strengths between these units are proposed, making the implementation of the network easier, faster, and biologically more plausible than rules depending on error propagation."
            },
            "venue": {
                "fragments": [],
                "text": "International 1989 Joint Conference on Neural Networks"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3152471"
                        ],
                        "name": "G. Blasdel",
                        "slug": "G.-Blasdel",
                        "structuredName": {
                            "firstName": "Gary",
                            "lastName": "Blasdel",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Blasdel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2655339"
                        ],
                        "name": "J. Lund",
                        "slug": "J.-Lund",
                        "structuredName": {
                            "firstName": "Jennifer",
                            "lastName": "Lund",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lund"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "115720808"
                        ],
                        "name": "D. Fitzpatrick",
                        "slug": "D.-Fitzpatrick",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Fitzpatrick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Fitzpatrick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 45420975,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "20761fef3142e9923fff157fb69467293306c023",
            "isKey": false,
            "numCitedBy": 197,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "We have exploited a technique for making small injections of horseradish peroxidase into single cortical laminae in order to study axonal projections in macaque striate cortex. In the preceding paper (Fitzpatrick, D., J. S. Lund, and G. G. Blasdel (1985) J. Neurosci. 5: 3329–3349) we examined the projections of cells in lamina 4C--cells that receive most of their input from the lateral geniculate nucleus. The present paper deals with the projections of neurons that lie outside of lamina 4C. Among our findings are several projections that previously had not been described in the monkey. These include: a strong and precise (point-to-point) projection from lamina 4B to lamina 2/3A, a reciprocal projection from 2/3A back to 4B, a definite projection from lamina 4B to 5B, as well as a prominent input to lamina 6 from 5B. In many cases, we find it possible to trace the flow of visual information through several “circuits” in striate cortex that have, as their output, projections to extrastriate cortex or to the brainstem. Our results offer additional insights in this regard since we are able, in many cases, to compare the lateral spreads of particular projections. These vary and can be separated into at least three categories: those that terminate in a precise, point-to-point, fashion, those that spread widely, and those that terminate in a laterally periodic fashion. In several cases we find evidence for a correlation between specific patterns of projection and known physiological differences between the topographies of laminae that are connected. In cases where two laminae possess similar topographies (for example, where both contain orderly maps for orientation) their interconnections appear precise, with little diffuse spread. In cases where two laminae are characterized by strikingly different topographies (where, for example, one contains an orderly map for orientation and the other a precise map for retinotopic position, but no specificity for orientation), the connections appear more diffuse."
            },
            "slug": "Intrinsic-connections-of-macaque-striate-cortex:-of-Blasdel-Lund",
            "title": {
                "fragments": [],
                "text": "Intrinsic connections of macaque striate cortex: axonal projections of cells outside lamina 4C"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The present paper deals with the projections of neurons that lie outside of lamina 4C--cells that receive most of their input from the lateral geniculate nucleus, and finds evidence for a correlation between specific patterns of projection and known physiological differences between the topographies of laminatione that are connected."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of neuroscience : the official journal of the Society for Neuroscience"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34931109"
                        ],
                        "name": "R. Baddeley",
                        "slug": "R.-Baddeley",
                        "structuredName": {
                            "firstName": "Roland",
                            "lastName": "Baddeley",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Baddeley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145160279"
                        ],
                        "name": "P. Hancock",
                        "slug": "P.-Hancock",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Hancock",
                            "middleNames": [
                                "J.",
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Hancock"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 336,
                                "start": 166
                            }
                        ],
                        "text": "A number of recent studies have discussed the similarities between the principal components of natural scenes and the receptive fields of cells in the visual pathway (Bossomaier and Snyder 1986; Atick and Redlich 1990, 1992; Atick 1992; Hancock et al. 1992; Baddeley and Hancock 1991; MacKay and Miller 1990; Derrico and Buchsbaum 1991)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16109464,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "4ba54bf31c417fb7241f47869e012a82b0b3d6ca",
            "isKey": false,
            "numCitedBy": 105,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "A neural net method is used to extract principal components from real-world images. The initial components are a Gaussian followed by horizontal and vertical operators, starting with the first derivative and moving to successively higher orders. Two of the components are ‘bar-detectors’. Their measured orientation selectivity is similar to that suggested by Foster & Ward (Proc. R. Soc. Lond. B 243, 75 (1991)) to account for brief-exposure psychophysical data. In tests with noise images, the ratio of sensitivity between the two components is controlled by the degree of anisotropy in the image."
            },
            "slug": "A-statistical-analysis-of-natural-images-matches-Baddeley-Hancock",
            "title": {
                "fragments": [],
                "text": "A statistical analysis of natural images matches psychophysically derived orientation tuning curves"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "A neural net method is used to extract principal components from real-world images and two of the components are ‘bar-detectors’, which are similar to that suggested by Foster & Ward to account for brief-exposure psychophysical data."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B: Biological Sciences"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "150165387"
                        ],
                        "name": "J. Urgen Schmidhuber",
                        "slug": "J.-Urgen-Schmidhuber",
                        "structuredName": {
                            "firstName": "J",
                            "lastName": "Urgen Schmidhuber",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Urgen Schmidhuber"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "In this case, the image is described as having a “factorial code” (Barlow et nl. 1989; Barlow 1987;  Schmidhuber 1992;  Atick et a/. 1993).,Techniques such as those of Intrator (1992, 1993), Foldiak (1990),  Schmidhuber (1992) , and Linsker (1993) may ultimately provide insights into this problem, but their work demonstrates that the solution may not be a simple one."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2142508,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "675d381653da0d2825ae37ab06069a1525fafb79",
            "isKey": false,
            "numCitedBy": 179,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "I propose a novel general principle for unsupervised learning of distributed non-redundant internal representations of input patterns. The principle is based on two opposing forces. For each represen-tational unit there is an adaptive predictor which tries to predict the unit from the remaining units. In turn, each unit tries to react to the environment such that it minimizes its predictability. This encourages each unit to lteràbstract concepts' out of the environmental input such that these concepts are statistically independent of those upon which the other units focus. I discuss various simple yet potentially powerful implementations of the principle which aim at nding binary factorial codes (Bar-low et al., 1989), i.e. codes where the probability of the occurrence of a particular input is simply the product of the probabilities of the corresponding code symbols. Such codes are potentially relevant for (1) segmentation tasks, (2) speeding up supervised learning, (3) novelty detection. Methods for nding factorial codes automatically implement Occam's razor for nding codes using a minimal number of units. Unlike previous methods the novel principle has a potential for removing not only linear but also non-linear output redundancy. Illustrative experiments show that algorithms based on the principle of predictability minimization are practically feasible. The nal part of this paper describes an entirely local algorithm that has a potential for learning unique representations of extended input sequences."
            },
            "slug": "Learning-Factorial-Codes-by-Predictability-Schmidhuber",
            "title": {
                "fragments": [],
                "text": "Learning Factorial Codes by Predictability Minimization"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "An entirely local algorithm is described that has a potential for learning unique representations of extended input sequences that are potentially relevant for segmentation tasks, speeding up supervised learning, and novelty detection."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1774394"
                        ],
                        "name": "T. Bossomaier",
                        "slug": "T.-Bossomaier",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Bossomaier",
                            "middleNames": [
                                "R.",
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Bossomaier"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1821772"
                        ],
                        "name": "A. Snyder",
                        "slug": "A.-Snyder",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Snyder",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Snyder"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "A number of recent studies have discussed the similarities between the principal components of natural scenes and the receptive fields of cells in the visual pathway ( Bossomaier and Snyder 1986;  Atick and Redlich 1990, 1992; Atick 1992; Hancock et al. 1992; Baddeley and Hancock 1991; MacKay and Miller 1990; Derrico and Buchsbaum 1991)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 35223335,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "095bcbbd93a4f9024e42f972ebf291b5b891f2e4",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Why-spatial-frequency-processing-in-the-visual-Bossomaier-Snyder",
            "title": {
                "fragments": [],
                "text": "Why spatial frequency processing in the visual cortex?"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37658617"
                        ],
                        "name": "A. Dobbins",
                        "slug": "A.-Dobbins",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Dobbins",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Dobbins"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39608310"
                        ],
                        "name": "Lee A. Iverson",
                        "slug": "Lee-A.-Iverson",
                        "structuredName": {
                            "firstName": "Lee",
                            "lastName": "Iverson",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lee A. Iverson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9847300,
            "fieldsOfStudy": [
                "Sociology"
            ],
            "id": "8dc4cb0f204368e1158b98b95105cbacece054d8",
            "isKey": false,
            "numCitedBy": 165,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of detecting curves in visual images arises in both computer vision and biological visual systems. Our approach integrates constraints from these two sources and suggests that there are two different stages to curve detection, the first resulting in a local description, and the second in a global one. Each stage involves a different style of computation: in the first stage, hypotheses are represented explicitly and coarsely in a fixed, preconfigured architecture; in the second stage, hypotheses are represented implicitly and more finely in a dynamically constructed architecture. We also show how these stages could be related to physiology, specifying the earlier parts in a relatively fine-grained fashion and the later ones more coarsely."
            },
            "slug": "Two-Stages-of-Curve-Detection-Suggest-Two-Styles-of-Zucker-Dobbins",
            "title": {
                "fragments": [],
                "text": "Two Stages of Curve Detection Suggest Two Styles of Visual Computation"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This work suggests that there are two different stages to curve detection, the first resulting in a local description, and the second in a global one, and shows how these stages could be related to physiology."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1952600"
                        ],
                        "name": "M. Webster",
                        "slug": "M.-Webster",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Webster",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Webster"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113588000"
                        ],
                        "name": "R. L. de Valois",
                        "slug": "R.-L.-de-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "de Valois",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. de Valois"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12077774,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "58e6e56adf3dd3181324caf9ec0d8d30a8fc8768",
            "isKey": false,
            "numCitedBy": 222,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "If striate cells had the receptive-field (RF) shapes classically attributed to them, their preferred spatial frequencies would vary considerably with orientation. Other models of RF shape would predict a greater independence between orientation and spatial-frequency tuning. We have examined this by recording the responses of cat striate-cortex cells to a wide range of different spatial-frequency and orientation combinations. In almost all cells studied, peak orientation did not consistently vary with spatial frequency, but the majority of cells showed some change in peak spatial-frequency tuning with orientation. The amount of change in peak spatial frequency tended to be greater for cells that were narrowly tuned for orientation. However, cells narrowly (and also very broadly) tuned for spatial frequency tended to show considerable independence of spatial-frequency and orientation tuning, and in all but a few cells the degree of change was less than predicted by the classic RF model. Such cells were found to fire only to patterns whose local spatial spectra fell within a compact, restricted, roughly circular two-dimensional spatial-frequency region. We conclude that the two-dimensional RF shape of striate cells more closely approximates that predicted by a two-dimensional Gabor model or by a Gaussian-derivative model than it does the classic shape based on the output of geniculate cells with aligned RF's."
            },
            "slug": "Relationship-between-spatial-frequency-and-tuning-Webster-Valois",
            "title": {
                "fragments": [],
                "text": "Relationship between spatial-frequency and orientation tuning of striate-cortex cells."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The two-dimensional RF shape of striate cells more closely approximates that predicted by a two- dimensional Gabor model or by a Gaussian-derivative model than it does the classic shape based on the output of geniculate cells with aligned RF's."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781325"
                        ],
                        "name": "J. Daugman",
                        "slug": "J.-Daugman",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Daugman",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Daugman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9271650,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "02f89cd1fd6f013a1a301a292936ff8fb06aff25",
            "isKey": false,
            "numCitedBy": 3420,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "Two-dimensional spatial linear filters are constrained by general uncertainty relations that limit their attainable information resolution for orientation, spatial frequency, and two-dimensional (2D) spatial position. The theoretical lower limit for the joint entropy, or uncertainty, of these variables is achieved by an optimal 2D filter family whose spatial weighting functions are generated by exponentiated bivariate second-order polynomials with complex coefficients, the elliptic generalization of the one-dimensional elementary functions proposed in Gabor's famous theory of communication [J. Inst. Electr. Eng. 93, 429 (1946)]. The set includes filters with various orientation bandwidths, spatial-frequency bandwidths, and spatial dimensions, favoring the extraction of various kinds of information from an image. Each such filter occupies an irreducible quantal volume (corresponding to an independent datum) in a four-dimensional information hyperspace whose axes are interpretable as 2D visual space, orientation, and spatial frequency, and thus such a filter set could subserve an optimally efficient sampling of these variables. Evidence is presented that the 2D receptive-field profiles of simple cells in mammalian visual cortex are well described by members of this optimal 2D filter family, and thus such visual neurons could be said to optimize the general uncertainty relations for joint 2D-spatial-2D-spectral information resolution. The variety of their receptive-field dimensions and orientation and spatial-frequency bandwidths, and the correlations among these, reveal several underlying constraints, particularly in width/length aspect ratio and principal axis organization, suggesting a polar division of labor in occupying the quantal volumes of information hyperspace.(ABSTRACT TRUNCATED AT 250 WORDS)"
            },
            "slug": "Uncertainty-relation-for-resolution-in-space,-and-Daugman",
            "title": {
                "fragments": [],
                "text": "Uncertainty relation for resolution in space, spatial frequency, and orientation optimized by two-dimensional visual cortical filters."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Evidence is presented that the 2D receptive-field profiles of simple cells in mammalian visual cortex are well described by members of this optimal 2D filter family, and thus such visual neurons could be said to optimize the general uncertainty relations for joint 2D-spatial-2D-spectral information resolution."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2281877"
                        ],
                        "name": "J. Atick",
                        "slug": "J.-Atick",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Atick",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Atick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5062473"
                        ],
                        "name": "Zhaoping Li",
                        "slug": "Zhaoping-Li",
                        "structuredName": {
                            "firstName": "Zhaoping",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zhaoping Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144513847"
                        ],
                        "name": "A. Redlich",
                        "slug": "A.-Redlich",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Redlich",
                            "middleNames": [
                                "Norman"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Redlich"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43473047,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3b4311a172097266fb29f04437085d622ced514e",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "What-does-post-adaptation-color-appearance-reveal-Atick-Li",
            "title": {
                "fragments": [],
                "text": "What does post-adaptation color appearance reveal about cortical color representation?"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2315855"
                        ],
                        "name": "T. P. Kaushal",
                        "slug": "T.-P.-Kaushal",
                        "structuredName": {
                            "firstName": "Tej",
                            "lastName": "Kaushal",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. P. Kaushal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145666307"
                        ],
                        "name": "G. Mitchison",
                        "slug": "G.-Mitchison",
                        "structuredName": {
                            "firstName": "Graeme",
                            "lastName": "Mitchison",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Mitchison"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28107770,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5074f2219ddac70995f0a5e81ee2e892cb884b56",
            "isKey": false,
            "numCitedBy": 203,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "To determine whether a particular sensory event is a reliable predictor of reward or punishment it is necessary to know the prior probability of that event. If the variables of a sensory representation normally occur independently of each other, then it is possible to derive the prior probability of any logical function of the variables from the prior probabilities of the individual variables, without any additional knowledge; hence such a representation enormously enlarges the scope of definable events that can be searched for reliable predictors. Finding a Minimum Entropy Code is a possible method of forming such a representation, and methods for doing this are explored in this paper. The main results are (1) to show how to find such a code when the probabilities of the input states form a geometric progression, as is shown to be nearly true for keyboard characters in normal text; (2) to show how a Minimum Entropy Code can be approximated by repeatedly recoding pairs, triples, etc. of an original 7-bit code for keyboard characters; (3) to prove that in some cases enlarging the capacity of the output channel can lower the entropy."
            },
            "slug": "Finding-Minimum-Entropy-Codes-Barlow-Kaushal",
            "title": {
                "fragments": [],
                "text": "Finding Minimum Entropy Codes"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Find a Minimum Entropy Code is a possible method of forming such a representation, and methods for doing this are explored, and the main results are to show how to find such a code when the probabilities of the input states form a geometric progression."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746242"
                        ],
                        "name": "S. Mallat",
                        "slug": "S.-Mallat",
                        "structuredName": {
                            "firstName": "Stéphane",
                            "lastName": "Mallat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mallat"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2356353,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b78626ce1a562c05b1c06f9c805e839f9760b9ab",
            "isKey": false,
            "numCitedBy": 20814,
            "numCiting": 87,
            "paperAbstract": {
                "fragments": [],
                "text": "Multiresolution representations are effective for analyzing the information content of images. The properties of the operator which approximates a signal at a given resolution were studied. It is shown that the difference of information between the approximation of a signal at the resolutions 2/sup j+1/ and 2/sup j/ (where j is an integer) can be extracted by decomposing this signal on a wavelet orthonormal basis of L/sup 2/(R/sup n/), the vector space of measurable, square-integrable n-dimensional functions. In L/sup 2/(R), a wavelet orthonormal basis is a family of functions which is built by dilating and translating a unique function psi (x). This decomposition defines an orthogonal multiresolution representation called a wavelet representation. It is computed with a pyramidal algorithm based on convolutions with quadrature mirror filters. Wavelet representation lies between the spatial and Fourier domains. For images, the wavelet representation differentiates several spatial orientations. The application of this representation to data compression in image coding, texture discrimination and fractal analysis is discussed. >"
            },
            "slug": "A-Theory-for-Multiresolution-Signal-Decomposition:-Mallat",
            "title": {
                "fragments": [],
                "text": "A Theory for Multiresolution Signal Decomposition: The Wavelet Representation"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is shown that the difference of information between the approximation of a signal at the resolutions 2/sup j+1/ and 2/Sup j/ can be extracted by decomposing this signal on a wavelet orthonormal basis of L/sup 2/(R/sup n/), the vector space of measurable, square-integrable n-dimensional functions."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7025163"
                        ],
                        "name": "K. Rockland",
                        "slug": "K.-Rockland",
                        "structuredName": {
                            "firstName": "Kathleen",
                            "lastName": "Rockland",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Rockland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2655339"
                        ],
                        "name": "J. Lund",
                        "slug": "J.-Lund",
                        "structuredName": {
                            "firstName": "Jennifer",
                            "lastName": "Lund",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lund"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 22708243,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3b307f3c449b1f7d95f547977df773f98367bdcf",
            "isKey": false,
            "numCitedBy": 547,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "Intracortical injections of horseradish peroxidase (HRP) reveal a system of periodically organized intrinsic connections in primate striate cortex. In layers 2 and 3 these connections form a reticular or latticelike pattern, extending for about 1.5–2.0 mm around an injection. This connectional lattice is composed of HRP‐labeled walls (350–450 μm apart in Saimiri and about 500–600 μm in macaque) surrounding unlabeled central lacunae. Within the lattice walls there are regularly arranged punctate loci of particularly dense HRP label, appearing as isolated patches as the lattice wall labeling thins further from the injection site. A periodic organization has also been demonstrated for the intrinsic connections in layer 4B, which are apparently in register with the supragranular periodicities, although separated from these by a thin unlabeled region. The 4B lattice is particularly prominent in squirrel monkey, extending for 2–3 mm from an injection. In both layers, these intrinsic connections are demonstrated by orthogradely and retrogradely transported HRP and seem to reflect a system of neurons with long horizontal axon collaterals, presumably with arborizations at regularly spaced intervals. The intrinsic connectional lattice in layers 2 and 3 resembles the repetitive array of cytochrome oxidase activity in these layers; but despite similarities of dimension and pattern, the two systems do not appear identical. In primate, as previously described in tree shrews (Rockland et al., 1982), the HRP‐labeled anatomical connections resemble the pattern of 2‐deoxy‐glucose accumulation resulting from stimulation with oriented lines, although the functional importance of these connections remains obscure."
            },
            "slug": "Intrinsic-laminar-lattice-connections-in-primate-Rockland-Lund",
            "title": {
                "fragments": [],
                "text": "Intrinsic laminar lattice connections in primate visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "In primate, as previously described in tree shrews, the HRP‐labeled anatomical connections resemble the pattern of 2‐deoxy‐glucose accumulation resulting from stimulation with oriented lines, although the functional importance of these connections remains obscure."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1828659"
                        ],
                        "name": "A. Watson",
                        "slug": "A.-Watson",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Watson",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Watson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 73
                            }
                        ],
                        "text": ", Gabor functions) have proved to be popular models of the visual cortex (Watson 1983; Daugman 1985; Field 1987)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 56888867,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "7a9aff38b096e675ee03abe341592ec45e4aeba6",
            "isKey": false,
            "numCitedBy": 197,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "In spite of the large number of intelligent, energetic people engaged in the study of vision, it often seems that we advance our understanding of this process at an excruciatingly slow pace. Why is this so? I believe that it is the fault of our models. We have been seduced by the simplicity of explanation available in the physical sciences, and try to describe the vast complexity of vision with models that would not do justice to a sphere rolling down an inclined plane."
            },
            "slug": "Detection-and-Recognition-of-Simple-Spatial-Forms-Watson",
            "title": {
                "fragments": [],
                "text": "Detection and Recognition of Simple Spatial Forms"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "In spite of the large number of intelligent, energetic people engaged in the study of vision, it often seems that the understanding of this process at an excruciatingly slow pace is the fault of the authors' models."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145852650"
                        ],
                        "name": "D. Mackay",
                        "slug": "D.-Mackay",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mackay",
                            "middleNames": [
                                "J.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mackay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1758194"
                        ],
                        "name": "K. Miller",
                        "slug": "K.-Miller",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Miller",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Miller"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10292734,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b8de5d975cbd5c1c18068408cddd036f903692ad",
            "isKey": false,
            "numCitedBy": 55,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Linsker has reported the development of center-surround receptive fields and oriented receptive fields in simulations of a Hebb-type equation in a linear network. The dynamics of the learning rule are analyzed in terms of the eigenvectors of the covariance matrix of cell activities. Analytic and computational results for Linsker's covariance matrices, and some general theorems, lead to an explanation of the emergence of center-surround and certain oriented structures. We estimate criteria for the parameter regime in which center-surround structures emerge."
            },
            "slug": "Analysis-of-Linsker's-Simulations-of-Hebbian-Rules-Mackay-Miller",
            "title": {
                "fragments": [],
                "text": "Analysis of Linsker's Simulations of Hebbian Rules"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Analytic and computational results for Linsker's covariance matrices, and some general theorems, lead to an explanation of the emergence of center-surround and certain oriented structures."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8909922"
                        ],
                        "name": "N. Intrator",
                        "slug": "N.-Intrator",
                        "structuredName": {
                            "firstName": "Nathan",
                            "lastName": "Intrator",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Intrator"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "There is a problem related to this, described as “projection pursuit” (e.g., Friedman 1987; Huber 1985;  Intrator 1992,1993 )., Intrator (1992, 1993)  has noted that one should look for projections (histograms) that are as far from gaussian as possible.,Techniques such as those of  Intrator (1992, 1993) , Foldiak (1990), Schmidhuber (1992), and Linsker (1993) may ultimately provide insights into this problem, but their work demonstrates that the solution may not be a simple one."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15475544,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "136fc611e49e5f3676265a288b78e473a752783b",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 65,
            "paperAbstract": {
                "fragments": [],
                "text": "A novel unsupervised neural network for dimensionality reduction that seeks directions emphasizing multimodality is presented, and its connection to exploratory projection pursuit methods is discussed. This leads to a new statistical insight into the synaptic modification equations governing learning in Bienenstock, Cooper, and Munro (BCM) neurons (1982). The importance of a dimensionality reduction principle based solely on distinguishing features is demonstrated using a phoneme recognition experiment. The extracted features are compared with features extracted using a backpropagation network."
            },
            "slug": "Feature-Extraction-Using-an-Unsupervised-Neural-Intrator",
            "title": {
                "fragments": [],
                "text": "Feature Extraction Using an Unsupervised Neural Network"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A novel unsupervised neural network for dimensionality reduction that seeks directions emphasizing multimodality is presented, and its connection to exploratory projection pursuit methods is discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3434639"
                        ],
                        "name": "Y. Tadmor",
                        "slug": "Y.-Tadmor",
                        "structuredName": {
                            "firstName": "Yoav",
                            "lastName": "Tadmor",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Tadmor"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2054059975"
                        ],
                        "name": "T. Chao",
                        "slug": "T.-Chao",
                        "structuredName": {
                            "firstName": "Tang",
                            "lastName": "Chao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Chao"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27840815,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "1284ea5fac0a5f73e5d7036641255cb89bf1e8c6",
            "isKey": false,
            "numCitedBy": 281,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Amplitude-spectra-of-natural-images.-Tolhurst-Tadmor",
            "title": {
                "fragments": [],
                "text": "Amplitude spectra of natural images."
            },
            "venue": {
                "fragments": [],
                "text": "Ophthalmic & physiological optics : the journal of the British College of Ophthalmic Opticians"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44962969,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "6711ba2277ccfba5349d5d8fc616e6a5e18d712d",
            "isKey": false,
            "numCitedBy": 152,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "I feel deeply honoured by your invitation to give the Bartlett lecture, and am especially glad to do so in Holland, the home of so many distinguished psychologists of sensation and perception. And there is a third reason why it has given me much pleasure, for Sir Frederick Bartlett was one of those who had an important influence on the direction of my career some 40 years ago. I had to decide whether to spend my last year at Cambridge reading psychology or physiology, so I attended a short course of introductory lectures he gave in July. About half a dozen of us sat on upright wooden chairs circled around him as he sat in an armchair, smiling benignly. The first thing he did was to tell us to close our notebooks, for he was not going to say anything that would help us to pass any exams. And I believe the very last words of his last lecture were, “So you see it is all very difficult”. I was very glad he said that, for I had in fact found it all very heavy going: my brain seemed always to be lost in clouds of uncertainty when “remembering”, “thinking”, or “perceiving” were mentioned, because there was no conceptual framework for these processes except the words themselves and others spun around them. What I was looking for were the definable quantities of physics, chemistry and even physiology, these I could handle conceptually in their geometric and functional interactions, whereas I always find a purely verbal argument about abstractions difficult to follow and impossible to believe. So this lack of any nonverbal conceptual framework was very painful."
            },
            "slug": "The-Twelfth-Bartlett-Memorial-Lecture:-The-Role-of-Barlow",
            "title": {
                "fragments": [],
                "text": "The Twelfth Bartlett Memorial Lecture: The Role of Single Neurons in the Psychology of Perception"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "I feel deeply honoured to give the Bartlett lecture, and am especially glad to do so in Holland, the home of so many distinguished psychologists of sensation and perception, for Sir Frederick Bartlett was one of those who had an important influence on the direction of my career some 40 years ago."
            },
            "venue": {
                "fragments": [],
                "text": "The Quarterly journal of experimental psychology. A, Human experimental psychology"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781325"
                        ],
                        "name": "J. Daugman",
                        "slug": "J.-Daugman",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Daugman",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Daugman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Recently, a number of studies have proposed that spatial coding by the mammalian visual system is well described by codes that make use of the correlations to reduce the redundancy of the sensory representation (e.g., Atick and Redlich 1990, 1992; Atick 1992; Barlow and Foldiak 1989;  Daugman 1988,1991;  Linsker 1988; Foldiak 1990; Sanger 1989).,The published response histograms by both Zetzsche (1990) and  Daugman (1988)  also suggest that codes based on the properties of the mammalian visual system will show positive kurtosis in response to natural scenes."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1984348,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6513888c5ef473bdbb3167c7b52f0985be071f7a",
            "isKey": false,
            "numCitedBy": 1899,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "A three-layered neural network is described for transforming two-dimensional discrete signals into generalized nonorthogonal 2-D Gabor representations for image analysis, segmentation, and compression. These transforms are conjoint spatial/spectral representations, which provide a complete image description in terms of locally windowed 2-D spectral coordinates embedded within global 2-D spatial coordinates. In the present neural network approach, based on interlaminar interactions involving two layers with fixed weights and one layer with adjustable weights, the network finds coefficients for complete conjoint 2-D Gabor transforms without restrictive conditions. In wavelet expansions based on a biologically inspired log-polar ensemble of dilations, rotations, and translations of a single underlying 2-D Gabor wavelet template, image compression is illustrated with ratios up to 20:1. Also demonstrated is image segmentation based on the clustering of coefficients in the complete 2-D Gabor transform. >"
            },
            "slug": "Complete-discrete-2-D-Gabor-transforms-by-neural-Daugman",
            "title": {
                "fragments": [],
                "text": "Complete discrete 2-D Gabor transforms by neural networks for image analysis and compression"
            },
            "tldr": {
                "abstractSimilarityScore": 53,
                "text": "A three-layered neural network based on interlaminar interactions involving two layers with fixed weights and one layer with adjustable weights finds coefficients for complete conjoint 2-D Gabor transforms without restrictive conditions for image analysis, segmentation, and compression."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Acoust. Speech Signal Process."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3056361"
                        ],
                        "name": "J. Friedman",
                        "slug": "J.-Friedman",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Friedman",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Friedman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "There is a problem related to this, described as “projection pursuit” (e.g.,  Friedman 1987;  Huber 1985; Intrator 1992,1993)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 120727315,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cce218b91cf634413ef9a71f702bd37b1a9ad2a6",
            "isKey": false,
            "numCitedBy": 590,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract A new projection pursuit algorithm for exploring multivariate data is presented that has both statistical and computational advantages over previous methods. A number of practical issues concerning its application are addressed. A connection to multivariate density estimation is established, and its properties are investigated through simulation studies and application to real data. The goal of exploratory projection pursuit is to use the data to find low- (one-, two-, or three-) dimensional projections that provide the most revealing views of the full-dimensional data. With these views the human gift for pattern recognition can be applied to help discover effects that may not have been anticipated in advance. Since linear effects are directly captured by the covariance structure of the variable pairs (which are straightforward to estimate) the emphasis here is on the discovery of nonlinear effects such as clustering or other general nonlinear associations among the variables. Although arbitrary ..."
            },
            "slug": "Exploratory-Projection-Pursuit-Friedman",
            "title": {
                "fragments": [],
                "text": "Exploratory Projection Pursuit"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "A new projection pursuit algorithm for exploring multivariate data is presented that has both statistical and computational advantages over previous methods and the emphasis here is on the discovery of nonlinear effects such as clustering or other general nonlinear associations among the variables."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3434639"
                        ],
                        "name": "Y. Tadmor",
                        "slug": "Y.-Tadmor",
                        "structuredName": {
                            "firstName": "Yoav",
                            "lastName": "Tadmor",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Tadmor"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2054059975"
                        ],
                        "name": "T. Chao",
                        "slug": "T.-Chao",
                        "structuredName": {
                            "firstName": "Tang",
                            "lastName": "Chao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Chao"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 73118065,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "d6b8ea30017d7f6e1c317b1e196098af5d0de93f",
            "isKey": false,
            "numCitedBy": 275,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Several studies have suggested that the amplitude spectra of photographs of natural scenes are remarkably similar and have the form: This is, of course, a straight line with slope of −1.0 when plotted on double logarithmic coordinates. We have examined the amplitude spectra of 135 digitized photographs of natural scenes and have Found that relatively few images conform exactly to the suggestion. About 25% of the images in our sample have spectra which show significant curvature when plotted on log log coordinates. The best‐fitting regression lines have slopes that range from −0.8 to −1.5: the average slope is −1.2, rather sleeper than previously suggested."
            },
            "slug": "Amplitude-spectra-of-natural-images-Tolhurst-Tadmor",
            "title": {
                "fragments": [],
                "text": "Amplitude spectra of natural images"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "The amplitude spectra of 135 digitized photographs of natural scenes are examined and it is found that relatively few images conform exactly to the suggestion."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52070127"
                        ],
                        "name": "佐藤 保",
                        "slug": "佐藤-保",
                        "structuredName": {
                            "firstName": "佐藤",
                            "lastName": "保",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "佐藤 保"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3204803,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "51f905e6854da20541f84a14e590bc9aac75765d",
            "isKey": false,
            "numCitedBy": 146,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Suppose that we have a set of p-dimensional random variables x. Typically we will be in a situation where we have n observations of these random variables, and the parameters of their distribution, such as means, variances and covari-ances are estimated from the values of the observations, but for the moment we think about the distribution of the underlying random variables rather than the particular observations. The basic idea of principal components is to try to describe p dimensional data in as small a number of dimensions (less than p) as possible, while preserving as much as possible of the structures involved. In doing this, we concentrate on variances. The rst step is to look for a linear function z 1 = 1 T x or z 1 = 1 T (x ?) of the elements of x which has maximum variance, where 1 is a vector of p components 11 , 21 , : : : , p1 (beware that some other authors write the suuces the other way round). Note we often subtract the mean. Then 1 T x = 11 x 1 + 21 x 2 + + p1 x p = p X j=1 j1 x j : Next, we look for a linear function z 2 = 2 T x uncorrelated with 1 T x which has maximum variance subject to this condition, and so on, so that at the kth stage a linear function z k = k x is found which has maximum variance subject to being uncorrelated with 1 T x, 2 T x, : : : , k?1 T x. We refer to the kth derived variable k T x as the kth principal component. We stop after the mth stage when, in some sense, the majority of the variation has been accounted for. Before proceeding further, let us recall some results on means and variances of linear functions. Suppose x is any p-dimensional random variable, and that is any constant p-dimensional vector. Then the mean of T x is"
            },
            "slug": "Principal-Components-佐藤",
            "title": {
                "fragments": [],
                "text": "主成分分析(Principal Components)の経済分析への応用"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1889515"
                        ],
                        "name": "L. Maloney",
                        "slug": "L.-Maloney",
                        "structuredName": {
                            "firstName": "Laurence",
                            "lastName": "Maloney",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Maloney"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 201,
                                "start": 150
                            }
                        ],
                        "text": "This has led investigators to suggest that the three cone types found in primate vision provide an efficient description of our chromatic environment (e.g., Buchsbaum and Gottschalk 1983; Maloney 1986)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 39948153,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d07ba509ff6989d81071e4298b5e50ddbed52842",
            "isKey": false,
            "numCitedBy": 776,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Recent computational models of color vision demonstrate that it is possible to achieve exact color constancy over a limited range of lights and surfaces described by linear models. The success of these computational models hinges on whether any sizable range of surface spectral reflectances can be described by a linear model with about three parameters. In the first part of this paper, I analyze two large sets of empirical surface spectral reflectances and examine three conjectures concerning constraints on surface reflectance: that empirical surface reflectances fall within a linear model with a small number of parameters, that empirical surface reflectances fall within a linear model composed of band-limited functions with a small number of parameters, and that the shape of the spectral-sensitivity curves of human vision enhance the fit between empirical surface reflectances and a linear model. I conclude that the first and second conjectures hold for the two sets of spectral reflectances analyzed but that the number of parameters required to model the spectral reflectances is five to seven, not three. A reanalysis of the empirical data that takes human visual sensitivity into account gives more promising results. The linear models derived provide excellent fits to the data with as few as three or four parameters, confirming the third conjecture. The results suggest that constraints on possible surface-reflectance functions and the \"filtering\" properties of the shapes of the spectral-sensitivity curves of photoreceptors can both contribute to color constancy. In the last part of the paper I derive the relation between the number of photoreceptor classes present in vision and the \"filtering\" properties of each class. The results of this analysis reverse a conclusion reached by Barlow: the \"filtering\" properties of human photoreceptors are consistent with a trichromatic visual system that is color constant."
            },
            "slug": "Evaluation-of-linear-models-of-surface-spectral-of-Maloney",
            "title": {
                "fragments": [],
                "text": "Evaluation of linear models of surface spectral reflectance with small numbers of parameters."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The results suggest that constraints on possible surface-reflectance functions and the \"filtering\" properties of the shapes of the spectral-sensitivity curves of photoreceptors can both contribute to color constancy."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "71335571"
                        ],
                        "name": "G. J. Burton",
                        "slug": "G.-J.-Burton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Burton",
                            "middleNames": [
                                "John"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. J. Burton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3432839"
                        ],
                        "name": "I. Moorhead",
                        "slug": "I.-Moorhead",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Moorhead",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Moorhead"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Natural scenes have been shown to have spectra that fall as roughly l/f ( Burton and Moorhead 1987;  Field 1987, 1993; Tolhurst rt a/. 1992)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 44415466,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "909731ea61cb25fe8d96cbc2d8757f4783debb1f",
            "isKey": false,
            "numCitedBy": 479,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "Digitized records of terrain scenes were produced using a technique of photographic colorimetry. Each record consisted of three tristimulus images (X, Y, and Z) which were analyzed for their color statistics, spatial frequency content, and image correlation. Interactions between color and space were examined using a cone receptor transformation. It is shown that the scene amplitude spectra follow an approximate reciprocal variation with frequency, and that the correlation function can be described by a one-step autoregressive model. The results are discussed in terms of methods for optimum image coding in human and machine vision."
            },
            "slug": "Color-and-spatial-structure-in-natural-scenes.-Burton-Moorhead",
            "title": {
                "fragments": [],
                "text": "Color and spatial structure in natural scenes."
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "It is shown that the scene amplitude spectra follow an approximate reciprocal variation with frequency, and that the correlation function can be described by a one-step autoregressive model."
            },
            "venue": {
                "fragments": [],
                "text": "Applied optics"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2058365460"
                        ],
                        "name": "J. Austin",
                        "slug": "J.-Austin",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Austin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Austin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "However, several authors have noted that codes that produce sparse outputs may provide several advantages for representing sensory information (eg, Barlow 1972, 1985;  Palm 1980;  Baum rt a/. 1988).,Several authors have noted that when the inputs to the networks are sparse, the networks can store more memories and provide more effective retrieval with partial information ( Palm 1980;  Baum et al. 1988)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 7355029,
            "fieldsOfStudy": [
                "Psychology",
                "Computer Science",
                "Biology"
            ],
            "id": "386db34312f780b8c1b01f43cbe6d2a19f8c97aa",
            "isKey": false,
            "numCitedBy": 242,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "This section considers how neural networks can be used as associative memory devices. It first describes what an associative memory is, and then moves on to describe associative memories based on feedforward neural networks and associative memories based on recurrent networks. The section also describes associative memory systems based on cognitive models. It also highlights the ability of neural-network-based systems to deal with uncertain data as compared with conventional associative memory systems."
            },
            "slug": "Associative-memory-Austin",
            "title": {
                "fragments": [],
                "text": "Associative memory"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "This section considers how neural networks can be used as associative memory devices and describes associative remembering systems based on feedforward neural networks and associative memories based on recurrent networks."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1726997"
                        ],
                        "name": "E. Oja",
                        "slug": "E.-Oja",
                        "structuredName": {
                            "firstName": "Erkki",
                            "lastName": "Oja",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Oja"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16577977,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3e00dd12caea7c4dab1633a35d1da3cb2e76b420",
            "isKey": false,
            "numCitedBy": 2357,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "A simple linear neuron model with constrained Hebbian-type synaptic modification is analyzed and a new class of unconstrained learning rules is derived. It is shown that the model neuron tends to extract the principal component from a stationary input vector sequence."
            },
            "slug": "Simplified-neuron-model-as-a-principal-component-Oja",
            "title": {
                "fragments": [],
                "text": "Simplified neuron model as a principal component analyzer"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A simple linear neuron model with constrained Hebbian-type synaptic modification is analyzed and a new class of unconstrained learning rules is derived."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of mathematical biology"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116658096"
                        ],
                        "name": "D. J. Evans",
                        "slug": "D.-J.-Evans",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Evans",
                            "middleNames": [
                                "John"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. J. Evans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121809214,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "38c8166485de699bff51c9fb0e497211e79ba9ae",
            "isKey": false,
            "numCitedBy": 70,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This volume is based on a series of lectures prepared by a group of internationally-renowned experts in the field for a meeting on the general theme of 'Sparsity and its Applications' at the University of Technology, Loughborough, in April 1983. An introductory section briefly surveys the field of sparsity research and summarises the main ideas discussed in each contribution. The contributions themselves examine the design, analysis, implementation, and application of computer algorithms, with a view to producing mathematical software which can be used as an efficent tool in different areas of science and engineering technology."
            },
            "slug": "Sparsity-and-its-applications-Evans",
            "title": {
                "fragments": [],
                "text": "Sparsity and its applications"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This volume is based on a series of lectures prepared by a group of internationally-renowned experts in the field for a meeting on the general theme of 'Sparsity and its Applications' at the University of Technology, Loughborough, in April 1983."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8909922"
                        ],
                        "name": "N. Intrator",
                        "slug": "N.-Intrator",
                        "structuredName": {
                            "firstName": "Nathan",
                            "lastName": "Intrator",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Intrator"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "There is a problem related to this, described as “projection pursuit” (e.g., Friedman 1987; Huber 1985;  Intrator 1992,1993 )., Intrator (1992, 1993)  has noted that one should look for projections (histograms) that are as far from gaussian as possible.,Techniques such as those of  Intrator (1992, 1993) , Foldiak (1990), Schmidhuber (1992), and Linsker (1993) may ultimately provide insights into this problem, but their work demonstrates that the solution may not be a simple one."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8926225,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d1046704930644e99b1305228c71216dfcbead6c",
            "isKey": false,
            "numCitedBy": 49,
            "numCiting": 104,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a novel classification and regression method that combines exploratory projection pursuit (unsupervised training) with projection pursuit regression (supervised training), to yield a new family of cost/complexity penalty terms. Some improved generalization properties are demonstrated on real-world problems."
            },
            "slug": "Combining-Exploratory-Projection-Pursuit-and-with-Intrator",
            "title": {
                "fragments": [],
                "text": "Combining Exploratory Projection Pursuit and Projection Pursuit Regression with Application to Neural Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 95,
                "text": "A novel classification and regression method that combines exploratory projection pursuit (unsupervised training) with projection pursuit regression ( supervised training), to yield a new family of cost/complexity penalty terms."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40574103"
                        ],
                        "name": "S. Klinke",
                        "slug": "S.-Klinke",
                        "structuredName": {
                            "firstName": "Sigbert",
                            "lastName": "Klinke",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Klinke"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2549124"
                        ],
                        "name": "J. Polzehl",
                        "slug": "J.-Polzehl",
                        "structuredName": {
                            "firstName": "Jörg",
                            "lastName": "Polzehl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Polzehl"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60628897,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "43d7cce568c4d6ec9cc2d95fe54dd5fa8f51e936",
            "isKey": false,
            "numCitedBy": 338,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "“Projection Pursuit” (PP) stands for a class of exploratory projection techniques. This class contains methods designed for analyzing high dimensional data using low-dimensional projections. The main idea is to describe “interesting” projections by maximizing an objective function or projection pursuit index."
            },
            "slug": "Exploratory-Projection-Pursuit-Klinke-Polzehl",
            "title": {
                "fragments": [],
                "text": "Exploratory Projection Pursuit"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "“Projection Pursuit” (PP) stands for a class of exploratory projection techniques that contains methods designed for analyzing high dimensional data using low-dimensional projections."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737063"
                        ],
                        "name": "I. Daubechies",
                        "slug": "I.-Daubechies",
                        "structuredName": {
                            "firstName": "Ingrid",
                            "lastName": "Daubechies",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Daubechies"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 150,
                                "start": 106
                            }
                        ],
                        "text": "Although much of the work on wavelet transforms has been devoted to the development of ortho-normal bases (e.g., Adelson et al. 1987; Daubechies 1988) the coding with these transforms has found a wide variety of applications ( e g , Farge et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2727398,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1d08a2ba82c351add7caf7a69d5567b2fddb025d",
            "isKey": false,
            "numCitedBy": 8724,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "We construct orthonormal bases of compactly supported wavelets, with arbitrarily high regularity. The order of regularity increases linearly with the support width. We start by reviewing the concept of multiresolution analysis as well as several algorithms in vision decomposition and reconstruction. The construction then follows from a synthesis of these different approaches."
            },
            "slug": "Orthonormal-bases-of-compactly-supported-wavelets-Daubechies",
            "title": {
                "fragments": [],
                "text": "Orthonormal bases of compactly supported wavelets"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "This work construct orthonormal bases of compactly supported wavelets, with arbitrarily high regularity, by reviewing the concept of multiresolution analysis as well as several algorithms in vision decomposition and reconstruction."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4433870"
                        ],
                        "name": "P. Lennie",
                        "slug": "P.-Lennie",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Lennie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Lennie"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 131083605,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1cc60e5c5587c1dfcd912572c4e89d2ac6edb158",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 55,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "SPATIAL-FREQUENCY-ANALYSIS-IN-THE-VISUAL-Lennie",
            "title": {
                "fragments": [],
                "text": "SPATIAL FREQUENCY ANALYSIS IN THE VISUAL"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16298171"
                        ],
                        "name": "D. Gabor",
                        "slug": "D.-Gabor",
                        "structuredName": {
                            "firstName": "Dennis",
                            "lastName": "Gabor",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gabor"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61327032,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a8ef7e8990527f01847845da9953896f35e489d5",
            "isKey": false,
            "numCitedBy": 4630,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Theory-of-communication-Gabor",
            "title": {
                "fragments": [],
                "text": "Theory of communication"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1946
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1858054"
                        ],
                        "name": "P. Földiák",
                        "slug": "P.-Földiák",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Földiák",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Földiák"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60513567,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "7947b19f7d5488b8d76664c8b2d70daff350babd",
            "isKey": false,
            "numCitedBy": 339,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Adaptation-and-decorrelation-in-the-cortex-Barlow-Földiák",
            "title": {
                "fragments": [],
                "text": "Adaptation and decorrelation in the cortex"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 39831555,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f7c6c62c0fc12bd65511429bc861430cfb52eccf",
            "isKey": false,
            "numCitedBy": 662,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Single-units-and-sensation:-a-neuron-doctrine-for-Barlow",
            "title": {
                "fragments": [],
                "text": "Single units and sensation: a neuron doctrine for perceptual psychology?"
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2102692030"
                        ],
                        "name": "RussLL L. Ds Vnlos",
                        "slug": "RussLL-L.-Ds-Vnlos",
                        "structuredName": {
                            "firstName": "RussLL",
                            "lastName": "Vnlos",
                            "middleNames": [
                                "L.",
                                "Ds"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "RussLL L. Ds Vnlos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2081557442"
                        ],
                        "name": "Duaxs G. ALSREcHT",
                        "slug": "Duaxs-G.-ALSREcHT",
                        "structuredName": {
                            "firstName": "Duaxs",
                            "lastName": "ALSREcHT",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Duaxs G. ALSREcHT"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2103028334"
                        ],
                        "name": "Lrse G. Tsonrll",
                        "slug": "Lrse-G.-Tsonrll",
                        "structuredName": {
                            "firstName": "Lrse",
                            "lastName": "Tsonrll",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lrse G. Tsonrll"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9306470,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d54f243c31a5797b059c945fec65502e47d5e879",
            "isKey": false,
            "numCitedBy": 701,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "SPATIAL-FREQUENCY-SELECTIVITY-OF-CELLS-IN-MACAQUE-Vnlos-ALSREcHT",
            "title": {
                "fragments": [],
                "text": "SPATIAL FREQUENCY SELECTIVITY OF CELLS IN MACAQUE VISUAL CORTEX"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Twelfth Bartlett Memorial Lecture: The role of single Barlow, H"
            },
            "venue": {
                "fragments": [],
                "text": "B. 1989. Unsupervised learning. Nrrrml Corirp. 1, 295-311. Barlow, H. B., and Foldiak, P. 1989. Adaptation and decorrelation in the cortex. In T/IP"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "What’s constant in contrast constancy?: A vector length model of suprathreshold sensitivity"
            },
            "venue": {
                "fragments": [],
                "text": "Visiori Res., submitted. Buchsbaum, G., and Gottschalk, A. 1983. Trichromacy, opponent colors coding and optimum color information transmission in the retina."
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Projection pursuit. Ann. Statist. 13, 435475. Intrator, N. 1992. Feature extraction using an unsuperviscd neural network"
            },
            "venue": {
                "fragments": [],
                "text": "Nerrrnl Cornp"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Single units and sensation: A neuron doctrine for perceptual Barlow, H"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The amplitude spectra o f natural images"
            },
            "venue": {
                "fragments": [],
                "text": "Oplztlinl. Physiol. Opt. 12, 229-232."
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "What's constant in contrast constancy?: A vector length model of suprathreshold sensitivity. Visiori Res"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Roy. SOC"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Network model of shape-from-shading: Neural function arises from both receptive and projective receptive fields"
            },
            "venue": {
                "fragments": [],
                "text": "Nature (London) 333, 452-454."
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A computational model of spatiochromatic coding in early vision. I. Visual Cornitrun. linage Proem"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Exploratory projection pursuit. 1. Atner. Statist. Assoc. 82, Gabor, D. 1946. Theory of Communication. j"
            },
            "venue": {
                "fragments": [],
                "text": "IEE London"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "ed., Representations of Vision"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The coding of sensory messages. Cirrruiil I -'~O~~C I I I S ill Anirriril"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Internal representations for associative memory. B i d"
            },
            "venue": {
                "fragments": [],
                "text": "Cyberw"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Feature extraction using an unsuperviscd neural network"
            },
            "venue": {
                "fragments": [],
                "text": "Nerrrnl Cornp. 4, 98-107. Intrator, N. 1993. Combining exploratory projection pursuit and projection pursuit regression with application to neural networks."
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Spnrse Mntrices"
            },
            "venue": {
                "fragments": [],
                "text": "Wiley, New York. Schmidhuber, J. 1992. Learning factorial codes by predictability minimization."
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "What does post - adaptation color appearance reveal about cortical color coding ?"
            },
            "venue": {
                "fragments": [],
                "text": "Visiorr it ^ ."
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Optimal unsupervised learning in a single layer network"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "What does post-adaptation color appearance reveal about cortical color coding? Visiorr it^"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Digitnl Irrrage Processing"
            },
            "venue": {
                "fragments": [],
                "text": "Wiley, New York. Rockland, K., and Lund,"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Self-similar oriented wavelet pyramids: Conjectures about neural non-orthogonality"
            },
            "venue": {
                "fragments": [],
                "text": "Representations of Vision"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An evaluation of the two-dimensional Gabor filter model of simple receptive fields in cat striate cortex. 1. Neirrop/rysio"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Tlre Conrpirtatiorrnl Brain"
            },
            "venue": {
                "fragments": [],
                "text": "MIT Press, Cambridge, MA."
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 152,
                                "start": 115
                            }
                        ],
                        "text": "This approach has been specifically proposed with respect to visual code and the representations of natural scenes (Field 1987,1989,1993; Zetzsche 1990)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Sparse coding: The link between low level vision and associative memory"
            },
            "venue": {
                "fragments": [],
                "text": "Pnrnllel Processing in Neirrnl System nnd Conzpirtcrs, R. Eckmiller,"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Scale-invariance and self-similar ’wavelet’ transforms: An analysis of natural scenes and mammalian visual systems"
            },
            "venue": {
                "fragments": [],
                "text": "In"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "What does post-adaptation color"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The principal components Huber, I"
            },
            "venue": {
                "fragments": [],
                "text": "J "
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Deriving receptive fields using an optimal encoding crite-249-266. 1-13. of natural images"
            },
            "venue": {
                "fragments": [],
                "text": "Nrtzoork"
            },
            "year": 1993
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 26,
            "methodology": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 85,
        "totalPages": 9
    },
    "page_url": "https://www.semanticscholar.org/paper/What-Is-the-Goal-of-Sensory-Coding-Field/ff1152582155acaa0e9d0ccbc900a4641504256d?sort=total-citations"
}