{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707107"
                        ],
                        "name": "J. Movshon",
                        "slug": "J.-Movshon",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Movshon",
                            "middleNames": [
                                "Anthony"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Movshon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1935795"
                        ],
                        "name": "I. Thompson",
                        "slug": "I.-Thompson",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Thompson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Thompson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13191517,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d4977b31c9de761d3ec144d580c0976eca56c6e0",
            "isKey": false,
            "numCitedBy": 643,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "1. All complex cells in the cat's striate cortex exhibit gross non‐linearities of spatial summation when tested with sinusoidal grating stimuli. Their responses to moving gratings of all but the lowest spatial frequencies are usually dominated by a component that is not modulated by the passage of the bars of the grating across the receptive field. They give responses to temporally modulated stationary gratings that consist mostly of even harmonics of the stimulus frequency and that vary little in amplitude or wave form as the spatial phase of the grating is varied. 2. We compared complex cells' receptive fields with their sensitivity to sinusoidal gratings of different spatial frequencies. Qualitatively, the receptive fields are usually two to five times wider than the bars of the gratings that stimulate them most effectively. Quantitatively, the receptive field profiles of complex cells are invariably broader than those predicted by Fourier synthesis of their spatial frequency tuning curves, and in particular lack predicted spatially antagonistic regions. 3. We further examined the receptive field organization of these cells, using pairs of stationary lines flashed synchronously on their receptive fields. If both lines are of the same polarity (bright or dark), complex cells respond to the paired stimulus much less well than they do to either of its component bars, unless the bars are separated by less than about one quarter of the width of the receptive field. If the lines are of opposite polarity, one bright and one dark, the opposite situation obtains: closely spaced bars elicit small responses, while paired bars of larger separation are much more effective. In either case, the results are independent in general character of the absolute positions of the stimuli within the receptive field; rather, they depend in a manner characteristic of each cell on the relative positions of the two bars. 4. The two‐line interaction profile that plots the change in a complex cell's response to one bar as a function of the position of a second added bar corresponds closely to the receptive field profile predicted from Fourier synthesis of the cell's spatial frequency tuning curve. These profiles may thus reveal the spatial characteristics of subunits within complex cell‐receptive fields. We examined the nature of the interaction between these subunits by performing several two‐line interaction experiments in which the onset of the second bar was delayed some time after the onset of the first. The results suggest that neighbouring subunits interact in a facilitatory fashion: for an interval after the presentation of one bar, responses to neighbouring bars are enhanced. 5. The subunits of a complex receptive field may, by their spatial properties, determine the spatial selectivities of complex cells, while the nature of the interaction among the subunits may determine these cells' sensitivity and selectivity for moving visual stimuli..."
            },
            "slug": "Receptive-field-organization-of-complex-cells-in-Movshon-Thompson",
            "title": {
                "fragments": [],
                "text": "Receptive field organization of complex cells in the cat's striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The subunits of a complex receptive field may, by their spatial properties, determine the spatial selectivities of complex cells, while the nature of the interaction among the subunits may determine these cells' sensitivity and selectivity for moving visual stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48089152"
                        ],
                        "name": "B. W. Andrews",
                        "slug": "B.-W.-Andrews",
                        "structuredName": {
                            "firstName": "Bryan",
                            "lastName": "Andrews",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. W. Andrews"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1925241"
                        ],
                        "name": "D. Pollen",
                        "slug": "D.-Pollen",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Pollen",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pollen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 28588085,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "dda59b551f8c72c29ee580f6627f1f75a6d3b38b",
            "isKey": false,
            "numCitedBy": 168,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Receptive fields of simple cells in area 17 of the cat were mapped with stationary stimuli. Spatial frequency selectivities of the same cells were measured with drifting sinusoidal gratings. 2. The reconstructed field profile (inverse Fourier transform of selectivity curve) shows qualitative agreement with the mapped profile, and suggests the existence of additional side‐lobes in the field. The side‐lobes may correspond to the 'unresponsive regions' investigated by Maffei & Fiorentini (1976). 3. Our data suggest that the simple cell may perform approximately linear spatial summation of inputs to the visual system. However, the output of the simple cell is generally non‐linear as reflected in its truncated responses to gratings."
            },
            "slug": "Relationship-between-spatial-frequency-selectivity-Andrews-Pollen",
            "title": {
                "fragments": [],
                "text": "Relationship between spatial frequency selectivity and receptive field profile of simple cells."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The data suggest that the simple cell may perform approximately linear spatial summation of inputs to the visual system, however, the output of thesimple cell is generally non‐linear as reflected in its truncated responses to gratings."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52555257"
                        ],
                        "name": "J. Kulikowski",
                        "slug": "J.-Kulikowski",
                        "structuredName": {
                            "firstName": "Janus",
                            "lastName": "Kulikowski",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kulikowski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145606123"
                        ],
                        "name": "P. O. Bishop",
                        "slug": "P.-O.-Bishop",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Bishop",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. O. Bishop"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44579600,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "2efda1f0162865f81c2f8382fbf3a830f5db2df4",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "silent-periodic-cells-in-the-cat-striate-cortex-Kulikowski-Bishop",
            "title": {
                "fragments": [],
                "text": "silent periodic cells in the cat striate cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1993085645"
                        ],
                        "name": "P. Schiller",
                        "slug": "P.-Schiller",
                        "structuredName": {
                            "firstName": "P",
                            "lastName": "Schiller",
                            "middleNames": [
                                "H"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Schiller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33760699"
                        ],
                        "name": "B. Finlay",
                        "slug": "B.-Finlay",
                        "structuredName": {
                            "firstName": "Barbara",
                            "lastName": "Finlay",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Finlay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6849044"
                        ],
                        "name": "S. Volman",
                        "slug": "S.-Volman",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Volman",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Volman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14270911,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "09b4ba65735f8e1ae2b2bf71dec784911f9f67bc",
            "isKey": false,
            "numCitedBy": 229,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The response properties of single cells in monkey striate cortex were examined using moving bars, square-wave gratings, and sine-wave gratings. 2. The moving of cells studied were not selective for bar width or for the spatial frequency of square-wave gratings. 3. Most cells responded selectively to the spatial frequency of the sine-wave gratings. 4. The spatial frequency of the sine-wave grating eliciting the optimal response could not be predicted from the organization of the receptive field of each cell as determined by stationary or moving stimuli. 5. The sharpness of spatial-frequency selectivity is only slightly more pronounced in S-type cells than in CX-type cells. 6. S-type and CX-type cells differ significantly in the temporal modulation of their discharges to gratings. S-type cells discharge in sharp bursts to each cycle which traverses the receptive field. CX-type cells discharge in a rather continuous fashion. This measure can be used reliably to classify cells as S or CS type."
            },
            "slug": "Quantitative-studies-of-single-cell-properties-in-Schiller-Finlay",
            "title": {
                "fragments": [],
                "text": "Quantitative studies of single-cell properties in monkey striate cortex. III. Spatial frequency."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The spatial frequency of the sine-wave grating eliciting the optimal response could not be predicted from the organization of the receptive field of each cell as determined by stationary or moving stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707107"
                        ],
                        "name": "J. Movshon",
                        "slug": "J.-Movshon",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Movshon",
                            "middleNames": [
                                "Anthony"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Movshon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1935795"
                        ],
                        "name": "I. Thompson",
                        "slug": "I.-Thompson",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Thompson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Thompson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7684023,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "83f9320a93b7c35a4d4791d4012898c9c25da8cc",
            "isKey": false,
            "numCitedBy": 670,
            "numCiting": 74,
            "paperAbstract": {
                "fragments": [],
                "text": "1. We have examined the spatial and temporal tuning properties of 238 cortical neurones, recorded using conventional techniques from acutely prepared anaesthetized cats. We determined spatial and temporal frequency tuning curves using sinusoidal grating stimuli presented to each neurone's receptive field by a digital computer on a cathode ray tube. 2. We measured tuning curves either by determining response amplitude as a function of spatial or temporal frequency, or by measuring contrast sensitivity (the inverse of the contrast of the grating that just elicited a detectable response). The two measures give very similar tuning curves in all cases. 3. We recorded from 184 neurones in area 17; of these 156 had receptive fields within 5 degrees of the area centralis. The range of preferred spatial frequency for these neurones was 0.3‐‐3 c/deg, and their spatial frequency tuning band widths varied from 0.7 to 3.2 octaves at half‐amplitude. The most common band width was roughly 1.3 octaves. Simple and complex cells in area 17 did not differ in their distributions of preferred spatial frequency, although complex cells were, on average, slightly less selective for spatial frequency than simple cells. 4. We recorded from fifty‐four neurones from area 18, and performed several experiments in which we recorded from corresponding portions of both area 17 and area 18 in the same electrode penetration. Neurones in area 18 preferred spatial frequencies that were, on average, one third as high as those preferred by area 17 neurones at the same retinal eccentricity. Thus the range of preferred spatial frequency in area eighteen cells having receptive fields within 5 deg of the area centralis was between less than 0.1 and 0.5 c/deg. The distributions of optimum spatial frequency in the two areas were practically non‐overlapping at eccentricities as high as 15 deg, the greatest eccentricity we examined. Neurones in area 18 were about as selective for spatial frequency as were neurones in area 17. 5. We determined temporal frequency tuning characteristics for some neurones from each area, using gratings that moved steadily across the screen. Neurones from area 17 all responded well to low temporal frequencies, and less well to higher frequencies (in excess of, usually, 2 or 4 Hz). In contrast, neurones recorded from area 18 sometimes had similar tuning properties, but more commonly showed a pronounced reduction in response as the temporal frequency was moved either above or below some optimum value (usually 2‐‐8 Hz). 6. We conclude from these results that areas 17 and 18 act in parallel to process different aspects of the visual information relayed from the retina via the lateral geniculate complex. Some or all of the differences between the areas may be attributable to the predominance of Y cell input to area 18 and the predominance of X cell input to area 17..."
            },
            "slug": "Spatial-and-temporal-contrast-sensitivity-of-in-17-Movshon-Thompson",
            "title": {
                "fragments": [],
                "text": "Spatial and temporal contrast sensitivity of neurones in areas 17 and 18 of the cat's visual cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is concluded that areas 17 and 18 act in parallel to process different aspects of the visual information relayed from the retina via the lateral geniculate complex."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3426280"
                        ],
                        "name": "K. D. De Valois",
                        "slug": "K.-D.-De-Valois",
                        "structuredName": {
                            "firstName": "Karen",
                            "lastName": "De Valois",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. D. De Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113588000"
                        ],
                        "name": "R. L. de Valois",
                        "slug": "R.-L.-de-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "de Valois",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. de Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2439030"
                        ],
                        "name": "E. Yund",
                        "slug": "E.-Yund",
                        "structuredName": {
                            "firstName": "E.",
                            "lastName": "Yund",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Yund"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 24232295,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c7d83779adf4d83f9ddffa8aeec342561d66f9c8",
            "isKey": false,
            "numCitedBy": 245,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Cells in visual cortex have been alternately considered as bar and edge detectors, or as spatial‐frequency filters responding to the two‐dimensional Fourier component of patterns. 2. The responses to gratings and to checkerboards allow one to test these alternate models: the Fourier components of a checkerboard pattern do not occur at the same orientation as the edges, nor do the checkerboard spatial frequencies correspond to the check widths. 3. Knowing the orientation tuning of a cell for gratings, one can precisely predict its orientation tuning to checkerboards from the orientation of the fundamental Fourier components of the patterns, not from the orientation of their edges. This was found for both square and rectangular checkerboards, and held for both simple and complex cortical cells. 4. Knowing the spatial tuning of a cell for sine‐wave gratings, one can precisely predict its spatial tuning to square and rectangular checkerboards from the spatial frequencies of the fundamental Fourier components of the patterns, not from the widths of their checks. 5. When presented with checkerboards in which not the fundamental but the upper harmonics were within its spatial bandpass, a cell's orientation tuning was found to be predictable from the (quite different) orientation of the higher Fourier harmonic components, but not from the orientation of the edges. 6. Knowing a cell's contrast sensitivity for gratings, one can predict the cell's contrast sensitivity for checkerboards much more accurately from the amplitudes of the two‐dimensional Fourier components of the patterns than from the contrasts of the patterns. 7. The orientation tuning, spatial‐frequency tuning and responsiveness of cells to a plaid pattern were also found to be predictable from the pattern's two‐dimensional Fourier spectrum. 8. Both simple and complex striate cortex cells can thus be characterized as two‐dimensional spatial‐frequency filters. Since different cells responsive to the same region in the visual field are tuned to different spatial frequencies and orientations, the ensemble of such cells would fairly precisely encode the two‐dimensional Fourier spectrum of a patch of visual space."
            },
            "slug": "Responses-of-striate-cortex-cells-to-grating-and-Valois-Valois",
            "title": {
                "fragments": [],
                "text": "Responses of striate cortex cells to grating and checkerboard patterns."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The orientation tuning, spatial‐frequency tuning and responsiveness of cells to a plaid pattern were found to be predictable from the pattern's two‐dimensional Fourier spectrum, and both simple and complex striate cortex cells can be characterized as two-dimensional spatial‐ frequencies filters."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5624877"
                        ],
                        "name": "S. Marčelja",
                        "slug": "S.-Marčelja",
                        "structuredName": {
                            "firstName": "Stjepan",
                            "lastName": "Marčelja",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Marčelja"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23364863,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "85af5a0b7102919e96eebe9143c082fe9e453e46",
            "isKey": false,
            "numCitedBy": 1317,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "On the basis of measured receptive field profiles and spatial frequency tuning characteristics of simple cortical cells, it can be concluded that the representation of an image in the visual cortex must involve both spatial and spatial frequency variables. In a scheme due to Gabor, an image is represented in terms of localized symmetrical and antisymmetrical elementary signals. Both measured receptive fields and measured spatial frequency tuning curves conform closely to the functional form of Gabor elementary signals. It is argued that the visual cortex representation corresponds closely to the Gabor scheme owing to its advantages in treating the subsequent problem of pattern recognition."
            },
            "slug": "Mathematical-description-of-the-responses-of-simple-Marčelja",
            "title": {
                "fragments": [],
                "text": "Mathematical description of the responses of simple cortical cells."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is argued that the visual cortex representation corresponds closely to the Gabor scheme owing to its advantages in treating the subsequent problem of pattern recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2041558"
                        ],
                        "name": "L. Maffei",
                        "slug": "L.-Maffei",
                        "structuredName": {
                            "firstName": "Lamberto",
                            "lastName": "Maffei",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Maffei"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2173920"
                        ],
                        "name": "C. Morrone",
                        "slug": "C.-Morrone",
                        "structuredName": {
                            "firstName": "Concetta",
                            "lastName": "Morrone",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Morrone"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5105772"
                        ],
                        "name": "M. Pirchio",
                        "slug": "M.-Pirchio",
                        "structuredName": {
                            "firstName": "Mario",
                            "lastName": "Pirchio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Pirchio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1678909"
                        ],
                        "name": "G. Sandini",
                        "slug": "G.-Sandini",
                        "structuredName": {
                            "firstName": "Giulio",
                            "lastName": "Sandini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Sandini"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 35727737,
            "fieldsOfStudy": [
                "Physics",
                "Biology"
            ],
            "id": "9082f05cc774b1a41f9e72c54f300d9103c065e4",
            "isKey": false,
            "numCitedBy": 71,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The activity of neurones of the visual cortex (area 17) has been recorded in anaesthetized cats in response to gratings of different profile and to single light and dark bars. 2. At very low spatial frequencies, outside the frequency response range to sinusoidal gratings, the response to square‐wave drifting gratings is obtainable from a combination of the response to the single bars of the grating presented in isolation. At higher spatial frequencies this is no longer true. 3. At very low spatial frequencies the responses to square‐wave gratings and to missing‐fundamental gratings (obtained by subtraction from the square‐wave grating of its fundamental gratings (obtained by subtraction from the square‐wave grating of its fundamental harmonic) are very similar. 4. At spatial frequencies near the peak of the spatial frequency tuning curve of the cell, the responses to square‐wave grating and to sinusoidal gratings are very similar. At these spatial frequencies the response to the missing‐fundamental grating is practically zero. 5. At spatial frequencies lower than that of best sensitivity for the cell, the response to square‐wave gratings is correlated with the 1st and 3rd harmonic of the stimulus. 6. We conclude that at very low spatial frequencies of the grating the response of cortical cells is correlated with the light or dark edges (or light or dark bars) of the stimulus, because the edges contain high frequencies within the range of sensitivity of the cells. At higher spatial frequencies the results are interpreted best by assuming that cortical cells respond to the harmonics of the visual periodic stimulus. 7. When a background of dynamic visual noise is added to increase the spontaneous discharge of simple cells, their response to visual stimuli becomes linear or quasi‐linear. The stimuli could be either single bars or gratings."
            },
            "slug": "Responses-of-visual-cortical-cells-to-periodic-and-Maffei-Morrone",
            "title": {
                "fragments": [],
                "text": "Responses of visual cortical cells to periodic and non‐periodic stimuli."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "It is concluded that at very low spatial frequencies of the grating the response of cortical cells is correlated with the light or dark edges of the stimulus, because the edges contain high frequencies within the range of sensitivity of the cells."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3658444"
                        ],
                        "name": "N. Berardi",
                        "slug": "N.-Berardi",
                        "structuredName": {
                            "firstName": "Nicoletta",
                            "lastName": "Berardi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Berardi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46862918"
                        ],
                        "name": "S. Bisti",
                        "slug": "S.-Bisti",
                        "structuredName": {
                            "firstName": "Silvia",
                            "lastName": "Bisti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Bisti"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34094435"
                        ],
                        "name": "A. Cattaneo",
                        "slug": "A.-Cattaneo",
                        "structuredName": {
                            "firstName": "Antonino",
                            "lastName": "Cattaneo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Cattaneo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145406237"
                        ],
                        "name": "A. Fiorentini",
                        "slug": "A.-Fiorentini",
                        "structuredName": {
                            "firstName": "Adriana",
                            "lastName": "Fiorentini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Fiorentini"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2041558"
                        ],
                        "name": "L. Maffei",
                        "slug": "L.-Maffei",
                        "structuredName": {
                            "firstName": "Lamberto",
                            "lastName": "Maffei",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Maffei"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 36238475,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "ffded20fe0835e3c2230fe861823f104b3761aae",
            "isKey": false,
            "numCitedBy": 61,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "1. In seventy‐six penetrations through areas 17 and 18 of the cat, neurones were regularly sampled at intervals of 100 micrometers and preferred orientation, optimal spatial frequency and resolving power were determined for each neurone in response to drifting sinusoidal gratings. 2. As already shown for area 17, in tangential penetrations through area 18, whenever the preferred orientation rotates progressively from cell to cell, the optimal spatial frequency tends to remain constant. 3. A statistical analysis on 1574 cells in areas 17 and 18 showed that for pairs of cells separated 200‐300 micrometers along a track the difference in preferred orientation delta alpha and the difference in optimal spatial frequency delta f are not randomly distributed: cell pairs with small delta alpha are most likely to have large delta f and vice versa. 4. These findings indicate that in areas 17 and 18 neurones with the same optimal frequency are aligned along a direction orthogonal to the orientation columns. 5. The optimal spatial frequency, resolving power and the velocity cut‐off were averaged for cells from different penetrations located in the same cortical layer or sublayer of area 18: mean optimal spatial frequency and acuity are highest in layer IV and lowest in layers II and V, while the velocity cut‐off is highest in layers II and V and lowest in layer IV. 6. Our data suggest that the layering of cells according to optimal spatial frequency is a more subtle subdivision than the six histological layers."
            },
            "slug": "Correlation-between-the-preferred-orientation-and-Berardi-Bisti",
            "title": {
                "fragments": [],
                "text": "Correlation between the preferred orientation and spatial frequency of neurones in visual areas 17 and 18 of the cat."
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The findings indicate that in areas 17 and 18 neurones with the same optimal frequency are aligned along a direction orthogonal to the orientation columns, suggesting that the layering of cells according to optimal spatial frequency is a more subtle subdivision than the six histological layers."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12432,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2129244"
                        ],
                        "name": "D. G. Albrecht",
                        "slug": "D.-G.-Albrecht",
                        "structuredName": {
                            "firstName": "Duane",
                            "lastName": "Albrecht",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. G. Albrecht"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2082557151"
                        ],
                        "name": "D. B. Hamilton",
                        "slug": "D.-B.-Hamilton",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hamilton",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. B. Hamilton"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 39792110,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5a99f7538e8362f1903c33f3f16ce75a40090d83",
            "isKey": false,
            "numCitedBy": 964,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "1. We measured the responses of 247 neurons recorded from the striate cortex of monkeys and cats as a function of the contrast intensity of luminance-modulated spatialtemporal sine-wave grating patterns to provide a qualitative description and a quantitative mathematical formulation of the contast response function (CRF). 2. Qualitatively, it is possible to provide a general description of the contrast response function for the majority of cells as follows: as the luminance contrast of a pattern increases, the response increases in a relatively linear fashion over approximately 50-607o of the response range (generally less than I log unit along the contrast range), the slope of the function then begins a rapid compression to an asymptotic maximum-saturation response level. There is, however, a great deal of variation. from cell to cell, in the exact shape and location of the CRF. 3. Quantitatively, the responses of each cell were analyzed in terms of the leastsquares (parameter optimized) best fit using four different mathematical functions: linear, logarithmic power, and hyperbolic ratio. The results of this procedure showed that, across the range of contrasts measured ( 1.4567o), the hypcrbolic ratio (H ratio) provided the best fit for the vast majority of striate cells: some 7O9o f the cells were best fitted by the H ratio and further, averaged across all cells, the H ratio produced the least average residual variance. 4. The contrast response function is an important factor when considering the spatial properties of cortical cells; nonlinearities in the CRF (compression and saturation) will necessarily influence the spatial tuning. We therefore measured the CRF at different spatial frequencies and used the parameters of the H ratio to test the predictions of two general classes of models. If the overall gain, compression, and saturation are set by the absolute response level (response-set gain), then the CRFs measured at different frequencies should shift horizontally along the contrast axis. Results show that the measured CRFs (tested on the same cell using different spatial frequencies) were shifted primarily vertically, suggesting that the gain, compression, and saturation were set by the absolute contrast level (contrast-set gain), relatively independent of spatial frequency; in terms of the H ratio, the semisaturation contrast and the exponent were relatively constant in comparison to the asymptotic saturation response. Thus, the spatial frequency response functions are relatively constant when measured at different stimulus contrasts. 5. There is a great deal of variation in the location of the dynamic response range, from cell to cell, along the contrast axis: some cells distribute their dynamic response range over the first lOVo of contrast, others the second, etc. (relatively independent of preferred spatial frequency). One might expect this range variation to be an important factor in behavioral contrast discrimination. To provide an indication of the average population response as a function of contrast, all cells were averaged together (percent response relative to each cell 's maximum): the slope of the bcst-fitt ing [nwer function (0.77) falls well within the range of estimates found for human psychophysical contrast discrimination functions."
            },
            "slug": "Striate-cortex-of-monkey-and-cat:-contrast-response-Albrecht-Hamilton",
            "title": {
                "fragments": [],
                "text": "Striate cortex of monkey and cat: contrast response function."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The results of this procedure showed that, across the range of contrasts measured, the hypcrbolic ratio (H ratio) provided the best fit for the vast majority of striate cells and the spatial frequency response functions are relatively constant when measured at different stimulus contrasts."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2385092"
                        ],
                        "name": "C. Gross",
                        "slug": "C.-Gross",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Gross",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Gross"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1403644863"
                        ],
                        "name": "C. Rocha-Miranda",
                        "slug": "C.-Rocha-Miranda",
                        "structuredName": {
                            "firstName": "Carlos",
                            "lastName": "Rocha-Miranda",
                            "middleNames": [
                                "Eduardo"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Rocha-Miranda"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36038893"
                        ],
                        "name": "D. B. Bender",
                        "slug": "D.-B.-Bender",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Bender",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. B. Bender"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16165935,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3c523f408efb0b32eccdbc12e9e57fb9b3b19c46",
            "isKey": false,
            "numCitedBy": 1471,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "IN THE LAST DEC,ADE, considerable progress has been made in understanding the physiology of one of the most fundamental aspects of human experience: perception of the visual world. It is now clear that the retina and visual pathways do not simply transmit a mosaic of Iight and dark to some central sensorium. Rather, even at the retinal level, specific features of visual stimuli are detected and their presence communicated to the next level. In cats and monkeys, the geniculostriate visual system consists of a series of converging and diverging connections such that at each successive tier of processing mechanism, single neurons respond to increasingly more specific visual stimuli falling on an increasingly wider area of the retina (19-Z). How far does this analytical-synthetic process continue whereby individual cells have more and more specific trigger features? Are there regions of the brain beyond striate and prestriatel cortex where this processing of visual information is carrie,d further? If so, how far and in what way? Are there cells that are concerned with the storage of visual information as well as its analysis? There are several lines of evidence suggesting that a possible site for further processing of visual information and perhaps even for storage of such information might, in the monkey, be inferotemporal cortexthe cortex on the inferior convexity of the temporal lobe. First, this area receives afferents from prestriate cortex which itself processes visual information received from"
            },
            "slug": "Visual-properties-of-neurons-in-inferotemporal-of-Gross-Rocha-Miranda",
            "title": {
                "fragments": [],
                "text": "Visual properties of neurons in inferotemporal cortex of the Macaque."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "There are several lines of evidence suggesting that a possible site for further processing of visual information and perhaps even for storage of such information might, in the monkey, be inferotemporal cortexthe cortex on the inferior convexity of the temporal lobe."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1925241"
                        ],
                        "name": "D. Pollen",
                        "slug": "D.-Pollen",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Pollen",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pollen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1992154"
                        ],
                        "name": "S. Ronner",
                        "slug": "S.-Ronner",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Ronner",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ronner"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16084115,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "957273ad4cf63ce1b9da51ddd1192782ab9889d1",
            "isKey": false,
            "numCitedBy": 79,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Complex cells in cortical areas 17 and 18 of the cat have been studied in response to narrow slits and edges moving across the receptive field in the preferred direction and also to stationary slits of different widths. 2. Average response histograms, recorded as a narrow slit was moved across the receptive field, displayed a periodic series of peaks above a base line level. The response histogram for most area 17 and 18 cells contained five principal peaks; sometimes one or two weaker peaks were present at receptive field borders. The histogram for one cell located at the area 17–18 border showed thirteen distinct peaks. Periodic response patterns were also generated as an extended edge was moved across the receptive field. Plots of cell responses versus slit width for stationary slits of different widths also indicated periodic response pattern. 3. The accuracy of determining the preferred slit orientation was the single most important requirement for demonstrating the periodic response pattern. Significant changes in the appearance of the periodic pattern occurred even upon 5 degrees rotations away from the preferred orientation. 4. Average response histograms were also studied over a wide range of moving slit velocities. The number of peaks across corresponding spacings within the recewptive field remained constant over a range of velocities. Response amplitudes, however, were velocity dependent. Thus the response peaks remain associated with fixed positions within visual space independent of stimulus velocity, even though temporal as well as spatial factors may be involved in response selectivity and the periodic modulation. The most striking periodic response histograms were generated at the velocities which produced the greatest cell firing rates. Area 17 complex cells responded well to velocities of less than 0–5 degrees to 6–0 degrees/sec, but cells in area 18 generally required higher velocities, sometimes as high as 20 degrees‐‐30 degrees/sec, for a good response. 5. Spatial frequencies for the periodic component of the receptive field for area 17 cells in the central visual area covered a range of three octaves up to 5 cycles/degree, and area 18 cells included another octave on the low frequency side. The spatial frequency of a cell was found to be roughly inversely proportional to the receptive field width. Only a small sample of area 18 cells was studied, but these cells tended to represent low spatial frequencies and to respond selectively to high velocity stimuli..."
            },
            "slug": "Periodic-excitability-changes-across-the-receptive-Pollen-Ronner",
            "title": {
                "fragments": [],
                "text": "Periodic excitability changes across the receptive fields of complex cells in the striate and parastriate cortex of the cat."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The most striking periodic response histograms were generated at the velocities which produced the greatest cell firing rates, and these cells tended to represent low spatial frequencies and to respond selectively to high velocity stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781325"
                        ],
                        "name": "J. Daugman",
                        "slug": "J.-Daugman",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Daugman",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Daugman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9271650,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "02f89cd1fd6f013a1a301a292936ff8fb06aff25",
            "isKey": false,
            "numCitedBy": 3420,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "Two-dimensional spatial linear filters are constrained by general uncertainty relations that limit their attainable information resolution for orientation, spatial frequency, and two-dimensional (2D) spatial position. The theoretical lower limit for the joint entropy, or uncertainty, of these variables is achieved by an optimal 2D filter family whose spatial weighting functions are generated by exponentiated bivariate second-order polynomials with complex coefficients, the elliptic generalization of the one-dimensional elementary functions proposed in Gabor's famous theory of communication [J. Inst. Electr. Eng. 93, 429 (1946)]. The set includes filters with various orientation bandwidths, spatial-frequency bandwidths, and spatial dimensions, favoring the extraction of various kinds of information from an image. Each such filter occupies an irreducible quantal volume (corresponding to an independent datum) in a four-dimensional information hyperspace whose axes are interpretable as 2D visual space, orientation, and spatial frequency, and thus such a filter set could subserve an optimally efficient sampling of these variables. Evidence is presented that the 2D receptive-field profiles of simple cells in mammalian visual cortex are well described by members of this optimal 2D filter family, and thus such visual neurons could be said to optimize the general uncertainty relations for joint 2D-spatial-2D-spectral information resolution. The variety of their receptive-field dimensions and orientation and spatial-frequency bandwidths, and the correlations among these, reveal several underlying constraints, particularly in width/length aspect ratio and principal axis organization, suggesting a polar division of labor in occupying the quantal volumes of information hyperspace.(ABSTRACT TRUNCATED AT 250 WORDS)"
            },
            "slug": "Uncertainty-relation-for-resolution-in-space,-and-Daugman",
            "title": {
                "fragments": [],
                "text": "Uncertainty relation for resolution in space, spatial frequency, and orientation optimized by two-dimensional visual cortical filters."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Evidence is presented that the 2D receptive-field profiles of simple cells in mammalian visual cortex are well described by members of this optimal 2D filter family, and thus such visual neurons could be said to optimize the general uncertainty relations for joint 2D-spatial-2D-spectral information resolution."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "91790464"
                        ],
                        "name": "G. Rybicki",
                        "slug": "G.-Rybicki",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Rybicki",
                            "middleNames": [
                                "Bruno"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Rybicki"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113531441"
                        ],
                        "name": "D. M. Tracy",
                        "slug": "D.-M.-Tracy",
                        "structuredName": {
                            "firstName": "Diana",
                            "lastName": "Tracy",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. M. Tracy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1925241"
                        ],
                        "name": "D. Pollen",
                        "slug": "D.-Pollen",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Pollen",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pollen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26207791,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "7faf768a4cc503acb4537551a71a69f0117ae077",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "PSYCHOPHYSICAL studies have established that the human central visual system contains a large number of independent channels each of which responds maximally to a selectively oriented sine wave grating of a given spatial frequency and hardly at all to gratings of spatial frequencies differing by a factor of two1–4. Electrophysiological studies with moving sinusoidally modulated grating patterns have demonstrated that there exists a class of neurones in the striate cortex of cats5 and monkeys6 each member of which is maximally selective to a given spatial frequency and orientation."
            },
            "slug": "Complex-cell-response-depends-on-interslit-spacing.-Rybicki-Tracy",
            "title": {
                "fragments": [],
                "text": "Complex cell response depends on interslit spacing."
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "Electrophysiological studies with moving sinusoidally modulated grating patterns have demonstrated that there exists a class of neurones in the striate cortex of cats and monkeys each member of which is maximally selective to a given spatial frequency and orientation."
            },
            "venue": {
                "fragments": [],
                "text": "Nature: New biology"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1925241"
                        ],
                        "name": "D. Pollen",
                        "slug": "D.-Pollen",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Pollen",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pollen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2144783000"
                        ],
                        "name": "James R. Lee",
                        "slug": "James-R.-Lee",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Lee",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "James R. Lee"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2152228141"
                        ],
                        "name": "Joseph H. Taylor",
                        "slug": "Joseph-H.-Taylor",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Taylor",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Joseph H. Taylor"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6247301,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e0e070c3d9a16acff0b1c4bb21469082b1a796e9",
            "isKey": false,
            "numCitedBy": 153,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "The striate cortex transforms the topographic representation of visual space in the lateral geniculate body into a Fourier transform or frequency representation at the complex cell level via the intermediary simple cell stage of \"strip integration.\" Each of these three stages contains essentially the same amount of information, which expresses a conservation of information principle; however, the form of the information is changed. In the transform domain, invariant descriptions of visual objects can be derived to serve as the basic sets required for pattern recognition and memory. We believe that our experimental and theoretical findings are fundamental for understanding the functional organization of the striate cortex."
            },
            "slug": "How-Does-the-Striate-Cortex-Begin-the-of-the-Visual-Pollen-Lee",
            "title": {
                "fragments": [],
                "text": "How Does the Striate Cortex Begin the Reconstruction of the Visual World?"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This work has shown that in the transform domain, invariant descriptions of visual objects can be derived to serve as the basic sets required for pattern recognition and memory in the striate cortex."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145902300"
                        ],
                        "name": "J. Baker",
                        "slug": "J.-Baker",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Baker",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Baker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1878109"
                        ],
                        "name": "S. Petersen",
                        "slug": "S.-Petersen",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Petersen",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Petersen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2885922"
                        ],
                        "name": "W. Newsome",
                        "slug": "W.-Newsome",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Newsome",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Newsome"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2100520"
                        ],
                        "name": "J. Allman",
                        "slug": "J.-Allman",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Allman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Allman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9865958,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1485f2cb8d3387100dcafe6fc6b8510fa0937929",
            "isKey": false,
            "numCitedBy": 265,
            "numCiting": 131,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The response properties of 354 single neurons in the medial (M), dorsomedial (DM), dorsolateral (DL), and middle temporal (MT) visual areas were studied quantitatively with bar, spot, and random-dot stimuli in chronically implanted owl monkeys with fixed gaze. 2. A directionality index was computed to compare the responses to stimuli in the optimal direction with the responses to the opposing direction of movement. The greater the difference between opposing directions, the higher the index. MT cells had much higher direction indices to moving bars than cells in DL, DM, and M. 3. A tuning index was computed for each cell to compare the responses to bars moving in the optimal direction, or flashed in the optimal orientation, with the responses in other directions or orientations within +/- 90 degrees. Cells in all four areas were more sharply tuned to the orientation of stationary flashed bars than to moving bars, although a few cells (9/92( were unresponsive in the absence of movement. DM cells tended to be more sharply tuned to moving bars than cells in the other areas. 4. Directionality in DM, DL, and MT was relatively unaffected by the use of single-spot stimuli instead of bars; tuning in all four areas was broader to spots than bars. 5. Moving arrays of randomly spaced spots were more strongly excitatory than bar stimuli for many neurons in MT (16/31 cells). These random-dot stimuli were also effective in M, but evoked no response or weak responses from most cells in DM and DL. 6. The best velocities of movement were usually in the range of 10-100 degrees/s, although a few cells (22/227), primarily in MT (14/69 cells), preferred higher velocities. 7. Receptive fields of neurons in all four areas were much larger than striate receptive fields. Eccentricity was positively correlated with receptive-field size (r = 0.62), but was not correlated with directionality index, tuning index, or best velocity. 8. The results support the hypothesis that there are specializations of function among the cortical visual areas."
            },
            "slug": "Visual-response-properties-of-neurons-in-four-areas-Baker-Petersen",
            "title": {
                "fragments": [],
                "text": "Visual response properties of neurons in four extrastriate visual areas of the owl monkey (Aotus trivirgatus): a quantitative comparison of medial, dorsomedial, dorsolateral, and middle temporal areas."
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "The response properties of 354 single neurons in the medial (M), dorsomedial (DM), dorsolateral (DL), and middle temporal (MT) visual areas were studied quantitatively with bar, spot, and random-dot stimuli in chronically implanted owl monkeys to support the hypothesis that there are specializations of function among the cortical visual areas."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4846633"
                        ],
                        "name": "H. Wässle",
                        "slug": "H.-Wässle",
                        "structuredName": {
                            "firstName": "Heinz",
                            "lastName": "Wässle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wässle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4892099"
                        ],
                        "name": "B. Boycott",
                        "slug": "B.-Boycott",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Boycott",
                            "middleNames": [
                                "Blundell"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Boycott"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145375056"
                        ],
                        "name": "R. Illing",
                        "slug": "R.-Illing",
                        "structuredName": {
                            "firstName": "Robert-Benjamin",
                            "lastName": "Illing",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Illing"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9853422,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b68cf0620b97dc8f20e671866380d162e349a848",
            "isKey": false,
            "numCitedBy": 350,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "The beta type of ganglion cell can be subdivided in Golgi-stained whole mounts of the cat retina according to the branching level of the dendritic tree in the inner plexiform layer. The dendritic branching level of on-beta cells is nearer to the cell body; that of off-beta cells is about 10 μm further outwards. After horseradish peroxidase (HRP) injection into the lateral geniculate nucleus all beta cells were labelled. In this way it is shown that about 55% of all ganglion cells, irrespective of retinal topography, are beta cells. The spatial distribution of on- and off-beta cells was studied from the HRP-labelled material. On-beta cells form a lattice with regular inter-cell spacings ; off-beta cells are also regularly arrayed. The two lattices are superimposed independently of each other. Beta cells are commonly assumed to be associated with the resolution of fine detail in the cat visual system. The mosaic of beta cells imposes some constraints and permits some predictions to be made with respect to the cat’s visual discrimination."
            },
            "slug": "Morphology-and-mosaic-of-on-and-off-beta-cells-in-Wässle-Boycott",
            "title": {
                "fragments": [],
                "text": "Morphology and mosaic of on- and off-beta cells in the cat retina and some functional considerations"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The mosaic of beta cells imposes some constraints and permits some predictions to be made with respect to the cat’s visual discrimination."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15685782,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1c387b70f37fd902735e6c2b76d9715a251d1b5e",
            "isKey": false,
            "numCitedBy": 1059,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "The striate cortex of the macaque monkey is subdivided into two independent and overlapping systems of columns termed “orientation columns” and “ocular dominance columns.” The present paper is concerned with the orientation columns, particularly their geometry and the relationship between successive columns. The arrangement of the columns is highly ordered; in the great majority of oblique or tangential microelectrode penetrations the preferred orientations of cells changed systematically with electrode position, in a clockwise or counterclockwise direction. Graphs of orientation vs. electrode track distance were virtually straight lines over distances of up to several millimeters; such orderly sequences were often terminated by sudden changes in the direction of orientation shifts, from clockwise to counterclockwise or back. The orientations at which these reversals occurred were quite unpredictable. Total rotations of 180–360° were frequently seen between reversals. In tangential or almost tangential penetrations orientation shifts occurred almost every time the electrode was moved forward, indicating that the columns were either not discrete or had a thickness of less than 25–50 μ, the smallest order of distance that our methods could resolve. In penetrations that were almost perpendicular to the surface, the graphs of orientation vs. track distance were relatively flatter, as expected if the surfaces of constant orientation are perpendicular to the cortical surface. Stepwise changes in orientation of about 10° could sometimes be seen in perpendicular penetrations, each orientation persisting through several clear advances of the electrode, suggesting a set of discrete columnar subdivisions. The possibility of some kind of continuous variation in orientation with horizontal distance along the cortex was not, however, completely ruled out. Occasionally a highly ordered sequence was broken by an abrupt large shift in orientation of up to 90°. Shifts in ocular dominance occurred roughly every 0.25–0.5 mm and were independent of orientation shifts. In multiple parallel penetrations spaced closer than about 250 μ the slopes of the orientation vs. track distance curves were almost the same; reconstruction of these penetrations indicated that the regions of constant orientation are parallel sheets. On crossing perpendicular to these sheets, a total orientation shift of 180° took place over a distance of 0.5–1.0 mm. Column thickness, size of shifts in orientation, and the rate of change of orientation with distance along the cortex seemed to be independent of eccentricity, at least between 2° and 15° from the fovea. A few penetrations made in area 17 of the cat and in area 18 of the monkey showed similar orderly sequences of receptive‐field orientation shifts."
            },
            "slug": "Sequence-regularity-and-geometry-of-orientation-in-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Sequence regularity and geometry of orientation columns in the monkey striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Column thickness, size of shifts in orientation, and the rate of change of orientation with distance along the cortex seemed to be independent of eccentricity, at least between 2° and 15° from the fovea."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49557422"
                        ],
                        "name": "R. Weller",
                        "slug": "R.-Weller",
                        "structuredName": {
                            "firstName": "Rosalyn",
                            "lastName": "Weller",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Weller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2328544"
                        ],
                        "name": "J. Kaas",
                        "slug": "J.-Kaas",
                        "structuredName": {
                            "firstName": "Jon",
                            "lastName": "Kaas",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kaas"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 140827783,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5dbd3db2bb3dad6e390df0912e25edfe96039478",
            "isKey": false,
            "numCitedBy": 58,
            "numCiting": 108,
            "paperAbstract": {
                "fragments": [],
                "text": "Over the last several years, considerable progress has been made in understanding the connections of the visual system in primates. Much of this progress has been the result of applications of the relatively new and powerful autoradiographic and histochemical tracing methods that reveal connections in great detail and clarity. The major limitation on further understanding of visual system connections does not seem to be technical at this time, but rather it is our incomplete knowledge of the functional subdivisions of the primate visual system. It is difficult to study connections of parts of the brain for which the organization and divisions into separate areas or nuclei are still unclear. Quite different schemes of cortical organization have been proposed for visual cortex of New World (5–7) and Old World monkeys (96, 111, 116–118) and neither of these schemes includes all of visually responsive cortex. For example, neither organization deals with subdivisions of inferotemporal cortex, a visually responsive region of cortex that in Old World monkeys has received detailed attention (33, 34, 59), without completely resolving the issue of number and boundaries of subdivisions. Efforts have been made to show similarites in cortical organization between Old and New World primates (1, 95, 99), but how similar or dissimilar the two groups of primates are presently remains uncertain."
            },
            "slug": "Cortical-and-Subcortical-Connections-of-Visual-in-Weller-Kaas",
            "title": {
                "fragments": [],
                "text": "Cortical and Subcortical Connections of Visual Cortex in Primates"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Efforts have been made to show similarites in cortical organization between Old and New World primates, but how similar or dissimilar the two groups of primates are presently remains uncertain."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40442568"
                        ],
                        "name": "A. Ginsburg",
                        "slug": "A.-Ginsburg",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Ginsburg",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Ginsburg"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143227020,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "b2f7c5b21d1f2a253ec910bcf6fcde61147e4ba7",
            "isKey": false,
            "numCitedBy": 92,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : A model of the human visual system is investigated for psychological correlates. A priori hypotheses from the model concerned with human identification of defocused letters as well as identification of rotated letters have been validated with the computer model. Gestalt principles of similarity, proximity, closure, and figure-ground perception as well as geometric illusions are explained in terms of spatial filter bandwidth using the optics homolog. The experimental results have allowed postulates which extend the model by means of another cortical transform and a spatial filter shape which is also psychologically correlated. It is further postulated that the human perceptual space is the image domain from spatially filtered transforms of object forms. It is concluded that the model provides a means of obtaining quantitative psychological correlates of the human visual system. Recommendations are made for additional investigations concerning psychological correlates."
            },
            "slug": "Psychological-Correlates-of-a-Model-of-the-Human-Ginsburg",
            "title": {
                "fragments": [],
                "text": "Psychological Correlates of a Model of the Human Visual System"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145746281"
                        ],
                        "name": "R. Nelson",
                        "slug": "R.-Nelson",
                        "structuredName": {
                            "firstName": "Randy",
                            "lastName": "Nelson",
                            "middleNames": [
                                "J"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Nelson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5579354"
                        ],
                        "name": "E. V. Famiglietti",
                        "slug": "E.-V.-Famiglietti",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Famiglietti",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. V. Famiglietti"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50502826"
                        ],
                        "name": "H. Kolb",
                        "slug": "H.-Kolb",
                        "structuredName": {
                            "firstName": "Helga",
                            "lastName": "Kolb",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Kolb"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 19034323,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7d7517ff97c65c3392f6f21cc6b1db21bc0595fe",
            "isKey": false,
            "numCitedBy": 628,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Ganglion cells in the retina of the cat were stained by intracellular dye injection after recording their responses to photic stimulation. 2. All cells encountered were divided into those giving on-responses and those producing off-responses, and the level of dendritic branching of these two groups was compared. Cells giving off-responses were found to branch high in the inner plexiform layer (IPL), near the amacrine cell bodies (sublamina a); those giving on-responses were found to branch lower in the inner plexiform layer (sublamina b). 3. Dye-injected cells varied widely in morphology and size, having cell bodies ranging in diameter from 8 to 32 micrometer and dendritic fields ranging from 25 to 490 micrometer in diameter; yet the sign of the response of each unit correlated only with the level of dendritic branching. Thus, no other morphological feature except stratification appears to be important in determining the sign of the response of these cells. 4. The stratification of ganglion cells into on- and off-layers parallels the distribution of the axon terminals of the flat and invaginating cone bipolars. Flat cone bipolars are in a position to contact off-center ganglion cells (in sublamina a) and invaginating cone bipolars are in a position to contact on-center ganglion cells (in sublamina b). 5. The rod and cone inputs to some cells were characterized by comparing their responses to deep red and blue rod-matched stimuli over a 2-log unit range starting at dark-adapted threshold. About half the cells appeared to be rod dominated under these conditions, whereas the others appeared to have mixed rod and cone signals. 6. The nature of the rod and cone pathways to ganglion cells is discussed."
            },
            "slug": "Intracellular-staining-reveals-different-levels-of-Nelson-Famiglietti",
            "title": {
                "fragments": [],
                "text": "Intracellular staining reveals different levels of stratification for on- and off-center ganglion cells in cat retina."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "No other morphological feature except stratification appears to be important in determining the sign of the response of these cells, and the nature of the rod and cone pathways to ganglion cells is discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1407756324"
                        ],
                        "name": "C. Enroth-Cugell",
                        "slug": "C.-Enroth-Cugell",
                        "structuredName": {
                            "firstName": "Christina",
                            "lastName": "Enroth-Cugell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Enroth-Cugell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3052969,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c6609ae352d9e1c99530136e41798f337496ff27",
            "isKey": false,
            "numCitedBy": 2635,
            "numCiting": 52,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "slug": "The-contrast-sensitivity-of-retinal-ganglion-cells-Enroth-Cugell-Robson",
            "title": {
                "fragments": [],
                "text": "The contrast sensitivity of retinal ganglion cells of the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34138398"
                        ],
                        "name": "R. Bracewell",
                        "slug": "R.-Bracewell",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Bracewell",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bracewell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 121023618,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "11ac98081c496a1d48d33b27cdadc6ffe76018d0",
            "isKey": false,
            "numCitedBy": 616,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "When a celestial source of radio waves is scanned with an aerial beam which is much longer than the source in one direction but suitably narrow in the other, the transformation from the true distribution to the measured value is referred to as strip integration. It is here treated as a special case of two-dimensional aerial smoothing in which the aerial beam is allowed to spin about its centre as it moves about the sky. It is shown that the resolution obtainable is set by the cross-sectional profile of the strip beam in the narrow dimension. Thus, when the strip reduces to a line, the resolution is complete and full reconstruction of the true distribution is possible; but scans must be made in all directions. In the general case it is shown that there is a principal solution, and that a finite number of scans suffices to determine it. A method is presented for reconstructing the principal solution from the observed data."
            },
            "slug": "Strip-Integration-in-Radio-Astronomy-Bracewell",
            "title": {
                "fragments": [],
                "text": "Strip Integration in Radio Astronomy"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 228358,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ddc2ea63fa69eca4aa44a4fd135543d67badcb23",
            "isKey": false,
            "numCitedBy": 3039,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies."
            },
            "slug": "Application-of-fourier-analysis-to-the-visibility-Campbell-Robson",
            "title": {
                "fragments": [],
                "text": "Application of fourier analysis to the visibility of gratings"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies and the results show clear patterns of uniformity in the response to grating noise."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2157389885"
                        ],
                        "name": "J. Taylor",
                        "slug": "J.-Taylor",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Taylor",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Taylor"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121110640,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "8610cdec7efa0d8fe3918f9741ea80fbda3b585c",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Two-Dimensional-Brightness-Distributions-of-Radio-Taylor",
            "title": {
                "fragments": [],
                "text": "Two-Dimensional Brightness Distributions of Radio Sources from Lunar Occultation Observations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1935795"
                        ],
                        "name": "I. Thompson",
                        "slug": "I.-Thompson",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Thompson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Thompson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46682866,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "06bdc1c6e2ecd82cf132c3d41498ba21ae05609f",
            "isKey": false,
            "numCitedBy": 6,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Variation-in-the-spatial-frequency-selectivity-of-Thompson-Tolhurst",
            "title": {
                "fragments": [],
                "text": "Variation in the spatial frequency selectivity of neurones in the cat visual cortex [proceedings]."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39274396"
                        ],
                        "name": "D. Mackay",
                        "slug": "D.-Mackay",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Mackay",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mackay"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4367218,
            "fieldsOfStudy": [
                "Computer Science",
                "Medicine"
            ],
            "id": "13cdac78e65d83c1ac0ab63f182cdc4aa7f75a3c",
            "isKey": false,
            "numCitedBy": 62,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Strife-over-visual-cortical-function-Mackay",
            "title": {
                "fragments": [],
                "text": "Strife over visual cortical function"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Pollen , \" Spatial and temporal selectivity of VI neurons in the macaque monkey"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Tolhurst , \" On the response linearity of neurones in cat visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Physiol ."
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Tootell , \" Spatial frequencyspecific inhibition in cat striate cortex cells"
            },
            "venue": {
                "fragments": [],
                "text": "Physiol ."
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The striate cortex and the spatial analysis of visual space"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Spatiotemporal masking : asymmetry , nonseparability and facilitation"
            },
            "venue": {
                "fragments": [],
                "text": "Ophthalmol . Visual Sci ."
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Spatial and temporal properties of ' sustained ' and ' transient ' neurons in area 17 of the cat ' s visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Pollen , \" Spatial and temporal selectivity of V 2 neurons in the macaque monkey"
            },
            "venue": {
                "fragments": [],
                "text": "Ophthalmol . Visual Sci ."
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the existence in the human visual system of neurons selectively sensitive to the orientation and size of retinal images"
            },
            "venue": {
                "fragments": [],
                "text": "Physiol ."
            },
            "year": 1969
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Receptive fields : Neural representation of the spatial and intensive attributes of the visual image"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 37,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Visual-cortical-neurons-as-localized-spatial-Pollen-Ronner/5ec37637d34c792a3798e9724be81d041ca0ec32?sort=total-citations"
}