{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69960817"
                        ],
                        "name": "M. R. Quillian",
                        "slug": "M.-R.-Quillian",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Quillian",
                            "middleNames": [
                                "Ross"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. R. Quillian"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28072126,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "53a27d628a08f56c3a6112aadb7007797c7b0554",
            "isKey": false,
            "numCitedBy": 755,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : In order to discover design principles for a large memory that can enable it to serve as the base of knowledge underlying human-like language behavior, experiments with a model memory are being performed. This model is built up within a computer by 'recoding' a body of information from an ordinary dictionary into a complex network of elements and associations. Then the ability of a program to use the resulting model memory effectively for simulating human performance provides a test of its design. One simulation program, now running, is given the model memory and is required to compare and contrast the meanings of arbitrary pairs of English words. For each pair, the program locates any relevant semantic information within the model memory, draws inferences on the basis of this, and thereby discovers various relationships between the meanings of the two words. Finally, it creates English text to express its conclusions. The design principles embodied in the memory model together with some of the methods used by the program constitute a theory of how human memory for semantic and other conceptual material may be formatted, organized, and used. (Author)"
            },
            "slug": "Word-concepts:-a-theory-and-simulation-of-some-Quillian",
            "title": {
                "fragments": [],
                "text": "Word concepts: a theory and simulation of some basic semantic capabilities."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The design principles embodied in the memory model together with some of the methods used by the program constitute a theory of how human memory for semantic and other conceptual material may be formatted, organized, and used."
            },
            "venue": {
                "fragments": [],
                "text": "Behavioral science"
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69960817"
                        ],
                        "name": "M. R. Quillian",
                        "slug": "M.-R.-Quillian",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Quillian",
                            "middleNames": [
                                "Ross"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. R. Quillian"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15304609,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "be02603f27853d3cf6ef10cadc64727ed505cc25",
            "isKey": false,
            "numCitedBy": 439,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "The Teachable Language Comprehender (TLC) is a program designed to be capable of being taught to “comprehend” English text. When text which the program has not seen before is input to it, it comprehends that text by correctly relating each (explicit or implicit) assertion of the new text to a large memory. This memory is a “semantic network” representing factual assertions about the world.\nThe program also creates copies of the parts of its memory which have been found to relate to the new text, adapting and combining these copies to represent the meaning of the new text. By this means, the meaning of all text the program successfully comprehends is encoded into the same format as that of the memory. In this form it can be added into the memory.\nBoth factual assertions for the memory and the capabilities for correctly relating text to the memory's prior content are to be taught to the program as they are needed. TLC presently contains a relatively small number of examples of such assertions and capabilities, but within the system, notations for expressing either of these are provided. Thus the program now corresponds to a general process for comprehending language, and it provides a methodology for adding the additional information this process requires to actually comprehend text of any particular kind.\nThe memory structure and comprehension process of TLC allow new factual assertions and capabilities for relating text to such stored assertions to generalize automatically. That is, once such an assertion or capability is put into the system, it becomes available to help comprehend a great many other sentences in the future. Thus the addition of a single factual assertion or linguistic capability will often provide a large increment in TLC's effective knowledge of the world and in its overall ability to comprehend text.\nThe program's strategy is presented as a general theory of"
            },
            "slug": "The-teachable-language-comprehender:-a-simulation-Quillian",
            "title": {
                "fragments": [],
                "text": "The teachable language comprehender: a simulation program and theory of language"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The memory structure and comprehension process of TLC allow new factual assertions and capabilities for relating text to such stored assertions to generalize automatically and provide a large increment in TLC's effective knowledge of the world and in its overall ability to comprehend text."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102856791"
                        ],
                        "name": "S. Sternberg",
                        "slug": "S.-Sternberg",
                        "structuredName": {
                            "firstName": "Saul",
                            "lastName": "Sternberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sternberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18013423,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "17d0872d524c9aced2523b00f195b4a3951a019e",
            "isKey": false,
            "numCitedBy": 1953,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "When subjects judge whether a test symbol is contained in a short memorized sequence of symbols, their mean reaction-time increases linearly with the length of the sequence. The linearity and slope of the function imply the existence of an internal serial-comparison process whose average rate is between 25 and 30 symbols per second."
            },
            "slug": "High-Speed-Scanning-in-Human-Memory-Sternberg",
            "title": {
                "fragments": [],
                "text": "High-Speed Scanning in Human Memory"
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "When subjects judge whether a test symbol is contained in a short memorized sequence of symbols, their mean reaction-time increases linearly with the length of the sequence, implying the existence of an internal serial-comparison process."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107623844"
                        ],
                        "name": "E. Smith",
                        "slug": "E.-Smith",
                        "structuredName": {
                            "firstName": "E.",
                            "lastName": "Smith",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Smith"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6173052,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "b7005144b0bd1aa0ef75c85691d77a800c6d5589",
            "isKey": false,
            "numCitedBy": 394,
            "numCiting": 70,
            "paperAbstract": {
                "fragments": [],
                "text": "Choice reaction time to visual stimuli - analysis of major theoretical positions to perceptual recognition theories"
            },
            "slug": "Choice-reaction-time:-an-analysis-of-the-major-Smith",
            "title": {
                "fragments": [],
                "text": "Choice reaction time: an analysis of the major theoretical positions."
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "Choice reaction time to visual stimuli - analysis of major theoretical positions to perceptual recognition theories and its applications to choice reaction time-based recognition theories."
            },
            "venue": {
                "fragments": [],
                "text": "Psychological bulletin"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107623909"
                        ],
                        "name": "E. Smith",
                        "slug": "E.-Smith",
                        "structuredName": {
                            "firstName": "E",
                            "lastName": "Smith",
                            "middleNames": [
                                "E"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Smith"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30359566,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "459f4d98d949f989308f0dd711e7a01f22356953",
            "isKey": false,
            "numCitedBy": 55,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Effects-of-familiarity-on-stimulus-recognition-and-Smith",
            "title": {
                "fragments": [],
                "text": "Effects of familiarity on stimulus recognition and categorization."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of experimental psychology"
            },
            "year": 1967
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 5,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Retrieval-time-from-semantic-memory-Collins-Quillian/06cb835bda3420186e2c6f6fa2dbc1613a9b2d75?sort=total-citations"
}