{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27092071"
                        ],
                        "name": "B. Baird",
                        "slug": "B.-Baird",
                        "structuredName": {
                            "firstName": "Bill",
                            "lastName": "Baird",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Baird"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 0
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "corpusId": 18730591,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b744aa0dbf9f87dd67ee917bf7c53cc81e2cd4a8",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "A new learning algorithm for the storage of static and periodic attractors in biologically inspired recurrent analog neural networks is introduced. For a network of n nodes, n static or n/2 periodic attractors may be stored. The algorithm allows programming of the network vector field independent of the patterns to be stored. Stability of patterns, basin geometry, and rates of convergence may be controlled. For orthonormal patterns, the learning operation reduces to a kind of periodic outer product rule that allows local, additive, commutative, incremental learning. Standing or traveling wave cycles may be stored to mimic the kind of oscillating spatial patterns that appear in the neural activity of the olfactory bulb and prepyriform cortex during inspiration and suffice, in the bulb, to predict the pattern recognition behavior of rabbits in classical conditioning experiments. These attractors arise, during simulated inspiration, through a multiple Hopf bifurcation, which can act as a critical \"decision point\" for their selection by a very small input pattern."
            },
            "slug": "A-Bifurcation-Theory-Approach-to-the-Programming-of-Baird",
            "title": {
                "fragments": [],
                "text": "A Bifurcation Theory Approach to the Programming of Periodic Attractors in Network Models of Olfactory Cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "A new learning algorithm for the storage of static and periodic attractors in biologically inspired recurrent analog neural networks is introduced, which allows programming of the network vector field independent of the patterns to be stored."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27092071"
                        ],
                        "name": "B. Baird",
                        "slug": "B.-Baird",
                        "structuredName": {
                            "firstName": "Bill",
                            "lastName": "Baird",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Baird"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144784302"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Freeman",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2010432"
                        ],
                        "name": "F. Eeckman",
                        "slug": "F.-Eeckman",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Eeckman",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Eeckman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110254356"
                        ],
                        "name": "Y. Yao",
                        "slug": "Y.-Yao",
                        "structuredName": {
                            "firstName": "Yong",
                            "lastName": "Yao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Yao"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 57,
                                "start": 42
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "corpusId": 58045748,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a7d77a28d03e2a17f5acbf7f0a7aeeef7dd45f02",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Network algorithms and architectures for pattern recognition derived from neural models of the olfactory system are reviewed. These span a range from highly abstract to physiologically detailed, and employ the kind of dynamical complexity observed in olfactory cortex, ranging from oscillation to chaos. A simple architecture and algorithm for analytically guaranteed associative memory storage of analog patterns, continuous sequences, and chaotic attractors in the same network is described. A matrix inversion determines network weights, given prototype patterns to be stored. There are N units of capacity in an N node network with 3N2 weights. It costs one unit per static attractor, two per Fourier component of each sequence, and three to four per chaotic attractor. There are no spurious attractors, and for sequences there is a Liapunov function in a special coordinate system which governs the approach of transient states to stored trajectories. Unsupervised or supervised incremental learning algorithms for pattern classification, such as competitive learning or bootstrap Widrow-Hoff can easily be implemented. The architecture can be ''folded'' into a recurrent network with higher order weights that can be used as a model of cortex that stores oscillatory and chaotic attractors by a Hebb rule. Network performance is demonstrated by application to the problem of real-time handwritten digit recognition. An effective system with on-line learning has been written by Eeckman and Baird for the Macintosh. It utilizes static, oscillatory, and/or chaotic attractors of two kinds--Lorenze attractors, or attractors resulting from chaotically interacting oscillatory modes. The successful application to an industrial pattern recognition problem of a network architecture of considerable physiological and dynamical complexity, developed by Freeman and Yao, is described. The data sets of the problem come in three classes of difficulty, and performance of the biological network is favorably compared with that of several other network and statistical pattern recognition methods.© (1991) COPYRIGHT SPIE--The International Society for Optical Engineering. Downloading of the abstract is permitted for personal use only."
            },
            "slug": "Applications-of-chaotic-neurodynamics-in-pattern-Baird-Freeman",
            "title": {
                "fragments": [],
                "text": "Applications of chaotic neurodynamics in pattern recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The successful application to an industrial pattern recognition problem of a network architecture of considerable physiological and dynamical complexity, developed by Freeman and Yao, is described and performance of the biological network is favorably compared with that of several other network and statistical pattern recognition methods."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27092071"
                        ],
                        "name": "B. Baird",
                        "slug": "B.-Baird",
                        "structuredName": {
                            "firstName": "Bill",
                            "lastName": "Baird",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 0
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "corpusId": 16479949,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "6787a9093ac0e573745e8fc30b7c1145412f559d",
            "isKey": false,
            "numCitedBy": 8,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Analytic methods of bifurcation theory are used to design algorithms for synthesis of analog neural networks with a precisely defined local vector field for pattern recognition that is created by a multiple bifurcation. For two memories thus far, static or oscillating spatial patterns can be stored, basin boundaries programmed, and the location of secondary bifurcations that introduce new attractors determined in the neighborhood of the bifurcation.<<ETX>>"
            },
            "slug": "Bifurcation-theory-methods-for-programming-static-Baird",
            "title": {
                "fragments": [],
                "text": "Bifurcation theory methods for programming static or periodic attractors and their bifurcations in dynamic neural networks"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Analytic methods of bifurcation theory are used to design algorithms for synthesis of analog neural networks with a precisely defined local vector field for pattern recognition that is created by a multiple bifURcation."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE 1988 International Conference on Neural Networks"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27092071"
                        ],
                        "name": "B. Baird",
                        "slug": "B.-Baird",
                        "structuredName": {
                            "firstName": "Bill",
                            "lastName": "Baird",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 0
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "corpusId": 14557759,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "78f5003f19c3e724c0d35bcf0d0287977e315265",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "Analytic methods of bifurcation theory are used to design algorithms for determining synaptic weights in recurrent analog neural network architectures. Nonnumerical formulas, as well as numerical learning algorithms using hidden units for the storage of static and periodic attractors, are introduced. These algorithms allow programming of the network vector field regardless of the patterns to be stored. Stability of patterns and cycles, basin geometry, and rates of convergence may be controlled. For a network of n nodes, n static of n/2 periodic attractors can be stored by a projection algorithm. For orthogonal patterns, this learning operation reduces to a kind of periodic outer product rule that allows local, additive, and commutative incremental learning. Standing- or traveling-wave cycles may be stored to mimic the kind of oscillating spatial patterns that appear in the neural activity of the olfactory bulb and prepyriform cortex during inspiration, and suffice, in the bulb, to predict the pattern recognition behavior of rabbits in classical conditioning experiments. These attractors arise, during simulated inspiration, through a multiple Hopf bifurcation, which can act as a critical decision point for their selection by very small input patterns.<<ETX>>"
            },
            "slug": "A-bifurcation-theory-approach-to-vector-field-for-Baird",
            "title": {
                "fragments": [],
                "text": "A bifurcation theory approach to vector field programming for periodic attractors"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "Analytic methods of bifurcation theory are used to design algorithms for determining synaptic weights in recurrent analog neural network architectures and nonnumerical formulas, as well as numerical learning algorithms using hidden units for the storage of static and periodic attractors, are introduced."
            },
            "venue": {
                "fragments": [],
                "text": "International 1989 Joint Conference on Neural Networks"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27092071"
                        ],
                        "name": "B. Baird",
                        "slug": "B.-Baird",
                        "structuredName": {
                            "firstName": "Bill",
                            "lastName": "Baird",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 0
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "corpusId": 122624031,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7ce2ea543254489e9ce51d54e7498a792a02a970",
            "isKey": false,
            "numCitedBy": 6,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "A neural network model describing pattern recognition in the rabbit olfactory bulb is analysed to explain the changes in neural activity observed experimentally during classical Pavlovian conditioning. EEG activity recorded from an 8×8 arry of 64 electrodes directly on the surface on the bulb shows distinct spatial patterns of oscillation that correspond to the animal’s recognition of different conditioned odors and change with conditioning to new odors. The model may be considered a variant of Hopfield’s model of continuous analog neural dynamics. Excitatory and inhibitory cell types in the bulb and the anatomical architecture of their connection requires a nonsymmetric coupling matrix. As the mean input level rises during each breath of the animal, the system bifurcates from homogenous equilibrium to a spatially patterned oscillation. The theory of multiple Hopf bifurcations is employed to find coupled equations for the amplitudes of these unstable oscillatory modes independent of frequency. This allows..."
            },
            "slug": "Bifurcation-analysis-of-oscillating-network-model-Baird",
            "title": {
                "fragments": [],
                "text": "Bifurcation analysis of oscillating network model of pattern recognition in the rabbit olfactory bulb"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A neural network model describing pattern recognition in the rabbit olfactory bulb is analysed to explain the changes in neural activity observed experimentally during classical Pavlovian conditioning."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27092071"
                        ],
                        "name": "B. Baird",
                        "slug": "B.-Baird",
                        "structuredName": {
                            "firstName": "Bill",
                            "lastName": "Baird",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Baird"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 41,
                                "start": 23
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "corpusId": 6342446,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "89418316dcfb47960bdb406dbd6e06149fb09cff",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "A generic model of oscillating cortex, which assumes \"minimal\" coupling justified by known anatomy, is shown to function as an associative memory, using previously developed theory. The network has explicit excitatory neurons with local inhibitory interneuron feedback that forms a set of nonlinear oscillators coupled only by long range excitatory connections. Using a local Hebb-like learning rule for primary and higher order synapses at the ends of the long range connections, the system learns to store the kinds of oscillation amplitude patterns observed in olfactory and visual cortex. This rule is derived from a more general \"projection algorithm\" for recurrent analog networks, that analytically guarantees content addressable memory storage of continuous periodic sequences - capacity: N/2 Fourier components for an N node network - no \"spurious\" attractors."
            },
            "slug": "Associative-Memory-in-a-Simple-Model-of-Oscillating-Baird",
            "title": {
                "fragments": [],
                "text": "Associative Memory in a Simple Model of Oscillating Cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A generic model of oscillating cortex, which assumes \"minimal\" coupling justified by known anatomy, is shown to function as an associative memory, using previously developed theory."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27092071"
                        ],
                        "name": "B. Baird",
                        "slug": "B.-Baird",
                        "structuredName": {
                            "firstName": "Bill",
                            "lastName": "Baird",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 58
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "corpusId": 116026357,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e221b7b0dbeeb59007d48b59b8ed49cca820183d",
            "isKey": false,
            "numCitedBy": 1,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "We show how hierarchical networks may be constructed of interconnected oscillatory network modules developed previously as models of olfactory cortex, or caricatures of “patches”of neocortex. The architecture is such that the larger system is itself a special case of the type of network of the submodules, and can be analysed with the same tools used to design the subnetwork modules. A particular subnetwork is formed by a set of neural populations whose interconnections also contain higher order synapses. These synapses determine attractors for that subnetwork independent of other subnetworks. Each subnetwork module assumes only minimal coupling justified by known anatomy. An N node network can be shown to function as an associative memory for up to N/2 oscillatory and N/3 chaotic memory attractors."
            },
            "slug": "Information-Processing-by-Dynamical-Interaction-of-Baird",
            "title": {
                "fragments": [],
                "text": "Information Processing by Dynamical Interaction of Oscillatory Modes in Coupled Cortical Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 81,
                "text": "It is shown how hierarchical networks may be constructed of interconnected oscillatory network modules developed previously as models of olfactory cortex, or caricatures of “patches” of neocortex, and can be analysed with the same tools used to design the subnetwork modules."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27092071"
                        ],
                        "name": "B. Baird",
                        "slug": "B.-Baird",
                        "structuredName": {
                            "firstName": "Bill",
                            "lastName": "Baird",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Baird"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2010432"
                        ],
                        "name": "F. Eeckman",
                        "slug": "F.-Eeckman",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Eeckman",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Eeckman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8184337,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2942bccd646603453ba53c07d5091d9bcd644377",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "A simple architecture and algorithm for analytically guaranteed associative memory storage of analog patterns, continuous sequences, and chaotic attractors in the same network is described. A matrix inversion determines network weights, given prototype patterns to be stored. There are N units of capacity in an N node network with 3N2 weights. It costs one unit per static attractor, two per Fourier component of each sequence, and four per chaotic attractor. There are no spurious attractors, and there is a Liapunov function in a special coordinate system which governs the approach of transient states to stored trajectories. Unsupervised or supervised incremental learning algorithms for pattern classification, such as competitive learning or bootstrap Widrow-Hoff can easily be implemented. The architecture can be \"folded\" into a recurrent network with higher order weights that can be used as a model of cortex that stores oscillatory and chaotic attractors by a Hebb rule. Hierarchical sensory-motor control networks may be constructed of interconnected \"cortical patches\" of these network modules. Network performance is being investigated by application to the problem of real time handwritten digit recognition."
            },
            "slug": "CAM-Storage-of-Analog-Patterns-and-Continuous-with-Baird-Eeckman",
            "title": {
                "fragments": [],
                "text": "CAM Storage of Analog Patterns and Continuous Sequences with 3N2 Weights"
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "A simple architecture and algorithm for analytically guaranteed associative memory storage of analog patterns, continuous sequences, and chaotic attractors in the same network is described and is being investigated by application to the problem of real time handwritten digit recognition."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27092071"
                        ],
                        "name": "B. Baird",
                        "slug": "B.-Baird",
                        "structuredName": {
                            "firstName": "Bill",
                            "lastName": "Baird",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 41,
                                "start": 23
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "corpusId": 17540210,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "8e1e4b2673ab6e5d43428385e45de7508698f762",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "A simple network model of olfactory cortex, which assumes only minimal coupling justified by known anatomy, can be analytically proven to function as an associative memory for oscillatory patterns. The network has explicit excitatory neural populations with local inhibitory interneu- ron feedback that forms a set of nonlinear oscillators coupled only by long range excitatory connections. Using a local Hebb-like learning rule for primary and higher order synapses at the ends of the long range connections, the system can learn to store the kinds of oscillation amplitude and phase patterns observed in olfactory and visual cortex. The network can be truely self-organizing because a synapse can modify itself according to it’s own pre and postsynaptic activity during stimulation by an input pattern to be learned. The neurons of the neuron pools modeled here can be viewed as operating in the linear region of the usual sigmoidal axonal non- linearity, and multiple memories are stored instead by the learned synaptic nonlinearities"
            },
            "slug": "Learning-with-Synaptic-Nonlinearities-in-a-Coupled-Baird",
            "title": {
                "fragments": [],
                "text": "Learning with Synaptic Nonlinearities in a Coupled Oscillator Model of Olfactory Cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A simple network model of olfactory cortex, which assumes only minimal coupling justified by known anatomy, can be analytically proven to function as an associative memory for oscillatory patterns."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27092071"
                        ],
                        "name": "B. Baird",
                        "slug": "B.-Baird",
                        "structuredName": {
                            "firstName": "Bill",
                            "lastName": "Baird",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 0
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "corpusId": 122602593,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "7624f12c1f6c369c07c3bc57cbcc3024ac676c2b",
            "isKey": false,
            "numCitedBy": 155,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Nonlinear-dynamics-of-pattern-formation-and-pattern-Baird",
            "title": {
                "fragments": [],
                "text": "Nonlinear dynamics of pattern formation and pattern recognition in the rabbit olfactory bulb"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27092071"
                        ],
                        "name": "B. Baird",
                        "slug": "B.-Baird",
                        "structuredName": {
                            "firstName": "Bill",
                            "lastName": "Baird",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 41,
                                "start": 23
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "corpusId": 20055230,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a66aa986e281bc2f4751fc1e5fb9cdf08830fea7",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "An analytic formula is used to set weights in recurrent analog networks with higher-order correlations to achieve the associative or content-addressable memory (CAM) storage of continuous pattern sequences as periodic trajectories. This learning rule allows programming of characteristics of the network vector field independently of the spatiotemporal patterns to be stored. Stability of sequences, basin geometry, and rates of convergence may be determined. A Lyapunov function in a special coordinate system governs the approach of initial conditions to the nearest stored trajectory"
            },
            "slug": "A-learning-rule-for-CAM-storage-of-continuous-Baird",
            "title": {
                "fragments": [],
                "text": "A learning rule for CAM storage of continuous periodic sequences"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "An analytic formula is used to set weights in recurrent analog networks with higher-order correlations to achieve the associative or content-addressable memory (CAM) storage of continuous pattern sequences as periodic trajectories."
            },
            "venue": {
                "fragments": [],
                "text": "1990 IJCNN International Joint Conference on Neural Networks"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144784302"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Freeman",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27092071"
                        ],
                        "name": "B. Baird",
                        "slug": "B.-Baird",
                        "structuredName": {
                            "firstName": "Bill",
                            "lastName": "Baird",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Baird"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 0
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "corpusId": 20057657,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "7723fe703e008564b259ee37d79e115d9c0a4bef",
            "isKey": false,
            "numCitedBy": 153,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The hypothesis that odor-specific patterns of mitral cell activity during odor discrimination might be found in the corresponding spatial patterns of electroencephalogram (EEG) amplitude over a surgically accessible segment of the bulbar surface was tested in rabbits with chronically implanted electrode arrays. The spatial spectrum of the bulbar EEG was derived and compared with the spectrum predicted for the granule cell generator. Spatial filters were devised to identify, enhance, or remove the granule cell contribution to the EEG. Spatial deconvolution was applied to the filtered granule cell activity patterns to correct for distortion caused by volume conduction. The results indicated that the bulb generated odor-specific spatial patterns in rabbits trained to discriminate between two odors. The odor-specific information was not localizable to subsets of channels. This suggested that the discriminative output of the bulb involved the entire structure, even though the receptor input was delivered to limited subsets of mitral cells."
            },
            "slug": "Relation-of-olfactory-EEG-to-behavior:-spatial-Freeman-Baird",
            "title": {
                "fragments": [],
                "text": "Relation of olfactory EEG to behavior: spatial analysis."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The results indicated that the bulb generated odor-specific spatial patterns in rabbits trained to discriminate between two odors, suggesting that the discriminative output of the bulb involved the entire structure, even though the receptor input was delivered to limited subsets of mitral cells."
            },
            "venue": {
                "fragments": [],
                "text": "Behavioral neuroscience"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27092071"
                        ],
                        "name": "B. Baird",
                        "slug": "B.-Baird",
                        "structuredName": {
                            "firstName": "Bill",
                            "lastName": "Baird",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 57,
                                "start": 42
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "corpusId": 145196207,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "9b07a4d26e28a855b9d9cf057dd9cb7d7bb4c7dd",
            "isKey": false,
            "numCitedBy": 1,
            "numCiting": 85,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Biologically-applied-neural-networks-may-foster-the-Baird",
            "title": {
                "fragments": [],
                "text": "Biologically applied neural networks may foster the coevolution of neurobiology and Cognitive psychology"
            },
            "venue": {
                "fragments": [],
                "text": "Behavioral and Brain Sciences"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Click the link beneath to read \"Nie Weiping Go the temple entry Exercises registered(Chinese Edition"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 41,
                                "start": 23
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Bifurcation and learning in network models of oscillating cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Physica D,"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "teach ers in self -cu ltiv atio n Bo o ks"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Sp ecials( C h in ese Ed itio n ) kn o w led ge"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Click the link beneath to read \"Genuine] teachers in self-cultivation Books ---the pursue the education of Wutuobangbao into in J57(Chinese Edition"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 58
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A neural network computer architecture for computation with oscilla-  tory and chaotic attractors"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. 2nd Int. Conf. on Fuzzy Logic and Neural  Networks,"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 57,
                                "start": 42
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Secondary structure modelling of bacteriorodhopsin"
            },
            "venue": {
                "fragments": [],
                "text": "Biophysical Journal,"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 0
                            }
                        ],
                        "text": "[2, 1, 3, 31, 5, 4, 7] [8, 9, 10, 32, 12] [21, 25, 20, 6] [11, 23, 24, 22, 28, 26, 33, 30, 18] [27, 14, 29, 13, 16, 17, 19, 15] Bill Baird { Publications References [1] B."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Bifurcation analysis of a network model of the rabbit olfactory bulb with periodic attractors  stored by a sequence learning algorithm"
            },
            "venue": {
                "fragments": [],
                "text": "In Proceedings of the IEEE First International Conference on  Neural Networks,"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A neural network computer architecture for computation with oscillatory and chaotic attractors"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. 2nd Int. Conf. on Fuzzy Logic and Neural Networks"
            },
            "year": 1992
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 22,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/In-Advances-in-Neural-Information-Processing-Hanson/69d7086300e7f5322c06f2f242a565b3a182efb5?sort=total-citations"
}