{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699205"
                        ],
                        "name": "S. Furui",
                        "slug": "S.-Furui",
                        "structuredName": {
                            "firstName": "Sadaoki",
                            "lastName": "Furui",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Furui"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "The dynamic features represented by the regression coefficients have the advantage of being robust with respect to frequency response distortions introduced by transmission systems [ 5 ]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "In a previous experiment in speaker verification using the first and second polynomial expansion coefficients extracted from each time sequence of cepstrurn coefficients, the effectiveness of these dynamic features was demonstrated [4], [ 5 ]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "The optimum length of the speech segment for extracting the regression coefficients in this method is almost onehalf of that adopted in the speaker verification system using short English sentences [ 5 ]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 62219893,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "374d9f4d9e8e1aae89033c9abe61e74e9bf2869b",
            "isKey": false,
            "numCitedBy": 1403,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes new techniques for automatic speaker verification using telephone speech. The operation of the system is based on a set of functions of time obtained from acoustic analysis of a fixed, sentence-long utterance. Cepstrum coefficients are extracted by means of LPC analysis successively throughout an utterance to form time functions, and frequency response distortions introduced by transmission systems are removed. The time functions are expanded by orthogonal polynomial representations and, after a feature selection procedure, brought into time registration with stored reference functions to calculate the overall distance. This is accomplished by a new time warping method using a dynamic programming technique. A decision is made to accept or reject an identity claim, based on the overall distance. Reference functions and decision thresholds are updated for each customer. Several sets of experimental utterances were used for the evaluation of the system, which include male and female utterances recorded over a conventional telephone connection. Male utterances processed by ADPCM and LPC coding systems were used together with unprocessed utterances. Results of the experiment indicate that verification error rate of one percent or less can be obtained even if the reference and test utterances are subjected to different transmission conditions."
            },
            "slug": "Cepstral-analysis-technique-for-automatic-speaker-Furui",
            "title": {
                "fragments": [],
                "text": "Cepstral analysis technique for automatic speaker verification"
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "New techniques for automatic speaker verification using telephone speech based on a set of functions of time obtained from acoustic analysis of a fixed, sentence-long utterance using a new time warping method using a dynamic programming technique."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699205"
                        ],
                        "name": "S. Furui",
                        "slug": "S.-Furui",
                        "structuredName": {
                            "firstName": "Sadaoki",
                            "lastName": "Furui",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Furui"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14833627"
                        ],
                        "name": "A. Rosenberg",
                        "slug": "A.-Rosenberg",
                        "structuredName": {
                            "firstName": "Aaron",
                            "lastName": "Rosenberg",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 40160643,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "0d113bb177852f510e621170e83080d99dcea0af",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "New techniques for automatic speaker verification are described which are based on cepstral analysis of fixed sentence-long utterances. Utterances are represented by time functions of cepstral coefficients expanded by an orthogonal polynomial. Sample utterance representations are compared with similarly constituted reference patterns to decide whether to accept or reject an identity claim. A dynamic programming technique is used to bring sample utterance representations into time registration with reference patterns. A local distance measurement is summed along the optimal path associated with the time registration to provide an overall distance which is compared with a threshold to effect the decision. Results of an evaluation using prerecorded utterance sets including telephone speech are presented. Verification error rates less 1% are obtained."
            },
            "slug": "Experimental-studies-in-a-new-automatic-speaker-Furui-Rosenberg",
            "title": {
                "fragments": [],
                "text": "Experimental studies in a new automatic speaker verification system using telephone speech"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "New techniques for automatic speaker verification are described which are based on cepstral analysis of fixed sentence-long utterances, and results of an evaluation using prerecorded utterance sets including telephone speech are presented."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143885067"
                        ],
                        "name": "M. Brown",
                        "slug": "M.-Brown",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Brown",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brown"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712517"
                        ],
                        "name": "L. Rabiner",
                        "slug": "L.-Rabiner",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Rabiner",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Rabiner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 20716390,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "970f328c3efc055fcf9fa33a6ef2131f97d8faa6",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Recognition of isolated words by encoding speech into linear predictive coefficients (LPC) is well known and widely accepted as one of the better methods for speech recognition. One of the drawbacks in relying entirely on LPC measures for recognition, however, is that the energy information in the speech is removed during the LPC analysis. Consequently, attempts have been made to include energy pattern information along with the LPC pattern information to achieve greater recognition accuracy. This paper discusses problems involved in combining energy pattern information with the LPC pattern information and presents results of recognition experiments with one method. The energy information and LPC information are combined linearly in a (speech) frame-by-frame manner utilizing the dynamic time warping (DTW) method time alignment. The LPC log likelihood ratio distance function, which determines the spectral difference between two frames of speech, does not lend itself to direct statistical analysis in multiple dimensions. The method for obtaining the weighting for the linear combination involves an iterative minimization of a probability of error function. The combined energy and LPC distance function was tested using a 129-word “airline” vocabulary, which is designed for speaker-independent, isolated word recognition. The inclusion of energy information in the recognition feature space reduces recognition error rates by an average of about 25 percent as compared with LPC alone."
            },
            "slug": "On-the-use-of-energy-in-LPC-based-recognition-of-Brown-Rabiner",
            "title": {
                "fragments": [],
                "text": "On the use of energy in LPC-based recognition of isolated words"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The inclusion of energy information in the recognition feature space reduces recognition error rates by an average of about 25 percent as compared with LPC alone, and results of recognition experiments with one method are presented."
            },
            "venue": {
                "fragments": [],
                "text": "The Bell System Technical Journal"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2188966"
                        ],
                        "name": "N. Sugamura",
                        "slug": "N.-Sugamura",
                        "structuredName": {
                            "firstName": "Noboru",
                            "lastName": "Sugamura",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Sugamura"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9243990"
                        ],
                        "name": "K. Shikano",
                        "slug": "K.-Shikano",
                        "structuredName": {
                            "firstName": "Kiyohiro",
                            "lastName": "Shikano",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Shikano"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699205"
                        ],
                        "name": "S. Furui",
                        "slug": "S.-Furui",
                        "structuredName": {
                            "firstName": "Sadaoki",
                            "lastName": "Furui",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Furui"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 19210910,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b4108c62690098323276f25dc0074775f770e638",
            "isKey": false,
            "numCitedBy": 54,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes new technique for use in a word recognition system. This recognition system is especially efffective in speaker-dependent large vocabulary word recognition based on multiple reference templates. In this system, word templates are represented as sequences of descrete phoneme-like (pseudo-phoneme) templates which are automatically determined from a training set of word utterances by a clustering technique. In speaker-dependent 641 city names word recognition experiments, 96.3% recognition accuracy was obtained using 256 phoneme-like templates."
            },
            "slug": "Isolated-word-recognition-using-phoneme-like-Sugamura-Shikano",
            "title": {
                "fragments": [],
                "text": "Isolated word recognition using phoneme-like templates"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "New technique for use in a word recognition system where word templates are represented as sequences of descrete phoneme-like (pseudo-phoneme) templates which are automatically determined from a training set of word utterances by a clustering technique."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2612031"
                        ],
                        "name": "K. Elenius",
                        "slug": "K.-Elenius",
                        "structuredName": {
                            "firstName": "Kjell",
                            "lastName": "Elenius",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Elenius"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38594228"
                        ],
                        "name": "M. Blomberg",
                        "slug": "M.-Blomberg",
                        "structuredName": {
                            "firstName": "Mats",
                            "lastName": "Blomberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Blomberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15773495,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "1f470f24691d257fb9b572ec9ece300c7e0057d5",
            "isKey": false,
            "numCitedBy": 35,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "A dynamic programming pattern matching isolated word recognition system has been modified in order to emphasize the transient parts of speech in the similarity measure. The technique is to weight the word distances with a normalized spectral change function. A small positive effect is measured. Emphasizing the stationary parts is shown to substantially decrease the performance. Adding the time derivative of the speech parameters to the word patterns improves performance significantly. This is probably a consequence of an improvement in the description of the transient segments."
            },
            "slug": "Effects-of-emphasizing-transitional-or-stationary-a-Elenius-Blomberg",
            "title": {
                "fragments": [],
                "text": "Effects of emphasizing transitional or stationary parts of the speech signal in a discrete utterance recognition system"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "A dynamic programming pattern matching isolated word recognition system has been modified in order to emphasize the transient parts of speech in the similarity measure, to weight the word distances with a normalized spectral change function."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2380069"
                        ],
                        "name": "B. Atal",
                        "slug": "B.-Atal",
                        "structuredName": {
                            "firstName": "B.",
                            "lastName": "Atal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Atal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41317064,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "14f4fc0bc3fae237641f10b9881e5706eda0cf7f",
            "isKey": false,
            "numCitedBy": 1030,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Several different parametric representations of speech derived from the linear prediction model are examined for their effectiveness for automatic recognition of speakers from their voices. Twelve predictor coefficients were determined approximately once every 50 msec from speech sampled at 10 kHz. The predictor coefficients and other speech parameters derived from them, such as the impulse response function, the autocorrelation function, the area function, and the cepstrum function were used as input to an automatic speaker‐recognition system. The speech data consisted of 60 utterances, consisting of six repetitions of the same sentence spoken by 10 speakers. The identification decision was based on the distance of the test sample vector from the reference vector for different speakers in the population; the speaker corresponding to the reference vector with the smallest distance was judged to be the unknown speaker. In verification, the speaker was verified if the distance between the test sample vector and the reference vector for the claimed speaker was less than a fixed threshold. Among all the parameters investigated, the cepstrum was found to be the most effective, providing an identification accuracy of 70% for speech 50 msec in duration, which increased to more than 98% for a duration of 0.5 sec. Using the same speech data, the verification accuracy was found to be approximately 83% for a duration of 50 msec, increasing to 98% for a duration of 1 sec. In a separate study to determine the feasibility of text‐independent speaker identification, an identification accuracy of 93% was achieved for speech 2 sec in duration even though the texts of the test and reference samples were different."
            },
            "slug": "Effectiveness-of-linear-prediction-characteristics-Atal",
            "title": {
                "fragments": [],
                "text": "Effectiveness of linear prediction characteristics of the speech wave for automatic speaker identification and verification."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The cepstrum was found to be the most effective, providing an identification accuracy of 70% for speech 50 msec in duration, which increased to more than 98% for a duration of 0.5 sec."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of the Acoustical Society of America"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699205"
                        ],
                        "name": "S. Furui",
                        "slug": "S.-Furui",
                        "structuredName": {
                            "firstName": "Sadaoki",
                            "lastName": "Furui",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Furui"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37439535,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "321e9f74d44ca3172db6e50a9bd2cde56207dcf0",
            "isKey": false,
            "numCitedBy": 287,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper examines the relationship between dynamic spectral features and the identification of Japanese syllables modified by initial and/or final truncation. The experiments confirm several main points. \"Perceptual critical points,\" where the percent correct identification of the truncated syllable as a function of the truncation position changes abruptly, are related to maximum spectral transition positions. A speech wave of approximately 10 ms in duration that includes the maximum spectral transition position bears the most important information for consonant and syllable perception. Consonant and vowel identification scores simultaneously change as a function of the truncation position in the short period, including the 10-ms period for final truncation. This suggests that crucial information for both vowel and consonant identification is contained across the same initial part of each syllable. The spectral transition is more crucial than unvoiced and buzz bar periods for consonant (syllable) perception, although the latter features are of some perceptual importance. Also, vowel nuclei are not necessary for either vowel or syllable perception."
            },
            "slug": "On-the-role-of-spectral-transition-for-speech-Furui",
            "title": {
                "fragments": [],
                "text": "On the role of spectral transition for speech perception."
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "The relationship between dynamic spectral features and the identification of Japanese syllables modified by initial and/or final truncation is examined, suggesting that crucial information for both vowel and consonant identification is contained across the same initial part of each syllable."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of the Acoustical Society of America"
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Auditory perception and its application to computer analysis of speech,"
            },
            "venue": {
                "fragments": [],
                "text": "Computer Analysis and Perception,"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Voice authentication gets the go-ahead for security systems,"
            },
            "venue": {
                "fragments": [],
                "text": "Speech Technol.,"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An isolated word recognition method using power - weighted spectral matching measure"
            },
            "venue": {
                "fragments": [],
                "text": "Trans . Tech . Group Speech Acoust . SOC . Japan"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Staggered array DP matching,"
            },
            "venue": {
                "fragments": [],
                "text": "Trans. Tech. Group Speech Acoust. SOC. Japan,"
            },
            "year": 1982
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 1,
            "methodology": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 11,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Speaker-independent-isolated-word-recognition-using-Furui/f64038de5e388bce2f0575cfb4a291a41e3bab57?sort=total-citations"
}