{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4252204"
                        ],
                        "name": "R. Morison",
                        "slug": "R.-Morison",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Morison",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Morison"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6027048"
                        ],
                        "name": "E. Dempsey",
                        "slug": "E.-Dempsey",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Dempsey",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Dempsey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6069128,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0d8d104763fd2764760d5385eacbfa8e465a4677",
            "isKey": false,
            "numCitedBy": 239,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "In another paper two types of cortical activity elicited by stimulation of the sensory path have been described. Evidence was presented that these phenomena, the so-called augmented and repetitive sensory responses, share a single neuronal mechanism, but may, on the other hand, be segregated both from the simple “primary” sensory response and the generalized 8 to 12 per second “spontaneous” bursts (Dempsey and Morison, 1943). The present study was directed toward a more thorough investigation of the properties of the system responsible for the augmented and repeating effects. METHODS. The methods employed were entirely similar to those employed in the preceding papers and need not be repeated. RESULTS. Site of repetition and augmentation. Since repetition is not a feature of sensory responses recorded from the lemniscus (Dempsey and Morison, 1943), attention was directed to the thalamus and cortex. Adrian (1941) has demonstrated that the thalamus deprived of its cortex still exhibits repetitive responses. In the present investigation records taken from the thalamus before and after cutting of the internal capsule showed that the repetitive response of the thalamus, though still present after the procedure, was always depressed. In order to facilitate cutting of the capsule in this and other types of experiments, the ventricle was carefully unroofed before any observations were made, so that the cutting of the capsule could be carried out with a minimum of additional operative trauma. Since depression of the thalamic response might still be attributable to some nonspecific effects of the operation, however, the influence of the cortex on the thalamic response was tested in another way. Cortical repetition was enhanced by local application of acetylcholine (Chatfield and Dempsey, 1942). The thalamic repetitive response was enhanced pari passu (fig. 1). The question still remained as to whether the cortex alone may exhibit repetitive or augmented sensory responses. In order to solve this question, stimulating electrodes were introduced into the capsule and the cortical responses recorded. Division of the capsular fibers caudal to the electrodes abolished both the repetitive and augmented (fig. 2) responses. Even though acetylcholine was applied to the cortex in the hope of compensating for the loss of an asynchronous thalamic bombardment (cf. its facilitating effect in intact animals above), the abolished repetitive response did not return. The primary response induced by capsular stimulation invariably was smaller and its second and third component declined more rapidly with frequency before section of the thalamic radiations. As the augmenting response developed (fig. 2A), a decline in the primary response occurred. Figure 2B shows the larger"
            },
            "slug": "MECHANISM-OF-THALAMOCORTICAL-AUGMENTATION-AND-Morison-Dempsey",
            "title": {
                "fragments": [],
                "text": "MECHANISM OF THALAMOCORTICAL AUGMENTATION AND REPETITION"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "A more thorough investigation of the properties of the system responsible for the augmented and repeating effects of cortical activity elicited by stimulation of the sensory path showed that the repetitive response of the thalamus, though still present after the procedure, was always depressed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1943
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6027048"
                        ],
                        "name": "E. Dempsey",
                        "slug": "E.-Dempsey",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Dempsey",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Dempsey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4252204"
                        ],
                        "name": "R. Morison",
                        "slug": "R.-Morison",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Morison",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Morison"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2491805,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "8f64b9bf59182f09c1166d4376e22f1d59c81f7a",
            "isKey": false,
            "numCitedBy": 469,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "During the course of experiments designed to determine the cortical representation of localized thalamic regions, it was observed that stimulation at a frequency of 5 to 15 per second was followed by a recruiting cortical response when the stimulating electrodes were placed in the region of the midline nuclei (Morison and Dempsey, 1942). Moreover, single stimuli delivered to this area frequently produced a train of cortical potentials lasting a few seconds. These trains of spikes were strikingly like the recurrent spontaneous bursts which are seen in the electrocorticograms of animals anesthetized with barbiturates (Derbyshire, Rempel, Forbes and Lambert, 1936). In view of this similarity to a component of the normal spontaneous activity, it was thought advisable to study tJhe effects of stimulation of the medial thalamic nuclei in more detail. The following sections deal with the results of such a study. MATERIAL ANDMETHODS. Cats were used. The methods employed have been discussed elsewhere (Morison and Dempsey, 1942) and need not be repeated. RESULTS. A. Description of recruiting response. In cats under relatively deep nembutal anesthesia, in which spontaneous bursts of 8 to 12 per sec. cortical potentials were relatively rare, a slow series of electrical stimuli applied to the dorsomedial regions of the thalamus was followed by recruiting potentials which were widespread in the cortex. The first shock of a series usually produced no response, but following the second or third a cortical potential developed which on successive stimulation increased rapidly in magnitude until a maximum was reached after the fifth or sixth shock. Figure 1 illustrates this recruitment response in an experiment in which the spontaneous 8 to 12 per sec. bursts had been almost abolished by deep nembutal anesthesia. These potentials bore a remarkable superficial resemblance to the spontaneously generated bursts of 8 to 12 per sec. activity (fig. 2). The recruited potential usually was monophasic and surface negative. After recruitment to its greatest height, however, it sometimes became diphasic with a positive component following the initial negativity. Diphasicity was more frequently encountered in lightly anesthetized preparations. The electrical polarity was not, however, completely constant. Recruited potentials of opposite signs were sometimes recorded from different cortical regions. The latency of the recruited response was long, varying in different experiments between 20 and 35 msec. In any single experiment the latency was less"
            },
            "slug": "THE-PRODUCTION-OF-RHYTHMICALLY-RECURRENT-CORTICAL-Dempsey-Morison",
            "title": {
                "fragments": [],
                "text": "THE PRODUCTION OF RHYTHMICALLY RECURRENT CORTICAL POTENTIALS AFTER LOCALIZED THALAMIC STIMULATION"
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "During the course of experiments designed to determine the cortical representation of localized thalamic regions, it was observed that stimulation at a frequency of 5 to 15 per second was followed by a recruiting cortical response when the stimulating electrodes were placed in the region of the midline nuclei which bore a remarkable superficial resemblance to the spontaneously generated bursts of 8 to 12 per sec. activity."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1941
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "74813776"
                        ],
                        "name": "R. L. Nó",
                        "slug": "R.-L.-Nó",
                        "structuredName": {
                            "firstName": "Rafael",
                            "lastName": "Nó",
                            "middleNames": [
                                "Lorente",
                                "de"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. Nó"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144474078,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "25d9cbaf00758ad9ac7bf7816e7beb9f1e5ea1e0",
            "isKey": false,
            "numCitedBy": 514,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "THE PROBLEM The actual anatomic foundations of the concept of the reflex arc were laid by Ramon y Cajal between 1887 and 1892, when he carried out a systematic study of the spinal cord with the method of Golgi. Cajal's findings were soon confirmed by the best neuro-anatomists (van Gehuchten, von Lenhossek, Held, Retzius, von Kolliker and others).1A short time later, when Cajal and van Gehuchten developed the concept of axonal polarization, the elementary reflex arc acquired a more general significance; it became the expression of the fundamental plan of structure and function of the nervous system. Figure 1 reproduces the original diagram of Cajal, showing the reflex arc composed of the afferent sensory neuron, the efferent motoneuron and a connecting link that may either be only a collateral from the posterior root or also include one or more intercalated (internuncial) neurons. When the internuncial neurons lie outside"
            },
            "slug": "VESTIBULO-OCULAR-REFLEX-ARC-Nó",
            "title": {
                "fragments": [],
                "text": "VESTIBULO-OCULAR REFLEX ARC"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "When Cajal and van Gehuchten developed the concept of axonal polarization, the elementary reflex arc acquired a more general significance and became the expression of the fundamental plan of structure and function of the nervous system."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1933
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "15353604"
                        ],
                        "name": "R. T. Woodburne",
                        "slug": "R.-T.-Woodburne",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "Woodburne",
                            "middleNames": [
                                "Thomas"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. T. Woodburne"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5441750"
                        ],
                        "name": "E. Crosby",
                        "slug": "E.-Crosby",
                        "structuredName": {
                            "firstName": "Elizabeth",
                            "lastName": "Crosby",
                            "middleNames": [
                                "Caroline"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Crosby"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "65969685"
                        ],
                        "name": "R. E. McCotter",
                        "slug": "R.-E.-McCotter",
                        "structuredName": {
                            "firstName": "Rollo",
                            "lastName": "McCotter",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. E. McCotter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 83704983,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c9a0281aef03af54c9834d373b29572b1ad50749",
            "isKey": false,
            "numCitedBy": 93,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "The study of the nuclear pattern of the mammalian midbrain and isthmus regions (Huber et al.) reported in 1943 is being followed by an investigation of the fiber connections of this area based on both normal and experimental material. The present paper, the first of this series of studies on the connections, reports on the interrelations existing between the tegmentum of the midbrain and the basal ganglia of the hemispheres. Since many of the descending paths from the basal ganglia undergo synapse in the subthalamus and the tegmental region of the midbrain, subthalamo-teg-mental and certain descending paths from the tegmentum to lower centers are also discussed. The material used for this consideration of fiber connections consists of transversely and sagittally cut serial sections of the brain of Macaca mulatta stained by the Weigert technique, and supplemented by some Marchi preparations."
            },
            "slug": "The-mammalian-midbrain-and-isthmus-regions.-Part-A.-Woodburne-Crosby",
            "title": {
                "fragments": [],
                "text": "The mammalian midbrain and isthmus regions. Part II. The fiber connections. A. The relations of the tegmentum of the midbrain with the basal ganglia in Macaca mulatta"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The present paper reports on the interrelations existing between the tegmentum of the midbrain and the basal ganglia of the hemispheres and the subthalamo-teg-mental and certain descending paths from the te segmentum to lower centers."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1946
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3743759"
                        ],
                        "name": "J. Apter",
                        "slug": "J.-Apter",
                        "structuredName": {
                            "firstName": "Julia",
                            "lastName": "Apter",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Apter"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 146862950,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e9042bea581c90a7869d14d682584c3d92f7df8f",
            "isKey": false,
            "numCitedBy": 132,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "PROJECTION-OF-THE-RETINA-ON-SUPERIOR-COLLICULUS-OF-Apter",
            "title": {
                "fragments": [],
                "text": "PROJECTION OF THE RETINA ON SUPERIOR COLLICULUS OF CATS"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1945
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6027048"
                        ],
                        "name": "E. Dempsey",
                        "slug": "E.-Dempsey",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Dempsey",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Dempsey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4252204"
                        ],
                        "name": "R. Morison",
                        "slug": "R.-Morison",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Morison",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Morison"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 99174494,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "813df2fdad7d5aec80700760fc866314f8d63df0",
            "isKey": false,
            "numCitedBy": 195,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "THE-ELECTRICAL-ACTIVITY-OF-A-THALAMOCORTICAL-RELAY-Dempsey-Morison",
            "title": {
                "fragments": [],
                "text": "THE ELECTRICAL ACTIVITY OF A THALAMOCORTICAL RELAY SYSTEM"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1943
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49446273"
                        ],
                        "name": "G. C. Huber",
                        "slug": "G.-C.-Huber",
                        "structuredName": {
                            "firstName": "Gotthelf",
                            "lastName": "Huber",
                            "middleNames": [
                                "Carl"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. C. Huber"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5441750"
                        ],
                        "name": "E. Crosby",
                        "slug": "E.-Crosby",
                        "structuredName": {
                            "firstName": "Elizabeth",
                            "lastName": "Crosby",
                            "middleNames": [
                                "Caroline"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Crosby"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 86098255,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e301e05600d0f34d564ef418a4e3f7bf8e585691",
            "isKey": false,
            "numCitedBy": 102,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Comparison-of-the-mammalian-and-reptilian-tecta-Huber-Crosby",
            "title": {
                "fragments": [],
                "text": "A Comparison of the mammalian and reptilian tecta"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1943
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "88631461"
                        ],
                        "name": "R. W. Barris",
                        "slug": "R.-W.-Barris",
                        "structuredName": {
                            "firstName": "Ralph",
                            "lastName": "Barris",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. W. Barris"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2372215"
                        ],
                        "name": "W. R. Ingram",
                        "slug": "W.-R.-Ingram",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Ingram",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. R. Ingram"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3388646"
                        ],
                        "name": "S. W. Ranson",
                        "slug": "S.-W.-Ranson",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Ranson",
                            "middleNames": [
                                "Walter"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. W. Ranson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 84948399,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "dd74df5778298b0d2b30a638e9dc4ca15b77310e",
            "isKey": false,
            "numCitedBy": 119,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Optic-connections-of-the-diencephalon-and-midbrain-Barris-Ingram",
            "title": {
                "fragments": [],
                "text": "Optic connections of the diencephalon and midbrain of the cat"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1935
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "115025396"
                        ],
                        "name": "J. O'leary",
                        "slug": "J.-O'leary",
                        "structuredName": {
                            "firstName": "James L.",
                            "lastName": "O'leary",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. O'leary"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6746647"
                        ],
                        "name": "G. H. Bishop",
                        "slug": "G.-H.-Bishop",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Bishop",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. H. Bishop"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 83474979,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "2a05a43018375d39723e1607f9c7a727a891d67f",
            "isKey": false,
            "numCitedBy": 43,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-optically-excitable-cortex-of-the-rabbit-O'leary-Bishop",
            "title": {
                "fragments": [],
                "text": "The optically excitable cortex of the rabbit"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1938
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3743759"
                        ],
                        "name": "J. Apter",
                        "slug": "J.-Apter",
                        "structuredName": {
                            "firstName": "Julia",
                            "lastName": "Apter",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Apter"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5784895,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5a72ce2b6fc6a0a3743d8553995d88100e7b96d5",
            "isKey": false,
            "numCitedBy": 145,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Eye-movements-following-strychninization-of-the-of-Apter",
            "title": {
                "fragments": [],
                "text": "Eye movements following strychninization of the superior colliculus of cats."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1946
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1419588467"
                        ],
                        "name": "A. Ward",
                        "slug": "A.-Ward",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Ward",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Ward"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4678831"
                        ],
                        "name": "H. L. Reed",
                        "slug": "H.-L.-Reed",
                        "structuredName": {
                            "firstName": "Harold",
                            "lastName": "Reed",
                            "middleNames": [
                                "Lyle"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. L. Reed"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23339171,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "0f64fe3bd18b702b6456346b7c79c00e71c61872",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Mechanism-of-pupillary-dilatation-elicited-by-Ward-Reed",
            "title": {
                "fragments": [],
                "text": "Mechanism of pupillary dilatation elicited by cortical stimulation."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1946
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 11,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/How-we-know-universals;-the-perception-of-auditory-Pitts-McCulloch/0e9b804adcedfe82d5139b572c5c165fa161efb7?sort=total-citations"
}