{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1387878041"
                        ],
                        "name": "T. Syeda-Mahmood",
                        "slug": "T.-Syeda-Mahmood",
                        "structuredName": {
                            "firstName": "Tanveer",
                            "lastName": "Syeda-Mahmood",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Syeda-Mahmood"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 90
                            }
                        ],
                        "text": "However, most of them require expensive processing of the entire scene (see, for example, [4])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2137392,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a6eebad1c23f859e88aaa22715ffb15c72517691",
            "isKey": false,
            "numCitedBy": 69,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "A key problem in model-based object recognition is selection, namely, the problem of determining which regions in the image are likely to come from a single object. In this paper we present an approach that uses color as a cue to perform selection either based solely on image-data (data-driven), or based on the knowledge of the color description of the model (model-driven). Specifically, the paper presents a method of color specification in terms of perceptual color categories and shows its relevance for the task of selection. The color categories are used to develop a fast region segmentation algorithm that extracts perceptual color regions in images. The color regions extracted form the basis for performing data and model-driven selection. Data-driven selection is achieved by selecting salient color regions as judged by a color-saliency measure that emphasizes attributes that are also important in human color perception. The approach to model-driven selection, on the other hand, exploits the color and other region information in the 3d model object to locate instances of the object in a given image. The approach presented tolerates some of the problems of occlusion, pose and illumination changes that make a model instance in an image appear different from its original description. Finally, the utility of color-based selection is demonstrated by showing the extent of search reduction possible when color-based selection is integrated with a recognition system."
            },
            "slug": "Data-and-Model-Driven-Selection-Using-Color-Regions-Syeda-Mahmood",
            "title": {
                "fragments": [],
                "text": "Data and Model-Driven Selection using Color Regions"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The paper presents a method of color specification in terms of perceptual color categories and shows its relevance for the task of selection by showing the extent of search reduction possible when color-based selection is integrated with a recognition system."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144644545"
                        ],
                        "name": "G. Healey",
                        "slug": "G.-Healey",
                        "structuredName": {
                            "firstName": "Glenn",
                            "lastName": "Healey",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Healey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 31986847,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "84818dc24b6efe355ee5bcd7ac1c28473d0e8e3d",
            "isKey": false,
            "numCitedBy": 186,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm for segmenting images of 3-D scenes is presented. From an input color image, the algorithm determines the number of materials in the scene and labels each pixel according to the corresponding material. This segmentation is useful for many visual tasks including 3-D inspection and 3-D object recognition. The segmentation algorithm is based on a detailed analysis of the physics underlying color image formation and may be applied to images of a wide range of materials and surface textures. An initial edge detection on the intensity image is used to guide the segmentation process and to ensure accurate localization of region boundaries. The algorithm is based on the computation of local image features and can be mapped effectively onto high-performance parallel hardware. Issues related to illumination and sensors are addressed. Experimental results obtained for several images are presented. >"
            },
            "slug": "Segmenting-images-using-normalized-color-Healey",
            "title": {
                "fragments": [],
                "text": "Segmenting images using normalized color"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "An algorithm for segmenting images of 3-D scenes is presented, based on a detailed analysis of the physics underlying color image formation, that may be applied to images of a wide range of materials and surface textures."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Syst. Man Cybern."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2987811"
                        ],
                        "name": "M. Swain",
                        "slug": "M.-Swain",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Swain",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Swain"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691804"
                        ],
                        "name": "D. Ballard",
                        "slug": "D.-Ballard",
                        "structuredName": {
                            "firstName": "Dana",
                            "lastName": "Ballard",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ballard"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 19606351,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c8fba07ecbebefbb15df557e479f778de05b6c4d",
            "isKey": false,
            "numCitedBy": 540,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper shows color histograms to be stable object representations over change in view, and demonstrates that they can differentiate among a large number of objects. The authors introduce a technique called histogram intersection for efficiently matching model and image histograms. Color can also be used to search for the location of an object. An algorithm called histogram backprojection performs this task efficiently in crowded scenes.<<ETX>>"
            },
            "slug": "Indexing-via-color-histograms-Swain-Ballard",
            "title": {
                "fragments": [],
                "text": "Indexing via color histograms"
            },
            "venue": {
                "fragments": [],
                "text": "[1990] Proceedings Third International Conference on Computer Vision"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719838"
                        ],
                        "name": "W. Grimson",
                        "slug": "W.-Grimson",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Grimson",
                            "middleNames": [
                                "Eric",
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Grimson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 78,
                                "start": 75
                            }
                        ],
                        "text": "Many known algorithms are able to locate an object in a complex scene (see [6] for a recent overview)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1530384,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4462c82748d81489f4f453f516754438b35a8cec",
            "isKey": false,
            "numCitedBy": 961,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "With contributions from Tomas LozanoPerez and Daniel P. Huttenlocher.An intelligent system must know \"what \"the objects are and \"where \"they are in its environment. Examples of this ubiquitous problem in computer vision arise in tasks involving hand-eye coordination (such as assembling or sorting), inspection tasks, gauging operations, and in navigation and localization of mobile robots. This book describes an extended series of experiments into the role of geometry in the critical area of object recognition. It provides precise definitions of the recognition and localization problems, describes the methods used to address them, analyzes the solutions to these problems, and addresses the implications of this analysis.The solution to problems of object recognition are of fundamental importance in many real applications and versions of the techniques described here are already being used in industrial settings. Although a number of questions remain to be solved, the authors provide a valuable framework for understanding both the strengths and limitations of using object shape to guide recognition.W. Eric L. Grimson is Matsushita Associate Professor in the Department of Electrical Engineering and Computer Science at MIT.Contents: Introduction. Recognition as a Search Problem. Searching for Correspondences. Two-Dimensional Constraints. Three-Dimensional Constraints. Verifying Hypotheses. Controlling the Search Explosion. Selecting Subspaces of the Search Space. Empirical Testing. The Combinatorics of the Matching Process. The Combinatorics of Hough Transforms. The Combinatorics of Verification. The Combinatorics of Indexing. Evaluating the Methods. Recognition from Libraries. Parameterized Objects. The Role of Grouping. Sensing Strategies. Applications. The Next Steps."
            },
            "slug": "Object-recognition-by-computer-the-role-of-Grimson",
            "title": {
                "fragments": [],
                "text": "Object recognition by computer - the role of geometric constraints"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This book describes an extended series of experiments into the role of geometry in the critical area of object recognition, providing precise definitions of the recognition and localization problems, the methods used to address them, the solutions to these problems, and the implications of this analysis."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745250"
                        ],
                        "name": "F. Leymarie",
                        "slug": "F.-Leymarie",
                        "structuredName": {
                            "firstName": "Frederic",
                            "lastName": "Leymarie",
                            "middleNames": [
                                "Fol"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Leymarie"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3631473"
                        ],
                        "name": "M. Levine",
                        "slug": "M.-Levine",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Levine",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Levine"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34118350,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ef4d4bf00727dfd34cf4f87308fd40e5d64e4b86",
            "isKey": false,
            "numCitedBy": 670,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "The problems of segmenting a noisy intensity image and tracking a nonrigid object in the plane are discussed. In evaluating these problems, a technique based on an active contour model commonly called a snake is examined. The technique is applied to cell locomotion and tracking studies. The snake permits both the segmentation and tracking problems to be simultaneously solved in constrained cases. A detailed analysis of the snake model, emphasizing its limitations and shortcomings, is presented, and improvements to the original description of the model are proposed. Problems of convergence of the optimization scheme are considered. In particular, an improved terminating criterion for the optimization scheme that is based on topographic features of the graph of the intensity image is proposed. Hierarchical filtering methods, as well as a continuation method based on a discrete sale-space representation, are discussed. Results for both segmentation and tracking are presented. Possible failures of the method are discussed. >"
            },
            "slug": "Tracking-Deformable-Objects-in-the-Plane-Using-an-Leymarie-Levine",
            "title": {
                "fragments": [],
                "text": "Tracking Deformable Objects in the Plane Using an Active Contour Model"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An improved terminating criterion for the optimization scheme that is based on topographic features of the graph of the intensity image is proposed, as well as a continuation method based on a discrete sale-space representation."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1789486"
                        ],
                        "name": "G. Finlayson",
                        "slug": "G.-Finlayson",
                        "structuredName": {
                            "firstName": "Graham",
                            "lastName": "Finlayson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Finlayson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680726"
                        ],
                        "name": "M. S. Drew",
                        "slug": "M.-S.-Drew",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Drew",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. S. Drew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3304188"
                        ],
                        "name": "B. Funt",
                        "slug": "B.-Funt",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Funt",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Funt"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10276364,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "55af12d7c58a346358a64a7034c8e3dcd8d7311d",
            "isKey": false,
            "numCitedBy": 105,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The main result is to show that under the conditions imposed by the Maloney-Wandell color constancy algorithm, color constancy can be expressed in terms of a simple independent adjustment of the sensor responses, so long as the sensor space is first transformed to a new basis. The overall goal is to present a theoretical analysis connecting many established theories of color constancy. For the case where surface reflectances are two-dimensional and illuminants are three-dimensional, it is proved that perfect color constancy can always be solved for by an independent adjustment of sensor responses, which means that the color constancy transform can be expressed as a diagonal matrix. In addition to purely theoretical arguments, results from simulations of diagonal-matrix-based color constancy, in which the spectra of real illuminants and reflectances along with the human cone sensitivity functions were used, are presented. The simulations demonstrate that when the cone sensor space is transformed to its new basis in the appropriate manner, a diagonal matrix supports close to optimal color constancy.<<ETX>>"
            },
            "slug": "Diagonal-transforms-suffice-for-color-constancy-Finlayson-Drew",
            "title": {
                "fragments": [],
                "text": "Diagonal transforms suffice for color constancy"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "It is proved that perfectcolor constancy can always be solved for by an independent adjustment of sensor responses, which means that the color constancy transform can be expressed as a diagonal matrix."
            },
            "venue": {
                "fragments": [],
                "text": "1993 (4th) International Conference on Computer Vision"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35106875"
                        ],
                        "name": "R. Duda",
                        "slug": "R.-Duda",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Duda",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Duda"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3108177"
                        ],
                        "name": "P. Hart",
                        "slug": "P.-Hart",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Hart",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Hart"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12946615,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b07ce649d6f6eb636872527104b0209d3edc8188",
            "isKey": false,
            "numCitedBy": 16927,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Provides a unified, comprehensive and up-to-date treatment of both statistical and descriptive methods for pattern recognition. The topics treated include Bayesian decision theory, supervised and unsupervised learning, nonparametric techniques, discriminant analysis, clustering, preprosessing of pictorial data, spatial filtering, shape description techniques, perspective transformations, projective invariants, linguistic procedures, and artificial intelligence techniques for scene analysis."
            },
            "slug": "Pattern-classification-and-scene-analysis-Duda-Hart",
            "title": {
                "fragments": [],
                "text": "Pattern classification and scene analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "The topics treated include Bayesian decision theory, supervised and unsupervised learning, nonparametric techniques, discriminant analysis, clustering, preprosessing of pictorial data, spatial filtering, shape description techniques, perspective transformations, projective invariants, linguistic procedures, and artificial intelligence techniques for scene analysis."
            },
            "venue": {
                "fragments": [],
                "text": "A Wiley-Interscience publication"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 441278,
            "fieldsOfStudy": [
                "Computer Science",
                "Art"
            ],
            "id": "b441dd8fb25eddbaf92bc9938afda69627a281ab",
            "isKey": false,
            "numCitedBy": 3878,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computer-Vision-Rosenfeld",
            "title": {
                "fragments": [],
                "text": "Computer Vision"
            },
            "venue": {
                "fragments": [],
                "text": "Adv. Comput."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3439085"
                        ],
                        "name": "J. Mollon",
                        "slug": "J.-Mollon",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Mollon",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mollon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 55,
                                "start": 52
                            }
                        ],
                        "text": "The choice of color space has been adressed in [2], [3], [ 5 ] , [12], [ 131."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1463188,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "10cf41dcdf24785a9dd5d637965e8656e9488fe5",
            "isKey": false,
            "numCitedBy": 674,
            "numCiting": 141,
            "paperAbstract": {
                "fragments": [],
                "text": "INTRODUCTION .......................................................................................................... 42 Trichromacy nd the Trichromatic Theory .............................................................. 42 Psychol~hysical l~$timates of the Cone Sensitivities .................................................... 44 The Two-Color P ocedure and the ~\" Mechanisms .................................................. 45 Postreceptorol Processes .............................................................................................. 48 Color Deficiency .......................................................................................................... 49 RECENT REVIEWS AND BIBLIOGRAPHIC SOURCES, TESTS, PERSONALIA .............................................................................................. 49 Books .......................................................................................................................... 49 Journals ...................................................................................................................... 50 Reviews and Specialist Bibliographies ........................................................................ 50 New Tests and, clOth,Other Materials ................................................................................ 51 Necrology .................................................................................................................... 51 THE FUNDAMENTAL SENSITIVITIES .................................................................. 52 Psychophysical E timates ............................................................................................ 52 Microspectrophotometry .............................................................................................. 57 Concordance of Estimates of the Human Fundamentals. .... .................................... 59 Individual Differences ................................. : .............................................................. 61 THE ANOMALIES OFTHE SHORTWAVE SYSTEM ............................................ 63 Group A: Sensitivity of Short-Wavelength System .................................................... 63 Group B:Adaptational Anomalies ............................................................................ 66 Two Explanatory Principles ........................................................................................ 67 COLOR-OPPONENT CHAN ELS .............................................................................. 68 Pn’mate El ctrophysiology .......................................................................................... 68 Psychophysical Techniques for Isolating Color-Opponent Channels .......................... 68 Chromatically Opponent Processes Manifested in Threshold Measurements ........................................................................................................ 70 Possible Identity of Opponent Mechanisms Revealed by Changes in . Sensitivity, by Phenomenological Cancellation, and by Chromaticity Discrimination .......................................................................................... 72 DO STILES’S ~MECHANISMS CORRESPOND TO CONE FUNDAMENTALS? .................................................................................... 73 Experimental Tests .................................................................................................... 73 A Theory of ~’1 and tr3 .............................................................................................. 75 Self-Screening ............................................................................................................ 75 Conclusions ................................................................................................................ 76"
            },
            "slug": "Color-vision.-Mollon",
            "title": {
                "fragments": [],
                "text": "Color vision."
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "The author reveals the possible identity of Opponent Mechanisms Revealed by Changes in Sensitivity, by Phenomenological Cancellation, and by Chromaticity Discrimination in the Short-Wavelength System."
            },
            "venue": {
                "fragments": [],
                "text": "Annual review of psychology"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Recognition of 3D objects from 2D groupings ,'' Imuge Understunding Workshop"
            },
            "venue": {
                "fragments": [],
                "text": "Recognition of 3D objects from 2D groupings ,'' Imuge Understunding Workshop"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Fundumentuls qf Digital Imuge Processing"
            },
            "venue": {
                "fragments": [],
                "text": "Fundumentuls qf Digital Imuge Processing"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Color-information for region"
            },
            "venue": {
                "fragments": [],
                "text": "Color-information for region"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Algorithms for Gruphics and Imuge Processing"
            },
            "venue": {
                "fragments": [],
                "text": "Algorithms for Gruphics and Imuge Processing"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Segmenting images using normalized colors Physics- Bused Vision: Principles and Pructice-Color"
            },
            "venue": {
                "fragments": [],
                "text": "Segmenting images using normalized colors Physics- Bused Vision: Principles and Pructice-Color"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "ISODATA, A novel method of data analysis mentation, CGIP"
            },
            "venue": {
                "fragments": [],
                "text": "222. and pattern classification"
            },
            "year": 1965
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 50,
                                "start": 47
                            }
                        ],
                        "text": "The choice of color space has been adressed in [2], [3], [ 5 ] , [12], [ 131."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Digitul Imuge Processing"
            },
            "venue": {
                "fragments": [],
                "text": "Digitul Imuge Processing"
            },
            "year": 1978
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 4
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 16,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Finding-Waldo,-or-focus-of-attention-using-local-Ennesser-Medioni/c7cb3b96aba81b123278627d03c1f60eafa0bed0?sort=total-citations"
}