{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38718061,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "709e9e78094d3f077c2c9156bb3792bbb2dd9f3a",
            "isKey": false,
            "numCitedBy": 238,
            "numCiting": 121,
            "paperAbstract": {
                "fragments": [],
                "text": "The main factors limiting the performance of the peripheral parts of the visual system can be specified, and doing this clarifies the nature of the interpretive tasks that must be performed by the central parts of the system. It is argued that the critical factor that hinders development of better resolving power is the difficulty of confining light within the waveguide-like outer segment, and that for sensitivity this critical factor is the thermal decomposition of photosensitive pigments. Knowledge of these limits makes many surprising details of the eye intelligible. Understanding the difficulties posed by the narrow dynamic range of nerve fibres may give similar insight into the coding of the retinal image for transmission to the brain. Our level of understanding changes when we come to the visual cortex, for although we do not lack good anatomical and neurophysiological data, these do not make the principles of operation self-evident in the way that the structure of the eye immediately suggests that it is an image-forming device. The cortex converts the representation of the visual field that it receives into reliable knowledge of the world around us, and the trouble may be that we lack good models of how this can be done. A system that can respond to single quanta and resolve almost to the diffraction limit is unlikely to employ grossly inefficient methods for those higher functions upon which its whole utility depends, and so it is worth seeking out the limiting factors. The quality of human performance at certain higher perceptual tasks is high compared with the limit of reliable statistical inference; hence much of the sample of information available in a visual image must be effectively utilized. But there are strong limitations on the connectivity in the cortex, so that one is forced to consider how the relevant information can be collected together. Three stages of dealing with the visual image are proposed: the improvement of the cortical map in primary visual cortex by processes analogous to spatial and temporal interpolation ; the detection of linking features in this map; and the concentration of this information by non-topographical mapping in adjacent visual areas."
            },
            "slug": "The-Ferrier-lecture,-1980-Barlow",
            "title": {
                "fragments": [],
                "text": "The Ferrier lecture, 1980"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Three stages of dealing with the visual image are proposed: the improvement of the cortical map in primary visual cortex by processes analogous to spatial and temporal interpolation ; the detection of linking features in this map; and the concentration of this information by non-topographical mapping in adjacent visual areas."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144205451"
                        ],
                        "name": "W. H. Miller",
                        "slug": "W.-H.-Miller",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Miller",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. H. Miller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "It is argued that the spacing of photoreceptors is matched to the quality of the optical image (Miller 1979; Snyder 1979) and that the mosaics of retinal ganglion cells are matched to the predictable patterns of retinal input generated by factors such as the increasing fineness of texture with distance from the eye, and to the flow patterns that are produced in the visual field by locomotion (Wehner 1981)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 62005066,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3a7a3c4bc9b32267e92c353a78edba622aaaabb2",
            "isKey": false,
            "numCitedBy": 158,
            "numCiting": 203,
            "paperAbstract": {
                "fragments": [],
                "text": "Visual perception is initiated by the eye’s optics in the sense that the neural aspects of the visual process can only operate on the information that is presented to the nervous system. The varied ways in which this information is presented in the eyes of vertebrates and invertebrates raise questions about the consequences of the function of optical structures for vision. The purpose of this chapter is to review the effects of optical filtering on eye function emphasizing such unresolved issues, for example, as the function of optical filtering in the eyes of animals with high (suprahuman) visual acuity. Aspects of optical filtering will be reviewed commencing with the physical basis of transparency of the ocular media. The effects of interference and absorption filters will be examined. Polarization filters, which are covered by Waterman (this volume, Part B), and visual pigments, which have been recently reviewed by several authors in the Handbook of Sensory Physiology Vol. VII/I and Hamdorf (this volume), will be omitted. Filtering that results from the spatial arrangements and the physical properties of the photoreceptor cells will also be discussed. The unifying nature of this topic lends itself to a consideration of these factors independent of phylogenetic classification, and for this reason examples will be drawn freely from both the vertebrates and invertebrates."
            },
            "slug": "Ocular-Optical-Filtering-Miller",
            "title": {
                "fragments": [],
                "text": "Ocular Optical Filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The purpose of this chapter is to review the effects of optical filtering on eye function emphasizing such unresolved issues, for example, as the function of optical filters in the eyes of animals with high (suprahuman) visual acuity."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32531540"
                        ],
                        "name": "A. Dubs",
                        "slug": "A.-Dubs",
                        "structuredName": {
                            "firstName": "Andreas",
                            "lastName": "Dubs",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Dubs"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2161090"
                        ],
                        "name": "S. Laughlin",
                        "slug": "S.-Laughlin",
                        "structuredName": {
                            "firstName": "Simon",
                            "lastName": "Laughlin",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Laughlin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145339648"
                        ],
                        "name": "M. Srinivasan",
                        "slug": "M.-Srinivasan",
                        "structuredName": {
                            "firstName": "Mandyam",
                            "lastName": "Srinivasan",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Srinivasan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 33682680,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "ce23474253795a4175a38067f2d7d3454399b0b1",
            "isKey": false,
            "numCitedBy": 81,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The contrast sensitivity of the optomotor response of the fly Musca domestica was measured using a moving sinusoidal grating as the stimulus. In parallel experiments intracellular recordings were made from photoreceptors and first order visual interneurones to to determine their responses to the same threshold stimuli. Measurements of the spatial modulation transfer function for photoreceptors confirm that the optics of the eye were intact during recordings. 2. At the lowest intensity at which one can obtain an optomotor response, the photoreceptor signal is a train of discrete depolarizations, or bumps. With constant intensity stimuli, the temporal distribution of bumps followed the Poisson distribution with a mean rate of proportional to luminance. The mean bump rate at the threshold intensity for a behavioural response is 1.7 +/‐ 0.7 s‐1 (mean +/‐ S.D., n = 25). 3. Calibrations and the statistical properties of the bump train indicate that a bump represents one effective photon, implying that the bump : photon ratios are quantum capture efficiencies. 4. At low intensities the first order interneurones (the large monopolar cells or LMCs) show hyperpolarizing bumps each triggered by a receptor bump. Using a point source stimulus, centred in the field of view, the LMC bump rate is six times that in a single receptor viewing the same stimulus, as expected from the known projection of six receptor axons to each LMC. When using an extended stimulus (the grating), the bump rate is 18‐20 times that in receptors. Comparison with earlier work suggests that this increased lateral summation of receptor inputs to LMCs only occurs at very low intensities. 5. In both receptor and LMCs the amplitudes and wave forms of bumps depend upon the position of a point source stimulus within the field of view. With the light in the periphery of the field the bumps are smaller and slower than when the light is in the centre. This difference in response suggests that spatial stimulation is brought about by lateral interactions, possibly between receptors. 6. At higher mean intensities the signal‐to‐noise ratios in receptors responding to the appropriate threshold stimuli increase with intensity. This is suggestive of a decrease in the extent of spatial and/or temporal summation in the optomotor pathway."
            },
            "slug": "Single-photon-signals-in-fly-photoreceptors-and-at-Dubs-Laughlin",
            "title": {
                "fragments": [],
                "text": "Single photon signals in fly photoreceptors and first order interneurones at behavioral threshold."
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "The contrast sensitivity of the optomotor response of the fly Musca domestica was measured using a moving sinusoidal grating as the stimulus andCalibrations and the statistical properties of the bump train indicate that a bump represents one effective photon, implying that the bump : photon ratios are quantum capture efficiencies."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "man (Robson 1966), Limulus (Brodie et al."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Secondly, signals coming from the surround of a receptive field can be selectively abolished by using stimuli with high temporal frequency, because the surround has a longer time constant than the centre (Robson 1966; Brodie et al. 1978; Dubs 1982)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 122257265,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "75fa9076ed59eeaf552e6fe448072d0d5062cd7a",
            "isKey": false,
            "numCitedBy": 852,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "T HE dependence of the form of the spatial contrast-sensitivity function for a square-wave test grating upon the duration of exposure of the target has been investigated by Schober and Hilz. 1 Kelly 2 has pointed out an analogous dependence of the form of the temporal contrast (modulation) sensitivity function upon the angular extent of the test target. The reciprocal nature of these spatio-temporal interactions can be particularly clearly ap­ preciated if the threshold contrast is determined for a grating target whose luminance perpendicular to the bars is given by where m is the contrast, v the spatial frequency, and ƒ the temporal frequency of the target. FIG. 2. Temporal contrast-sensitivity (reciprocal of threshold contrast) functions for different spatial frequencies. The points are the means of four measurements and the curves (two with dashed low-frequency sections) differ only in their positions along the contrast-sensitivity scale, O 0.5 cycle per degree, ● 4, ∆ 16, ▲ 22 cycles per degree. FIG. 1. Spatial contrast-sensitivity (reciprocal of threshold contrast) functions for different temporal frequencies. The points are the means of four measurements and the curves (one with a dashed low-frequency section) differ only in their positions along the contrast-sensitivity scale O 1 cycle per second, ● 6, ∆ 16, ▲ 22 cycles per second. Such a pattern was set up as a display on a cathode-ray oscil­ loscope and Figs. 1 and 2 show the results of threshold-contrast measurements made by the author (a well-corrected myope). Viewing was binocular at a distance of 2 m. The grating pattern subtended 2.5°×2.5° in the center of a 10°× 10° screen illuminated to the same mean luminance of 20 cd/m 2. The general similarity of the two sets of contrast-sensitivity functions is immediately evident but two features are particularly remarkable. First, the form of the fall-off in sensitivity at high"
            },
            "slug": "Spatial-and-Temporal-Contrast-Sensitivity-Functions-Robson",
            "title": {
                "fragments": [],
                "text": "Spatial and Temporal Contrast-Sensitivity Functions of the Visual System"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6270661"
                        ],
                        "name": "S. W. Kuffler",
                        "slug": "S.-W.-Kuffler",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Kuffler",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. W. Kuffler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18591943,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b446e3fb01026b4e5ad978812540f172405fff6f",
            "isKey": false,
            "numCitedBy": 2575,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "THE DISCHARGES carried in the optic nerve fibers contain all the information which the central nervous system receives from the retina. A correct interpretation of discharge patterns therefore constitutes an important step in the analysis of visual events. Further, investigations of nervous activity arising in the eye reveal many aspects of the functional organization of the neural elements within the retina itself. Following studies of discharges in the optic nerve of the eel’s eye by Adrian and Matthews (2,3), Hartline and his colleagues described the discharge pattern in the eye of the Limulus in a series of important and lucid papers (for a summary see 20). In the Limulus the relationship between the stimulus to the primary receptor cell and the nerve discharges proved relatively simple, apparently because the connection between sense cell and nerve fiber was a direct one. Thus, when stimulation is confined to one receptor the discharge in a single Limulus nerve fiber will provide a good indication of excitatory events which take place as a result of photochemical processes. Discharges last for the duration of illumination and their frequency is a measure of stimulus strength. Lately, however, it was shown by Hartline et al. (22) that inhibitory interactions may be revealed when several receptors are excited. On the whole, the Limulus preparation shows many features which are similar to other simple sense organs, for instance, stretch receptors. In the latter, however, instead of photochemical events, stretch-deformation acts as the adequate stimulus on sensory terminals and is translated into a characteristic discharge pattern. The discharge from the cold-blooded vertebrate retina (mainly frogs) proved much more complex. Hartline found three main types when recording from single optic nerve fibers: (i) “on” discharges, similar to those in the Limulus, firing for the duration of the light stimulus, (ii) “off” discharges appearing when a light stimulus was withdrawn, and (iii) ‘con-off” discharges, a combination of the former two, with activity confined mainly to onset and cessation of illumination. The mammalian discharge patterns were studied in a number of species by Granit and his co-workers in the course of their extensive work on the physiology of the visual system (summaries in 13, 15). On the whole, they did not observe any fundamental differences between frog and mammalian discharge types (see later)."
            },
            "slug": "Discharge-patterns-and-functional-organization-of-Kuffler",
            "title": {
                "fragments": [],
                "text": "Discharge patterns and functional organization of mammalian retina."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The Limulus preparation shows many features which are similar to other simple sense organs, for instance, stretch receptors, however, instead of photochemical events, stretch-deformation acts as the adequate stimulus on sensory terminals and is translated into a characteristic discharge pattern."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145339648"
                        ],
                        "name": "M. Srinivasan",
                        "slug": "M.-Srinivasan",
                        "structuredName": {
                            "firstName": "Mandyam",
                            "lastName": "Srinivasan",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Srinivasan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32247906"
                        ],
                        "name": "G. D. Bernard",
                        "slug": "G.-D.-Bernard",
                        "structuredName": {
                            "firstName": "Gary",
                            "lastName": "Bernard",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. D. Bernard"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 375410,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "05442f8b93a709e51c135036f019a288c9a71646",
            "isKey": false,
            "numCitedBy": 85,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-effect-of-motion-on-visual-acuity-of-the-eye:-A-Srinivasan-Bernard",
            "title": {
                "fragments": [],
                "text": "The effect of motion on visual acuity of the compound eye: A theoretical analysis"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4249397"
                        ],
                        "name": "H. Hartline",
                        "slug": "H.-Hartline",
                        "structuredName": {
                            "firstName": "Haldan",
                            "lastName": "Hartline",
                            "middleNames": [
                                "Keffer"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Hartline"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4956880"
                        ],
                        "name": "F. Ratliff",
                        "slug": "F.-Ratliff",
                        "structuredName": {
                            "firstName": "Floyd",
                            "lastName": "Ratliff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Ratliff"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118954727,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "f8a9310a0b1d4a1a6a9961e2dbd4dd6a969272b3",
            "isKey": false,
            "numCitedBy": 70,
            "numCiting": 79,
            "paperAbstract": {
                "fragments": [],
                "text": "The interplay of excitation and inhibition lies at the foundation of nervous integrative function. Modern neurophysiology builds on Sherrington’s analysis of motor function, extending his concepts to all the sensory systems and to the infinite complexity of the higher nervous centers (cf. Granit, 1966). Antagonistic processes in vision recall Hering; the role of inhibition in vision was clearly recognized by Mach. Sherrington (1897) himself ventured into this field, but it was Granit’s work that played an essential role in introducing Sherringtonian concepts in the study of retinal function. “The retina is a nervous center” writes Granit, quoting Cajal, and this he proceeds to confirm, exhibiting the interplay of excitation and inhibition in the retinal action potential and in the unitary discharges of retinal ganglion cells."
            },
            "slug": "Inhibitory-Interaction-in-the-Retina-of-Limulus-Hartline-Ratliff",
            "title": {
                "fragments": [],
                "text": "Inhibitory Interaction in the Retina of Limulus"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It was Granit’s work that played an essential role in introducing Sherringtonian concepts in the study of retinal function, exhibiting the interplay of excitation and inhibition in the retinal action potential and in the unitary discharges of Retinal ganglion cells."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1821709"
                        ],
                        "name": "F. Werblin",
                        "slug": "F.-Werblin",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Werblin",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Werblin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15389701,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "da7ec9bfa1c9d21f444f2d35a88ed7c582552adb",
            "isKey": false,
            "numCitedBy": 376,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "Test stimuli, presented at the center of the bipolar cell receptive field, spanning less than 2 log units of intensity, elicit the full range of graded response. The intensity range of test stimuli that elicits the graded response depends upon the background conditions. A higher range of log test intensities is required to elicit the graded bipolar response in the presence of surround backgrounds. But surround backgrounds can also serve to unsaturate the bipolar response and thereby increase sensitivity under certain conditions. The results suggest that a second stage of sensitivity-control is mediated by the horizontal cell system at the outer plexiform layer, concatenated with the effects of adaptation in the photoreceptors."
            },
            "slug": "Control-of-Retinal-Sensitivity-II.-Lateral-at-the-Werblin",
            "title": {
                "fragments": [],
                "text": "Control of Retinal Sensitivity II. Lateral Interactions at the Outer Plexiform Layer"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The results suggest that a second stage of sensitivity-control is mediated by the horizontal cell system at the outer plexiform layer, concatenated with the effects of adaptation in the photoreceptors."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3148875"
                        ],
                        "name": "M. Georgeson",
                        "slug": "M.-Georgeson",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Georgeson",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Georgeson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2059703607"
                        ],
                        "name": "G. D. Sullivan",
                        "slug": "G.-D.-Sullivan",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Sullivan",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. D. Sullivan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 36604141,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e16bae114a703faba615850cf7766fa00bb8445b",
            "isKey": false,
            "numCitedBy": 542,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "The perception of contrast was measured in humans by a technique of subjective contrast‐matching, and was compared with contrast sensitivity as defined by threshold measures. 2. Contrast‐matching between different spatial frequencies was performed correctly (especially at frequencies above 5 c/deg) despite the attenuation by optical and neural factors which cause large differences in contrast thresholds. 3. Contrast‐matching between single lines of different widths was also veridical, and was not limited by the spatial integration (Ricco's Law) present at threshold. Adaptation to gratings altered the appearance of lines, and this could be best understood in Fourier terms. 4. The generality of these results was shown by matching the contrast of pictures which had been filtered so that each contained a one octave band of spatial frequencies. 5. Within the limits imposed by threshold and resolution, contrast‐matching was largely independent of luminance and position on the retina. 6. Six out of eleven astigmatic observers showed considerable suprathreshold compensation for their orientation‐specific neural deficit in contrast sensitivity. 7. These results define a new property of vision: contrast constancy. It is argued that spatial frequency channels in the visual cortex are organized to compensate for earlier attenuation. This achieves a dramatic 'deblurring' of the image, and optimizes the clarity of vision."
            },
            "slug": "Contrast-constancy:-deblurring-in-human-vision-by-Georgeson-Sullivan",
            "title": {
                "fragments": [],
                "text": "Contrast constancy: deblurring in human vision by spatial frequency channels."
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "It is argued that spatial frequency channels in the visual cortex are organized to compensate for earlier attenuation, and achieves a dramatic 'deblurring' of the image, and optimizes the clarity of vision."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50359956"
                        ],
                        "name": "F. Attneave",
                        "slug": "F.-Attneave",
                        "structuredName": {
                            "firstName": "Fred",
                            "lastName": "Attneave",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Attneave"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8453552,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6d0198460198fdb49b89d1646049712b3a0683df",
            "isKey": false,
            "numCitedBy": 2762,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "xThe ideas of information theory are at present stimulating many different areas of psychological inquiry. In providing techniques for quantifying situations which have hitherto been difficult or impossible to quantify, they suggest new and more precise ways of conceptualizing these situations (see Miller [12] for a general discussion and bibliography). Events ordered in time are particularly amenable to informational analysis; thus language sequences are being extensively studied, and other sequences, such as those of music, plainly invite research. In this paper I shall indicate some of the ways in which the concepts and techniques of information theory may clarify our understanding of visual perception. When we begin to consider perception as an information-handling process, it quickly becomes clear that much of the information received by any higher organism is redundant. Sensory events are highly interdependent in both space and time: if we know at a given moment the states of a limited number of receptors (i.e., whether they are firing or not firing), we can make better-than-chance inferences with respect to the prior and subsequent states of these receptors, and also with respect to the present, prior, and subsequent states of other receptors. The preceding statement, taken in its broadest im1 The experimental work for this study was performed as part of the United States Air Force Human Resources Research and Development Program. The opinions and conclusions contained in this report are those of the author. They are not to be construed as reflecting the views or indorsement of the Department of the Air Force. plications, is precisely equivalent to an assertion that the world as we know it is lawful. In the present discussion, however, we shall restrict our attention to special types of lawfulness which may exist in space at a fixed time, and which seem particularly relevant to processes of visual perception."
            },
            "slug": "Some-informational-aspects-of-visual-perception.-Attneave",
            "title": {
                "fragments": [],
                "text": "Some informational aspects of visual perception."
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "Special types of lawfulness which may exist in space at a fixed time, and which seem particularly relevant to processes of visual perception are focused on."
            },
            "venue": {
                "fragments": [],
                "text": "Psychological review"
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3672557"
                        ],
                        "name": "W. Levick",
                        "slug": "W.-Levick",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Levick",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Levick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 19040131,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "65a7f0a164f8592ab65e19b278279d5dfdc14b50",
            "isKey": false,
            "numCitedBy": 94,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The slope of curves relating the log increment threshold to log background luminance in cat retinal ganglion cells is affected by the area and duration of the test stimulus, as it is in human pyschophysical experiments. 2. Using large area, long duration stimuli the slopes average 0‐82 and approach close to 1 (Weber's Law) in the steepest cases. Small stimuli gave an average of 0‐53 for on‐centre units using brief stimuli, and 0‐56 for off‐centre units, using long stimuli. Slopes under 0‐5 (square root law) were not found over an extended range of luminances. 3. On individual units the slope was generally greater for larger and longer test stimulus, but no unit showed the full extent of change from slope of 0‐5 to slope of 1. 4. The above differences hold for objective measures of quantum/spike ratio, as well as for thresholds either judged by ear or assessed by calculation. 5. The steeper slope of the curves for large area, long duration test stimuli compared with small, long duration stimuli, is associated with the increased effectiveness of antagonism from the surround at high backgrounds. This change may be less pronounced in off‐centre units, one of which (probably transient Y‐type) showed no difference of slope, and gave parallel area‐threshold curves at widely separated background luminances, confirming the importance of differential surround effectiveness in changing the slope of the curves. 6. In on‐centre units, the increased relative effectiveness of the surround is associated with the part of the raised background light that falls on the receptive field centre. 7. It is suggested that the variable surround functions as a zero‐offset control that sets the threshold excitation required for generating impulses, and that this is separate from gain‐setting adaptive mechanisms. This may be how ganglion cells maintain high incremental sensitivity in spite of a strong maintained excitatory drive that would otherwise cause compressive response non‐linearities."
            },
            "slug": "Threshold-setting-by-the-surround-of-cat-retinal-Barlow-Levick",
            "title": {
                "fragments": [],
                "text": "Threshold setting by the surround of cat retinal ganglion cells."
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "It is suggested that the variable surround functions as a zero‐offset control that sets the threshold excitation required for generating impulses, and that this is separate from gain‐setting adaptive mechanisms."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32733837"
                        ],
                        "name": "H. Wilson",
                        "slug": "H.-Wilson",
                        "structuredName": {
                            "firstName": "Hugh",
                            "lastName": "Wilson",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1573287,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "b45c9da1e49cce9f37976d9187f85fb217d8d092",
            "isKey": false,
            "numCitedBy": 751,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-four-mechanism-model-for-threshold-spatial-vision-Wilson-Bergen",
            "title": {
                "fragments": [],
                "text": "A four mechanism model for threshold spatial vision"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2560052"
                        ],
                        "name": "S. Brodie",
                        "slug": "S.-Brodie",
                        "structuredName": {
                            "firstName": "Scott",
                            "lastName": "Brodie",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Brodie"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143748520"
                        ],
                        "name": "B. Knight",
                        "slug": "B.-Knight",
                        "structuredName": {
                            "firstName": "Bruce",
                            "lastName": "Knight",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Knight"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4956880"
                        ],
                        "name": "F. Ratliff",
                        "slug": "F.-Ratliff",
                        "structuredName": {
                            "firstName": "Floyd",
                            "lastName": "Ratliff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Ratliff"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16992108,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "43636e57296ab05c9f0f407295fa33c9339a07a1",
            "isKey": false,
            "numCitedBy": 70,
            "numCiting": 52,
            "paperAbstract": {
                "fragments": [],
                "text": "The dynamics of the Limulus retina may be well described by the spatiotemporal transfer function, which measures the response of the eye to moving sinusoidal gratings. We consider a model for this system, which incorporates an excitatory generator potential, and self- and lateral inhibitory processes. Procedures are described which allow estimation of parameters for the model consistent with the empirical transfer function data. Transfer functions calculated from the model show good agreement with laboratory measurements, and may be used to predict accurately the response of the eye to arbitrary moving stimuli. The model allows convenient interpretation of the transfer function measurements in terms of physiological processes which underly the response of the Limulus retina."
            },
            "slug": "The-spatiotemporal-transfer-function-of-the-Limulus-Brodie-Knight",
            "title": {
                "fragments": [],
                "text": "The spatiotemporal transfer function of the Limulus lateral eye"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A model is considered for this system, which incorporates an excitatory generator potential, and self- and lateral inhibitory processes, and shows good agreement with laboratory measurements, and may be used to predict accurately the response of the eye to arbitrary moving stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of general physiology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143912557"
                        ],
                        "name": "D. H. Kelly",
                        "slug": "D.-H.-Kelly",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Kelly",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. H. Kelly"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27489951,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "d472638a57d7504812eb4210e2408dbc99b34512",
            "isKey": false,
            "numCitedBy": 480,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "With sinusoidal modulation of the radiance of the stimulus as a function of time, amplitude thresholds are measured instead of the repetition-rate thresholds usually obtained in flicker-fusion experiments. Controlling the modulation amplitude independently of the time-average radiance provides an additional degree of freedom, so that the observer’s adaptation level can be held constant while his amplitude sensitivity is measured as a function of the modulation frequency. With an “edgeless” flickering field, these amplitude sensitivity curves show a broad peak of maximum visual response, in the region from 10 to 20 cps at high photopic levels. Such classic relationships as the Ferry-Porter, Talbot-Plateau, and Weber-Fechner laws are derivable from the present results, as descriptions of the behavior of certain parts of the amplitude sensitivity curves as functions of adaptation level."
            },
            "slug": "Visual-response-to-time-dependent-stimuli.-I.-Kelly",
            "title": {
                "fragments": [],
                "text": "Visual response to time-dependent stimuli. I. Amplitude sensitivity measurements."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Classic relationships as the Ferry-Porter, Talbot-Plateau, and Weber-Fechner laws are derivable from the present results, as descriptions of the behavior of certain parts of the amplitude sensitivity curves as functions of adaptation level."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33545137"
                        ],
                        "name": "R. Normann",
                        "slug": "R.-Normann",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Normann",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Normann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1821709"
                        ],
                        "name": "F. Werblin",
                        "slug": "F.-Werblin",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Werblin",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Werblin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 97919087,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "33853157b25886a3d856ccdb76eebe50722308aa",
            "isKey": false,
            "numCitedBy": 393,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "Rods and cones in Necturus respond with graded hyperpolarization to test flashes spanning about 3.5 log units of intensity. Steady background levels hyperpolarize the rods, and the rod responses become progressively smaller as background level is increased. In cones, higher background levels reduce the effectiveness of test flashes, so higher ranges of test intensities are required to elicit the full range of graded responses. When backgrounds are terminated, cones return rapidly, but rods return slowly to the dark potential level. The effects of backgrounds on both rods and cones can be observed at intensities that cause negligible bleaching as determined by retinal densitometry. During dark adaptation, changes are observed in the rods and cones that are similar to those produced by backgrounds. Receptor sensitivities, derived from these results, show that rods saturate, cones obey Weber's law, and sensitization during dark adaptation follows a two-phase time-course."
            },
            "slug": "Control-of-Retinal-Sensitivity:-I.-Light-and-Dark-Normann-Werblin",
            "title": {
                "fragments": [],
                "text": "Control of Retinal Sensitivity: I. Light and Dark Adaptation of Vertebrate Rods and Cones"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "Receptor sensitivities, derived from these results, show that rods saturate, cones obey Weber's law, and sensitization during dark adaptation follows a two-phase time-course."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2161090"
                        ],
                        "name": "S. Laughlin",
                        "slug": "S.-Laughlin",
                        "structuredName": {
                            "firstName": "Simon",
                            "lastName": "Laughlin",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Laughlin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8991866,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "420c02bdc487338dbda64feb7491dcf9fb412f17",
            "isKey": false,
            "numCitedBy": 905,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract The contrast-response function of a class of first order intemeurons in the fly's compound eye approximates to the cumulative probability distribution of contrast levels in natural scenes. Elementary information theory shows that this matching enables the neurons to encode contrast fluctuations most efficiently."
            },
            "slug": "A-Simple-Coding-Procedure-Enhances-a-Neuron's-Laughlin",
            "title": {
                "fragments": [],
                "text": "A Simple Coding Procedure Enhances a Neuron's Information Capacity"
            },
            "tldr": {
                "abstractSimilarityScore": 85,
                "text": "The contrast-response function of a class of first order intemeurons in the fly's compound eye approximates to the cumulative probability distribution of contrast levels in natural scenes, showing that this matching enables the neurons to encode contrast fluctuations most efficiently."
            },
            "venue": {
                "fragments": [],
                "text": "Zeitschrift fur Naturforschung. Section C, Biosciences"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1407756324"
                        ],
                        "name": "C. Enroth-Cugell",
                        "slug": "C.-Enroth-Cugell",
                        "structuredName": {
                            "firstName": "Christina",
                            "lastName": "Enroth-Cugell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Enroth-Cugell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3052969,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c6609ae352d9e1c99530136e41798f337496ff27",
            "isKey": false,
            "numCitedBy": 2635,
            "numCiting": 52,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "slug": "The-contrast-sensitivity-of-retinal-ganglion-cells-Enroth-Cugell-Robson",
            "title": {
                "fragments": [],
                "text": "The contrast sensitivity of retinal ganglion cells of the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113588000"
                        ],
                        "name": "R. L. de Valois",
                        "slug": "R.-L.-de-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "de Valois",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. de Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152172276"
                        ],
                        "name": "H. Morgan",
                        "slug": "H.-Morgan",
                        "structuredName": {
                            "firstName": "H",
                            "lastName": "Morgan",
                            "middleNames": [
                                "C"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Morgan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "80561269"
                        ],
                        "name": "D. Snodderly",
                        "slug": "D.-Snodderly",
                        "structuredName": {
                            "firstName": "D",
                            "lastName": "Snodderly",
                            "middleNames": [
                                "Max"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Snodderly"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32781738,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "3b015c3abf24abff0902832bfef3c1e06c7bf9cc",
            "isKey": false,
            "numCitedBy": 414,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Psychophysical-studies-of-monkey-vision.-3.-Spatial-Valois-Morgan",
            "title": {
                "fragments": [],
                "text": "Psychophysical studies of monkey vision. 3. Spatial luminance contrast sensitivity tests of macaque and human observers."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1411599188"
                        ],
                        "name": "J. T. Leutscher-Hazelhoff",
                        "slug": "J.-T.-Leutscher-Hazelhoff",
                        "structuredName": {
                            "firstName": "Johanna",
                            "lastName": "Leutscher-Hazelhoff",
                            "middleNames": [
                                "Titia"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. T. Leutscher-Hazelhoff"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 46253422,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "ab1eaee2f9c027ec6376aceb7212f7a3b497c87f",
            "isKey": false,
            "numCitedBy": 37,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Intracellular recordings have been made from the blowfly (Calliphora erythrocephala) retinula cell; apart from the transducer mechanism, these cells also feature a pupil mechanism. 2. At several mean intensity levels, within the apparently linear range of response, frequency characteristics of amplitude and phase and responses to ‘delta’‐flashes and ‘delta’‐flash pairs have been obtained. 3. Fourier methods have shown these responses to be mutually compatible, confirming linearity in these circumstances. 4. Non‐linear behaviour can be made to appear at the lower frequencies when the modulation depth is increased. 5. Non‐linearities can also appear through application of the superposition test: a low frequency sine wave, modulated so as to elicit an apparently linear response, and a high frequence sine wave which does not give rise to non‐linearity even at the highest modulation depths can, when superimposed, yield a greater response to the latter when situated at the minima of the former than at its maxima. 6. At frequencies above approximately 1 Hz these superposition non‐linearities are attributed to the transducer mechanism gain control. Below this frequency the pupil mechanism takes part considerably in the retinula cell's total observed gain control: its characteristics remain yet to be cleared up. 7. The transducer's linear and non‐linear properties fit in closely with those of the Fuortes‐Hodgkin model which couples increases in gain and time constants. 8. The Fuortes‐Hodgkin model will probably require some quantitative modifications in the originally treated case of Limulus, on account of its pupil. 9. Finally, the merits of Veringa's diffusion model, and the possibility of eventually joining this model with the Fuortes‐Hodgkin one are pointed out briefly."
            },
            "slug": "Linear-and-non‐linear-performance-of-transducer-and-Leutscher-Hazelhoff",
            "title": {
                "fragments": [],
                "text": "Linear and non‐linear performance of transducer and pupil in Calliphora retinula cells."
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "Intracellular recordings have been made from the blowfly (Calliphora erythrocephala) retinula cell; apart from the transducer mechanism, these cells also feature a pupil mechanism, which fits in closely with the Fuortes‐Hodgkin model which couples increases in gain and time constants."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1821772"
                        ],
                        "name": "A. Snyder",
                        "slug": "A.-Snyder",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Snyder",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Snyder"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "It is argued that the spacing of photoreceptors is matched to the quality of the optical image (Miller 1979; Snyder 1979) and that the mosaics of retinal ganglion cells are matched to the predictable patterns of retinal input generated by factors such as the increasing fineness of texture with distance from the eye, and to the flow patterns that are produced in the visual field by locomotion (Wehner 1981)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "By using a reasoning analogous to that of Snyder (1979), it can be shown that the correlation duration T of the receptor signal evoked by a spatially random scene moving at an angular velocity W (deg s-1) is given by"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 118925840,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "a6efbba4f02beadf114c0413fbc2a8ceb055b54c",
            "isKey": false,
            "numCitedBy": 284,
            "numCiting": 93,
            "paperAbstract": {
                "fragments": [],
                "text": "Invertebrates are the class par excellence where one finds all manner of variations in the structure and arrangement of photoreceptors and their associated light-gathering and processing structures. We are compelled to search for a physiologic explanation of these unique forms. This article offers a highly personalized view of the physics suited to the task."
            },
            "slug": "Physics-of-Vision-in-Compound-Eyes-Snyder",
            "title": {
                "fragments": [],
                "text": "Physics of Vision in Compound Eyes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784235"
                        ],
                        "name": "C. Harrison",
                        "slug": "C.-Harrison",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Harrison",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Harrison"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This simple procedure, initially developed for transmission of video data (Oliver 1952; Harrison 1952), reduces the signal amplitude by removing predictable, and hence redundant, components."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 123792143,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "8607681cf00336a23f2964bf1a22ed3295b6307c",
            "isKey": false,
            "numCitedBy": 105,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The correlation present in a signal makes possible the prediction of the future of the signal in terms of the past and present. If the method used for prediction makes full use of the entire pertinent past, then the error signal — the difference between the actual and the predicted signal — will be a completely random wave of lower power than the original signal but containing all the information of the original. One method of prediction, which docs not make full use of the past, but which is nevertheless remarkably effective with certain signals and also appealing because of its relative simplicity, is linear prediction. Here the prediction for the next signal sample is simply the sum of previous signal samples each multiplied by an appropriate weighting factor. The best values for the weighting coefficients depend upon the statistics of the signal, but once they have been determined the prediction may be done with relatively simple apparatus. This paper describes the apparatus used for some experiments on linear prediction of television signals, and describes the results obtained to date."
            },
            "slug": "Experiments-with-linear-prediction-in-television-Harrison",
            "title": {
                "fragments": [],
                "text": "Experiments with linear prediction in television"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1952
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39274396"
                        ],
                        "name": "D. Mackay",
                        "slug": "D.-Mackay",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Mackay",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mackay"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45242090,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "5e113ff0a16a0e57f23b0c1b53eda74c50d62e86",
            "isKey": false,
            "numCitedBy": 156,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper is concerned with behaviour possible in an information-flow system intended explicitly as a hypothetical model for comparison with human information-handling system. A statistically self-organizing system is described in which not only normal homeostatic behaviour but also such activities as invention of fruitful hypotheses, imagination of fictitious situations, and like would find a natural place. Discussion is confined mainly to manner of concept-formation and concept-handling in such a system. It has been suggested that correlate of perception (as distinct from reception) is activity which organizes an outwardly directed internal matching response to signals from receptors. This organizing activity amounts logically to an internal representation of feature in incoming signals to which it is adaptive, i.e. feature which is thus ‘perceived’. \n \n \n \nA hierarchic structure is postulated wherein much of organizing activity is concerned with modifying probabilities of other activity. Abstract concepts and hypotheses are represented by ‘sub-routines’ of such organizing activity. These can in principle be evolved as a result of experience in a manner analogous to-or at least fruitfully comparable with-process of learning and discovery; and it is not necessary for designer to predetermine, nor possible for him to foresee, all conceptual categories in terms of which information received by system may be structured. Particular attention is directed to conditions under which such a process of concept-formation could take place with sufficient rapidity. \n \n \n \nSome of symptoms of psychopathology find apparent correlates in possible modes of malfunction of such a system. But in this, as in other respects, it is not intended to press resemblances; intention is rather to stimulate critical comparisons, in order that differences between information-flow model and real thing may continually lead to progressive refinement and enlarged understanding."
            },
            "slug": "Towards-an-information-flow-model-of-human-Mackay",
            "title": {
                "fragments": [],
                "text": "Towards an information-flow model of human behaviour."
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "This paper is concerned with behaviour possible in an information-flow system intended explicitly as a hypothetical model for comparison with human information-handling system to stimulate critical comparisons, in order that differences between information- flow model and real thing may continually lead to progressive refinement and enlarged understanding."
            },
            "venue": {
                "fragments": [],
                "text": "British journal of psychology"
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1407756324"
                        ],
                        "name": "C. Enroth-Cugell",
                        "slug": "C.-Enroth-Cugell",
                        "structuredName": {
                            "firstName": "Christina",
                            "lastName": "Enroth-Cugell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Enroth-Cugell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1994273"
                        ],
                        "name": "R. Shapley",
                        "slug": "R.-Shapley",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Shapley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Shapley"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 37015571,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "911c528cccd434a796862cd0442ffce5284856ed",
            "isKey": false,
            "numCitedBy": 186,
            "numCiting": 51,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The impulse/quantum (I/Q) ratio was measured as a function of background illumination for rod‐dominated, pure central, linear square‐wave responses of retinal ganglion cells in the cat."
            },
            "slug": "Adaptation-and-dynamics-of-cat-retinal-ganglion-Enroth-Cugell-Shapley",
            "title": {
                "fragments": [],
                "text": "Adaptation and dynamics of cat retinal ganglion cells"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "The impulse/quantum (I/Q) ratio was measured as a function of background illumination for rod‐dominated, pure central, linear square‐wave responses of retinal ganglion cells in the cat."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "119860216"
                        ],
                        "name": "B. M. Oliver",
                        "slug": "B.-M.-Oliver",
                        "structuredName": {
                            "firstName": "B.",
                            "lastName": "Oliver",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. M. Oliver"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 125936761,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b6f1d5ba279eff9b41ffb87437a1374bc26c663d",
            "isKey": false,
            "numCitedBy": 67,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper reviews briefly a few of the simpler aspects of communication theory, especially those parts which relate, to the information rate of and channel capacity required for sampled, quantized messages. Two methods are then discussed, whereby such messages can be converted to a “reduced” form in which the successive samples are more nearly independent and for which the simple amplitude distribution is more peaked than in the original message. This reduced signal can then be encoded into binary digits with good efficiency using a Shannon-Fano code on a symbol-by-symbol (or pair-by-pair) basis. The usual inefficiency which results from ignoring the correlation between message segments is lessened because this correlation is less in the reduced message."
            },
            "slug": "Efficient-coding-Oliver",
            "title": {
                "fragments": [],
                "text": "Efficient coding"
            },
            "tldr": {
                "abstractSimilarityScore": 88,
                "text": "This paper reviews briefly a few of the simpler aspects of communication theory, especially those parts which relate, to the information rate of and channel capacity required for sampled, quantized messages, whereby such messages can be converted to a “reduced” form."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1952
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 228358,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ddc2ea63fa69eca4aa44a4fd135543d67badcb23",
            "isKey": false,
            "numCitedBy": 3039,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies."
            },
            "slug": "Application-of-fourier-analysis-to-the-visibility-Campbell-Robson",
            "title": {
                "fragments": [],
                "text": "Application of fourier analysis to the visibility of gratings"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies and the results show clear patterns of uniformity in the response to grating noise."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16172422"
                        ],
                        "name": "R. Gubisch",
                        "slug": "R.-Gubisch",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Gubisch",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gubisch"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1600873,
            "fieldsOfStudy": [
                "Physics",
                "Medicine"
            ],
            "id": "db1cd81e2c54a0de7dc85519ac47aa0932fcbde7",
            "isKey": false,
            "numCitedBy": 853,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Optical quality of the eye was measured at eight pupil sizes between 1·5 and 6·6 mm diameter by recording the faint light emerging from the eye; this light was reflected from the bright image of a thin line on the fundus."
            },
            "slug": "Optical-quality-of-the-human-eye-Campbell-Gubisch",
            "title": {
                "fragments": [],
                "text": "Optical quality of the human eye"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "Optical quality of the eye was measured at eight pupil sizes between 1·5 and 6·6 mm diameter by recording the faint light emerging from the eye; this light was reflected from the bright image of a thin line on the fundus."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70149208"
                        ],
                        "name": "E. Kretzmer",
                        "slug": "E.-Kretzmer",
                        "structuredName": {
                            "firstName": "E.",
                            "lastName": "Kretzmer",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Kretzmer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "As a result, most visual scenes are not entirely random and intensities are spatially correlated over short distances (Kretzmer 1952)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "To do so would be a daunting task since the retinal image is composed of millions of samples, many of which can be related by statistics of a high order (Kretzmer 1952)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 108948312,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "98cf082d3d334de479470ff1acc3e50069490eba",
            "isKey": false,
            "numCitedBy": 226,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Measurements have been made of some basic statistical quantities characterizing picture signals. These include various amplitude distributions, autocorrelation, and correlation among successive frames. The methods of measurement are described, and the results are used to estimate the amount by which the channel capacity required for television transmission may be reduced through exploitation of the statistics measured."
            },
            "slug": "Statistics-of-television-signals-Kretzmer",
            "title": {
                "fragments": [],
                "text": "Statistics of television signals"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The results are used to estimate the amount by which the channel capacity required for television transmission may be reduced through exploitation of the statistics measured."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1952
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1703247"
                        ],
                        "name": "A. Kak",
                        "slug": "A.-Kak",
                        "structuredName": {
                            "firstName": "Avinash",
                            "lastName": "Kak",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Kak"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60845912,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "e10f473947a7afd55aa2ff13cf031e0f8a1accdd",
            "isKey": false,
            "numCitedBy": 3600,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Digital-Picture-Processing-Rosenfeld-Kak",
            "title": {
                "fragments": [],
                "text": "Digital Picture Processing"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2862374"
                        ],
                        "name": "U. Grenander",
                        "slug": "U.-Grenander",
                        "structuredName": {
                            "firstName": "Ulf",
                            "lastName": "Grenander",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Grenander"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37346685"
                        ],
                        "name": "G. Szegő",
                        "slug": "G.-Szegő",
                        "structuredName": {
                            "firstName": "Gábor",
                            "lastName": "Szegő",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Szegő"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060052888"
                        ],
                        "name": "M. Kac",
                        "slug": "M.-Kac",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Kac",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Kac"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 122293660,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "cc66b88693d8821e4d5c40cb73877fe8e140a081",
            "isKey": false,
            "numCitedBy": 2420,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Part I: Toeplitz Forms: Preliminaries Orthogonal polynomials. Algebraic properties Orthogonal polynomials. Limit properties The trigonometric moment problem Eigenvalues of Toeplitz forms Generalizations and analogs of Toeplitz forms Further generalizations Certain matrices and integral equations of the Toeplitz type Part II: Applications of Toeplitz Forms: Applications to analytic functions Applications to probability theory Applications to statistics Appendix: Notes and references Bibliography Index."
            },
            "slug": "Toeplitz-Forms-And-Their-Applications-Grenander-Szegő",
            "title": {
                "fragments": [],
                "text": "Toeplitz Forms And Their Applications"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31617570"
                        ],
                        "name": "A. Papoulis",
                        "slug": "A.-Papoulis",
                        "structuredName": {
                            "firstName": "Athanasios",
                            "lastName": "Papoulis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Papoulis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "It is called 'linear mean-squared estimation' (Papoulis 1965)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 118245370,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "753fbc36641df174d1a61ff949e6637258912fde",
            "isKey": false,
            "numCitedBy": 10957,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "Part 1 Probability and Random Variables 1 The Meaning of Probability 2 The Axioms of Probability 3 Repeated Trials 4 The Concept of a Random Variable 5 Functions of One Random Variable 6 Two Random Variables 7 Sequences of Random Variables 8 Statistics Part 2 Stochastic Processes 9 General Concepts 10 Random Walk and Other Applications 11 Spectral Representation 12 Spectral Estimation 13 Mean Square Estimation 14 Entropy 15 Markov Chains 16 Markov Processes and Queueing Theory"
            },
            "slug": "Probability,-Random-Variables-and-Stochastic-Papoulis",
            "title": {
                "fragments": [],
                "text": "Probability, Random Variables and Stochastic Processes"
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "This chapter discusses the concept of a Random Variable, the meaning of Probability, and the axioms of probability in terms of Markov Chains and Queueing Theory."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2375545"
                        ],
                        "name": "S. Dwyer",
                        "slug": "S.-Dwyer",
                        "structuredName": {
                            "firstName": "Samuel",
                            "lastName": "Dwyer",
                            "middleNames": [
                                "J."
                            ],
                            "suffix": "III"
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Dwyer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60766796,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "725dfdc3f47474c276d8442d97ccc7b1b5a39c00",
            "isKey": false,
            "numCitedBy": 112,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Automatic remote sensor image processing.- On radiographic image analysis.- Image processing in high energy physics.- Digital picture analysis in cytology.- Picture analysis in character recognition."
            },
            "slug": "Digital-picture-analysis-Rosenfeld-Dwyer",
            "title": {
                "fragments": [],
                "text": "Digital picture analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "Automatic remote sensor image processing based on radiographic image analysis for high energy physics and digital picture analysis in cytology."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2161090"
                        ],
                        "name": "S. Laughlin",
                        "slug": "S.-Laughlin",
                        "structuredName": {
                            "firstName": "Simon",
                            "lastName": "Laughlin",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Laughlin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 83252146,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "fd942d39ada226a711f1cd2ec360c315dfcebdf2",
            "isKey": false,
            "numCitedBy": 222,
            "numCiting": 219,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Neural-Principles-in-the-Peripheral-Visual-Systems-Laughlin",
            "title": {
                "fragments": [],
                "text": "Neural Principles in the Peripheral Visual Systems of Invertebrates"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46444768"
                        ],
                        "name": "A. Hughes",
                        "slug": "A.-Hughes",
                        "structuredName": {
                            "firstName": "Austin",
                            "lastName": "Hughes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Hughes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 81851359,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "fb7fc816f8b705f089468e3dee05e4f8cd589ead",
            "isKey": false,
            "numCitedBy": 663,
            "numCiting": 477,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Topography-of-Vision-in-Mammals-of-Contrasting-Hughes",
            "title": {
                "fragments": [],
                "text": "The Topography of Vision in Mammals of Contrasting Life Style: Comparative Optics and Retinal Organisation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145523037"
                        ],
                        "name": "D. Jameson",
                        "slug": "D.-Jameson",
                        "structuredName": {
                            "firstName": "Dorothea",
                            "lastName": "Jameson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Jameson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4264042"
                        ],
                        "name": "L. Hurvich",
                        "slug": "L.-Hurvich",
                        "structuredName": {
                            "firstName": "Leo",
                            "lastName": "Hurvich",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Hurvich"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4956880"
                        ],
                        "name": "F. Ratliff",
                        "slug": "F.-Ratliff",
                        "structuredName": {
                            "firstName": "Floyd",
                            "lastName": "Ratliff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Ratliff"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "The idea that lateral inhibition compensates for optical blurring by squeezing spread edges back to shape is as old as the idea of lateral antagonism itself (Mach 1865), and the requirements for deblurring are readily obtained by applying Fourier analysis (Ratliff 1965)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Alternatively, lateral inhibition has been interpreted as a filter for enhancing edges (Ratliff 1965), either to deblur the retinal image (see, for example, Marcelja 1979) or to encode a wide range of spatial detail in a form that might be appropriate for analysis in higher centres (Marr & Hildreth 1980)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 62229210,
            "fieldsOfStudy": [
                "Psychology",
                "Physics"
            ],
            "id": "2a60ec48aa87b3a46d0c464b2861769edb0ea35c",
            "isKey": false,
            "numCitedBy": 555,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Mach-bands-:-quantitative-studies-on-neural-in-the-Jameson-Hurvich",
            "title": {
                "fragments": [],
                "text": "Mach bands : quantitative studies on neural networks in the retina"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144269435"
                        ],
                        "name": "R. Wehner",
                        "slug": "R.-Wehner",
                        "structuredName": {
                            "firstName": "Rüdiger",
                            "lastName": "Wehner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Wehner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "It is argued that the spacing of photoreceptors is matched to the quality of the optical image (Miller 1979; Snyder 1979) and that the mosaics of retinal ganglion cells are matched to the predictable patterns of retinal input generated by factors such as the increasing fineness of texture with distance from the eye, and to the flow patterns that are produced in the visual field by locomotion (Wehner 1981)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 53816319,
            "fieldsOfStudy": [
                "Geography"
            ],
            "id": "3ef622477942246c34529eb97628d9a299638b51",
            "isKey": false,
            "numCitedBy": 584,
            "numCiting": 854,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Spatial-Vision-in-Arthropods-Wehner",
            "title": {
                "fragments": [],
                "text": "Spatial Vision in Arthropods"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144246983"
                        ],
                        "name": "H. Barlow",
                        "slug": "H.-Barlow",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Barlow",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barlow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8470693"
                        ],
                        "name": "R. FitzHugh",
                        "slug": "R.-FitzHugh",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "FitzHugh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. FitzHugh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6270661"
                        ],
                        "name": "S. W. Kuffler",
                        "slug": "S.-W.-Kuffler",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Kuffler",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. W. Kuffler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 41651429,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "929f33d2c4ede915b830e5a47b5007cd4c870386",
            "isKey": false,
            "numCitedBy": 762,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Change-of-organization-in-the-receptive-fields-of-Barlow-FitzHugh",
            "title": {
                "fragments": [],
                "text": "Change of organization in the receptive fields of the cat's retina during dark adaptation"
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6389940"
                        ],
                        "name": "R. W. Rodieck",
                        "slug": "R.-W.-Rodieck",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Rodieck",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. W. Rodieck"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144469587"
                        ],
                        "name": "J. Stone",
                        "slug": "J.-Stone",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Stone",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Stone"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40722810,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "55d47e02a93c0bde7469daa8b2f926e17b2381df",
            "isKey": false,
            "numCitedBy": 160,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Response-of-cat-retinal-ganglion-cells-to-moving-Rodieck-Stone",
            "title": {
                "fragments": [],
                "text": "Response of cat retinal ganglion cells to moving visual patterns."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3537935"
                        ],
                        "name": "A. Lieberman",
                        "slug": "A.-Lieberman",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Lieberman",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Lieberman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152707868"
                        ],
                        "name": "K. E. Webster",
                        "slug": "K.-E.-Webster",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Webster",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. E. Webster"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6039460,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "40940b972cf8f608ee1eb4b917531345d8c79a95",
            "isKey": false,
            "numCitedBy": 90,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Presynaptic-dendrites-and-a-distinctive-class-of-in-Lieberman-Webster",
            "title": {
                "fragments": [],
                "text": "Presynaptic dendrites and a distinctive class of synaptic vesicle in the rat dorsal lateral geniculate nucleus."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5502315"
                        ],
                        "name": "R. Purple",
                        "slug": "R.-Purple",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Purple",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Purple"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6838053"
                        ],
                        "name": "F. Dodge",
                        "slug": "F.-Dodge",
                        "structuredName": {
                            "firstName": "Frederick",
                            "lastName": "Dodge",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Dodge"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 680945,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3ef3c2ee5e4a7720a49203f9001fab7d8fb4f691",
            "isKey": false,
            "numCitedBy": 70,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Interaction-of-excitation-and-inhibition-in-the-in-Purple-Dodge",
            "title": {
                "fragments": [],
                "text": "Interaction of excitation and inhibition in the eccentric cell in the eye of Limulus."
            },
            "venue": {
                "fragments": [],
                "text": "Cold Spring Harbor symposia on quantitative biology"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1821709"
                        ],
                        "name": "F. Werblin",
                        "slug": "F.-Werblin",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Werblin",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Werblin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 33492304,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "caa0b27a0ee3e3bd6f5c5802a2a605e0e0aa9df2",
            "isKey": false,
            "numCitedBy": 146,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Adaptation-in-a-vertebrate-retina:-intracellular-in-Werblin",
            "title": {
                "fragments": [],
                "text": "Adaptation in a vertebrate retina: intracellular recording in Necturus."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Informational aspects of visual processing"
            },
            "venue": {
                "fragments": [],
                "text": "Psychol . Rev ."
            },
            "year": 1954
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Ferrier Lecture 1980 . Critical limiting factors in the design of the eye and the visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Proc . R . Soc . Lond . B"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Inhibitory interactions in the retina of Limulus"
            },
            "venue": {
                "fragments": [],
                "text": "Handbook of sensory physiology"
            },
            "year": 1972
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Signal transmission by graded slow potentials in the arthropod peripheral visual system"
            },
            "venue": {
                "fragments": [],
                "text": "The neurosciences : fourth study program"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "19616 Three points about lateral inhibition"
            },
            "venue": {
                "fragments": [],
                "text": "Sensory communication"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A four mechanism model for spatial vision"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Res ."
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The coding of sensory messages"
            },
            "venue": {
                "fragments": [],
                "text": "Current problems in animal behaviour"
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 5,
            "methodology": 3
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 48,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/Predictive-coding:-a-fresh-view-of-inhibition-in-Srinivasan-Laughlin/a95311474d799499fbb50b4b7e765a9af99791d9?sort=total-citations"
}