{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "15805169"
                        ],
                        "name": "L. Kamentsky",
                        "slug": "L.-Kamentsky",
                        "structuredName": {
                            "firstName": "Louis",
                            "lastName": "Kamentsky",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Kamentsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "123266344"
                        ],
                        "name": "Chao-Ning Liu",
                        "slug": "Chao-Ning-Liu",
                        "structuredName": {
                            "firstName": "Chao-Ning",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chao-Ning Liu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6188555,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2e9407b62dd34f68d9b60072e9be3f146ab111b6",
            "isKey": false,
            "numCitedBy": 85,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "A computer program has been written to design character recognition logic based on the processing of data samples. This program consists of two subroutines: (1) to search for logic circuits having certain constraints on hardware design, and (2) to evaluate these logics in terms of their discriminating ability over samples of the character set they are expected to recognize. An executive routine is used to apply these subroutines to select a complete logic with a given performance and complexity. This logic consists of 39 to 96 AND gates connected to a shift register and a table look-up or resistance network comparison system. \n \nThe methods were applied to the design of recognitionl ogics for the 52 upper and lower case characters of IBM Electric Modern Pica type font and lower case Cyrillic characters scanned from Russian text. In both cases when the logics were tested on data different from that used to design the logics, the substitution rate was about one error per thousand. A single logic was designed to read two different Cyrillic fonts. For this design, an error rate of one error per hundred characters was observed. \n \nSeveral experiments are reported ona number of logics designed for typewritten data, and single- and two-font Cyrillic data. The performances of different recognitionsy stems are compared as a function of the complexity of the recognition logics."
            },
            "slug": "Computer-Automated-Design-of-Multifont-Print-Logic-Kamentsky-Liu",
            "title": {
                "fragments": [],
                "text": "Computer-Automated Design of Multifont Print Recognition Logic"
            },
            "tldr": {
                "abstractSimilarityScore": 86,
                "text": "A computer program has been written to design character recognition logic based on the processing of data samples to search for logic circuits having certain constraints on hardware design and evaluate these logics in terms of their discriminating ability over samples of the character set they are expected to recognize."
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. Dev."
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47099660"
                        ],
                        "name": "W. C. Naylor",
                        "slug": "W.-C.-Naylor",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Naylor",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. C. Naylor"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 30274790,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ea824ce657825271c65bd7abda2bd313ebb41e63",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "A project to develop an effective tool for the interactive design of optical character recognition systems is described. The initial design system and several techniques and experiments to improve the system are also reported. Results of an experiment to design a recognition system for typewritten characters are included. The recognition logic required 11.3 man-hours to design and recognized over 99.9 percent of its test characters. It is also small and can run at high speeds on standard digital computer systems. The results of several experiments and recommendations for future experiments to extend these results to hand-printed characters are also included. The development of more powerful multilevel logic forms and suggestions for making these forms easy to use in an interactive design environment are particularly important results of these studies."
            },
            "slug": "Some-Studies-in-the-Interactive-Design-of-Character-Naylor",
            "title": {
                "fragments": [],
                "text": "Some Studies in the Interactive Design of Character Recognition Systems"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The development of more powerful multilevel logic forms and suggestions for making these forms easy to use in an interactive design environment are particularly important results of these studies."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1702517"
                        ],
                        "name": "I. Sethi",
                        "slug": "I.-Sethi",
                        "structuredName": {
                            "firstName": "Ishwar",
                            "lastName": "Sethi",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Sethi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3266532"
                        ],
                        "name": "G. P. R. Sarvarayudu",
                        "slug": "G.-P.-R.-Sarvarayudu",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Sarvarayudu",
                            "middleNames": [
                                "P.",
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. P. R. Sarvarayudu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 18707355,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "66ee4bb5d704856f43d751c259a7b5de9c77b764",
            "isKey": false,
            "numCitedBy": 188,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "A nonparametric algorithm is presented for the hierarchical partitioning of the feature space. The algorithm is based on the concept of average mutual information, and is suitable for multifeature multicategory pattern recognition problems. The algorithm generates an efficient partitioning tree for specified probability of error by maximizing the amount of average mutual information gain at each partitioning step. A confidence bound expression is presented for the resulting classifier. Three examples, including one of handprinted numeral recognition, are presented to demonstrate the effectiveness of the algorithm."
            },
            "slug": "Hierarchical-Classifier-Design-Using-Mutual-Sethi-Sarvarayudu",
            "title": {
                "fragments": [],
                "text": "Hierarchical Classifier Design Using Mutual Information"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "A nonparametric algorithm is presented for the hierarchical partitioning of the feature space that generates an efficient partitioning tree for specified probability of error by maximizing the amount of average mutual information gain at each partitioning step."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1982
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 3,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Decision-tree-design-using-a-probabilistic-model-Casey-Nagy/eb73120b579eceff08cc7308d81839ce50280038?sort=total-citations"
}