{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32052472"
                        ],
                        "name": "R. Buccigrossi",
                        "slug": "R.-Buccigrossi",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Buccigrossi",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Buccigrossi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 84,
                                "start": 78
                            }
                        ],
                        "text": "This type of scaling dependency has been extensively documented by Simoncelli [5, 9]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 11
                            }
                        ],
                        "text": "Simoncelli [5, 9] has modeled the variance dependencies of pairs of wavelet coefficients."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1887438,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "156ed6cd90506cd1111dffcd8e80e33ff62ca5ae",
            "isKey": false,
            "numCitedBy": 620,
            "numCiting": 68,
            "paperAbstract": {
                "fragments": [],
                "text": "We develop a probability model for natural images, based on empirical observation of their statistics in the wavelet transform domain. Pairs of wavelet coefficients, corresponding to basis functions at adjacent spatial locations, orientations, and scales, are found to be non-Gaussian in both their marginal and joint statistical properties. Specifically, their marginals are heavy-tailed, and although they are typically decorrelated, their magnitudes are highly correlated. We propose a Markov model that explains these dependencies using a linear predictor for magnitude coupled with both multiplicative and additive uncertainties, and show that it accounts for the statistics of a wide variety of images including photographic images, graphical images, and medical images. In order to directly demonstrate the power of the model, we construct an image coder called EPWIC (embedded predictive wavelet image coder), in which subband coefficients are encoded one bitplane at a time using a nonadaptive arithmetic encoder that utilizes conditional probabilities calculated from the model. Bitplanes are ordered using a greedy algorithm that considers the MSE reduction per encoded bit. The decoder uses the statistical model to predict coefficient values based on the bits it has received. Despite the simplicity of the model, the rate-distortion performance of the coder is roughly comparable to the best image coders in the literature."
            },
            "slug": "Image-compression-via-joint-statistical-in-the-Buccigrossi-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Image compression via joint statistical characterization in the wavelet domain"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A Markov model is proposed that explains dependencies using a linear predictor for magnitude coupled with both multiplicative and additive uncertainties, and it is shown that it accounts for the statistics of a wide variety of images including photographic images, graphical images, and medical images."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2145738882"
                        ],
                        "name": "Jinggang Huang",
                        "slug": "Jinggang-Huang",
                        "structuredName": {
                            "firstName": "Jinggang",
                            "lastName": "Huang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jinggang Huang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117481816"
                        ],
                        "name": "D. Mumford",
                        "slug": "D.-Mumford",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mumford",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mumford"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 18
                            }
                        ],
                        "text": "Huang and Mumford [11] have modeled marginal densities and cross-sections of joint densities with multi-dimensional generalized Laplacians."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16242434,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c9001ca7266f67de55733477eeb48988481d7204",
            "isKey": false,
            "numCitedBy": 636,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Large calibrated datasets of 'random' natural images have recently become available. These make possible precise and intensive statistical studies of the local nature of images. We report results ranging from the simplest single pixel intensity to joint distribution of 3 Haar wavelet responses. Some of these statistics shed light on old issues such as the near scale-invariance of image statistics and some are entirely new. We fit mathematical models to some of the statistics and explain others in terms of local image features."
            },
            "slug": "Statistics-of-natural-images-and-models-Huang-Mumford",
            "title": {
                "fragments": [],
                "text": "Statistics of natural images and models"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Results ranging from the simplest single pixel intensity to joint distribution of 3 Haar wavelet responses are reported, which shed light on old issues such as the near scale-invariance of image statistics and some are entirely new."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. 1999 IEEE Computer Society Conference on Computer Vision and Pattern Recognition (Cat. No PR00149)"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1735291"
                        ],
                        "name": "J. Romberg",
                        "slug": "J.-Romberg",
                        "structuredName": {
                            "firstName": "Justin",
                            "lastName": "Romberg",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Romberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2942047"
                        ],
                        "name": "Hyeokho Choi",
                        "slug": "Hyeokho-Choi",
                        "structuredName": {
                            "firstName": "Hyeokho",
                            "lastName": "Choi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hyeokho Choi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144908066"
                        ],
                        "name": "Richard Baraniuk",
                        "slug": "Richard-Baraniuk",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Baraniuk",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Richard Baraniuk"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[10] have made a related proposal using two-state discrete multipliers, corresponding to a finite mixture of Gaussians."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[10] have modeled wavelet densities using two-component mixtures of Gaussians."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 6821083,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ec2451f684da33cbfcdb27a077721014d1a565f9",
            "isKey": false,
            "numCitedBy": 37,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Wavelet-domain hidden Markov models have proven to be useful tools for statistical signal and image processing. The hidden Markov tree (HMT) model captures the key features of the joint statistics of the wavelet coefficients of real-world data. One potential drawback to the HMT framework is the need for computationally expensive iterative training (using the EM algorithm, for example). In this paper, we propose two reduced-parameter HMT models that capture the general structure of a broad class of grayscale images. The image HMT (iHMT) model leverages the fact that for a large class of images the structure of the HMT is self-similar across scale. This allows us to reduce the complexity of the iHMT to just nine easily trained parameters (independent of the size of the image and the number of wavelet scales). In the universal HMT (uHMT) we take a Bayesian approach and fix these nine parameters. The uHMT requires no training of any kind. While simple, we show using a series of image estimation/denoising experiments that these two new models retain nearly all of the key structures modeled by the full HMT. Based on these new models, we develop a shift-invariant wavelet denoising scheme that outperforms all algorithms in the current literature."
            },
            "slug": "Bayesian-wavelet-domain-image-modeling-using-hidden-Romberg-Choi",
            "title": {
                "fragments": [],
                "text": "Bayesian wavelet-domain image modeling using hidden Markov trees"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Two reduced-parameter HMT models that capture the general structure of a broad class of grayscale images are proposed and a shift-invariant wavelet denoising scheme is developed that outperforms all algorithms in the current literature."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings 1999 International Conference on Image Processing (Cat. 99CH36348)"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1829021"
                        ],
                        "name": "D. Ruderman",
                        "slug": "D.-Ruderman",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Ruderman",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ruderman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1762240"
                        ],
                        "name": "W. Bialek",
                        "slug": "W.-Bialek",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Bialek",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Bialek"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10210242,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4ea293ac6d42d09ccb9ffab7bd72dcf6102c3eab",
            "isKey": false,
            "numCitedBy": 974,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "In order to best understand a visual system one should attempt to characterize the natural images it processes. We gather images from the woods and find that these scenes possess an ensemble scale invariance. Further, they are highly non-Gaussian, and this non-Gaussian character cannot be removed through local linear filtering. We find that including a simple \"gain control\" nonlinearity in the filtering process makes the filter output quite Gaussian, meaning information is maximized at fixed channel variance. Finally, we use the measured power spectrum to place an upper bound on the information conveyed about natural scenes by an array of receptors."
            },
            "slug": "Statistics-of-Natural-Images:-Scaling-in-the-Woods-Ruderman-Bialek",
            "title": {
                "fragments": [],
                "text": "Statistics of Natural Images: Scaling in the Woods"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "This work gathers images from the woods and finds that these scenes possess an ensemble scale invariance, and this non-Gaussian character cannot be removed through local linear filtering, meaning information is maximized at fixed channel variance."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 235072,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "85a1725bfd3b4a2d3fe9a7272d66ebf03c016fed",
            "isKey": false,
            "numCitedBy": 766,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "The classical solution to the noise removal problem is the Wiener filter, which utilizes the second-order statistics of the Fourier decomposition. Subband decompositions of natural images have significantly non-Gaussian higher-order point statistics; these statistics capture image properties that elude Fourier-based techniques. We develop a Bayesian estimator that is a natural extension of the Wiener solution, and that exploits these higher-order statistics. The resulting nonlinear estimator performs a \"coring\" operation. We provide a simple model for the subband statistics, and use it to develop a semi-blind noise removal algorithm based on a steerable wavelet pyramid."
            },
            "slug": "Noise-removal-via-Bayesian-wavelet-coring-Simoncelli-Adelson",
            "title": {
                "fragments": [],
                "text": "Noise removal via Bayesian wavelet coring"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "A Bayesian estimator is developed that is a natural extension of the Wiener solution, and that exploits higher-order statistics of the Fourier decomposition to develop a semi-blind noise removal algorithm based on a steerable wavelet pyramid."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd IEEE International Conference on Image Processing"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14163010,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4646e76fe9b59e5a3ba46e388c63a268740acf89",
            "isKey": false,
            "numCitedBy": 342,
            "numCiting": 51,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a parametric statistical model for visual images in the wavelet transform domain. We characterize the joint densities of coefficient magnitudes at adjacent spatial locations, adjacent orientations, and adjacent spatial scales. The model accounts for the statistics of a wide variety of visual images. As a demonstration of this, we used the model to design a progressive image encoder with state-of-the-art rate-distortion performance. We also show promising examples of image restoration and texture synthesis."
            },
            "slug": "Statistical-models-for-images:-compression,-and-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Statistical models for images: compression, restoration and synthesis"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "A parametric statistical model for visual images in the wavelet transform domain is presented and the joint densities of coefficient magnitudes at adjacent spatial locations, adjacent orientations, and adjacent spatial scales are characterized."
            },
            "venue": {
                "fragments": [],
                "text": "Conference Record of the Thirty-First Asilomar Conference on Signals, Systems and Computers (Cat. No.97CB36136)"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1742248"
                        ],
                        "name": "P. Moulin",
                        "slug": "P.-Moulin",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Moulin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Moulin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2108516799"
                        ],
                        "name": "Juan Liu",
                        "slug": "Juan-Liu",
                        "structuredName": {
                            "firstName": "Juan",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Juan Liu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 8325093,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5c8c82ea1a458b821993865bc9d6a575a93576fb",
            "isKey": false,
            "numCitedBy": 566,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "Research on universal and minimax wavelet shrinkage and thresholding methods has demonstrated near-ideal estimation performance in various asymptotic frameworks. However, image processing practice has shown that universal thresholding methods are outperformed by simple Bayesian estimators assuming independent wavelet coefficients and heavy-tailed priors such as generalized Gaussian distributions (GGDs). In this paper, we investigate various connections between shrinkage methods and maximum a posteriori (MAP) estimation using such priors. In particular, we state a simple condition under which MAP estimates are sparse. We also introduce a new family of complexity priors based upon Rissanen's universal prior on integers. One particular estimator in this class outperforms conventional estimators based on earlier applications of the minimum description length (MDL) principle. We develop analytical expressions for the shrinkage rules implied by GGD and complexity priors. This allows us to show the equivalence between universal hard thresholding, MAP estimation using a very heavy-tailed GGD, and MDL estimation using one of the new complexity priors. Theoretical analysis supported by numerous practical experiments shows the robustness of some of these estimates against mis-specifications of the prior-a basic concern in image processing applications."
            },
            "slug": "Analysis-of-Multiresolution-Image-Denoising-Schemes-Moulin-Liu",
            "title": {
                "fragments": [],
                "text": "Analysis of Multiresolution Image Denoising Schemes Using Generalized Gaussian and Complexity Priors"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "This paper investigates various connections between shrinkage methods and maximum a posteriori (MAP) estimation using such priors, and introduces a new family of complexity priors based upon Rissanen's universal prior on integers."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49649079"
                        ],
                        "name": "D. Field",
                        "slug": "D.-Field",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Field",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Field"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1600874,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aeb37769d72999bcbfb0582b73607fd8d23f4545",
            "isKey": false,
            "numCitedBy": 3274,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "The relative efficiency of any particular image-coding scheme should be defined only in relation to the class of images that the code is likely to encounter. To understand the representation of images by the mammalian visual system, it might therefore be useful to consider the statistics of images from the natural environment (i.e., images with trees, rocks, bushes, etc). In this study, various coding schemes are compared in relation to how they represent the information in such natural images. The coefficients of such codes are represented by arrays of mechanisms that respond to local regions of space, spatial frequency, and orientation (Gabor-like transforms). For many classes of image, such codes will not be an efficient means of representing information. However, the results obtained with six natural images suggest that the orientation and the spatial-frequency tuning of mammalian simple cells are well suited for coding the information in such images if the goal of the code is to convert higher-order redundancy (e.g., correlation between the intensities of neighboring pixels) into first-order redundancy (i.e., the response distribution of the coefficients). Such coding produces a relatively high signal-to-noise ratio and permits information to be transmitted with only a subset of the total number of cells. These results support Barlow's theory that the goal of natural vision is to represent the information in the natural environment with minimal redundancy."
            },
            "slug": "Relations-between-the-statistics-of-natural-images-Field",
            "title": {
                "fragments": [],
                "text": "Relations between the statistics of natural images and the response properties of cortical cells."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The results obtained with six natural images suggest that the orientation and the spatial-frequency tuning of mammalian simple cells are well suited for coding the information in such images if the goal of the code is to convert higher-order redundancy into first- order redundancy."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746242"
                        ],
                        "name": "S. Mallat",
                        "slug": "S.-Mallat",
                        "structuredName": {
                            "firstName": "Stéphane",
                            "lastName": "Mallat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mallat"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2356353,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b78626ce1a562c05b1c06f9c805e839f9760b9ab",
            "isKey": false,
            "numCitedBy": 20815,
            "numCiting": 87,
            "paperAbstract": {
                "fragments": [],
                "text": "Multiresolution representations are effective for analyzing the information content of images. The properties of the operator which approximates a signal at a given resolution were studied. It is shown that the difference of information between the approximation of a signal at the resolutions 2/sup j+1/ and 2/sup j/ (where j is an integer) can be extracted by decomposing this signal on a wavelet orthonormal basis of L/sup 2/(R/sup n/), the vector space of measurable, square-integrable n-dimensional functions. In L/sup 2/(R), a wavelet orthonormal basis is a family of functions which is built by dilating and translating a unique function psi (x). This decomposition defines an orthogonal multiresolution representation called a wavelet representation. It is computed with a pyramidal algorithm based on convolutions with quadrature mirror filters. Wavelet representation lies between the spatial and Fourier domains. For images, the wavelet representation differentiates several spatial orientations. The application of this representation to data compression in image coding, texture discrimination and fractal analysis is discussed. >"
            },
            "slug": "A-Theory-for-Multiresolution-Signal-Decomposition:-Mallat",
            "title": {
                "fragments": [],
                "text": "A Theory for Multiresolution Signal Decomposition: The Wavelet Representation"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is shown that the difference of information between the approximation of a signal at the resolutions 2/sup j+1/ and 2/Sup j/ can be extracted by decomposing this signal on a wavelet orthonormal basis of L/sup 2/(R/sup n/), the vector space of measurable, square-integrable n-dimensional functions."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685058"
                        ],
                        "name": "A. Tewfik",
                        "slug": "A.-Tewfik",
                        "structuredName": {
                            "firstName": "Ahmed",
                            "lastName": "Tewfik",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Tewfik"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107618934"
                        ],
                        "name": "M. Kim",
                        "slug": "M.-Kim",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Kim",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Kim"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 113,
                                "start": 110
                            }
                        ],
                        "text": "Furthermore, despite being approximately decorrelated (as suggested by theoretical analysis of 1/ f processes [3]), orthonormal wavelet coefficients exhibit striking forms of statistical dependency [4, 5]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 42556907,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e6d2035de7d49d85e63ce31bf7636fb818482f49",
            "isKey": false,
            "numCitedBy": 362,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown that the discrete wavelet coefficients of fractional Brownian motion at different scales are correlated and that their auto- and cross-correlation functions decay hyperbolically fast at a rate much faster than that of the autocorrelation of the fractional Brownian motion itself. The rate of decay of the correlation function in the wavelet domain is primarily determined by the number of vanishing moments of the analyzing wavelet. >"
            },
            "slug": "Correlation-structure-of-the-discrete-wavelet-of-Tewfik-Kim",
            "title": {
                "fragments": [],
                "text": "Correlation structure of the discrete wavelet coefficients of fractional Brownian motion"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "It is shown that the discrete wavelet coefficients of fractional Brownian motion at different scales are correlated and that their auto- and cross-correlation functions decay hyperbolically fast at a rate much faster than that of the autocorrelation of the fractionalBrownian motion itself."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144381490"
                        ],
                        "name": "D. F. Andrews",
                        "slug": "D.-F.-Andrews",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Andrews",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. F. Andrews"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2655181"
                        ],
                        "name": "C. Mallows",
                        "slug": "C.-Mallows",
                        "structuredName": {
                            "firstName": "Colin",
                            "lastName": "Mallows",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Mallows"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 82
                            }
                        ],
                        "text": "More generally, it is straightforward to provide conditions on either the density [12] or characteristic function of X that ensure it is a GSM, but these conditions do not necessarily provide an explicit form of <Pz."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 117175649,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "73e6d410f380af0ed85a5284952a8d01047f1e86",
            "isKey": false,
            "numCitedBy": 533,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "SUMMARY This paper presents necessary and sufficient conditions under which a random variable X may be generated as the ratio ZI V where Z and V are independent and Z has a standard normal distribution. This representation is useful in Monte Carlo calculations. It is established that when 7 V2 is exponential, X is double exponential; and that when WV has the asymptotic distribution of the Kolmogorov distance statistic, X is logistic."
            },
            "slug": "Scale-Mixtures-of-Normal-Distributions-Andrews-Mallows",
            "title": {
                "fragments": [],
                "text": "Scale Mixtures of Normal Distributions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "80641325"
                        ],
                        "name": "K. C. Chou",
                        "slug": "K.-C.-Chou",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Chou",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. C. Chou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701607"
                        ],
                        "name": "A. Willsky",
                        "slug": "A.-Willsky",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Willsky",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Willsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50376126"
                        ],
                        "name": "R. Nikoukhah",
                        "slug": "R.-Nikoukhah",
                        "structuredName": {
                            "firstName": "Ramine",
                            "lastName": "Nikoukhah",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Nikoukhah"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 109,
                                "start": 105
                            }
                        ],
                        "text": "For illustration, we assume that the multipliers are linked by a multiscale autoregressive (MAR) process [15] on a tree:"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 18724281,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "517713f31615382ed8fc9a66c653a656e6c9ff73",
            "isKey": false,
            "numCitedBy": 147,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm analogous to the Rauch-Tung-Striebel algorithm/spl minus/consisting of a fine-to-coarse Kalman filter-like sweep followed by a coarse-to-fine smoothing step/spl minus/was developed previously by the authors (ibid. vol.39, no.3, p.464-78 (1994)). In this paper they present a detailed system-theoretic analysis of this filter and of the new scale-recursive Riccati equation associated with it. While this analysis is similar in spirit to that for standard Kalman filters, the structure of the dyadic tree leads to several significant differences. In particular, the structure of the Kalman filter error dynamics leads to the formulation of an ML version of the filtering equation and to a corresponding smoothing algorithm based on triangularizing the Hamiltonian for the smoothing problem. In addition, the notion of stability for dynamics requires some care as do the concepts of reachability and observability. Using these system-theoretic constructs, the stability and steady-state behavior of the fine-to-coarse Kalman filter and its Riccati equation are analysed. >"
            },
            "slug": "Multiscale-systems,-Kalman-filters,-and-Riccati-Chou-Willsky",
            "title": {
                "fragments": [],
                "text": "Multiscale systems, Kalman filters, and Riccati equations"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A detailed system-theoretic analysis is presented of the stability and steady-state behavior of the fine-to-coarse Kalman filter and its Riccati equation and of the new scale-recursive RicCati equation associated with it."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Autom. Control."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768236"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Freeman",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 91,
                                "start": 87
                            }
                        ],
                        "text": "lWe use the steer able pyramid, an overcomplete multiscale representation described in [13]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1099364,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "89b6a5a136bc0a938b792df6bdde134def28335e",
            "isKey": false,
            "numCitedBy": 1150,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe an architecture for efficient and accurate linear decomposition of an image into scale and orientation subbands. The basis functions of this decomposition are directional derivative operators of any desired order. We describe the construction and implementation of the transform."
            },
            "slug": "The-steerable-pyramid:-a-flexible-architecture-for-Simoncelli-Freeman",
            "title": {
                "fragments": [],
                "text": "The steerable pyramid: a flexible architecture for multi-scale derivative computation"
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "An architecture for efficient and accurate linear decomposition of an image into scale and orientation subbands and the construction and implementation of the transform is described."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings., International Conference on Image Processing"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2380576"
                        ],
                        "name": "Luca Abeni",
                        "slug": "Luca-Abeni",
                        "structuredName": {
                            "firstName": "Luca",
                            "lastName": "Abeni",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Luca Abeni"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1708752"
                        ],
                        "name": "G. Buttazzo",
                        "slug": "G.-Buttazzo",
                        "structuredName": {
                            "firstName": "Giorgio",
                            "lastName": "Buttazzo",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Buttazzo"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 107,
                                "start": 104
                            }
                        ],
                        "text": "Some of the more well-known server schemes that function in this way include constant bandwidth servers [1], total bandwidth servers [24], and resource kernels [22]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16653710,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6fd3e6adec10b0d1a4d9d11ec799d96505acaae1",
            "isKey": false,
            "numCitedBy": 772,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper focuses on the problem of providing efficient run-time support to multimedia applications in a real-time system, where two types of tasks can coexist simultaneously: multimedia soft real-time tasks and hard real-time tasks. Hard tasks are guaranteed based on worst case execution times and minimum interarrival times, whereas multimedia and soft tasks are served based on mean parameters. The paper describes a server-based mechanism for scheduling soft and multimedia tasks without jeopardizing the a priori guarantee of hard real-time activities. The performance of the proposed method is compared with that of similar service mechanisms through extensive simulation experiments and several multimedia applications have been implemented on the HARTIK kernel."
            },
            "slug": "Integrating-multimedia-applications-in-hard-systems-Abeni-Buttazzo",
            "title": {
                "fragments": [],
                "text": "Integrating multimedia applications in hard real-time systems"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A server-based mechanism for scheduling soft and multimedia tasks without jeopardizing the a priori guarantee of hard real-time activities is described."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings 19th IEEE Real-Time Systems Symposium (Cat. No.98CB36279)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143862425"
                        ],
                        "name": "R. Rajkumar",
                        "slug": "R.-Rajkumar",
                        "structuredName": {
                            "firstName": "Ragunathan",
                            "lastName": "Rajkumar",
                            "middleNames": [
                                "Raj"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Rajkumar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2101124"
                        ],
                        "name": "K. Juvva",
                        "slug": "K.-Juvva",
                        "structuredName": {
                            "firstName": "Kanaka",
                            "lastName": "Juvva",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Juvva"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40224651"
                        ],
                        "name": "A. Molano",
                        "slug": "A.-Molano",
                        "structuredName": {
                            "firstName": "Anastasio",
                            "lastName": "Molano",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Molano"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38742549"
                        ],
                        "name": "S. Oikawa",
                        "slug": "S.-Oikawa",
                        "structuredName": {
                            "firstName": "Shuichi",
                            "lastName": "Oikawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Oikawa"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 2
                            }
                        ],
                        "text": "Choosing a budget is more complicated."
                    },
                    "intents": []
                }
            ],
            "corpusId": 10629339,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "52f29b0494c14e80d025d5a4cf8c92ed6fb1bf6d",
            "isKey": false,
            "numCitedBy": 388,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "We consider the problem of OS resource management for real- time and multimedia systems where multiple activities with different timing constraints must be scheduled concurrently. Time on a particular resource is shared among its users and must be globally managed in real-time and multimedia systems. A resource kernel is meant for use in such systems and is defined to be one which provides timely, guaranteed and protected access to system resources. The resource kernel allows applications to specify only their resource demands leaving the kernel to satisfy those demands using hidden resource management schemes. This separation of resource specification from resource management allows OS-subsystem- specific customization by extending, optimizing or even replacing resource management schemes. As a result, this resource-centric approach can be implemented with any of several different resource management schemes. We identify the specific goals of a resource kernel: applications must be able to explicitly state their timeliness requirements; the kernel must enforce maximum resource usage by applications; the kernel must support high utilization of system resources; and an application must be able to access different system resources simultaneously. Since the same application consumes a different amount of time on different platforms, the resource kernel must allow such resource consumption times to be portable across platforms, and to be automatically calibrated. Our resource management scheme is based on resource reservation and satisfies these goals. The scheme is not only simple but captures a wide range of solutions developed by the real-time systems community over several years. One potentially serious problem that any resource management scheme must address is that of allowing access to multiple resources simultaneously and in timely fashion, a problem which is known to be NP-complete. We show that this problem of simultaneous access to multiple resources can be practically addressed by resource decoupling and resolving critical resource dependencies immediately. Finally, we demonstrate our resource kernel's functionality and flexibility in the context of multimedia applications which need processor cycles and/or disk bandwidth."
            },
            "slug": "Resource-kernels:-a-resource-centric-approach-to-Rajkumar-Juvva",
            "title": {
                "fragments": [],
                "text": "Resource kernels: a resource-centric approach to real-time and multimedia systems"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "This paper considers the problem of OS resource management for real- time and multimedia systems where multiple activities with different timing constraints must be scheduled concurrently and shows that this problem of simultaneous access to multiple resources can be practically addressed by resource decoupling and resolving critical resource dependencies immediately."
            },
            "venue": {
                "fragments": [],
                "text": "Electronic Imaging"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2171927472"
                        ],
                        "name": "C. Liu",
                        "slug": "C.-Liu",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Liu",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48959230"
                        ],
                        "name": "J. Layland",
                        "slug": "J.-Layland",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Layland",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Layland"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 113
                            }
                        ],
                        "text": "In this paper, we consider a well-studied task model in which such notions arise, namely the periodic task model [20]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Finally, we have illustrated numerous avenues for future research based on the proposed architecture and future exentensions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 59896693,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3d63f7b22bc70250d2008e14c305ac88e307f986",
            "isKey": false,
            "numCitedBy": 4798,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of multiprogram scheduling on a single processor is studied from the viewpoint of the characteristics peculiar to the program functions that need guaranteed service. It is shown that an optimum fixed priority scheduler possesses an upper bound to processor utilization which may be as low as 70 percent for large task sets. It is also shown that full processor utilization can be achieved by dynamically assigning priorities on the basis of their current deadlines. A combination of these two scheduling techniques is also discussed."
            },
            "slug": "Scheduling-Algorithms-for-Multiprogramming-in-a-Liu-Layland",
            "title": {
                "fragments": [],
                "text": "Scheduling algorithms for multiprogramming in a hard-real-time environment"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "The problem of multiprogram scheduling on a single processor is studied from the viewpoint of the characteristics peculiar to the program functions that need guaranteed service and it is shown that an optimum fixed priority scheduler possesses an upper bound to processor utilization."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3217873"
                        ],
                        "name": "Victor Yodaiken",
                        "slug": "Victor-Yodaiken",
                        "structuredName": {
                            "firstName": "Victor",
                            "lastName": "Yodaiken",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Victor Yodaiken"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52278161"
                        ],
                        "name": "M. Barabanov",
                        "slug": "M.-Barabanov",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Barabanov",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Barabanov"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 145
                            }
                        ],
                        "text": "2By “Linux,” we mean modified versions of the stock Linux kernel with improved real-time capability, not paravirtualized variants such as RTLinux[28] or L4Linux[18], where real-time tasks are not actually Linux tasks."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2864918,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2218bb8155a6a17e2d8503852dcc0ee8815b9bb2",
            "isKey": false,
            "numCitedBy": 258,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "The paper describes the design, implementation, experimental results, and possible applications of a real-time version of the Linux operating system. We have used the idea of virtual machines for running a standard time-sharing OS and a real-time executive on the same computer. Services provided by the real-time kernel are described. The comparison of our solution with other work on real-time UNIXes is also presented."
            },
            "slug": "A-Real-Time-Linux-Yodaiken-Barabanov",
            "title": {
                "fragments": [],
                "text": "A Real-Time Linux"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "The design, implementation, experimental results, and possible applications of a real-time version of the Linux operating system, using the idea of virtual machines for running a standard time-sharing OS and areal-time executive on the same computer are described."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2789737"
                        ],
                        "name": "M. Spuri",
                        "slug": "M.-Spuri",
                        "structuredName": {
                            "firstName": "Marco",
                            "lastName": "Spuri",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Spuri"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1708752"
                        ],
                        "name": "G. Buttazzo",
                        "slug": "G.-Buttazzo",
                        "structuredName": {
                            "firstName": "Giorgio",
                            "lastName": "Buttazzo",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Buttazzo"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 204,
                                "start": 200
                            }
                        ],
                        "text": "However, since task periods are harmonic, this problem can be avoided by choosing C.p = min{T.p} for all containers—by definition, jobs only arrive at times that are multiples of C.p and budget retention becomes unnecessary."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 10416264,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7ce899fb05dc03bd23d8ed2c11777bf4d7de9225",
            "isKey": false,
            "numCitedBy": 266,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "We present four new on-line algorithms for servicing soft aperiodic requests in real-time systems, where a set of hard periodic tasks is scheduled using the Earliest Deadline First (EDF) algorithm. All the proposed solutions can achieve full processor utilization and enhance aperiodic responsiveness, still guaranteeing the execution of the periodic tasks. Operation of the algorithms, performance, schedulability analysis, and implementation complexity are discussed and compared with classical alternative solutions, such as background and polling service. Extensive simulations show that algorithms with contained run-time overhead present nearly optimal responsiveness. A valuable contribution of this work is to provide the real-time system designer with a wide range of practical solutions which allow to balance efficiency against implementation complexity.<<ETX>>"
            },
            "slug": "Efficient-aperiodic-service-under-earliest-deadline-Spuri-Buttazzo",
            "title": {
                "fragments": [],
                "text": "Efficient aperiodic service under earliest deadline scheduling"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "Four new on-line algorithms for servicing soft aperiodic requests in real-time systems, where a set of hard periodic tasks is scheduled using the Earliest Deadline First (EDF) algorithm are presented."
            },
            "venue": {
                "fragments": [],
                "text": "1994 Proceedings Real-Time Systems Symposium"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144379776"
                        ],
                        "name": "Sanjoy Baruah",
                        "slug": "Sanjoy-Baruah",
                        "structuredName": {
                            "firstName": "Sanjoy",
                            "lastName": "Baruah",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sanjoy Baruah"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143614516"
                        ],
                        "name": "J. Gehrke",
                        "slug": "J.-Gehrke",
                        "structuredName": {
                            "firstName": "Johannes",
                            "lastName": "Gehrke",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gehrke"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691055"
                        ],
                        "name": "C. G. Plaxton",
                        "slug": "C.-G.-Plaxton",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Plaxton",
                            "middleNames": [
                                "Greg"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. G. Plaxton"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 71,
                                "start": 64
                            }
                        ],
                        "text": "1A category of global algorithms exists called Pfair algorithms [3, 25] for which this statement is not true."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 13053757,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f207d872e60b480920529a88d7e641bd7c80f488",
            "isKey": false,
            "numCitedBy": 242,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "Given n periodic tasks, each characterized by an execution requirement and a period, and m identical copies of a resource, the periodic scheduling problem is concerned with generating a schedule for the n tasks on the m resources. We present an algorithm that schedules every feasible instance of the periodic scheduling problem, and runs in O(min{mlgn,n}) time per slot scheduled.<<ETX>>"
            },
            "slug": "Fast-scheduling-of-periodic-tasks-on-multiple-Baruah-Gehrke",
            "title": {
                "fragments": [],
                "text": "Fast scheduling of periodic tasks on multiple resources"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This work presents an algorithm that schedules every feasible instance of the periodic scheduling problem, and runs in O(min{mlgn,n}) time per slot scheduled."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 9th International Parallel Processing Symposium"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1731688"
                        ],
                        "name": "Hermann Härtig",
                        "slug": "Hermann-Härtig",
                        "structuredName": {
                            "firstName": "Hermann",
                            "lastName": "Härtig",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hermann Härtig"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1944727"
                        ],
                        "name": "Michael Hohmuth",
                        "slug": "Michael-Hohmuth",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Hohmuth",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael Hohmuth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40347870"
                        ],
                        "name": "J. Wolter",
                        "slug": "J.-Wolter",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Wolter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Wolter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 164,
                                "start": 160
                            }
                        ],
                        "text": "2By “Linux,” we mean modified versions of the stock Linux kernel with improved real-time capability, not paravirtualized variants such as RTLinux[28] or L4Linux[18], where real-time tasks are not actually Linux tasks."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 9123643,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b11b60e1f75f68aef758d44ee577a276f1b00a91",
            "isKey": false,
            "numCitedBy": 50,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes the overall design, partial implement ation and brief performance evaluation of a system in which Linux and i ts applications run besides real-time applications. The separation of the real -time and time-sharing subsystems is not restricted to the use of the CPU but enforce d as well for other resources, namely main memory and caches. This paper details t he changes needed for the original Linux to decouple it from real-time processand analyzes the performance of the resulting system."
            },
            "slug": "Taming-Linux-Härtig-Hohmuth",
            "title": {
                "fragments": [],
                "text": "Taming Linux"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "This paper details the changes needed for the original Linux to decouple it from real-time process and analyzes the performance of the resulting system."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Introduced a parameterisation (MAP) to capture the dependency between nearby filters that falls off with increased separation"
            },
            "venue": {
                "fragments": [],
                "text": "Introduced a parameterisation (MAP) to capture the dependency between nearby filters that falls off with increased separation"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Derived a non-linear form of normalisation"
            },
            "venue": {
                "fragments": [],
                "text": "Derived a non-linear form of normalisation"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "The main focus of this research effort is devising mechanisms for providing “temporal isolation” across criticality levels: lower levels should not adversely “interfere” with higher levels."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "LITMUS RT project"
            },
            "venue": {
                "fragments": [],
                "text": "LITMUS RT project"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 173,
                                "start": 166
                            }
                        ],
                        "text": "This is a generalization of the variance normalization proposed by Ruderman and Bialek[I], and the weighted sum of squares normalization procedure used by Simoncelli [5, 14]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Image statistics and cortical normalization models"
            },
            "venue": {
                "fragments": [],
                "text": "Adv. Neural Information Processing Systems,"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Shown Gaussian Scale Mixtures can characterise the pair-wise and marginal dependencies of wavelet filter coefficients"
            },
            "venue": {
                "fragments": [],
                "text": "Shown Gaussian Scale Mixtures can characterise the pair-wise and marginal dependencies of wavelet filter coefficients"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Field . Relations between the statistics of natural images and the responseproperties of cortical cells"
            },
            "venue": {
                "fragments": [],
                "text": "J . Opt . Soc . Am . A"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 132
                            }
                        ],
                        "text": "Note that for this pair of coefficients, the contours are nearly circular, an observation that has been previously made by Zetzsche [4]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 204,
                                "start": 198
                            }
                        ],
                        "text": "Furthermore, despite being approximately decorrelated (as suggested by theoretical analysis of 1/ f processes [3]), orthonormal wavelet coefficients exhibit striking forms of statistical dependency [4, 5]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Nonlinear aspects of primary vision: Entropy reduction beyond decorrelation"
            },
            "venue": {
                "fragments": [],
                "text": "In Int 'l Symp. Soc. for Info. Display,"
            },
            "year": 1993
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 10,
            "methodology": 7,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 27,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/Scale-Mixtures-of-Gaussians-and-the-Statistics-of-Wainwright-Simoncelli/092d70604a76fa691503cdc41449ec1ddc87630f?sort=total-citations"
}