{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3277321"
                        ],
                        "name": "K. Kise",
                        "slug": "K.-Kise",
                        "structuredName": {
                            "firstName": "Koichi",
                            "lastName": "Kise",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Kise"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113154928"
                        ],
                        "name": "O. Yanagida",
                        "slug": "O.-Yanagida",
                        "structuredName": {
                            "firstName": "Osamu",
                            "lastName": "Yanagida",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Yanagida"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143882780"
                        ],
                        "name": "S. Takamatsu",
                        "slug": "S.-Takamatsu",
                        "structuredName": {
                            "firstName": "Shinobu",
                            "lastName": "Takamatsu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Takamatsu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 109,
                                "start": 105
                            }
                        ],
                        "text": "have proposed a different approach which uses connected white pixels obtained by thinning the background [16]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 41049994,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "f5b0110c64d0bf696dc12bee3d3f2b97e87c7521",
            "isKey": false,
            "numCitedBy": 35,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a new method of page segmentation based on the analysis of background (white areas). The proposed method is capable of segmenting pages with non-rectangular layout as well as with various angles of skew. The characteristics of the method are as follows: (1) thinning of the background enables us to represent white areas of any shape as connected thin lines or chains and the robustness for tilted page images is also achieved by the representation; and (2) based on this representation, the task of page segmentation is defined as to find the loops enclosing printed areas. The task is achieved by eliminating unnecessary chains using not only a feature of white areas, but also a feature of black areas divided by a chain. Based on the experimental results and the comparison with previous methods, we discuss the advantages and limitations of the proposed method."
            },
            "slug": "Page-segmentation-based-on-thinning-of-background-Kise-Yanagida",
            "title": {
                "fragments": [],
                "text": "Page segmentation based on thinning of background"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "The proposed method is capable of segmenting pages with non-rectangular layout as well as with various angles of skew, and the advantages and limitations of the proposed method are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 13th International Conference on Pattern Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1803149"
                        ],
                        "name": "A. Antonacopoulos",
                        "slug": "A.-Antonacopoulos",
                        "structuredName": {
                            "firstName": "Apostolos",
                            "lastName": "Antonacopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Antonacopoulos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2699810"
                        ],
                        "name": "T. Ritchings",
                        "slug": "T.-Ritchings",
                        "structuredName": {
                            "firstName": "Tim",
                            "lastName": "Ritchings",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Ritchings"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 72,
                                "start": 69
                            }
                        ],
                        "text": "The method by Antonacopoulos and Ritchings employ a similar approach [9]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 46947302,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "669e43cfb69f9625bd96e6b586463c82fa2b7967",
            "isKey": false,
            "numCitedBy": 48,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper introduces a new method for document page segmentation. This method is based on the analysis of the background white space that surrounds the printed regions on the page. It does not make any assumptions about the shape of the regions as opposed to most earlier approaches which assume that printed regions are rectangular. It is capable of identifying and describing regions of complex shapes more accurately than existing methods. It requires no a priori knowledge. The background white space is covered with tiles and the contour of each region is identified by tracing through these white tiles that encircle it. The method can segment page images with severe skew without skew correction. The white tiles on the image can also be used in subsequent document analysis processes such as the classification of the image regions."
            },
            "slug": "Flexible-page-segmentation-using-the-background-Antonacopoulos-Ritchings",
            "title": {
                "fragments": [],
                "text": "Flexible page segmentation using the background"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "This paper introduces a new method for document page segmentation based on the analysis of the background white space that surrounds the printed regions on the page that is capable of identifying and describing regions of complex shapes more accurately than existing methods."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 12th IAPR International Conference on Pattern Recognition, Vol. 3 - Conference C: Signal Processing (Cat. No.94CH3440-5)"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713698"
                        ],
                        "name": "N. Normand",
                        "slug": "N.-Normand",
                        "structuredName": {
                            "firstName": "Nicolas",
                            "lastName": "Normand",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Normand"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398288037"
                        ],
                        "name": "C. Viard-Gaudin",
                        "slug": "C.-Viard-Gaudin",
                        "structuredName": {
                            "firstName": "Christian",
                            "lastName": "Viard-Gaudin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Viard-Gaudin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 137,
                                "start": 133
                            }
                        ],
                        "text": "Normand and ViardGaudin have discussed the advantage of the use of regular octagons as primitives to attain two-dimensional isotropy [10]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 62474643,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d2dc6cdb40cdae24103da91773c7b9c07a617467",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "A novel page segmentation algorithm is provided in this paper. Based on the extraction of the background, it offers the benefit of being adaptive to the context of the document and to be insensitive to the orientation of the text blocks. It involves a two-dimensional isotropic structuring element used to characterized the white streams. This element is a disk approximated by a regular octagon which can be recursively generated. Another advantage of the proposed method is that a hierarchical segmentation can be derived from the image built upon the octagonal pattern. This tree allows to perform an isotropic multi-scale smearing, which leads to a physical segmentation. The algorithms are based on an input-time tracing principle and use a single scan of the image, they are very well suited to a real-time implementation."
            },
            "slug": "A-background-based-adaptive-page-segmentation-Normand-Viard-Gaudin",
            "title": {
                "fragments": [],
                "text": "A background based adaptive page segmentation algorithm"
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "A novel page segmentation algorithm is provided, based on the extraction of the background, which offers the benefit of being adaptive to the context of the document and to be insensitive to the orientation of the text blocks."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398550688"
                        ],
                        "name": "L. O'Gorman",
                        "slug": "L.-O'Gorman",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "O'Gorman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. O'Gorman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 110,
                                "start": 107
                            }
                        ],
                        "text": "O’Gorman has focused on k- earest neighbors to form blocks as well as text-lines from connected components [6]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 22995244,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d85097da36118fbccfeb7802abf89bf4b4c63a3e",
            "isKey": false,
            "numCitedBy": 728,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Page layout analysis is a document processing technique used to determine the format of a page. This paper describes the document spectrum (or docstrum), which is a method for structural page layout analysis based on bottom-up, nearest-neighbor clustering of page components. The method yields an accurate measure of skew, within-line, and between-line spacings and locates text lines and text blocks. It is advantageous over many other methods in three main ways: independence from skew angle, independence from different text spacings, and the ability to process local regions of different text orientations within the same image. Results of the method shown for several different page formats and for randomly oriented subpages on the same image illustrate the versatility of the method. We also discuss the differences, advantages, and disadvantages of the docstrum with respect to other lay-out methods. >"
            },
            "slug": "The-Document-Spectrum-for-Page-Layout-Analysis-O'Gorman",
            "title": {
                "fragments": [],
                "text": "The Document Spectrum for Page Layout Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "The document spectrum (or docstrum), which is a method for structural page layout analysis based on bottom-up, nearest-neighbor clustering of page components, yields an accurate measure of skew, within-line, and between-line spacings and locates text lines and text blocks."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "12811570"
                        ],
                        "name": "M. Burge",
                        "slug": "M.-Burge",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Burge",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Burge"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1813087"
                        ],
                        "name": "G. Monagan",
                        "slug": "G.-Monagan",
                        "structuredName": {
                            "firstName": "Gladys",
                            "lastName": "Monagan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Monagan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14722714,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "03986fab71bbea66caf198f842f2e3f8b2939a58",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "We examine the importance of the definition of neighbors and neighborhoods for grouping in document understanding and list some previous definitions. We present a number of benefits to using the Voronoi neighborhood definition; however, we argue that definitions based upon the point Voronoi diagrams are insufficient in the general case (e.g. for grouping image elements in line drawings). We give the definition of a generalized (Euclidean distance measure, 2D Cartesian space, and an area based generator set) Voronoi tessellation and then present our algorithm for approximating this generalized tessellation. The algorithm is constructed from a normal point Voronoi tessellation algorithm. A parameterized Voronoi neighborhood graph (VNG) which can be derived from the tessellation is defined. A graph algorithm for grouping based on the VNG, its image elements, and Voronoi cell descriptors can then be easily derived. We show some results of how this algorithm was used in a map understanding system."
            },
            "slug": "Using-the-Voronoi-tessellation-for-grouping-words-Burge-Monagan",
            "title": {
                "fragments": [],
                "text": "Using the Voronoi tessellation for grouping words and multipart symbols in documents"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "It is argued that definitions based upon the point Voronoi diagrams are insufficient in the general case (e.g. for grouping image elements in line drawings) and a graph algorithm for grouping based on the VNG, its image elements, and Vor onoi cell descriptors can be easily derived."
            },
            "venue": {
                "fragments": [],
                "text": "Optics & Photonics"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107761635"
                        ],
                        "name": "S. Jones",
                        "slug": "S.-Jones",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Jones",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Jones"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1798254"
                        ],
                        "name": "S. Fortune",
                        "slug": "S.-Fortune",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Fortune",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Fortune"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[3], accomplish high accuracy as well as efficiency by normalizing the skew of page images beforehand."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 62735730,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fbe0be8a26a0e9d8889f7f09ded38000faa357ba",
            "isKey": false,
            "numCitedBy": 130,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "A technique for image segmentation using shape-directed covers is described and applied to the fully automatic analysis of complex printed-page layouts. The structure of the background (white space) is analyzed, assisted by an enumeration of all maximal white rectangles. For this enumeration, the most computationally expensive step, an algorithm has been developed that, aside from a sort, achieves an expected runtime linear in the number of black connected components. The crucial engineering decision is the specification of a partial order on white rectangles to express domain-specific knowledge of preferred shapes and sizes. This order determines a sequence of partial covers of the background, and thus, a sequence of nested page segmentations. In experimental trials on Manhattan layouts, good segmentations often occur early in this sequence, using a simple and uniform shape-direction rule. This is a global-to-local strategy, which for some tasks is superior to strategies currently emphasized in the literature, including bottom-up and top-down.<<ETX>>"
            },
            "slug": "Image-segmentation-by-shape-directed-covers-Baird-Jones",
            "title": {
                "fragments": [],
                "text": "Image segmentation by shape-directed covers"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "A technique for image segmentation using shape-directed covers is described and applied to the fully automatic analysis of complex printed-page layouts, which for some tasks is superior to strategies currently emphasized in the literature, including bottom-up and top-down."
            },
            "venue": {
                "fragments": [],
                "text": "[1990] Proceedings. 10th International Conference on Pattern Recognition"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145820949"
                        ],
                        "name": "T. Pavlidis",
                        "slug": "T.-Pavlidis",
                        "structuredName": {
                            "firstName": "Theodosios",
                            "lastName": "Pavlidis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Pavlidis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2461436"
                        ],
                        "name": "Jiangying Zhou",
                        "slug": "Jiangying-Zhou",
                        "structuredName": {
                            "firstName": "Jiangying",
                            "lastName": "Zhou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jiangying Zhou"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 150,
                                "start": 147
                            }
                        ],
                        "text": "Pavlidis and Zhou have used right rectangles of a predetermined short height as primitives and filtered them by their width to extract column gaps [8]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 23410608,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "999e76f9115af2741b0cd973d875163ae714d5da",
            "isKey": false,
            "numCitedBy": 281,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Page-segmentation-and-classification-Pavlidis-Zhou",
            "title": {
                "fragments": [],
                "text": "Page segmentation and classification"
            },
            "venue": {
                "fragments": [],
                "text": "CVGIP Graph. Model. Image Process."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1751698"
                        ],
                        "name": "K. Sugihara",
                        "slug": "K.-Sugihara",
                        "structuredName": {
                            "firstName": "Kokichi",
                            "lastName": "Sugihara",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Sugihara"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 120,
                                "start": 112
                            }
                        ],
                        "text": "In order to obtain candidates of such line segments efficiently, we employ theapproximated area Voronoi diagram [11, 12] which represents the neighborhood of connected components as polygons."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 12941243,
            "fieldsOfStudy": [
                "Computer Science",
                "Engineering"
            ],
            "id": "8e0878419a9c11cfcd2166124eff233bafd389e7",
            "isKey": false,
            "numCitedBy": 72,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract A numerically robust algorithm for the ordinary Voronoi diagrams is applied to the approximation of various types of generalized Voronoi diagrams. The generalized Voronoi diagrams treated here include Voronoi diagrams for figures, additively weighted Voronoi diagrams, Voronoi diagrams in a river, Voronoi diagrams in a Riemannian plane, and Voronoi diagrams with respect to collision-avoiding shortest paths. The construction of these generalized Voronoi diagrams is reduced to the construction of the ordinary Voronoi diagrams. The methods proposed here can save much time which is otherwise necessary for writing a computer program for each type of generalized Voronoi diagram."
            },
            "slug": "Approximation-of-Generalized-Voronoi-Diagrams-by-Sugihara",
            "title": {
                "fragments": [],
                "text": "Approximation of Generalized Voronoi Diagrams by Ordinary Voronoi Diagrams"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "The methods proposed here can save much time which is otherwise necessary for writing a computer program for each type of generalized Voronoi diagram."
            },
            "venue": {
                "fragments": [],
                "text": "CVGIP Graph. Model. Image Process."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47260288"
                        ],
                        "name": "L. Fletcher",
                        "slug": "L.-Fletcher",
                        "structuredName": {
                            "firstName": "Lloyd",
                            "lastName": "Fletcher",
                            "middleNames": [
                                "Alan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Fletcher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3110392"
                        ],
                        "name": "R. Kasturi",
                        "slug": "R.-Kasturi",
                        "structuredName": {
                            "firstName": "Rangachar",
                            "lastName": "Kasturi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kasturi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 110,
                                "start": 107
                            }
                        ],
                        "text": "Fletcher and Kasturi have utilized four nearest neighbors within a collinear group of connected components [5]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2685456,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b08e547ba4edb60902d1708a5593d71f075aa7f1",
            "isKey": false,
            "numCitedBy": 655,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "The development and implementation of an algorithm for automated text string separation that is relatively independent of changes in text font style and size and of string orientation are described. It is intended for use in an automated system for document analysis. The principal parts of the algorithm are the generation of connected components and the application of the Hough transform in order to group components into logical character strings that can then be separated from the graphics. The algorithm outputs two images, one containing text strings and the other graphics. These images can then be processed by suitable character recognition and graphics recognition systems. The performance of the algorithm, both in terms of its effectiveness and computational efficiency, was evaluated using several test images and showed superior performance compared to other techniques. >"
            },
            "slug": "A-Robust-Algorithm-for-Text-String-Separation-from-Fletcher-Kasturi",
            "title": {
                "fragments": [],
                "text": "A Robust Algorithm for Text String Separation from Mixed Text/Graphics Images"
            },
            "tldr": {
                "abstractSimilarityScore": 85,
                "text": "The development and implementation of an algorithm for automated text string separation that is relatively independent of changes in text font style and size and of string orientation are described and showed superior performance compared to other techniques."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "29567139"
                        ],
                        "name": "Y. Ishiyama",
                        "slug": "Y.-Ishiyama",
                        "structuredName": {
                            "firstName": "Yutaka",
                            "lastName": "Ishiyama",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Ishiyama"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47278489"
                        ],
                        "name": "F. Kubo",
                        "slug": "F.-Kubo",
                        "structuredName": {
                            "firstName": "Fumio",
                            "lastName": "Kubo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Kubo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2079483"
                        ],
                        "name": "Hironobu Takahashi",
                        "slug": "Hironobu-Takahashi",
                        "structuredName": {
                            "firstName": "Hironobu",
                            "lastName": "Takahashi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hironobu Takahashi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34622292"
                        ],
                        "name": "F. Tomita",
                        "slug": "F.-Tomita",
                        "structuredName": {
                            "firstName": "Fumiaki",
                            "lastName": "Tomita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Tomita"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 67,
                                "start": 63
                            }
                        ],
                        "text": "We utilize a fast labeling procedure based on border following [15], so that sample points on borders of connected components are simultaneously obtained while labeling."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 38784683,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "996c568d6b9473301e6f29d22e4cb5c5e0ef6af8",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "Describes a newly developed labeling board based on an algorithm in a combination of raster scanning and boundary tracking. This board employs the boundary tracking method and does not require a working memory for temporary labels, and thus it can process labels in size 512*512 images without restricting the maximum numbers of connected regions. It can also count holes within regions, and control labeling by using the perimeter of regions, at the same time of labelling. The processing time is 50 msec for size 512*512 real images.<<ETX>>"
            },
            "slug": "Labeling-board-based-on-boundary-tracking-Ishiyama-Kubo",
            "title": {
                "fragments": [],
                "text": "Labeling board based on boundary tracking"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "A newly developed labeling board based on an algorithm in a combination of raster scanning and boundary tracking that can process labels in size 512*512 images without restricting the maximum numbers of connected regions."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings., 11th IAPR International Conference on Pattern Recognition. Vol. IV. Conference D: Architectures for Vision and Pattern Recognition,"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3055160"
                        ],
                        "name": "David J. Ittner",
                        "slug": "David-J.-Ittner",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Ittner",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David J. Ittner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 69
                            }
                        ],
                        "text": "have estimated text-line orientation using the minimum spanning tree [14], which is a subset of the Delaunay triangulation, i."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 5360061,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4bc5bf7115142885992f99516169ea24bf18b529",
            "isKey": false,
            "numCitedBy": 86,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "A system for isolating blocks, lines, words, and symbols within images of machine-printed textual documents that is, to a large existent, independent of language and writing system is described. This is achieved by exploiting a small number of nearly universal typesetting and layout conventions. The system does not require prior knowledge of page orientation (module 90/spl deg/), and copes well with nonzero skew and shear angles (within 10/spl deg/). Also it locates blocks of text without reliance on detailed a priori layout models, and in spite of unknown or mixed horizontal and vertical text-line orientations. Within blocks, it infers text-line orientation and isolates lines, without knowledge of the language, symbol set, text sizes, or the number of text lines. Segmentation into words and symbols, and determination of reading order, normally require some knowledge of the language: this is held to minimum by relying on shape-driven algorithms. The underlying algorithms are based on Fourier theory, digital signal processing, computational geometry, and statistical decision theory. Most of the computation occurs within algorithms that possess unambiguous semantics (that is, heuristics are kept to a minimum). The effectiveness of the method on English, Japanese, Hebrew, Thai, and Korean documents is discussed.<<ETX>>"
            },
            "slug": "Language-free-layout-analysis-Ittner-Baird",
            "title": {
                "fragments": [],
                "text": "Language-free layout analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "A system for isolating blocks, lines, words, and symbols within images of machine-printed textual documents that is, to a large existent, independent of language and writing system is described, achieved by exploiting a small number of nearly universal typesetting and layout conventions."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 106,
                                "start": 100
                            }
                        ],
                        "text": "For pages within the class of Manhattan layout, a large number of methods have so far been proposed [1, 2]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 13615381,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d91e0d202fa23b7a2e81c5b3b04eb4cc5327b0f9",
            "isKey": false,
            "numCitedBy": 144,
            "numCiting": 66,
            "paperAbstract": {
                "fragments": [],
                "text": "Document image understanding encompasses the technology required to make paper documents equivalent to other computer exchange media like floppies, tapes, and CDROMs. The physical reader of the paper document is the scanner just like the physical reader of the floppy is the floppy drive and the physical reader of the tape cartridge is the tape cartridge drive, and the physical reader of the CDROM is the CDROM drive. In the survey presented, we restrict ourselves to documents such as business letters, forms, and scientific and technical articles such as those found in archival journals and technical conferences. Understanding such documents involves estimating the rotation skew of each document page, determining the geometric page layout, labeling blocks as text or non-text, determining the read order for text blocks, recognizing the text of text blocks through an OCR system, determining the logical page layout, and formatting the data and information of the document in a suitable way for use by a word processing system or by an information retrieval system.<<ETX>>"
            },
            "slug": "Document-image-understanding:-geometric-and-logical-Haralick",
            "title": {
                "fragments": [],
                "text": "Document image understanding: geometric and logical layout"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "Document image understanding encompasses the technology required to make paper documents equivalent to other computer exchange media like floppies, tapes, and CDROMs and restricts ourselves to documents such as business letters, forms, and scientific and technical articles such as those found in archival journals and technical conferences."
            },
            "venue": {
                "fragments": [],
                "text": "1994 Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34990816"
                        ],
                        "name": "A. Okabe",
                        "slug": "A.-Okabe",
                        "structuredName": {
                            "firstName": "Atsuyuki",
                            "lastName": "Okabe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Okabe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145469848"
                        ],
                        "name": "B. Boots",
                        "slug": "B.-Boots",
                        "structuredName": {
                            "firstName": "Barry",
                            "lastName": "Boots",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Boots"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1751698"
                        ],
                        "name": "K. Sugihara",
                        "slug": "K.-Sugihara",
                        "structuredName": {
                            "firstName": "Kokichi",
                            "lastName": "Sugihara",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Sugihara"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117201421,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9fca23912d064e4cc5d1fd3ed9786a2256d763d5",
            "isKey": false,
            "numCitedBy": 3137,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Definitions and Basic Properties of Voronoi Diagrams. Generalizations of the Voronoi Diagram. Algorithms for Computing Voronoi Diagrams. Poisson Voronoi Diagrams. Spatial Interpolation. Models of Spatial Processes. Point Pattern Analysis. Locational Optimization Through Voronoi Diagrams. References. Index."
            },
            "slug": "Spatial-Tessellations:-Concepts-and-Applications-of-Okabe-Boots",
            "title": {
                "fragments": [],
                "text": "Spatial Tessellations: Concepts and Applications of Voronoi Diagrams"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "This paper presents generalizations of the Voronoi Diagrams, a model of Spatial Interpolation, and some of the algorithms used in this study to derive these generalizations."
            },
            "venue": {
                "fragments": [],
                "text": "Wiley Series in Probability and Mathematical Statistics"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398550688"
                        ],
                        "name": "L. O'Gorman",
                        "slug": "L.-O'Gorman",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "O'Gorman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. O'Gorman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3110392"
                        ],
                        "name": "R. Kasturi",
                        "slug": "R.-Kasturi",
                        "structuredName": {
                            "firstName": "Rangachar",
                            "lastName": "Kasturi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kasturi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6575783,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c43505cc450b647f6f3b4a6f9004ae7d414e2bea",
            "isKey": false,
            "numCitedBy": 340,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Document-Image-Analysis-O'Gorman-Kasturi",
            "title": {
                "fragments": [],
                "text": "Document Image Analysis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 3,
            "methodology": 8
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 14,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Segmentation-of-Page-Images-Using-the-Area-Voronoi-Kise-Sato/be80678c0eeedf754647a8b9adccd5d6d9be3e86?sort=total-citations"
}