{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145031927"
                        ],
                        "name": "J. Blom",
                        "slug": "J.-Blom",
                        "structuredName": {
                            "firstName": "Johan",
                            "lastName": "Blom",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Blom"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699027"
                        ],
                        "name": "B. H. Romeny",
                        "slug": "B.-H.-Romeny",
                        "structuredName": {
                            "firstName": "Bart",
                            "lastName": "Romeny",
                            "middleNames": [
                                "M.",
                                "ter",
                                "Haar"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. H. Romeny"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49858863"
                        ],
                        "name": "A. Bel",
                        "slug": "A.-Bel",
                        "structuredName": {
                            "firstName": "Arjan",
                            "lastName": "Bel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36316181,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f7f55a2ac0f3d07d6129216453a9ce7b48654989",
            "isKey": false,
            "numCitedBy": 65,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Image structure analysis requires the computation of local spatial derivatives of the intensity distribution. These are determined in a natural way by convolution with Gaussian derivative operators. These \"fuzzy derivatives\" are calculated at any scale, and remove the problem of the ill-posed nature of numerical differentiation. However, noise is enhanced by the high-pass nature of differentiation, particularly at high order. On the other hand, the Gaussian-weighted averaging gives rise to noise reduction. This paper gives an analysis of the propagation of spatially uncorrelated as well as spatially correlated additive noise in scale space, when the noise is subjected to fuzzy derivative operators of any order. The propagation of noise variance is always substantially reduced when scale is increased, the effect being greater for higher order derivatives. The spatial blurring is always predominant, or, the representation of the noise and its derivatives is substantial only at the original (inner) scale. Expressions are derived for the propagation of noise in functions of derivatives, like the Laplacian and isophote curvature. All expressions are evaluated for a D-dimensional (image) data structure. Determining derivatives, even up to high order, combined with scale space, is a very robust and stable operation. The important conclusion is that the use of differential geometrical methods in scale space, particularly in noisy images, is justified."
            },
            "slug": "Spatial-Derivatives-and-the-Propagation-of-Noise-in-Blom-Romeny",
            "title": {
                "fragments": [],
                "text": "Spatial Derivatives and the Propagation of Noise in Gaussian Scale Space"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "An analysis of the propagation of spatially uncorrelated as well as spatially correlated additive noise in scale space, when the noise is subjected to fuzzy derivative operators of any order is given."
            },
            "venue": {
                "fragments": [],
                "text": "J. Vis. Commun. Image Represent."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3205375"
                        ],
                        "name": "T. Lindeberg",
                        "slug": "T.-Lindeberg",
                        "structuredName": {
                            "firstName": "Tony",
                            "lastName": "Lindeberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Lindeberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17143661,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f306444acc81b0af1875e5633e921148cb3a8977",
            "isKey": false,
            "numCitedBy": 682,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "A basic and extensive treatment of discrete aspects of the scale-space theory is presented. A genuinely discrete scale-space theory is developed and its connection to the continuous scale-space theory is explained. Special attention is given to discretization effects, which occur when results from the continuous scale-space theory are to be implemented computationally. The 1D problem is solved completely in an axiomatic manner. For the 2D problem, the author discusses how the 2D discrete scale space should be constructed. The main results are as follows: the proper way to apply the scale-space theory to discrete signals and discrete images is by discretization of the diffusion equation, not the convolution integral; the discrete scale space obtained in this way can be described by convolution with the kernel, which is the discrete analog of the Gaussian kernel, a scale-space implementation based on the sampled Gaussian kernel might lead to undesirable effects and computational problems, especially at fine levels of scale; the 1D discrete smoothing transformations can be characterized exactly and a complete catalogue is given; all finite support 1D discrete smoothing transformations arise from repeated averaging over two adjacent elements (the limit case of such an averaging process is described); and the symmetric 1D discrete smoothing kernels are nonnegative and unimodal, in both the spatial and the frequency domain. >"
            },
            "slug": "Scale-Space-for-Discrete-Signals-Lindeberg",
            "title": {
                "fragments": [],
                "text": "Scale-Space for Discrete Signals"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "The proper way to apply the scale-space theory to discrete signals and discrete images is by discretization of the diffusion equation, not the convolution integral."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7096897,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a26f893c224ed6e3df1f37479de0e774a4cae237",
            "isKey": false,
            "numCitedBy": 2873,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Scale-Space-Filtering-Witkin",
            "title": {
                "fragments": [],
                "text": "Scale-Space Filtering"
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145482214"
                        ],
                        "name": "A. Korn",
                        "slug": "A.-Korn",
                        "structuredName": {
                            "firstName": "Axel",
                            "lastName": "Korn",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Korn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 27612951,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "45d353aec60b2ce725761e8847b81222633da6c9",
            "isKey": false,
            "numCitedBy": 145,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "The symbolic representation of gray-value variations is studied, with emphasis on the gradient of the image function. The goal is to relate the results of this analysis to the structure of the picture, which is determined by the physics of the image generation process. Candidates for contour points are the maximal magnitudes of the gray-value gradient for different scales in the direction of the gradient. Based on the output of such a bank of gradient filters, a procedure is proposed to select automatically a suitable scale, and with that, the size of the right convolution kernel. The application of poorly adapted filters, which make the exact localization of gray-value corners or T-, X-, and Y-junctions more difficult, is thus avoided. Possible gaps at such junctions are discussed for images of real scenes, and possibilities for the closure of some of these gaps are demonstrated when the extrema of the magnitudes of the gray-value gradients are used. >"
            },
            "slug": "Toward-a-Symbolic-Representation-of-Intensity-in-Korn",
            "title": {
                "fragments": [],
                "text": "Toward a Symbolic Representation of Intensity Changes in Images"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "The symbolic representation of gray-value variations is studied, with emphasis on the gradient of the image function, and a procedure is proposed to select automatically a suitable scale, and with that, the size of the right convolution kernel."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35806347"
                        ],
                        "name": "P. Danielsson",
                        "slug": "P.-Danielsson",
                        "structuredName": {
                            "firstName": "Per-Erik",
                            "lastName": "Danielsson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Danielsson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2045127"
                        ],
                        "name": "O. Seger",
                        "slug": "O.-Seger",
                        "structuredName": {
                            "firstName": "Olle",
                            "lastName": "Seger",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Seger"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5266809,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "6de22f96b71c2aa44c4e98f952324cd3b8a29ffe",
            "isKey": false,
            "numCitedBy": 48,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Rotation-Invariance-in-Gradient-and-Higher-Order-Danielsson-Seger",
            "title": {
                "fragments": [],
                "text": "Rotation Invariance in Gradient and Higher Order Derivative Detectors"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746242"
                        ],
                        "name": "S. Mallat",
                        "slug": "S.-Mallat",
                        "structuredName": {
                            "firstName": "Stéphane",
                            "lastName": "Mallat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mallat"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2356353,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b78626ce1a562c05b1c06f9c805e839f9760b9ab",
            "isKey": false,
            "numCitedBy": 20814,
            "numCiting": 87,
            "paperAbstract": {
                "fragments": [],
                "text": "Multiresolution representations are effective for analyzing the information content of images. The properties of the operator which approximates a signal at a given resolution were studied. It is shown that the difference of information between the approximation of a signal at the resolutions 2/sup j+1/ and 2/sup j/ (where j is an integer) can be extracted by decomposing this signal on a wavelet orthonormal basis of L/sup 2/(R/sup n/), the vector space of measurable, square-integrable n-dimensional functions. In L/sup 2/(R), a wavelet orthonormal basis is a family of functions which is built by dilating and translating a unique function psi (x). This decomposition defines an orthogonal multiresolution representation called a wavelet representation. It is computed with a pyramidal algorithm based on convolutions with quadrature mirror filters. Wavelet representation lies between the spatial and Fourier domains. For images, the wavelet representation differentiates several spatial orientations. The application of this representation to data compression in image coding, texture discrimination and fractal analysis is discussed. >"
            },
            "slug": "A-Theory-for-Multiresolution-Signal-Decomposition:-Mallat",
            "title": {
                "fragments": [],
                "text": "A Theory for Multiresolution Signal Decomposition: The Wavelet Representation"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is shown that the difference of information between the approximation of a signal at the resolutions 2/sup j+1/ and 2/Sup j/ can be extracted by decomposing this signal on a wavelet orthonormal basis of L/sup 2/(R/sup n/), the vector space of measurable, square-integrable n-dimensional functions."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48614929"
                        ],
                        "name": "J. Babaud",
                        "slug": "J.-Babaud",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Babaud",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Babaud"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2700207"
                        ],
                        "name": "M. Baudin",
                        "slug": "M.-Baudin",
                        "structuredName": {
                            "firstName": "Michel",
                            "lastName": "Baudin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Baudin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35106875"
                        ],
                        "name": "R. Duda",
                        "slug": "R.-Duda",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Duda",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Duda"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 18295906,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fd9c54a47a6763ddf1a1d0fa7ba2323d3d871a6b",
            "isKey": false,
            "numCitedBy": 859,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Scale-space filtering constructs hierarchic symbolic signal descriptions by transforming the signal into a continuum of versions of the original signal convolved with a kernal containing a scale or bandwidth parameter. It is shown that the Gaussian probability density function is the only kernel in a broad class for which first-order maxima and minima, respectively, increase and decrease when the bandwidth of the filter is increased. The consequences of this result are explored when the signal¿or its image by a linear differential operator¿is analyzed in terms of zero-crossing contours of the transform in scale-space."
            },
            "slug": "Uniqueness-of-the-Gaussian-Kernel-for-Scale-Space-Babaud-Witkin",
            "title": {
                "fragments": [],
                "text": "Uniqueness of the Gaussian Kernel for Scale-Space Filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is shown that the Gaussian probability density function is the only kernel in a broad class for which first-order maxima and minima, respectively, increase and decrease when the bandwidth of the filter is increased."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69039576"
                        ],
                        "name": "M. Spivak",
                        "slug": "M.-Spivak",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Spivak",
                            "middleNames": [
                                "David"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Spivak"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 34881842,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "762cbbbeb46f0b1873cfe1dccb57a37da3a5af3e",
            "isKey": false,
            "numCitedBy": 3825,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Spivak's Comprehensive introduction takes as its theme the classical roots of contemporary differential geometry. Spivak explains his Main Premise (my term) as follows: \"in order for an introduction to differential geometry to expose the geometric aspect of the subject, an historical approach is necessary; there is no point in introducing the curvature tensor without explaining how it was invented and what it has to do with curvature\". His second premise concerns the manner in which the historical material should be presented: \"it is absurdly inefficient to eschew the modern language of manifolds, bundles, forms, etc., which was developed precisely in order to rigorize the concepts of classical differential geometry\". Here, Spivak is addressing \"a dilemma which confronts anyone intent on penetrating the mysteries of differential geometry\". On the one hand, the subject is an old one, dating, as we know it, from the works of Gauss and Riemann, and possessing a rich classical literature. On the other hand, the rigorous and systematic formulations in current use were established relatively recently, after topological techniques had been sufficiently well developed to provide a base for an abstract global theory; the coordinate-free geometric methods of E. Cartan were also a major source. Furthermore, the viewpoint of global structure theory now dominates the subject, whereas differential geometers were traditionally more concerned with the local study of geometric objects. Thus it is possible and not uncommon for a modern geometric education to leave the subject's classical origins obscure. Such an approach can offer the great advantages of elegance, efficiency, and direct access to the most active areas of modern research. At the same time, it may strike the student as being frustratingly incomplete. As Spivak remarks, \"ignorance of the roots of the subject has its price-no one denies that modern formulations are clear, elegant and precise; it's just that it's impossible to comprehend how any one ever thought of them.\" While Spivak's impulse to mediate between the past and the present is a natural one and is by no means unique, his undertaking is remarkable for its ambitious scope. Acting on its second premise, the Comprehensive introduction opens with an introduction to differentiable manifolds; the remaining four volumes are devoted to a geometric odyssey which starts with Gauss and Riemann, and ends with the Gauss-Bonnet-Chern Theorem and characteristic classes. A formidable assortment of topics is included along the way, in which we may distinguish several major historical themes: In the first place, the origins of fundamental geometric concepts are investigated carefully. As just one example, Riemannian sectional curvature is introduced by a translation and close exposition of the text of Riemann's remarkable paper, Über die Hypothesen, welche der Geometrie zu Grunde"
            },
            "slug": "A-comprehensive-introduction-to-differential-Spivak",
            "title": {
                "fragments": [],
                "text": "A comprehensive introduction to differential geometry"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729041"
                        ],
                        "name": "J. Canny",
                        "slug": "J.-Canny",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Canny",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Canny"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13284142,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fcf9fc4e23b45345c2404ce7d6cb0fc9dea2c9ec",
            "isKey": false,
            "numCitedBy": 27662,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a computational approach to edge detection. The success of the approach depends on the definition of a comprehensive set of goals for the computation of edge points. These goals must be precise enough to delimit the desired behavior of the detector while making minimal assumptions about the form of the solution. We define detection and localization criteria for a class of edges, and present mathematical forms for these criteria as functionals on the operator impulse response. A third criterion is then added to ensure that the detector has only one response to a single edge. We use the criteria in numerical optimization to derive detectors for several common image features, including step edges. On specializing the analysis to step edges, we find that there is a natural uncertainty principle between detection and localization performance, which are the two main goals. With this principle we derive a single operator shape which is optimal at any scale. The optimal detector has a simple approximate implementation in which edges are marked at maxima in gradient magnitude of a Gaussian-smoothed image. We extend this simple detector using operators of several widths to cope with different signal-to-noise ratios in the image. We present a general method, called feature synthesis, for the fine-to-coarse integration of information from operators at different scales. Finally we show that step edge detector performance improves considerably as the operator point spread function is extended along the edge."
            },
            "slug": "A-Computational-Approach-to-Edge-Detection-Canny",
            "title": {
                "fragments": [],
                "text": "A Computational Approach to Edge Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "There is a natural uncertainty principle between detection and localization performance, which are the two main goals, and with this principle a single operator shape is derived which is optimal at any scale."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14815630,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d352cf71946e7f4b229d30c614e504424633a62a",
            "isKey": false,
            "numCitedBy": 726,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "We characterize some properties of the zero crossings of the Laplacian of signals¿in particular images¿filtered with linear filters, as a function of the scale of the filter (extending recent work by Witkin [16]). We prove that in any dimension the only filter that does not create generic zero crossings as the scale increases is the Gaussian. This result can be generalized to apply to level crossings of any linear differential operator: it applies in particular to ridges and ravines in the image intensity. In the case of the second derivative along the gradient, there is no filter that avoids creation of zero crossings, unless the filtering is performed after the derivative is applied."
            },
            "slug": "Scaling-Theorems-for-Zero-Crossings-Yuille-Poggio",
            "title": {
                "fragments": [],
                "text": "Scaling Theorems for Zero Crossings"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is proved that in any dimension the only filter that does not create generic zero crossings as the scale increases is the Gaussian and this result can be generalized to apply to level crossings of any linear differential operator."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1682208"
                        ],
                        "name": "K. Kanatani",
                        "slug": "K.-Kanatani",
                        "structuredName": {
                            "firstName": "Kenichi",
                            "lastName": "Kanatani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Kanatani"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122436138,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8ba4f440c775f2115ad58c0453cc3422e49bc117",
            "isKey": false,
            "numCitedBy": 270,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This book presents the mathematics relevant to image understanding by computer vision and gives examples of actual applications. Group representation theory, Lie groups and Lie algebras, the theory of invariance, tensor calculus, differential geometry and projective geometry are used for three-dimensional shape and motion analysis from images, making use of techniques such as shape from motion, shape from texture, shape from angle and shape from surface. Although the mathematics itself may be well known to mathematicians, people working in areas related to computer science, image understanding, computer vision and image processing have usually never studied such mathematics, and so may be surprised to learn that abstract mathematical concepts can be of enormous help in building intelligent computer vision systems."
            },
            "slug": "Group-Theoretical-Methods-in-Image-Understanding-Kanatani",
            "title": {
                "fragments": [],
                "text": "Group-Theoretical Methods in Image Understanding"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145730992"
                        ],
                        "name": "V. Torre",
                        "slug": "V.-Torre",
                        "structuredName": {
                            "firstName": "Vincent",
                            "lastName": "Torre",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Torre"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1065794,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a8059c598e4f9643eb040685af0d6e7055391048",
            "isKey": false,
            "numCitedBy": 1214,
            "numCiting": 59,
            "paperAbstract": {
                "fragments": [],
                "text": "Edge detection is the process that attempts to characterize the intensity changes in the image in terms of the physical processes that have originated them. A critical, intermediate goal of edge detection is the detection and characterization of significant intensity changes. This paper discusses this part of the edge detection problem. To characterize the types of intensity changes derivatives of different types, and possibly different scales, are needed. Thus, we consider this part of edge detection as a problem in numerical differentiation. We show that numerical differentiation of images is an ill-posed problem in the sense of Hadamard. Differentiation needs to be regularized by a regularizing filtering operation before differentiation. This shows that this part of edge detection consists of two steps, a filtering step and a differentiation step. Following this perspective, the paper discusses in detail the following theoretical aspects of edge detection. 1) The properties of different types of filters-with minimal uncertainty, with a bandpass spectrum, and with limited support-are derived. Minimal uncertainty filters optimize a tradeoff between computational efficiency and regularizing properties. 2) Relationships among several 2-D differential operators are established. In particular, we characterize the relation between the Laplacian and the second directional derivative along the gradient. Zero crossings of the Laplacian are not the only features computed in early vision. 3) Geometrical and topological properties of the zero crossings of differential operators are studied in terms of transversality and Morse theory."
            },
            "slug": "On-Edge-Detection-Torre-Poggio",
            "title": {
                "fragments": [],
                "text": "On Edge Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that numerical differentiation of images is an ill-posed problem in the sense of Hadamard, and that this part of edge detection consists of two steps, a filtering step and a differentiation step."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12432,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2302358"
                        ],
                        "name": "P. Burt",
                        "slug": "P.-Burt",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Burt",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Burt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40908101"
                        ],
                        "name": "T. Hong",
                        "slug": "T.-Hong",
                        "structuredName": {
                            "firstName": "Tsai",
                            "lastName": "Hong",
                            "middleNames": [],
                            "suffix": ""
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Hong"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11797589,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "863ae3a53720ef8c86dd52e830626c8c55c63d32",
            "isKey": false,
            "numCitedBy": 367,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "The task of segmenting an image and that of estimating properties of image regions may be highly interdependent. The goal of segmentation is to partition the image into regions with more or less homogeneous properties; but the processes which estimate these properties should be confined within individual regions. A cooperative, iterative approach to segmentation and property estimation is defined; the results of each process at a given iteration are used to adjust the other process at the next iteration. A linked pyramid structure provides a framework for this process iteration. This hierarchical structure ensures rapid convergence even with strictly local communication between pyramid nodes."
            },
            "slug": "Segmentation-and-Estimation-of-Image-Region-through-Burt-Hong",
            "title": {
                "fragments": [],
                "text": "Segmentation and Estimation of Image Region Properties through Cooperative Hierarchial Computation"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A cooperative, iterative approach to segmentation and property estimation is defined; the results of each process at a given iteration are used to adjust the other process at the next iteration."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Systems, Man, and Cybernetics"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7409396"
                        ],
                        "name": "E. D. Micheli",
                        "slug": "E.-D.-Micheli",
                        "structuredName": {
                            "firstName": "Enrico",
                            "lastName": "Micheli",
                            "middleNames": [
                                "De"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. D. Micheli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2076400"
                        ],
                        "name": "B. Caprile",
                        "slug": "B.-Caprile",
                        "structuredName": {
                            "firstName": "Bruno",
                            "lastName": "Caprile",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Caprile"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2226145"
                        ],
                        "name": "P. Ottonello",
                        "slug": "P.-Ottonello",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Ottonello",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Ottonello"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145730992"
                        ],
                        "name": "V. Torre",
                        "slug": "V.-Torre",
                        "structuredName": {
                            "firstName": "Vincent",
                            "lastName": "Torre",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Torre"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43559100,
            "fieldsOfStudy": [
                "Physics",
                "Computer Science"
            ],
            "id": "9f10b758ba713db394748f42ae19b26224b93106",
            "isKey": false,
            "numCitedBy": 107,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Two aspects of edge detection are analyzed, namely accuracy of localization and sensitivity to noise. The detection of corners and trihedral vertices is analyzed for gradient schemes and zero-crossing schemes. It is shown that neither scheme correctly detects corners of trihedral vertices, but that the gradient schemes are less sensitive to noise. A simple but important conclusion is that the noise present in digital images of typical indoor scenes is small and the signal-to-noise ratio is high. The noise present in digital images is so small as to make the performances of a variety of filters almost indistinguishable. As a consequence small filters can be used and the exact shape of the filter is not critical. >"
            },
            "slug": "Localization-and-Noise-in-Edge-Detection-Micheli-Caprile",
            "title": {
                "fragments": [],
                "text": "Localization and Noise in Edge Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The noise present in digital images of typical indoor scenes is small and the signal-to-noise ratio is high, so small that small filters can be used and the exact shape of the filter is not critical."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1684821"
                        ],
                        "name": "P. Olver",
                        "slug": "P.-Olver",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Olver",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Olver"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117822940,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "65c10b4fb95dd2860a6eb2e43c88cb9b30dc8d51",
            "isKey": false,
            "numCitedBy": 6658,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "1 Introduction to Lie Groups.- 1.1. Manifolds.- Change of Coordinates.- Maps Between Manifolds.- The Maximal Rank Condition.- Submanifolds.- Regular Submanifolds.- Implicit Submanifolds.- Curves and Connectedness.- 1.2. Lie Groups.- Lie Subgroups.- Local Lie Groups.- Local Transformation Groups.- Orbits.- 1.3. Vector Fields.- Flows.- Action on Functions.- Differentials.- Lie Brackets.- Tangent Spaces and Vectors Fields on Submanifolds.- Frobenius' Theorem.- 1.4. Lie Algebras.- One-Parameter Subgroups.- Subalgebras.- The Exponential Map.- Lie Algebras of Local Lie Groups.- Structure Constants.- Commutator Tables.- Infinitesimal Group Actions.- 1.5. Differential Forms.- Pull-Back and Change of Coordinates.- Interior Products.- The Differential.- The de Rham Complex.- Lie Derivatives.- Homotopy Operators.- Integration and Stokes' Theorem.- Notes.- Exercises.- 2 Symmetry Groups of Differential Equations.- 2.1. Symmetries of Algebraic Equations.- Invariant Subsets.- Invariant Functions.- Infinitesimal Invariance.- Local Invariance.- Invariants and Functional Dependence.- Methods for Constructing Invariants.- 2.2. Groups and Differential Equations.- 2.3. Prolongation.- Systems of Differential Equations.- Prolongation of Group Actions.- Invariance of Differential Equations.- Prolongation of Vector Fields.- Infinitesimal Invariance.- The Prolongation Formula.- Total Derivatives.- The General Prolongation Formula.- Properties of Prolonged Vector Fields.- Characteristics of Symmetries.- 2.4. Calculation of Symmetry Groups.- 2.5. Integration of Ordinary Differential Equations.- First Order Equations.- Higher Order Equations.- Differential Invariants.- Multi-parameter Symmetry Groups.- Solvable Groups.- Systems of Ordinary Differential Equations.- 2.6. Nondegeneracy Conditions for Differential Equations.- Local Solvability.- In variance Criteria.- The Cauchy-Kovalevskaya Theorem.- Characteristics.- Normal Systems.- Prolongation of Differential Equations.- Notes.- Exercises.- 3 Group-Invariant Solutions.- 3.1. Construction of Group-Invariant Solutions.- 3.2. Examples of Group-Invariant Solutions.- 3.3. Classification of Group-Invariant Solutions.- The Adjoint Representation.- Classification of Subgroups and Subalgebras.- Classification of Group-Invariant Solutions.- 3.4. Quotient Manifolds.- Dimensional Analysis.- 3.5. Group-Invariant Prolongations and Reduction.- Extended Jet Bundles.- Differential Equations.- Group Actions.- The Invariant Jet Space.- Connection with the Quotient Manifold.- The Reduced Equation.- Local Coordinates.- Notes.- Exercises.- 4 Symmetry Groups and Conservation Laws.- 4.1. The Calculus of Variations.- The Variational Derivative.- Null Lagrangians and Divergences.- Invariance of the Euler Operator.- 4.2. Variational Symmetries.- Infinitesimal Criterion of Invariance.- Symmetries of the Euler-Lagrange Equations.- Reduction of Order.- 4.3. Conservation Laws.- Trivial Conservation Laws.- Characteristics of Conservation Laws.- 4.4. Noether's Theorem.- Divergence Symmetries.- Notes.- Exercises.- 5 Generalized Symmetries.- 5.1. Generalized Symmetries of Differential Equations.- Differential Functions.- Generalized Vector Fields.- Evolutionary Vector Fields.- Equivalence and Trivial Symmetries.- Computation of Generalized Symmetries.- Group Transformations.- Symmetries and Prolongations.- The Lie Bracket.- Evolution Equations.- 5.2. Recursion Operators, Master Symmetries and Formal Symmetries.- Frechet Derivatives.- Lie Derivatives of Differential Operators.- Criteria for Recursion Operators.- The Korteweg-de Vries Equation.- Master Symmetries.- Pseudo-differential Operators.- Formal Symmetries.- 5.3. Generalized Symmetries and Conservation Laws.- Adjoints of Differential Operators.- Characteristics of Conservation Laws.- Variational Symmetries.- Group Transformations.- Noether's Theorem.- Self-adjoint Linear Systems.- Action of Symmetries on Conservation Laws.- Abnormal Systems and Noether's Second Theorem.- Formal Symmetries and Conservation Laws.- 5.4. The Variational Complex.- The D-Complex.- Vertical Forms.- Total Derivatives of Vertical Forms.- Functionals and Functional Forms.- The Variational Differential.- Higher Euler Operators.- The Total Homotopy Operator.- Notes.- Exercises.- 6 Finite-Dimensional Hamiltonian Systems.- 6.1. Poisson Brackets.- Hamiltonian Vector Fields.- The Structure Functions.- The Lie-Poisson Structure.- 6.2. Symplectic Structures and Foliations.- The Correspondence Between One-Forms and Vector Fields.- Rank of a Poisson Structure.- Symplectic Manifolds.- Maps Between Poisson Manifolds.- Poisson Submanifolds.- Darboux' Theorem.- The Co-adjoint Representation.- 6.3. Symmetries, First Integrals and Reduction of Order.- First Integrals.- Hamiltonian Symmetry Groups.- Reduction of Order in Hamiltonian Systems.- Reduction Using Multi-parameter Groups.- Hamiltonian Transformation Groups.- The Momentum Map.- Notes.- Exercises.- 7 Hamiltonian Methods for Evolution Equations.- 7.1. Poisson Brackets.- The Jacobi Identity.- Functional Multi-vectors.- 7.2. Symmetries and Conservation Laws.- Distinguished Functionals.- Lie Brackets.- Conservation Laws.- 7.3. Bi-Hamiltonian Systems.- Recursion Operators.- Notes.- Exercises.- References.- Symbol Index.- Author Index."
            },
            "slug": "Applications-of-lie-groups-to-differential-Olver",
            "title": {
                "fragments": [],
                "text": "Applications of lie groups to differential equations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47125588"
                        ],
                        "name": "James J. Clark",
                        "slug": "James-J.-Clark",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Clark",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "James J. Clark"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 19320957,
            "fieldsOfStudy": [
                "Physics",
                "Medicine",
                "Computer Science"
            ],
            "id": "5a169ff77470e7db490df27ca5e8e0724e85067c",
            "isKey": false,
            "numCitedBy": 231,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown that zero-crossing edge detection algorithms can produce edges that do not correspond to significant image intensity changes. Such edges are called phantom or spurious. A method for classifying zero crossings as corresponding to authentic or phantom edges is presented. The contrast of an authentic edge is shown to increase and the contrast of phantom edges to decrease with a decrease in the filter scale. Thus, a phantom edge is truly a phantom in that the closer one examines it, the weaker it becomes. The results of applying the classification schemes described to synthetic and authentic signals in one and two dimensions are given. The significance of the phantom edges is examined with respect to their frequency and strength relative to the authentic edges, and it is seen that authentic edges are denser and stronger, on the average, than phantom edges. >"
            },
            "slug": "Authenticating-Edges-Produced-by-Zero-Crossing-Clark",
            "title": {
                "fragments": [],
                "text": "Authenticating Edges Produced by Zero-Crossing Algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "It is shown that zero-crossing edge detection algorithms can produce edges that do not correspond to significant image intensity changes, and it is seen that authentic edges are denser and stronger, on the average, than phantom edges."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145163875"
                        ],
                        "name": "K. Brunnström",
                        "slug": "K.-Brunnström",
                        "structuredName": {
                            "firstName": "Kjell",
                            "lastName": "Brunnström",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Brunnström"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2270435"
                        ],
                        "name": "J. Eklundh",
                        "slug": "J.-Eklundh",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Eklundh",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Eklundh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3205375"
                        ],
                        "name": "T. Lindeberg",
                        "slug": "T.-Lindeberg",
                        "structuredName": {
                            "firstName": "Tony",
                            "lastName": "Lindeberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Lindeberg"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38002366,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "c00a012a586cb681f3c7f5b8af45c80bcefb16fa",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Focus-of-attention is extremely important in human visual perception. If computer vision systems are to perform tasks in a complex, dynamic world they will have to be able to control processing in a way that is analogous to visual attention in humans."
            },
            "slug": "On-scale-and-resolution-in-the-analysis-of-local-Brunnström-Eklundh",
            "title": {
                "fragments": [],
                "text": "On scale and resolution in the analysis of local image structure"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "Focus-of-attention is extremely important in human visual perception and computer vision systems will have to be able to control processing in a way that is analogous to visual attention in humans."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "147066001"
                        ],
                        "name": "J. B. J. Fourier",
                        "slug": "J.-B.-J.-Fourier",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Fourier",
                            "middleNames": [
                                "Baptiste",
                                "Joseph"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. B. J. Fourier"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47434074"
                        ],
                        "name": "A. Freeman",
                        "slug": "A.-Freeman",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Freeman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Freeman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4122564,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "48be79905ab7ad562faba0cf144a8889ca4997ac",
            "isKey": false,
            "numCitedBy": 166,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "THERE cannot be two opinions as to the value and importance of the Théorie de la Chaleur. It has been called “an exquisite mathematical poem,” not once but many times, independently, by mathematicians of different schools. Many of the very greatest of modern mathematicians regard it, justly, as the key which first opened to them the treasure-house of mathematical physics.The Analytical Theory of Heat.J. Fourier. Translated by A. Freeman (University Press, Cambridge, 1878.)"
            },
            "slug": "The-Analytical-Theory-of-Heat-Fourier-Freeman",
            "title": {
                "fragments": [],
                "text": "The Analytical Theory of Heat"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1878
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1703047,
            "fieldsOfStudy": [
                "Philosophy",
                "Art"
            ],
            "id": "f3c5745f848c74a7c154c0dd8620ba5a283caaae",
            "isKey": false,
            "numCitedBy": 92,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "SummaryAccording to Kant, spacetime is a form of the mind. If so, the brain must be a geometry engine. This idea is taken seriously, and consequently the implementation of space and time in terms of machines is considered. This enables one to conceive of spacetime as really “embodied.”"
            },
            "slug": "The-brain-a-geometry-engine-Koenderink",
            "title": {
                "fragments": [],
                "text": "The brain a geometry engine"
            },
            "venue": {
                "fragments": [],
                "text": "Psychological research"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40942127"
                        ],
                        "name": "R. Young",
                        "slug": "R.-Young",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Young",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Young"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59658489,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ab6e9d33667c462670c0fbd5b2a7535925deef12",
            "isKey": false,
            "numCitedBy": 83,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "SIMULATION-OF-HUMAN-RETINAL-FUNCTION-WITH-THE-Young",
            "title": {
                "fragments": [],
                "text": "SIMULATION OF HUMAN RETINAL FUNCTION WITH THE GAUSSIAN DERIVATIVE MODEL."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "and Seger , 0 ‘ Rotation invariance in gradient and higher order derivative detectors ’ , C ‘ omput . Vision , Graph . CP : Image Process . , Vol 49 Koenderink , J J ‘ The brain a geometry engine"
            },
            "venue": {
                "fragments": [],
                "text": "C ~ rlcirlu . ~ , Schaum ’ s Outline Series"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Uniqueness of the g a u s h n kernel for scale-space filtering Vol 8 No I (1986) Mallat, S G 'A theory Tor multiresolution signal decomposition: The wavelet representation"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Tram. I'A M I IEEE Trans. PAMI"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Toward a \\ymbolic representation of intensity changes in imagesScale-space for discrete signals"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. PAMI"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Catastrophe theory and its applications"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The structure of images', B i d"
            },
            "venue": {
                "fragments": [],
                "text": "Cybern"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The structure of images ‘ , B i d . Cybern"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans . PAMI"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The principal of similitude"
            },
            "venue": {
                "fragments": [],
                "text": "J The Anulytical Tlirory of Neut, Dover Publications,"
            },
            "year": 1955
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The principal of similitude"
            },
            "venue": {
                "fragments": [],
                "text": "Nature. Vol XCV"
            },
            "year": 1915
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "filtering’, IEEE Tram"
            },
            "venue": {
                "fragments": [],
                "text": "I’A M I ,"
            },
            "year": 1986
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 31,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Scale-and-the-differential-structure-of-images-Florack-Romeny/362324d34d730581ddbc2b7ec1b322a2e73e1aaa?sort=total-citations"
}