{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1969961"
                        ],
                        "name": "Jongmin Baek",
                        "slug": "Jongmin-Baek",
                        "structuredName": {
                            "firstName": "Jongmin",
                            "lastName": "Baek",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jongmin Baek"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7346435,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b93ad6b397505c915b0decb224d40e73a2a135f1",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "The rest of the paper is organized as follows: in Section 1, we give preliminary definitions of relevant terms and notation; in Section2, we formally define the permutohedral lattice in several ways and prove useful structural properties stemming from the definition; in Section 3, we suggest criteria for picking the ideal lattice with which to perform Gaussian filtering, and present an argument that the permutohedral lattice is the most appropriate choice within a lar ge family of lattices; in Section4, we discuss how to perform each step of the Gaussian filter using the permutohedral lattice. Finally, in Section5, we analyze the overall algorithm and compare it to the implementation on Z in [PD09]."
            },
            "slug": "Some-Useful-Properties-of-the-Permutohedral-Lattice-Baek",
            "title": {
                "fragments": [],
                "text": "Some Useful Properties of the Permutohedral Lattice for Gaussian Filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The permutohedral lattice is formally defined in several ways and proved useful structural properties stemming from the definition are proved."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145506199"
                        ],
                        "name": "Andrew Adams",
                        "slug": "Andrew-Adams",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Adams",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Andrew Adams"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1683095"
                        ],
                        "name": "N. Gelfand",
                        "slug": "N.-Gelfand",
                        "structuredName": {
                            "firstName": "Natasha",
                            "lastName": "Gelfand",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Gelfand"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2889257"
                        ],
                        "name": "Jennifer Dolson",
                        "slug": "Jennifer-Dolson",
                        "structuredName": {
                            "firstName": "Jennifer",
                            "lastName": "Dolson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jennifer Dolson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1801789"
                        ],
                        "name": "M. Levoy",
                        "slug": "M.-Levoy",
                        "structuredName": {
                            "firstName": "Marc",
                            "lastName": "Levoy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Levoy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13902752,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "272a8ff438d6bc5dbaca2ac68499f00c6088cf1a",
            "isKey": false,
            "numCitedBy": 158,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a method for accelerating a broad class of non-linear filters that includes the bilateral, non-local means, and other related filters. These filters can all be expressed in a similar way: First, assign each value to be filtered a position in some vector space. Then, replace every value with a weighted linear combination of all values, with weights determined by a Gaussian function of distance between the positions. If the values are pixel colors and the positions are (x, y) coordinates, this describes a Gaussian blur. If the positions are instead (x, y, r, g, b) coordinates in a five-dimensional space-color volume, this describes a bilateral filter. If we instead set the positions to local patches of color around the associated pixel, this describes non-local means. We describe a Monte-Carlo kd-tree sampling algorithm that efficiently computes any filter that can be expressed in this way, along with a GPU implementation of this technique. We use this algorithm to implement an accelerated bilateral filter that respects full 3D color distance; accelerated non-local means on single images, volumes, and unaligned bursts of images for denoising; and a fast adaptation of non-local means to geometry. If we have n values to filter, and each is assigned a position in a d-dimensional space, then our space complexity is O(dn) and our time complexity is O(dn log n), whereas existing methods are typically either exponential in d or quadratic in n."
            },
            "slug": "Gaussian-KD-trees-for-fast-high-dimensional-Adams-Gelfand",
            "title": {
                "fragments": [],
                "text": "Gaussian KD-trees for fast high-dimensional filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A Monte-Carlo kd-tree sampling algorithm that efficiently computes any filter that can be expressed in this way, along with a GPU implementation of this technique and a fast adaptation of non-local means to geometry."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '09"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2096445694"
                        ],
                        "name": "V. Aurich",
                        "slug": "V.-Aurich",
                        "structuredName": {
                            "firstName": "Volker",
                            "lastName": "Aurich",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Aurich"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2866274"
                        ],
                        "name": "J. Weule",
                        "slug": "J.-Weule",
                        "structuredName": {
                            "firstName": "Jörg",
                            "lastName": "Weule",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Weule"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 31354989,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "72857b712b39c41eac6438f776d6a98a0a29bfd9",
            "isKey": false,
            "numCitedBy": 333,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a new diffusion method for edge preserving smoothing of images. In contrast to other methods it is not based on an anisotropic modification of the heat conductance equation, rather on a modification of the way the solution of the heat conductance equation is obtained by convolving the initial data with a Gaussian kernel. Hence the method uses simple non-linear modifications of Gaussian filters, thus avoiding iteration steps and convergence problems. A chain of three to five filters with suitable parameters provides excellent smoothing of fine image details without destroying the coarser structures. The size and contrast of the eliminated details can be selected. The choice of the parameters is not critical and the edges are not displaced when changing the scale. The filter stages can be implemented efficiently on almost any parallel hardware architecture."
            },
            "slug": "Non-Linear-Gaussian-Filters-Performing-Edge-Aurich-Weule",
            "title": {
                "fragments": [],
                "text": "Non-Linear Gaussian Filters Performing Edge Preserving Diffusion"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The method uses simple non-linear modifications of Gaussian filters, thus avoiding iteration steps and convergence problems and providing excellent smoothing of fine image details without destroying the coarser structures."
            },
            "venue": {
                "fragments": [],
                "text": "DAGM-Symposium"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3103897"
                        ],
                        "name": "Changjiang Yang",
                        "slug": "Changjiang-Yang",
                        "structuredName": {
                            "firstName": "Changjiang",
                            "lastName": "Yang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Changjiang Yang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719541"
                        ],
                        "name": "R. Duraiswami",
                        "slug": "R.-Duraiswami",
                        "structuredName": {
                            "firstName": "Ramani",
                            "lastName": "Duraiswami",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Duraiswami"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1697880"
                        ],
                        "name": "N. Gumerov",
                        "slug": "N.-Gumerov",
                        "structuredName": {
                            "firstName": "Nail",
                            "lastName": "Gumerov",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Gumerov"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1693428"
                        ],
                        "name": "L. Davis",
                        "slug": "L.-Davis",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Davis",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Davis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7211602,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fac97a6cb182236664fc55914004e0fafbead66e",
            "isKey": false,
            "numCitedBy": 492,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "Evaluating sums of multivariate Gaussians is a common computational task in computer vision and pattern recognition, including in the general and powerful kernel density estimation technique. The quadratic computational complexity of the summation is a significant barrier to the scalability of this algorithm to practical applications. The fast Gauss transform (FGT) has successfully accelerated the kernel density estimation to linear running time for low-dimensional problems. Unfortunately, the cost of a direct extension of the FGT to higher-dimensional problems grows exponentially with dimension, making it impractical for dimensions above 3. We develop an improved fast Gauss transform to efficiently estimate sums of Gaussians in higher dimensions, where a new multivariate expansion scheme and an adaptive space subdivision technique dramatically improve the performance. The improved FGT has been applied to the mean shift algorithm achieving linear computational complexity. Experimental results demonstrate the efficiency and effectiveness of our algorithm."
            },
            "slug": "Improved-fast-gauss-transform-and-efficient-kernel-Yang-Duraiswami",
            "title": {
                "fragments": [],
                "text": "Improved fast gauss transform and efficient kernel density estimation"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "An improved fast Gauss transform is developed to efficiently estimate sums of Gaussians in higher dimensions, where a new multivariate expansion scheme and an adaptive space subdivision technique dramatically improve the performance."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings Ninth IEEE International Conference on Computer Vision"
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1777434"
                        ],
                        "name": "Qingxiong Yang",
                        "slug": "Qingxiong-Yang",
                        "structuredName": {
                            "firstName": "Qingxiong",
                            "lastName": "Yang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qingxiong Yang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2441498"
                        ],
                        "name": "K. Tan",
                        "slug": "K.-Tan",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Tan",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Tan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145237406"
                        ],
                        "name": "N. Ahuja",
                        "slug": "N.-Ahuja",
                        "structuredName": {
                            "firstName": "Narendra",
                            "lastName": "Ahuja",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Ahuja"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2184994,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b2d5b1d4a196e8c5000bfc6d3b172dbdfc273755",
            "isKey": false,
            "numCitedBy": 343,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a new bilateral filtering algorithm with computational complexity invariant to filter kernel size, so-called O(1) or constant time in the literature. By showing that a bilateral filter can be decomposed into a number of constant time spatial filters, our method yields a new class of constant time bilateral filters that can have arbitrary spatial and arbitrary range kernels. In contrast, the current available constant time algorithm requires the use of specific spatial or specific range kernels. Also, our algorithm lends itself to a parallel implementation leading to the first real-time O(1) algorithm that we know of. Meanwhile, our algorithm yields higher quality results since we are effectively quantizing the range function instead of quantizing both the range function and the input image. Empirical experiments show that our algorithm not only gives higher PSNR, but is about 10× faster than the state-of-the-art. It also has a small memory footprint, needed only 2% of the memory required by the state-of-the-art for obtaining the same quality as exact using 8-bit images. We also show that our algorithm can be easily extended for O(1) median filtering. Our bilateral filtering algorithm was tested in a number of applications, including HD video conferencing, video abstraction, highlight removal, and multi-focus imaging."
            },
            "slug": "Real-time-O(1)-bilateral-filtering-Yang-Tan",
            "title": {
                "fragments": [],
                "text": "Real-time O(1) bilateral filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "A new bilateral filtering algorithm with computational complexity invariant to filter kernel size, so-called O(1) or constant time in the literature, that yields a new class of constant time bilateral filters that can have arbitrary spatial and arbitrary range kernels."
            },
            "venue": {
                "fragments": [],
                "text": "2009 IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2384382"
                        ],
                        "name": "Venkateswarlu Karnati",
                        "slug": "Venkateswarlu-Karnati",
                        "structuredName": {
                            "firstName": "Venkateswarlu",
                            "lastName": "Karnati",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Venkateswarlu Karnati"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2027231"
                        ],
                        "name": "Mithun Uliyar",
                        "slug": "Mithun-Uliyar",
                        "structuredName": {
                            "firstName": "Mithun",
                            "lastName": "Uliyar",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mithun Uliyar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49690919"
                        ],
                        "name": "Sumit Dey",
                        "slug": "Sumit-Dey",
                        "structuredName": {
                            "firstName": "Sumit",
                            "lastName": "Dey",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sumit Dey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2650939,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3b06c51e7a06278ae22a201b636d625e48917f8d",
            "isKey": false,
            "numCitedBy": 109,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, improvements to Non-Local Means (NLM) image denoising method is proposed to reduce the computational complexity. In the original NLM algorithm, neighborhood weightages are computed using the window similarity technique. The proposed technique replaces the window similarity by a modified multi-resolution based approach with much fewer comparisons rather than all pixels comparison. This approach also uses the concept of filtering out non-similar neighborhood pixels based on fixed sized window gray mean values. Further, mean values of the variable sized windows in the image are computed efficiently using Summed Image (SI) concept, which requires only 3 additions. The proposed approach is nearly 80 times faster than original Baudes NLM algorithm with close subjective and objective quality measurements."
            },
            "slug": "Fast-Non-Local-algorithm-for-image-denoising-Karnati-Uliyar",
            "title": {
                "fragments": [],
                "text": "Fast Non-Local algorithm for image denoising"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "Improvements to Non-Local Means (NLM) image denoising method are proposed to reduce the computational complexity and is nearly 80 times faster than original Baudes NLM algorithm with close subjective and objective quality measurements."
            },
            "venue": {
                "fragments": [],
                "text": "2009 16th IEEE International Conference on Image Processing (ICIP)"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "29905643"
                        ],
                        "name": "F. Porikli",
                        "slug": "F.-Porikli",
                        "structuredName": {
                            "firstName": "Fatih",
                            "lastName": "Porikli",
                            "middleNames": [
                                "Murat"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Porikli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 206591120,
            "fieldsOfStudy": [
                "Engineering",
                "Computer Science"
            ],
            "id": "b8b4eeddaa5b8bca921d1dc2f9e1ad0a3edbfae0",
            "isKey": false,
            "numCitedBy": 342,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents three novel methods that enable bilateral filtering in constant time O(1) without sampling. Constant time means that the computation time of the filtering remains same even if the filter size becomes very large. Our first method takes advantage of the integral histograms to avoid the redundant operations for bilateral filters with box spatial and arbitrary range kernels. For bilateral filters constructed by polynomial range and arbitrary spatial filters, our second method provides a direct formulation by using linear filters of image powers without any approximation. Lastly, we show that Gaussian range and arbitrary spatial bilateral filters can be expressed by Taylor series as linear filter decompositions without any noticeable degradation of filter response. All these methods drastically decrease the computation time by cutting it down constant times (e.g. to 0.06 seconds per 1MB image) while achieving very high PSNRpsilas over 45 dB. In addition to the computational advantages, our methods are straightforward to implement."
            },
            "slug": "Constant-time-O(1)-bilateral-filtering-Porikli",
            "title": {
                "fragments": [],
                "text": "Constant time O(1) bilateral filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "Three novel methods that enable bilateral filtering in constant time O(1) without sampling are presented and it is shown that Gaussian range and arbitrary spatial bilateral filters can be expressed by Taylor series as linear filter decompositions without any noticeable degradation of filter response."
            },
            "venue": {
                "fragments": [],
                "text": "2008 IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710872"
                        ],
                        "name": "T. Brox",
                        "slug": "T.-Brox",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Brox",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Brox"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2097833380"
                        ],
                        "name": "O. Kleinschmidt",
                        "slug": "O.-Kleinschmidt",
                        "structuredName": {
                            "firstName": "Oliver",
                            "lastName": "Kleinschmidt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Kleinschmidt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695302"
                        ],
                        "name": "D. Cremers",
                        "slug": "D.-Cremers",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Cremers",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Cremers"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 596895,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9b415cd27dcbf5da222d01b513439978eb103d56",
            "isKey": false,
            "numCitedBy": 246,
            "numCiting": 51,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper contributes two novel techniques in the context of image restoration by nonlocal filtering. First, we introduce an efficient implementation of the nonlocal means filter based on arranging the data in a cluster tree. The structuring of data allows for a fast and accurate preselection of similar patches. In contrast to previous approaches, the preselection is based on the same distance measure as used by the filter itself. It allows for large speedups, especially when the search for similar patches covers the whole image domain, i.e., when the filter is truly nonlocal. However, also in the windowed version of the filter, the cluster tree approach compares favorably to previous techniques in respect of quality versus computational cost. Second, we suggest an iterative version of the filter that is derived from a variational principle and is designed to yield nontrivial steady states. It reveals to be particularly useful in order to restore regular, textured patterns."
            },
            "slug": "Efficient-Nonlocal-Means-for-Denoising-of-Textural-Brox-Kleinschmidt",
            "title": {
                "fragments": [],
                "text": "Efficient Nonlocal Means for Denoising of Textural Patterns"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An iterative version of the nonlocal means filter that is derived from a variational principle and is designed to yield nontrivial steady states is suggested to be particularly useful in order to restore regular, textured patterns."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Image Processing"
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2221048"
                        ],
                        "name": "J. Darbon",
                        "slug": "J.-Darbon",
                        "structuredName": {
                            "firstName": "Jérôme",
                            "lastName": "Darbon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Darbon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152569576"
                        ],
                        "name": "Alexandre Cunha",
                        "slug": "Alexandre-Cunha",
                        "structuredName": {
                            "firstName": "Alexandre",
                            "lastName": "Cunha",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alexandre Cunha"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746335"
                        ],
                        "name": "T. Chan",
                        "slug": "T.-Chan",
                        "structuredName": {
                            "firstName": "Tony",
                            "lastName": "Chan",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Chan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1782265"
                        ],
                        "name": "S. Osher",
                        "slug": "S.-Osher",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Osher",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Osher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144351514"
                        ],
                        "name": "G. Jensen",
                        "slug": "G.-Jensen",
                        "structuredName": {
                            "firstName": "Grant",
                            "lastName": "Jensen",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Jensen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15408072,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "92a20aa459d9879a0611b3c138437262f96702fc",
            "isKey": false,
            "numCitedBy": 258,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "We present an efficient algorithm for nonlocal image filtering with applications in electron cryomicroscopy. Our denoising algorithm is a rewriting of the recently proposed nonlocal mean filter. It builds on the separable property of neighborhood filtering to offer a fast parallel and vectorized implementation in contemporary shared memory computer architectures while reducing the theoretical computational complexity of the original filter. In practice, our approach is much faster than a serial, non-vectorized implementation and it scales linearly with image size. We demonstrate its efficiency in data sets from Caulobacter crescentus tomograms and a cryoimage containing viruses and provide visual evidences attesting the remarkable quality of the nonlocal means scheme in the context of cryoimaging. With such development we provide biologists with an attractive filtering tool to facilitate their scientific discoveries."
            },
            "slug": "Fast-nonlocal-filtering-applied-to-electron-Darbon-Cunha",
            "title": {
                "fragments": [],
                "text": "Fast nonlocal filtering applied to electron cryomicroscopy"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "The denoising algorithm is a rewriting of the recently proposed nonlocal mean filter that builds on the separable property of neighborhood filtering to offer a fast parallel and vectorized implementation in contemporary shared memory computer architectures while reducing the theoretical computational complexity of the original filter."
            },
            "venue": {
                "fragments": [],
                "text": "2008 5th IEEE International Symposium on Biomedical Imaging: From Nano to Macro"
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145799132"
                        ],
                        "name": "Sylvain Paris",
                        "slug": "Sylvain-Paris",
                        "structuredName": {
                            "firstName": "Sylvain",
                            "lastName": "Paris",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sylvain Paris"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145403226"
                        ],
                        "name": "F. Durand",
                        "slug": "F.-Durand",
                        "structuredName": {
                            "firstName": "Frédo",
                            "lastName": "Durand",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Durand"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1482395,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2c8cbeb547f3c982c820794ec9cf431b133aba57",
            "isKey": false,
            "numCitedBy": 657,
            "numCiting": 58,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract\nThe bilateral filter is a nonlinear filter that smoothes a signal while preserving strong edges. It has demonstrated great effectiveness for a variety of problems in computer vision and computer graphics, and fast versions have been proposed. Unfortunately, little is known about the accuracy of such accelerations. In this paper, we propose a new signal-processing analysis of the bilateral filter which complements the recent studies that analyzed it as a PDE or as a robust statistical estimator. The key to our analysis is to express the filter in a higher-dimensional space where the signal intensity is added to the original domain dimensions. Importantly, this signal-processing perspective allows us to develop a novel bilateral filtering acceleration using downsampling in space and intensity. This affords a principled expression of accuracy in terms of bandwidth and sampling. The bilateral filter can be expressed as linear convolutions in this augmented space followed by two simple nonlinearities. This allows us to derive criteria for downsampling the key operations and achieving important acceleration of the bilateral filter. We show that, for the same running time, our method is more accurate than previous acceleration techniques. Typically, we are able to process a 2 megapixel image using our acceleration technique in less than a second, and have the result be visually similar to the exact computation that takes several tens of minutes. The acceleration is most effective with large spatial kernels. Furthermore, this approach extends naturally to color images and cross bilateral filtering.\n"
            },
            "slug": "A-Fast-Approximation-of-the-Bilateral-Filter-Using-Paris-Durand",
            "title": {
                "fragments": [],
                "text": "A Fast Approximation of the Bilateral Filter Using a Signal Processing Approach"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A new signal-processing analysis of the bilateral filter is proposed which complements the recent studies that analyzed it as a PDE or as a robust statistical estimator and develops a novel bilateral filtering acceleration using downsampling in space and intensity."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Computer Vision"
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2026863"
                        ],
                        "name": "M. Mahmoudi",
                        "slug": "M.-Mahmoudi",
                        "structuredName": {
                            "firstName": "Mona",
                            "lastName": "Mahmoudi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Mahmoudi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699339"
                        ],
                        "name": "G. Sapiro",
                        "slug": "G.-Sapiro",
                        "structuredName": {
                            "firstName": "Guillermo",
                            "lastName": "Sapiro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Sapiro"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6628146,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "04c5950dfe8f1d2d1107b08b504965c33ff7ccd4",
            "isKey": false,
            "numCitedBy": 559,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "In this letter, improvements to the nonlocal means image denoising method introduced by Buades et al. are presented. The original nonlocal means method replaces a noisy pixel by the weighted average of pixels with related surrounding neighborhoods. While producing state-of-the-art denoising results, this method is computationally impractical. In order to accelerate the algorithm, we introduce filters that eliminate unrelated neighborhoods from the weighted average. These filters are based on local average gray values and gradients, preclassifying neighborhoods and thereby reducing the original quadratic complexity to a linear one and reducing the influence of less-related areas in the denoising of a given pixel. We present the underlying framework and experimental results for gray level and color images as well as for video."
            },
            "slug": "Fast-image-and-video-denoising-via-nonlocal-means-Mahmoudi-Sapiro",
            "title": {
                "fragments": [],
                "text": "Fast image and video denoising via nonlocal means of similar neighborhoods"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "Improvements to the nonlocal means image denoising method introduced by Buades et al. are presented and filters that eliminate unrelated neighborhoods from the weighted average are introduced."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Signal Processing Letters"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3198175"
                        ],
                        "name": "T. Tasdizen",
                        "slug": "T.-Tasdizen",
                        "structuredName": {
                            "firstName": "Tolga",
                            "lastName": "Tasdizen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Tasdizen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1929508,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d40f247a52d1fe826bcf2187589c198725ac4935",
            "isKey": false,
            "numCitedBy": 103,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents an image denoising algorithm that uses principal component analysis (PCA) in conjunction with the non-local means image denoising. Image neighborhood vectors used in the non-local means algorithm are first projected onto a lower-dimensional subspace using PCA. Consequently, neighborhood similarity weights for denoising are computed using distances in this subspace rather than the full space. This modification to the non-local means algorithm results in improved accuracy and computational performance. We present an analysis of the proposed method's accuracy as a function of the dimensionality of the projection subspace and demonstrate that denoising accuracy peaks at a relatively low number of dimensions."
            },
            "slug": "Principal-components-for-non-local-means-image-Tasdizen",
            "title": {
                "fragments": [],
                "text": "Principal components for non-local means image denoising"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "An analysis of the proposed method's accuracy as a function of the dimensionality of the projection subspace is presented and it is demonstrated that denoising accuracy peaks at a relatively low number of dimensions."
            },
            "venue": {
                "fragments": [],
                "text": "2008 15th IEEE International Conference on Image Processing"
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145086151"
                        ],
                        "name": "Carlo Tomasi",
                        "slug": "Carlo-Tomasi",
                        "structuredName": {
                            "firstName": "Carlo",
                            "lastName": "Tomasi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Carlo Tomasi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737048"
                        ],
                        "name": "R. Manduchi",
                        "slug": "R.-Manduchi",
                        "structuredName": {
                            "firstName": "Roberto",
                            "lastName": "Manduchi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Manduchi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14308539,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "bfeaf424a2ea6ca4702d545c6e959e2caeb68e9b",
            "isKey": false,
            "numCitedBy": 8334,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "Bilateral filtering smooths images while preserving edges, by means of a nonlinear combination of nearby image values. The method is noniterative, local, and simple. It combines gray levels or colors based on both their geometric closeness and their photometric similarity, and prefers near values to distant values in both domain and range. In contrast with filters that operate on the three bands of a color image separately, a bilateral filter can enforce the perceptual metric underlying the CIE-Lab color space, and smooth colors and preserve edges in a way that is tuned to human perception. Also, in contrast with standard filtering, bilateral filtering produces no phantom colors along edges in color images, and reduces phantom colors where they appear in the original image."
            },
            "slug": "Bilateral-filtering-for-gray-and-color-images-Tomasi-Manduchi",
            "title": {
                "fragments": [],
                "text": "Bilateral filtering for gray and color images"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "In contrast with filters that operate on the three bands of a color image separately, a bilateral filter can enforce the perceptual metric underlying the CIE-Lab color space, and smooth colors and preserve edges in a way that is tuned to human perception."
            },
            "venue": {
                "fragments": [],
                "text": "Sixth International Conference on Computer Vision (IEEE Cat. No.98CH36271)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6867165"
                        ],
                        "name": "J. Kopf",
                        "slug": "J.-Kopf",
                        "structuredName": {
                            "firstName": "Johannes",
                            "lastName": "Kopf",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kopf"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1400248273"
                        ],
                        "name": "Michael F. Cohen",
                        "slug": "Michael-F.-Cohen",
                        "structuredName": {
                            "firstName": "Michael F.",
                            "lastName": "Cohen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael F. Cohen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1684384"
                        ],
                        "name": "Dani Lischinski",
                        "slug": "Dani-Lischinski",
                        "structuredName": {
                            "firstName": "Dani",
                            "lastName": "Lischinski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dani Lischinski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143711233"
                        ],
                        "name": "M. Uyttendaele",
                        "slug": "M.-Uyttendaele",
                        "structuredName": {
                            "firstName": "Matthew",
                            "lastName": "Uyttendaele",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Uyttendaele"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7241297,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1798058243aad828b92b2f7fa50dd5237c8a37d8",
            "isKey": false,
            "numCitedBy": 506,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "Image analysis and enhancement tasks such as tone mapping, colorization, stereo depth, and photomontage, often require computing a solution (e.g., for exposure, chromaticity, disparity, labels) over the pixel grid. Computational and memory costs often require that a smaller solution be run over a downsampled image. Although general purpose upsampling methods can be used to interpolate the low resolution solution to the full resolution, these methods generally assume a smoothness prior for the interpolation. We demonstrate that in cases, such as those above, the available high resolution input image may be leveraged as a prior in the context of a joint bilateral upsampling procedure to produce a better high resolution solution. We show results for each of the applications above and compare them to traditional upsampling methods."
            },
            "slug": "Joint-bilateral-upsampling-Kopf-Cohen",
            "title": {
                "fragments": [],
                "text": "Joint bilateral upsampling"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is demonstrated that in cases, such as those above, the available high resolution input image may be leveraged as a prior in the context of a joint bilateral upsampling procedure to produce a better high resolution solution."
            },
            "venue": {
                "fragments": [],
                "text": "ACM Trans. Graph."
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2172574376"
                        ],
                        "name": "Xiaobo An",
                        "slug": "Xiaobo-An",
                        "structuredName": {
                            "firstName": "Xiaobo",
                            "lastName": "An",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Xiaobo An"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1757883"
                        ],
                        "name": "F. Pellacini",
                        "slug": "F.-Pellacini",
                        "structuredName": {
                            "firstName": "Fabio",
                            "lastName": "Pellacini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Pellacini"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10941677,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c01c6689d633c73c8db74dd3a696c190b1c2863c",
            "isKey": false,
            "numCitedBy": 204,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "We present an intuitive and efficient method for editing the appearance of complex spatially-varying datasets, such as images and measured materials. In our framework, users specify rough adjustments that are refined interactively by enforcing the policy that similar edits are applied to spatially-close regions of similar appearance. Rather than proposing a specific user interface, our method allows artists to quickly and imprecisely specify the initial edits with any method or workflow they feel most comfortable with. An energy optimization formulation is used to propagate the initial rough adjustments to the final refined ones by enforcing the editing policy over all pairs of points in the dataset. We show that this formulation is equivalent to solving a large linear system defined by a dense matrix. We derive an approximate algorithm to compute such a solution interactively by taking advantage of the inherent structure of the matrix. We demonstrate our approach by editing images, HDR radiance maps, and measured materials. Finally, we show that our framework generalizes prior methods while providing significant improvements in generality, robustness and efficiency."
            },
            "slug": "AppProp:-all-pairs-appearance-space-edit-An-Pellacini",
            "title": {
                "fragments": [],
                "text": "AppProp: all-pairs appearance-space edit propagation"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "This work presents an intuitive and efficient method for editing the appearance of complex spatially-varying datasets, such as images and measured materials that generalizes prior methods while providing significant improvements in generality, robustness and efficiency."
            },
            "venue": {
                "fragments": [],
                "text": "ACM Trans. Graph."
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2157788337"
                        ],
                        "name": "Stephen M. Smith",
                        "slug": "Stephen-M.-Smith",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Smith",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Stephen M. Smith"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144431498"
                        ],
                        "name": "M. Brady",
                        "slug": "M.-Brady",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brady",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brady"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15033310,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3a891df6349236ace22780bec4951a88af785fdf",
            "isKey": false,
            "numCitedBy": 3520,
            "numCiting": 120,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a new approach to low level image processing; in particular, edge and corner detection and structure preserving noise reduction.Non-linear filtering is used to define which parts of the image are closely related to each individual pixel; each pixel has associated with it a local image region which is of similar brightness to that pixel. The new feature detectors are based on the minimization of this local image region, and the noise reduction method uses this region as the smoothing neighbourhood. The resulting methods are accurate, noise resistant and fast.Details of the new feature detectors and of the new noise reduction method are described, along with test results."
            },
            "slug": "SUSAN—A-New-Approach-to-Low-Level-Image-Processing-Smith-Brady",
            "title": {
                "fragments": [],
                "text": "SUSAN—A New Approach to Low Level Image Processing"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "This paper describes a new approach to low level image processing; in particular, edge and corner detection and structure preserving noise reduction and the resulting methods are accurate, noise resistant and fast."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Computer Vision"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8070492"
                        ],
                        "name": "A. Buades",
                        "slug": "A.-Buades",
                        "structuredName": {
                            "firstName": "Antoni",
                            "lastName": "Buades",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Buades"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38689796"
                        ],
                        "name": "B. Coll",
                        "slug": "B.-Coll",
                        "structuredName": {
                            "firstName": "Bartomeu",
                            "lastName": "Coll",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Coll"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27053481"
                        ],
                        "name": "J. Morel",
                        "slug": "J.-Morel",
                        "structuredName": {
                            "firstName": "Jean-Michel",
                            "lastName": "Morel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Morel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11206708,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9c842b2926fd60b9e6ff80fee28c65e7c1ae5f1d",
            "isKey": false,
            "numCitedBy": 5855,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a new measure, the method noise, to evaluate and compare the performance of digital image denoising methods. We first compute and analyze this method noise for a wide class of denoising algorithms, namely the local smoothing filters. Second, we propose a new algorithm, the nonlocal means (NL-means), based on a nonlocal averaging of all pixels in the image. Finally, we present some experiments comparing the NL-means algorithm and the local smoothing filters."
            },
            "slug": "A-non-local-algorithm-for-image-denoising-Buades-Coll",
            "title": {
                "fragments": [],
                "text": "A non-local algorithm for image denoising"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "A new measure, the method noise, is proposed, to evaluate and compare the performance of digital image denoising methods, and a new algorithm, the nonlocal means (NL-means), based on a nonlocal averaging of all pixels in the image is proposed."
            },
            "venue": {
                "fragments": [],
                "text": "2005 IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR'05)"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1967685"
                        ],
                        "name": "Jiawen Chen",
                        "slug": "Jiawen-Chen",
                        "structuredName": {
                            "firstName": "Jiawen",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jiawen Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145799132"
                        ],
                        "name": "Sylvain Paris",
                        "slug": "Sylvain-Paris",
                        "structuredName": {
                            "firstName": "Sylvain",
                            "lastName": "Paris",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sylvain Paris"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145403226"
                        ],
                        "name": "F. Durand",
                        "slug": "F.-Durand",
                        "structuredName": {
                            "firstName": "Frédo",
                            "lastName": "Durand",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Durand"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13028666,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4ef0a1200a1d9e69a291184d5c4c7cffc562135f",
            "isKey": false,
            "numCitedBy": 292,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new data structure---the bilateral grid, that enables fast edge-aware image processing. By working in the bilateral grid, algorithms such as bilateral filtering, edge-aware painting, and local histogram equalization become simple manipulations that are both local and independent. We parallelize our algorithms on modern GPUs to achieve real-time frame rates on high-definition video. We demonstrate our method on a variety of applications such as image editing, transfer of photographic look, and contrast enhancement of medical images."
            },
            "slug": "Real-time-edge-aware-image-processing-with-the-grid-Chen-Paris",
            "title": {
                "fragments": [],
                "text": "Real-time edge-aware image processing with the bilateral grid"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "A new data structure---the bilateral grid, that enables fast edge-aware image processing that parallelize the algorithms on modern GPUs to achieve real-time frame rates on high-definition video."
            },
            "venue": {
                "fragments": [],
                "text": "ACM Trans. Graph."
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8070492"
                        ],
                        "name": "A. Buades",
                        "slug": "A.-Buades",
                        "structuredName": {
                            "firstName": "Antoni",
                            "lastName": "Buades",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Buades"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38689796"
                        ],
                        "name": "B. Coll",
                        "slug": "B.-Coll",
                        "structuredName": {
                            "firstName": "Bartomeu",
                            "lastName": "Coll",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Coll"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27053481"
                        ],
                        "name": "J. Morel",
                        "slug": "J.-Morel",
                        "structuredName": {
                            "firstName": "Jean-Michel",
                            "lastName": "Morel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Morel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2973030,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "99bdad4623682f507bda77202bdc2548d19bfbad",
            "isKey": false,
            "numCitedBy": 738,
            "numCiting": 65,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract\nNeighborhood filters are nonlocal image and movie filters which reduce the noise by averaging similar pixels. The first object of the paper is to present a unified theory of these filters and reliable criteria to compare them to other filter classes. A CCD noise model will be presented justifying the involvement of neighborhood filters. A classification of neighborhood filters will be proposed, including classical image and movie denoising methods and discussing further a recently introduced neighborhood filter, NL-means. In order to compare denoising methods three principles will be discussed. The first principle, “method noise”, specifies that only noise must be removed from an image. A second principle will be introduced, “noise to noise”, according to which a denoising method must transform a white noise into a white noise. Contrarily to “method noise”, this principle, which characterizes artifact-free methods, eliminates any subjectivity and can be checked by mathematical arguments and Fourier analysis. “Noise to noise” will be proven to rule out most denoising methods, with the exception of neighborhood filters. This is why a third and new comparison principle, the “statistical optimality”, is needed and will be introduced to compare the performance of all neighborhood filters.\n\nThe three principles will be applied to compare ten different image and movie denoising methods. It will be first shown that only wavelet thresholding methods and NL-means give an acceptable method noise. Second, that neighborhood filters are the only ones to satisfy the “noise to noise” principle. Third, that among them NL-means is closest to statistical optimality. A particular attention will be paid to the application of the statistical optimality criterion for movie denoising methods. It will be pointed out that current movie denoising methods are motion compensated neighborhood filters. This amounts to say that they are neighborhood filters and that the ideal neighborhood of a pixel is its trajectory. Unfortunately the aperture problem makes it impossible to estimate ground true trajectories. It will be demonstrated that computing trajectories and restricting the neighborhood to them is harmful for denoising purposes and that space-time NL-means preserves more movie details.\n"
            },
            "slug": "Nonlocal-Image-and-Movie-Denoising-Buades-Coll",
            "title": {
                "fragments": [],
                "text": "Nonlocal Image and Movie Denoising"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "A unified theory of neighborhood filters and reliable criteria to compare them to other filter classes are presented and it will be demonstrated that computing trajectories and restricting the neighborhood to them is harmful for denoising purposes and that space-time NL-means preserves more movie details."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Computer Vision"
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110604093"
                        ],
                        "name": "Markus Weber",
                        "slug": "Markus-Weber",
                        "structuredName": {
                            "firstName": "Markus",
                            "lastName": "Weber",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Markus Weber"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2058542"
                        ],
                        "name": "M. Milch",
                        "slug": "M.-Milch",
                        "structuredName": {
                            "firstName": "Marco",
                            "lastName": "Milch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Milch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1790911"
                        ],
                        "name": "K. Myszkowski",
                        "slug": "K.-Myszkowski",
                        "structuredName": {
                            "firstName": "Karol",
                            "lastName": "Myszkowski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Myszkowski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144000942"
                        ],
                        "name": "K. Dmitriev",
                        "slug": "K.-Dmitriev",
                        "structuredName": {
                            "firstName": "Kirill",
                            "lastName": "Dmitriev",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Dmitriev"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31583256"
                        ],
                        "name": "P. Rokita",
                        "slug": "P.-Rokita",
                        "structuredName": {
                            "firstName": "Przemyslaw",
                            "lastName": "Rokita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Rokita"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145156858"
                        ],
                        "name": "H. Seidel",
                        "slug": "H.-Seidel",
                        "structuredName": {
                            "firstName": "Hans-Peter",
                            "lastName": "Seidel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Seidel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10443643,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "cdc6de890f70890b474e801665a6bd1570cd1a57",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "Photon tracing and density estimation are well established techniques in global illumination computation and rendering of high-quality animation sequences. Using traditional density estimation techniques it is difficult to remove stochastic noise inherent for photon-based methods while avoiding overblurring lighting details. In this paper we investigate the use of bilateral filtering for lighting reconstruction based on the local density of photon hit points. Bilateral filtering is applied in spatio-temporal domain and provides control over the level-of-details in reconstructed lighting. All changes of lighting below this level are treated as stochastic noise and are suppressed. Bilateral filtering proves to be efficient in preserving sharp features in lighting which is in particular important for high-quality caustic reconstruction. Also, flickering between subsequent animation frames is substantially reduced due to extending bilateral filtering into temporal domain"
            },
            "slug": "Spatio-temporal-photon-density-estimation-using-Weber-Milch",
            "title": {
                "fragments": [],
                "text": "Spatio-temporal photon density estimation using bilateral filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Bilateral filtering is applied in spatio-temporal domain and provides control over the level of details in reconstructed lighting and proves to be efficient in preserving sharp features in lighting which is in particular important for high-quality caustic reconstruction."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings Computer Graphics International, 2004."
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40656963"
                        ],
                        "name": "Soonmin Bae",
                        "slug": "Soonmin-Bae",
                        "structuredName": {
                            "firstName": "Soonmin",
                            "lastName": "Bae",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Soonmin Bae"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145799132"
                        ],
                        "name": "Sylvain Paris",
                        "slug": "Sylvain-Paris",
                        "structuredName": {
                            "firstName": "Sylvain",
                            "lastName": "Paris",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sylvain Paris"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145403226"
                        ],
                        "name": "F. Durand",
                        "slug": "F.-Durand",
                        "structuredName": {
                            "firstName": "Frédo",
                            "lastName": "Durand",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Durand"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13421812,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "33a23e37be8402b51a1d74b2254b2723741223dd",
            "isKey": false,
            "numCitedBy": 184,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "We introduce a new approach to tone management for photographs. Whereas traditional tone-mapping operators target a neutral and faithful rendition of the input image, we explore pictorial looks by controlling visual qualities such as the tonal balance and the amount of detail. Our method is based on a two-scale non-linear decomposition of an image. We modify the different layers based on their histograms and introduce a technique that controls the spatial variation of detail. We introduce a Poisson correction that prevents potential gradient reversal and preserves detail. In addition to directly controlling the parameters, the user can transfer the look of a model photograph to the picture being edited."
            },
            "slug": "Two-scale-tone-management-for-photographic-look-Bae-Paris",
            "title": {
                "fragments": [],
                "text": "Two-scale tone management for photographic look"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This work introduces a Poisson correction that prevents potential gradient reversal and preserves detail, and introduces a technique that controls the spatial variation of detail in the two-scale non-linear decomposition of an image."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '06"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143708263"
                        ],
                        "name": "Yung-Yu Chuang",
                        "slug": "Yung-Yu-Chuang",
                        "structuredName": {
                            "firstName": "Yung-Yu",
                            "lastName": "Chuang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yung-Yu Chuang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1763086"
                        ],
                        "name": "Alexei A. Efros",
                        "slug": "Alexei-A.-Efros",
                        "structuredName": {
                            "firstName": "Alexei",
                            "lastName": "Efros",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alexei A. Efros"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2055109649"
                        ],
                        "name": "J. Ruskin",
                        "slug": "J.-Ruskin",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Ruskin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Ruskin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145403226"
                        ],
                        "name": "F. Durand",
                        "slug": "F.-Durand",
                        "structuredName": {
                            "firstName": "Frédo",
                            "lastName": "Durand",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Durand"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2444123,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "668dd032ebf7dab476cfa842d8a31ee22cd9f841",
            "isKey": false,
            "numCitedBy": 1664,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new technique for the display of high-dynamic-range images, which reduces the contrast while preserving detail. It is based on a two-scale decomposition of the image into a base layer,..."
            },
            "slug": "Fast-bilateral-filtering-for-the-display-of-images-Chuang-Efros",
            "title": {
                "fragments": [],
                "text": "Fast bilateral filtering for the display of high-dynamic-range images"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "A new technique for the display of high-dynamic-range images, which reduces the contrast while preserving detail, is presented, based on a two-scale decomposition of the image into a base layer."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2057741248"
                        ],
                        "name": "Eric P. Bennett",
                        "slug": "Eric-P.-Bennett",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Bennett",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eric P. Bennett"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145170879"
                        ],
                        "name": "L. McMillan",
                        "slug": "L.-McMillan",
                        "structuredName": {
                            "firstName": "Leonard",
                            "lastName": "McMillan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. McMillan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3337416,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "201fed356fc9d39d3b9d81b029ba71cc798cc7ec",
            "isKey": false,
            "numCitedBy": 137,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "We enhance underexposed, low dynamic range videos by adaptively and independently varying the exposure at each photoreceptor in a post-process. This virtual exposure is a dynamic function of both the spatial neighborhood and temporal history at each pixel. Temporal integration enables us to expand the image's dynamic range while simultaneously reducing noise. Our non-linear exposure variation and denoising filters smoothly transition from temporal to spatial for moving scene elements. Our virtual exposure framework also supports temporally coherent per frame tone mapping. Our system outputs restored video sequences with significantly reduced noise, increased exposure time of dark pixels, intact motion, and improved details."
            },
            "slug": "Video-enhancement-using-per-pixel-virtual-exposures-Bennett-McMillan",
            "title": {
                "fragments": [],
                "text": "Video enhancement using per-pixel virtual exposures"
            },
            "tldr": {
                "abstractSimilarityScore": 91,
                "text": "This work enhances underexposed, low dynamic range videos by adaptively and independently varying the exposure at each photoreceptor in a post-process, which is a dynamic function of both the spatial neighborhood and temporal history at each pixel."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '05"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2084468499"
                        ],
                        "name": "Georg Petschnigg",
                        "slug": "Georg-Petschnigg",
                        "structuredName": {
                            "firstName": "Georg",
                            "lastName": "Petschnigg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Georg Petschnigg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1717841"
                        ],
                        "name": "R. Szeliski",
                        "slug": "R.-Szeliski",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Szeliski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Szeliski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1820412"
                        ],
                        "name": "Maneesh Agrawala",
                        "slug": "Maneesh-Agrawala",
                        "structuredName": {
                            "firstName": "Maneesh",
                            "lastName": "Agrawala",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Maneesh Agrawala"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1400248273"
                        ],
                        "name": "Michael F. Cohen",
                        "slug": "Michael-F.-Cohen",
                        "structuredName": {
                            "firstName": "Michael F.",
                            "lastName": "Cohen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael F. Cohen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144201188"
                        ],
                        "name": "Hugues Hoppe",
                        "slug": "Hugues-Hoppe",
                        "structuredName": {
                            "firstName": "Hugues",
                            "lastName": "Hoppe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hugues Hoppe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1769685"
                        ],
                        "name": "K. Toyama",
                        "slug": "K.-Toyama",
                        "structuredName": {
                            "firstName": "Kentaro",
                            "lastName": "Toyama",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Toyama"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 78680,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e735bcf14791d301a14602e6164843cf3d28404f",
            "isKey": false,
            "numCitedBy": 900,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "Digital photography has made it possible to quickly and easily take a pair of images of low-light environments: one with flash to capture detail and one without flash to capture ambient illumination. We present a variety of applications that analyze and combine the strengths of such flash/no-flash image pairs. Our applications include denoising and detail transfer (to merge the ambient qualities of the no-flash image with the high-frequency flash detail), white-balancing (to change the color tone of the ambient image), continuous flash (to interactively adjust flash intensity), and red-eye removal (to repair artifacts in the flash image). We demonstrate how these applications can synthesize new images that are of higher quality than either of the originals."
            },
            "slug": "Digital-photography-with-flash-and-no-flash-image-Petschnigg-Szeliski",
            "title": {
                "fragments": [],
                "text": "Digital photography with flash and no-flash image pairs"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A variety of applications that analyze and combine the strengths of flash/no-flash image pairs can synthesize new images that are of higher quality than either of the originals."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '04"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737690"
                        ],
                        "name": "E. Eisemann",
                        "slug": "E.-Eisemann",
                        "structuredName": {
                            "firstName": "Elmar",
                            "lastName": "Eisemann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Eisemann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145403226"
                        ],
                        "name": "F. Durand",
                        "slug": "F.-Durand",
                        "structuredName": {
                            "firstName": "Frédo",
                            "lastName": "Durand",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Durand"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11388007,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "eee03c81f38281479220ce323ee08e95ef84e541",
            "isKey": false,
            "numCitedBy": 353,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "We enhance photographs shot in dark environments by combining a picture taken with the available light and one taken with the flash. We preserve the ambiance of the original lighting and insert the sharpness from the flash image. We use the bilateral filter to decompose the images into detail and large scale. We reconstruct the image using the large scale of the available lighting and the detail of the flash. We detect and correct flash shadows. This combines the advantages of available illumination and flash photography."
            },
            "slug": "Flash-photography-enhancement-via-intrinsic-Eisemann-Durand",
            "title": {
                "fragments": [],
                "text": "Flash photography enhancement via intrinsic relighting"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This work uses the bilateral filter to decompose the images into detail and large scale and reconstruct the image using the large scale of the available lighting and the detail of the flash to enhance photographs shot in dark environments."
            },
            "venue": {
                "fragments": [],
                "text": "ACM Trans. Graph."
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144437216"
                        ],
                        "name": "I. Buck",
                        "slug": "I.-Buck",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Buck",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Buck"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9999617,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f9f7ef4d2138b1f667ce36b8ba873cd2889963fa",
            "isKey": false,
            "numCitedBy": 61,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Summary form only given. Many researchers have observed that general purpose computing with programmable graphics hardware (GPUs) has shown promise to solve many of the world's compute intensive problems, many orders of magnitude faster the conventional CPUs. The challenge has been working within the constraints of a graphics programming environment and limited language support to leverage this huge performance potential. GPU computing with CUDA is a new approach to computing where hundreds of on-chip processor cores simultaneously communicate and cooperate to solve complex computing problems, transforming the GPU into a massively parallel processor. The NVIDIA C-compiler for the GPU provides a complete development environment that gives developers the tools they need to solve new problems in computation-intensive applications such as product design, data analysis, technical computing, and game physics. In this talk, I will provide a description of how CUDA can solve compute intensive problems and highlight the challenges when compiling parallel programs for GPUs including the differences between graphics shaders vs. CUDA applications"
            },
            "slug": "GPU-Computing:-Programming-a-Massively-Parallel-Buck",
            "title": {
                "fragments": [],
                "text": "GPU Computing: Programming a Massively Parallel Processor"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "A description of how CUDA can solve compute intensive problems and highlights the challenges when compiling parallel programs for GPUs including the differences between graphics shaders vs. CUDA applications are provided."
            },
            "venue": {
                "fragments": [],
                "text": "International Symposium on Code Generation and Optimization (CGO'07)"
            },
            "year": 2007
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 57,
                                "start": 52
                            }
                        ],
                        "text": "Six dimensions is the number suggested by Tasdizen [Tas08], who demonstrated that performing non-local means in this way produces superior results to non-local means without dimensionality reduction."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 107
                            }
                        ],
                        "text": "Typically we do the latter, using PCA to determine the optimal filter bank, as first proposed by Tasdizen [Tas08]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Principal components for non-local means denoising"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. ICIP"
            },
            "year": 2008
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A fast approximation of the bi - lateral filter using a signal processing approach"
            },
            "venue": {
                "fragments": [],
                "text": "Proc . ECCV"
            },
            "year": 2006
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Author(s) Journal compilation c 2010 The Eurographics Association and"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. CVPR"
            },
            "year": 2009
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Principal components for non-local means denoising"
            },
            "venue": {
                "fragments": [],
                "text": "In Proc. ICIP"
            },
            "year": 2008
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Author(s) Journal compilation c 2009 The Eurographics Association and"
            },
            "venue": {
                "fragments": [],
                "text": "The Author(s) Journal compilation c 2009 The Eurographics Association and"
            },
            "year": 2009
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Sphere Packings, Lattice and Groups"
            },
            "venue": {
                "fragments": [],
                "text": "Sphere Packings, Lattice and Groups"
            },
            "year": 1999
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 1,
            "methodology": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 32,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Fast-High‐Dimensional-Filtering-Using-the-Lattice-Adams-Baek/7309a56c14f9f2737dbc7d45e106a65c205b3dcb?sort=total-citations"
}