{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12432,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14801990,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6f20e254e3993538c79e0ff2b9b8f198d3359cb3",
            "isKey": false,
            "numCitedBy": 4215,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "In the central nervous system the visual pathway from retina to striate cortex provides an opportunity to observe and compare single unit responses at several distinct levels. Patterns of light stimuli most effective in influencing units at one level may no longer be the most effective at the next. From differences in responses at successive stages in the pathway one may hope to gain some understanding of the part each stage plays in visual perception. By shining small spots of light on the light-adapted cat retina Kuffler (1953) showed that ganglion cells have concentric receptive fields, with an 'on' centre and an 'off ' periphery, or vice versa. The 'on' and 'off' areas within a receptive field were found to be mutually antagonistic, and a spot restricted to the centre of the field was more effective than one covering the whole receptive field (Barlow, FitzHugh & Kuffler, 1957). In the freely moving lightadapted cat it was found that the great majority of cortical cells studied gave little or no response to light stimuli covering most of the animal's visual field, whereas small spots shone in a restricted retinal region often evoked brisk responses (Hubel, 1959). A moving spot of light often produced stronger responses than a stationary one, and sometimes a moving spot gave more activation for one direction than for the opposite. The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex. Receptive fields of the cells considered in this paper were divided into separate excitatory and inhibitory ('on' and 'off') areas. In this respect they resembled retinal ganglion-cell receptive fields. However, the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinal ganglion cells. An attempt was made to correlate responses to moving stimuli"
            },
            "slug": "Receptive-fields-of-single-neurones-in-the-cat's-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields of single neurones in the cat's striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex, which resembled retinal ganglion-cell receptive fields, but the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinalganglion cells."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1993085645"
                        ],
                        "name": "P. Schiller",
                        "slug": "P.-Schiller",
                        "structuredName": {
                            "firstName": "P",
                            "lastName": "Schiller",
                            "middleNames": [
                                "H"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Schiller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33760699"
                        ],
                        "name": "B. Finlay",
                        "slug": "B.-Finlay",
                        "structuredName": {
                            "firstName": "Barbara",
                            "lastName": "Finlay",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Finlay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6849044"
                        ],
                        "name": "S. Volman",
                        "slug": "S.-Volman",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Volman",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Volman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14270911,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "09b4ba65735f8e1ae2b2bf71dec784911f9f67bc",
            "isKey": false,
            "numCitedBy": 229,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The response properties of single cells in monkey striate cortex were examined using moving bars, square-wave gratings, and sine-wave gratings. 2. The moving of cells studied were not selective for bar width or for the spatial frequency of square-wave gratings. 3. Most cells responded selectively to the spatial frequency of the sine-wave gratings. 4. The spatial frequency of the sine-wave grating eliciting the optimal response could not be predicted from the organization of the receptive field of each cell as determined by stationary or moving stimuli. 5. The sharpness of spatial-frequency selectivity is only slightly more pronounced in S-type cells than in CX-type cells. 6. S-type and CX-type cells differ significantly in the temporal modulation of their discharges to gratings. S-type cells discharge in sharp bursts to each cycle which traverses the receptive field. CX-type cells discharge in a rather continuous fashion. This measure can be used reliably to classify cells as S or CS type."
            },
            "slug": "Quantitative-studies-of-single-cell-properties-in-Schiller-Finlay",
            "title": {
                "fragments": [],
                "text": "Quantitative studies of single-cell properties in monkey striate cortex. III. Spatial frequency."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The spatial frequency of the sine-wave grating eliciting the optimal response could not be predicted from the organization of the receptive field of each cell as determined by stationary or moving stimuli."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7136759,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c5f5311fa1f34159ab3a0a1d58da51cd0340a640",
            "isKey": false,
            "numCitedBy": 6319,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light. Most cells can be categorized as simple, complex, or hypercomplex, with response properties very similar to those previously described in the cat. On the average, however, receptive fields are smaller, and there is a greater sensitivity to changes in stimulus orientation. A small proportion of the cells are colour coded."
            },
            "slug": "Receptive-fields-and-functional-architecture-of-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields and functional architecture of monkey striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light, with response properties very similar to those previously described in the cat."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113588000"
                        ],
                        "name": "R. L. de Valois",
                        "slug": "R.-L.-de-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "de Valois",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. de Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152172276"
                        ],
                        "name": "H. Morgan",
                        "slug": "H.-Morgan",
                        "structuredName": {
                            "firstName": "H",
                            "lastName": "Morgan",
                            "middleNames": [
                                "C"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Morgan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "80561269"
                        ],
                        "name": "D. Snodderly",
                        "slug": "D.-Snodderly",
                        "structuredName": {
                            "firstName": "D",
                            "lastName": "Snodderly",
                            "middleNames": [
                                "Max"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Snodderly"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32781738,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "3b015c3abf24abff0902832bfef3c1e06c7bf9cc",
            "isKey": false,
            "numCitedBy": 414,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Psychophysical-studies-of-monkey-vision.-3.-Spatial-Valois-Morgan",
            "title": {
                "fragments": [],
                "text": "Psychophysical studies of monkey vision. 3. Spatial luminance contrast sensitivity tests of macaque and human observers."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3133875"
                        ],
                        "name": "C. Blakemore",
                        "slug": "C.-Blakemore",
                        "structuredName": {
                            "firstName": "Colin",
                            "lastName": "Blakemore",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Blakemore"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15948874,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "1e1f6f39b97b1ed460dd6e1a8819903ea8966cd8",
            "isKey": false,
            "numCitedBy": 2055,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "1. It was found that an occipital evoked potential can be elicited in the human by moving a grating pattern without changing the mean light flux entering the eye. Prolonged viewing of a high contrast grating reduces the amplitude of the potential evoked by a low contrast grating."
            },
            "slug": "On-the-existence-of-neurones-in-the-human-visual-to-Blakemore-Campbell",
            "title": {
                "fragments": [],
                "text": "On the existence of neurones in the human visual system selectively sensitive to the orientation and size of retinal images"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "It was found that an occipital evoked potential can be elicited in the human by moving a grating pattern without changing the mean light flux entering the eye."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1407756324"
                        ],
                        "name": "C. Enroth-Cugell",
                        "slug": "C.-Enroth-Cugell",
                        "structuredName": {
                            "firstName": "Christina",
                            "lastName": "Enroth-Cugell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Enroth-Cugell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3052969,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c6609ae352d9e1c99530136e41798f337496ff27",
            "isKey": false,
            "numCitedBy": 2635,
            "numCiting": 52,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "slug": "The-contrast-sensitivity-of-retinal-ganglion-cells-Enroth-Cugell-Robson",
            "title": {
                "fragments": [],
                "text": "The contrast sensitivity of retinal ganglion cells of the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Spatial summation within cat retinal receptive fields was studied by recording from optic‐tract fibres the responses of ganglion cells to grating patterns whose luminance perpendicular to the bars varied sinusoidally about the mean level."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 228358,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ddc2ea63fa69eca4aa44a4fd135543d67badcb23",
            "isKey": false,
            "numCitedBy": 3039,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies."
            },
            "slug": "Application-of-fourier-analysis-to-the-visibility-Campbell-Robson",
            "title": {
                "fragments": [],
                "text": "Application of fourier analysis to the visibility of gratings"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies and the results show clear patterns of uniformity in the response to grating noise."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728478"
                        ],
                        "name": "D. Norman",
                        "slug": "D.-Norman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Norman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Norman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60367497,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ba3c337478aac89933685a26573298a813034490",
            "isKey": false,
            "numCitedBy": 355,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Human-Information-Processing.-Norman",
            "title": {
                "fragments": [],
                "text": "Human Information Processing."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 9,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Cortical-cells-;-Bar-and-edge-detectors,-or-spatial-Valois-Albrecht/6dd77b9c70c3cbcc2a29992b82d5e4612249fc40?sort=total-citations"
}