{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2079435524"
                        ],
                        "name": "A. Rydberg",
                        "slug": "A.-Rydberg",
                        "structuredName": {
                            "firstName": "Anna",
                            "lastName": "Rydberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rydberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733319"
                        ],
                        "name": "G. Borgefors",
                        "slug": "G.-Borgefors",
                        "structuredName": {
                            "firstName": "Gunilla",
                            "lastName": "Borgefors",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Borgefors"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45760747,
            "fieldsOfStudy": [
                "Mathematics",
                "Environmental Science"
            ],
            "id": "08fdf2fd9221289db2d9485cca9f6fd331d46641",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "This article presents a multispectral edge detection method that combines the best approaches from several sources. It uses all available multispectral information, by adding the magnitudes and directions of edges derived from edge detection in single bands, instead of just taking the maximum, which is commonly done. The addition is weighted on the edge direction, to remove noise and enhance the \"major direction\". The resulting image is then thinned using magnitude and direction information, together with hysteresis thresholding, so that weak edges can be preserved without adding too much noise. Small gaps in the edges are filled in. All edges between areas with different spectral characteristics are detected. The same technique could also be used for edge detection in multi-temporal images, or even multi-temporal/multispectral images. The edge image can then be used for further analysis, such as field segmentation and subsequent classification."
            },
            "slug": "Extracting-multispectral-edges-in-satellite-images-Rydberg-Borgefors",
            "title": {
                "fragments": [],
                "text": "Extracting multispectral edges in satellite images over agricultural fields"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "A multispectral edge detection method that combines the best approaches from several sources, by adding the magnitudes and directions of edges derived from edge detection in single bands, instead of just taking the maximum, which is commonly done."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings 10th International Conference on Image Analysis and Processing"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2079435524"
                        ],
                        "name": "A. Rydberg",
                        "slug": "A.-Rydberg",
                        "structuredName": {
                            "firstName": "Anna",
                            "lastName": "Rydberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rydberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733319"
                        ],
                        "name": "G. Borgefors",
                        "slug": "G.-Borgefors",
                        "structuredName": {
                            "firstName": "Gunilla",
                            "lastName": "Borgefors",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Borgefors"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 11799316,
            "fieldsOfStudy": [
                "Mathematics",
                "Environmental Science"
            ],
            "id": "5eeda0ff689c67224af156f1b156b49e27bf1039",
            "isKey": false,
            "numCitedBy": 93,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Agricultural field boundary information is important in many agricultural management practices and remotely sensed imagery can present valuable, timely, information about land parcels. This paper presents a multispectral segmentation method for automated delineation of agricultural field boundaries in digital imagery. Edge information from a gradient edge detector is integrated with region growing, where the multispectral information from all selected image bands is utilized in both procedures. In this way, information from several spectral bands (and/or different dates) can be used for delineating field boundaries with different characteristics. This is particularly important for agricultural applications, where multidate information is necessary to differentiate between, for instance, crops at different phenological growing stages. The results show that Landsat TM images are easier to delineate than SPOT images due to lower spectral variance between adjacent pixels."
            },
            "slug": "Integrated-method-for-boundary-delineation-of-in-Rydberg-Borgefors",
            "title": {
                "fragments": [],
                "text": "Integrated method for boundary delineation of agricultural fields in multispectral satellite images"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "In this study, a multispectral segmentation method for automated delineation of agricultural field boundaries in remotely sensed images is presented and the introduction of the ISODATA classifier compared with a previously used region growing procedure improves the output."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Geosci. Remote. Sens."
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46865129"
                        ],
                        "name": "Jianbo Shi",
                        "slug": "Jianbo-Shi",
                        "structuredName": {
                            "firstName": "Jianbo",
                            "lastName": "Shi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jianbo Shi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153652147"
                        ],
                        "name": "J. Malik",
                        "slug": "J.-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14848918,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b94c7ff9532ab26c3aedbee3988ec4c7a237c173",
            "isKey": false,
            "numCitedBy": 12812,
            "numCiting": 55,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a novel approach for solving the perceptual grouping problem in vision. Rather than focusing on local features and their consistencies in the image data, our approach aims at extracting the global impression of an image. We treat image segmentation as a graph partitioning problem and propose a novel global criterion, the normalized cut, for segmenting the graph. The normalized cut criterion measures both the total dissimilarity between the different groups as well as the total similarity within the groups. We show that an efficient computational technique based on a generalized eigenvalue problem can be used to optimize this criterion. We have applied this approach to segmenting static images and found results very encouraging."
            },
            "slug": "Normalized-cuts-and-image-segmentation-Shi-Malik",
            "title": {
                "fragments": [],
                "text": "Normalized cuts and image segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work treats image segmentation as a graph partitioning problem and proposes a novel global criterion, the normalized cut, for segmenting the graph, which measures both the total dissimilarity between the different groups as well as the total similarity within the groups."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "150358370"
                        ],
                        "name": "Zhenyu Wu",
                        "slug": "Zhenyu-Wu",
                        "structuredName": {
                            "firstName": "Zhenyu",
                            "lastName": "Wu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zhenyu Wu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9274265"
                        ],
                        "name": "R. Leahy",
                        "slug": "R.-Leahy",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Leahy",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Leahy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2595046,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "250748b4494cec56abd55ae049bdd38f4d42e5c8",
            "isKey": false,
            "numCitedBy": 1265,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "A novel graph theoretic approach for data clustering is presented and its application to the image segmentation problem is demonstrated. The data to be clustered are represented by an undirected adjacency graph G with arc capacities assigned to reflect the similarity between the linked vertices. Clustering is achieved by removing arcs of G to form mutually exclusive subgraphs such that the largest inter-subgraph maximum flow is minimized. For graphs of moderate size ( approximately 2000 vertices), the optimal solution is obtained through partitioning a flow and cut equivalent tree of G, which can be efficiently constructed using the Gomory-Hu algorithm (1961). However for larger graphs this approach is impractical. New theorems for subgraph condensation are derived and are then used to develop a fast algorithm which hierarchically constructs and partitions a partially equivalent tree of much reduced size. This algorithm results in an optimal solution equivalent to that obtained by partitioning the complete equivalent tree and is able to handle very large graphs with several hundred thousand vertices. The new clustering algorithm is applied to the image segmentation problem. The segmentation is achieved by effectively searching for closed contours of edge elements (equivalent to minimum cuts in G), which consist mostly of strong edges, while rejecting contours containing isolated strong edges. This method is able to accurately locate region boundaries and at the same time guarantees the formation of closed edge contours. >"
            },
            "slug": "An-Optimal-Graph-Theoretic-Approach-to-Data-Theory-Wu-Leahy",
            "title": {
                "fragments": [],
                "text": "An Optimal Graph Theoretic Approach to Data Clustering: Theory and Its Application to Image Segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 64,
                "text": "A novel graph theoretic approach for data clustering is presented and its application to the image segmentation problem is demonstrated, resulting in an optimal solution equivalent to that obtained by partitioning the complete equivalent tree and is able to handle very large graphs with several hundred thousand vertices."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685089"
                        ],
                        "name": "Pedro F. Felzenszwalb",
                        "slug": "Pedro-F.-Felzenszwalb",
                        "structuredName": {
                            "firstName": "Pedro",
                            "lastName": "Felzenszwalb",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Pedro F. Felzenszwalb"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713089"
                        ],
                        "name": "D. Huttenlocher",
                        "slug": "D.-Huttenlocher",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Huttenlocher",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Huttenlocher"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 207663697,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aeeffe327e6c93e9010c7b1e401caa9113723851",
            "isKey": false,
            "numCitedBy": 3751,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper addresses the problem of segmenting an image into regions. We define a predicate for measuring the evidence for a boundary between two regions using a graph-based representation of the image. We then develop an efficient segmentation algorithm based on this predicate, and show that although this algorithm makes greedy decisions it produces segmentations that satisfy global properties. We apply the algorithm to image segmentation using two different kinds of local neighborhoods in constructing the graph, and illustrate the results with both real and synthetic images. The algorithm runs in time nearly linear in the number of graph edges and is also fast in practice. An important characteristic of the method is its ability to preserve detail in low-variability image regions while ignoring detail in high-variability regions."
            },
            "slug": "Efficient-Graph-Based-Image-Segmentation-Felzenszwalb-Huttenlocher",
            "title": {
                "fragments": [],
                "text": "Efficient Graph-Based Image Segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "An efficient segmentation algorithm is developed based on a predicate for measuring the evidence for a boundary between two regions using a graph-based representation of the image and it is shown that although this algorithm makes greedy decisions it produces segmentations that satisfy global properties."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Computer Vision"
            },
            "year": 2004
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 5,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Efficient-Graph-Based-Image-泰明-智一/b3df1ffb8a6856f20be51243406f2fdbe2a335ba?sort=total-citations"
}