{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2135000"
                        ],
                        "name": "Claudia Wenzel",
                        "slug": "Claudia-Wenzel",
                        "structuredName": {
                            "firstName": "Claudia",
                            "lastName": "Wenzel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Claudia Wenzel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28496139,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8e41c8903dbb1a7b996934c44269812951fc70bc",
            "isKey": false,
            "numCitedBy": 12,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Document analysis and understanding (DAU) systems aim not only at the recognition of text and document structures but also at the extraction of relevant information out of a scanned document. Depending on the class of a document, information to be extracted may be defined in advance in syntactic structures as well as in semantic structures. In this paper we present a system for detecting such information and transforming it into a semantic representation. The basic component is a pattern matcher which incorporates geometric positions to detect phrases in the document. By defining a Levenshtein distance, the component reacts more generously in order to be error tolerant against OCR failures."
            },
            "slug": "Supporting-information-extraction-from-printed-by-Wenzel",
            "title": {
                "fragments": [],
                "text": "Supporting information extraction from printed documents by Lexico-Semantic pattern matching"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The basic component is a pattern matcher which incorporates geometric positions to detect phrases in the document and reacts more generously in order to be error tolerant against OCR failures."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Fourth International Conference on Document Analysis and Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1500661115"
                        ],
                        "name": "Toyohide Watanabe",
                        "slug": "Toyohide-Watanabe",
                        "structuredName": {
                            "firstName": "Toyohide",
                            "lastName": "Watanabe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Toyohide Watanabe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107969145"
                        ],
                        "name": "X. Huang",
                        "slug": "X.-Huang",
                        "structuredName": {
                            "firstName": "Xiao",
                            "lastName": "Huang",
                            "middleNames": [
                                "Jing"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Huang"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6948518,
            "fieldsOfStudy": [
                "Computer Science",
                "Business"
            ],
            "id": "df578f35419f0b7766ae6bd70ed9726a92d75e32",
            "isKey": false,
            "numCitedBy": 20,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Document knowledge plays a very important role in many document image understanding methods. In these methods, the document knowledge is utilized to classify/extract individual item data interpretatively from paper-based sheets as a kind of document model: these days, this knowledge is specified into the document image understanding system in advance. In this paper, we propose an experimental method to acquire the layout knowledge automatically from sample document images. In particular, we focus on the acquisition of the layout of business cards. Our idea is to generate the layout knowledge of business cards from a predefined logical structure, which is used as a kind of meta-knowledge to interpretatively generate the layout knowledge of given business cards."
            },
            "slug": "Automatic-acquisition-of-layout-knowledge-for-cards-Watanabe-Huang",
            "title": {
                "fragments": [],
                "text": "Automatic acquisition of layout knowledge for understanding business cards"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The idea is to generate the layout knowledge of business cards from a predefined logical structure, which is used as a kind of meta-knowledge to interpretatively generate the layouts knowledge of given business cards."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Fourth International Conference on Document Analysis and Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31844557"
                        ],
                        "name": "T. Kochi",
                        "slug": "T.-Kochi",
                        "structuredName": {
                            "firstName": "Tsukasa",
                            "lastName": "Kochi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kochi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2066251026"
                        ],
                        "name": "T. Saitoh",
                        "slug": "T.-Saitoh",
                        "structuredName": {
                            "firstName": "Takashi",
                            "lastName": "Saitoh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Saitoh"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 84
                            }
                        ],
                        "text": "For example, “coordinates” is an effectual layout feature in the element extraction [1] so that the weight for “coordinates” v0 should be less than others."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 44
                            }
                        ],
                        "text": "We have already reported a prototype system [1] that includes a unit that extracts elements from semi-formatted documents (Fig."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 45671296,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2c9951fac1b081729d8596de6a7d95e28ba99c09",
            "isKey": false,
            "numCitedBy": 6,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "SGML is a language for defining the layout structure of a document. Various attempts at generating SGML from a document image have not been successful. We focus on extracting some of the important layout elements by using flexible matching strategy and easy model generation. Our proposed approach treats each extracted element as it were independent. Some segmented areas like \"title\" or \"author\" are defined locally making the system robust, able to withstand shifting and noise. The system is also easy to operate. Since the system is not full automatic, we need to supply typical models of each component. Our GUI presents the attributes of each segmented area as well as the original bit map images. The color-coded attributes help us to easily edit the extracted component. In experiments with 288 pages of test images, the proposed method is shown to be 95.6% correct for a wide range of documents. By using 145 pages of documents as a learning set, the system recognized 99.2% of feature sets from 148 various types of unknown documents."
            },
            "slug": "A-Layout-Free-Method-for-Extracting-Elements-from-Kochi-Saitoh",
            "title": {
                "fragments": [],
                "text": "A Layout-Free Method for Extracting Elements from Document Images"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This work focuses on extracting some of the important layout elements by using flexible matching strategy and easy model generation, and treats each extracted element as it were independent."
            },
            "venue": {
                "fragments": [],
                "text": "Document Analysis Systems"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1500661115"
                        ],
                        "name": "Toyohide Watanabe",
                        "slug": "Toyohide-Watanabe",
                        "structuredName": {
                            "firstName": "Toyohide",
                            "lastName": "Watanabe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Toyohide Watanabe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2074293587"
                        ],
                        "name": "Q. Luo",
                        "slug": "Q.-Luo",
                        "structuredName": {
                            "firstName": "Qin",
                            "lastName": "Luo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Q. Luo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1692608"
                        ],
                        "name": "N. Sugie",
                        "slug": "N.-Sugie",
                        "structuredName": {
                            "firstName": "Noboru",
                            "lastName": "Sugie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Sugie"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23198522,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fa208b677239912cb394e5dbc6e7483a75f16ea4",
            "isKey": false,
            "numCitedBy": 140,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Many approaches have reported that knowledge-based layout recognition methods are very successful in classifying the meaningful data from document images automatically. However, these approaches are applicable to only the same kind of documents because they are based on the paradigm that specifies the structure definition information in advance so as to be able to analyze a particular class of documents intelligently. In this paper, the authors propose a method to recognize the layout structures of multi-kinds of table-form document images. For this purpose, the authors introduce a classification tree to manage the relationships among different classes of layout structures. The authors' recognition system has two modes: layout knowledge acquisition and layout structure recognition. In the layout knowledge acquisition mode, table-form document images are distinguished according to this. Classification tree and then the structure description trees which specify the logical structures of table-form documents are generated automatically. While, in the layout structure recognition mode, individual item fields in the table-form document images are extracted and classified successfully by searching the classification tree and interpreting the structure description tree. >"
            },
            "slug": "Layout-Recognition-of-Multi-Kinds-of-Table-Form-Watanabe-Luo",
            "title": {
                "fragments": [],
                "text": "Layout Recognition of Multi-Kinds of Table-Form Documents"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The authors introduce a classification tree to manage the relationships among different classes of layout structures and propose a method to recognize the layout structures of multi-kinds of table-form document images."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39702442"
                        ],
                        "name": "Y. Tang",
                        "slug": "Y.-Tang",
                        "structuredName": {
                            "firstName": "Yuan",
                            "lastName": "Tang",
                            "middleNames": [
                                "Yan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Tang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2144128094"
                        ],
                        "name": "Jiming Liu",
                        "slug": "Jiming-Liu",
                        "structuredName": {
                            "firstName": "Jiming",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jiming Liu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8605008,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8ef57dada06cb75aaddb49077d046830cf09c245",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "An automatic form information acquisition and storage system is presented. By semantic meaning analysis and registration of every king of forms in advance, the system as able to recognize incoming forms and extract information from them automatically. An efficient form image storage method is also proposed. Instead of keeping the entire form image, this system greatly reduces the memory needed to store the form images in a database by extracting and storing user filled data images only."
            },
            "slug": "Information-acquisition-and-storage-of-forms-in-Tang-Liu",
            "title": {
                "fragments": [],
                "text": "Information acquisition and storage of forms in document processing"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "An automatic form information acquisition and storage system is presented and an efficient form image storage method is proposed that greatly reduces the memory needed to store the form images in a database by extracting and storing user filled data images only."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Fourth International Conference on Document Analysis and Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2055055509"
                        ],
                        "name": "Michael Sharpe",
                        "slug": "Michael-Sharpe",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Sharpe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael Sharpe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2069486346"
                        ],
                        "name": "Nizam Ahmed",
                        "slug": "Nizam-Ahmed",
                        "structuredName": {
                            "firstName": "Nizam",
                            "lastName": "Ahmed",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nizam Ahmed"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145666207"
                        ],
                        "name": "G. Sutcliffe",
                        "slug": "G.-Sutcliffe",
                        "structuredName": {
                            "firstName": "Geoff",
                            "lastName": "Sutcliffe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Sutcliffe"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 123
                            }
                        ],
                        "text": "Some researchers have used the search templates or translation criteria including structural data and translation rules [3][4][5]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 155637,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aef918dd96e5a37c93b5ee255f3971cfd746ea34",
            "isKey": false,
            "numCitedBy": 6,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents the design and implementation of an intelligent document understanding and reproduction system. The system analyses a printed document to create an electronic document. The electronic document is written in a standard typesetting language ( Lw ), and is thus human usable. The output from processing the electronic document closely resembles the original printed document. A new document understanding technique, which utilises the Definite Clause Grammar formalism, has been developed."
            },
            "slug": "An-Intelligent-Document-Understanding-&-System-Sharpe-Ahmed",
            "title": {
                "fragments": [],
                "text": "An Intelligent Document Understanding & Reproduction System"
            },
            "tldr": {
                "abstractSimilarityScore": 84,
                "text": "This paper presents the design and implementation of an intelligent document understanding and reproduction system, which analyses a printed document to create an electronic document that closely resembles the original printed document."
            },
            "venue": {
                "fragments": [],
                "text": "MVA"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1694191"
                        ],
                        "name": "J. Hull",
                        "slug": "J.-Hull",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Hull",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hull"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3108177"
                        ],
                        "name": "P. Hart",
                        "slug": "P.-Hart",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Hart",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Hart"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 189,
                                "start": 186
                            }
                        ],
                        "text": "Almost all documents used in our daily workflow, even user copies, prints, and facsimiles, can be stored entirely on disks because a huge amount of disk storage is available at low cost [2]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15316828,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "32a5f5c913762c913e7789203b7face0594f3d14",
            "isKey": false,
            "numCitedBy": 6,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "A complete, working document storage and retrieval system is described. Designed to help users solve the problem of lost documents, this system illustrates the concepts of automatic document capture and easy retrieval. Every document a user copies or prints is automatically indexed and saved for later retrieval. A prototype implementation of such a system was constructed and used daily by approximately 20 people for over two years. The design of this system is presented and experimental results are discussed."
            },
            "slug": "THE-INFINITE-MEMORY-MULTIFUNCTION-MACHINE-Hull-Hart",
            "title": {
                "fragments": [],
                "text": "THE INFINITE MEMORY MULTIFUNCTION MACHINE"
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "A complete, working document storage and retrieval system designed to help users solve the problem of lost documents and illustrates the concepts of automatic document capture and easy retrieval."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153027997"
                        ],
                        "name": "Hiroyuki Arai",
                        "slug": "Hiroyuki-Arai",
                        "structuredName": {
                            "firstName": "Hiroyuki",
                            "lastName": "Arai",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hiroyuki Arai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3080357"
                        ],
                        "name": "K. Odaka",
                        "slug": "K.-Odaka",
                        "structuredName": {
                            "firstName": "Kazumi",
                            "lastName": "Odaka",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Odaka"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 206775242,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d2395e1f2b35d510de9fd172e5fd71b09d01140f",
            "isKey": false,
            "numCitedBy": 20,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a novel approach for processing form documents based on background region analysis. Our goal is to achieve line-property-free form processing. Background regions can be extracted independently of line width or length, and multi-layer analysis employing a series of coarse-to-fine background images makes it possible to extract background regions regardless of small line-breaks. We propose two multi-layer analysis algorithms for different situations. One is applied in a registration process of a form model. It reliably extracts box regions from un-filled forms without using any model. The other is applied in a character extraction process. By using a spatial model of a form, it reliably extracts background regions, and re-integrates these regions if they are divided by characters written in the boxes. From these re-integrated regions, the exact locations of the character boxes are determined on the input image. Besides these algorithms, we present a form identification method that uses coarse background images. We implemented the algorithms into a prototype system that processes pre-printed forms. 50 types of existing forms were tested without any customization. Model registration, character extraction, and form identification were reliably carried out."
            },
            "slug": "Form-processing-based-on-background-region-analysis-Arai-Odaka",
            "title": {
                "fragments": [],
                "text": "Form processing based on background region analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "This work presents a novel approach for processing form documents based on background region analysis, and proposes two multi-layer analysis algorithms for different situations that reliably extracts box regions from un-filled forms without using any model."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Fourth International Conference on Document Analysis and Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1917542"
                        ],
                        "name": "Chinchen Chang",
                        "slug": "Chinchen-Chang",
                        "structuredName": {
                            "firstName": "Chinchen",
                            "lastName": "Chang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chinchen Chang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733135"
                        ],
                        "name": "Suh-Yin Lee",
                        "slug": "Suh-Yin-Lee",
                        "structuredName": {
                            "firstName": "Suh-Yin",
                            "lastName": "Lee",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Suh-Yin Lee"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 13589988,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f33ab691655bbefea841eabaac34903ae9755ab7",
            "isKey": false,
            "numCitedBy": 146,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Retrieval-of-similar-pictures-on-pictorial-Chang-Lee",
            "title": {
                "fragments": [],
                "text": "Retrieval of similar pictures on pictorial databases"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727823"
                        ],
                        "name": "Jack A. Orenstein",
                        "slug": "Jack-A.-Orenstein",
                        "structuredName": {
                            "firstName": "Jack",
                            "lastName": "Orenstein",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jack A. Orenstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1798002"
                        ],
                        "name": "Frank Manola",
                        "slug": "Frank-Manola",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Manola",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Frank Manola"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 10
                            }
                        ],
                        "text": "Orenstein [10] that related to image classification or retrieval mainly based on location matching for objects."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 20013258,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cc56b73e8904ba0d2115e0f54179e70f1a0bafb3",
            "isKey": false,
            "numCitedBy": 295,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "The PROBE research project has produced results in the areas of data modeling, spatial/temporal query processing, recursive query processing, and database system architecture for nontraditional application areas, many of which involve spatial data and data with complex structure. An overview of PROBE is provided, focusing on the facilities for dealing with spatial and temporal data. It is shown how the PROBE database system and simple application-specific object classes combine to efficiently support PROBE's spatial data model. It is also shown how an image-database application can be supported using PROBE's data model and spatial query processor. The current status of the PROBE project and future plans are discussed. >"
            },
            "slug": "PROBE-Spatial-Data-Modeling-and-Query-Processing-in-Orenstein-Manola",
            "title": {
                "fragments": [],
                "text": "PROBE Spatial Data Modeling and Query Processing in an Image Database Application"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "An overview of PROBE is provided, focusing on the facilities for dealing with spatial and temporal data, and how thePROBE database system and simple application-specific object classes combine to efficiently support PROBe's spatial data model."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Software Eng."
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 129,
                                "start": 126
                            }
                        ],
                        "text": "Now we consider traditional methods related to image identification, there have been many attempts to identify form images [6][7][8]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Form items extraction by model matching"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 4,
            "methodology": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 11,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/User-defined-template-for-identifying-document-type-Kochi-Saitoh/c37afa374165479c0789a8748bc47f3ce756a0bb?sort=total-citations"
}