{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688235"
                        ],
                        "name": "P. Frasconi",
                        "slug": "P.-Frasconi",
                        "structuredName": {
                            "firstName": "Paolo",
                            "lastName": "Frasconi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Frasconi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145467467"
                        ],
                        "name": "M. Gori",
                        "slug": "M.-Gori",
                        "structuredName": {
                            "firstName": "Marco",
                            "lastName": "Gori",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Gori"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749815"
                        ],
                        "name": "A. Sperduti",
                        "slug": "A.-Sperduti",
                        "structuredName": {
                            "firstName": "Alessandro",
                            "lastName": "Sperduti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Sperduti"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 31,
                                "start": 8
                            }
                        ],
                        "text": "(1998), Frasconi et al. (1998). What is new here is the derivation of a number of specific classes of architectures that can process a wide range of data structures with variable sizes and dimensions together with their systematic application to protein structure prediction problems."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 507,
                                "start": 8
                            }
                        ],
                        "text": "(1998), Frasconi et al. (1998). What is new here is the derivation of a number of specific classes of architectures that can process a wide range of data structures with variable sizes and dimensions together with their systematic application to protein structure prediction problems. The results we describe expand and improve on those previously reported in Pollastri et al. (2003) associated with the contact map predictor that obtained results similar to the CORNET predictor of Fariselli et al. (2001) during the CASP5 (Critical Assessment of Techniques for Protein Structure Prediction) experiment ( http://predictioncenter."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 384,
                                "start": 8
                            }
                        ],
                        "text": "(1998), Frasconi et al. (1998). What is new here is the derivation of a number of specific classes of architectures that can process a wide range of data structures with variable sizes and dimensions together with their systematic application to protein structure prediction problems. The results we describe expand and improve on those previously reported in Pollastri et al. (2003) associated with the contact map predictor that obtained results similar to the CORNET predictor of Fariselli et al."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 6197973,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a5eb96540ef53b49eac2246d6b13635fe6e54451",
            "isKey": true,
            "numCitedBy": 467,
            "numCiting": 100,
            "paperAbstract": {
                "fragments": [],
                "text": "A structured organization of information is typically required by symbolic processing. On the other hand, most connectionist models assume that data are organized according to relatively poor structures, like arrays or sequences. The framework described in this paper is an attempt to unify adaptive models like artificial neural nets and belief nets for the problem of processing structured information. In particular, relations between data variables are expressed by directed acyclic graphs, where both numerical and categorical values coexist. The general framework proposed in this paper can be regarded as an extension of both recurrent neural networks and hidden Markov models to the case of acyclic graphs. In particular we study the supervised learning problem as the problem of learning transductions from an input structured space to an output structured space, where transductions are assumed to admit a recursive hidden statespace representation. We introduce a graphical formalism for representing this class of adaptive transductions by means of recursive networks, i.e., cyclic graphs where nodes are labeled by variables and edges are labeled by generalized delay elements. This representation makes it possible to incorporate the symbolic and subsymbolic nature of data. Structures are processed by unfolding the recursive network into an acyclic graph called encoding network. In so doing, inference and learning algorithms can be easily inherited from the corresponding algorithms for artificial neural networks or probabilistic graphical model."
            },
            "slug": "A-general-framework-for-adaptive-processing-of-data-Frasconi-Gori",
            "title": {
                "fragments": [],
                "text": "A general framework for adaptive processing of data structures"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The framework described in this paper is an attempt to unify adaptive models like artificial neural nets and belief nets for the problem of processing structured information, where relations between data variables are expressed by directed acyclic graphs, where both numerical and categorical values coexist."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Neural Networks"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144902513"
                        ],
                        "name": "P. Baldi",
                        "slug": "P.-Baldi",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Baldi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Baldi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8169197"
                        ],
                        "name": "S. Brunak",
                        "slug": "S.-Brunak",
                        "structuredName": {
                            "firstName": "Søren",
                            "lastName": "Brunak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Brunak"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688235"
                        ],
                        "name": "P. Frasconi",
                        "slug": "P.-Frasconi",
                        "structuredName": {
                            "firstName": "Paolo",
                            "lastName": "Frasconi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Frasconi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2540925"
                        ],
                        "name": "G. Soda",
                        "slug": "G.-Soda",
                        "structuredName": {
                            "firstName": "Giovanni",
                            "lastName": "Soda",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Soda"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2028880"
                        ],
                        "name": "G. Pollastri",
                        "slug": "G.-Pollastri",
                        "structuredName": {
                            "firstName": "Gianluca",
                            "lastName": "Pollastri",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Pollastri"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15343954,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9ac3c0f5c9cb6632447c314082151b6b45112941",
            "isKey": false,
            "numCitedBy": 487,
            "numCiting": 72,
            "paperAbstract": {
                "fragments": [],
                "text": "MOTIVATION\nPredicting the secondary structure of a protein (alpha-helix, beta-sheet, coil) is an important step towards elucidating its three-dimensional structure, as well as its function. Presently, the best predictors are based on machine learning approaches, in particular neural network architectures with a fixed, and relatively short, input window of amino acids, centered at the prediction site. Although a fixed small window avoids overfitting problems, it does not permit capturing variable long-rang information.\n\n\nRESULTS\nWe introduce a family of novel architectures which can learn to make predictions based on variable ranges of dependencies. These architectures extend recurrent neural networks, introducing non-causal bidirectional dynamics to capture both upstream and downstream information. The prediction algorithm is completed by the use of mixtures of estimators that leverage evolutionary information, expressed in terms of multiple alignments, both at the input and output levels. While our system currently achieves an overall performance close to 76% correct prediction--at least comparable to the best existing systems--the main emphasis here is on the development of new algorithmic ideas.\n\n\nAVAILABILITY\nThe executable program for predicting protein secondary structure is available from the authors free of charge.\n\n\nCONTACT\npfbaldi@ics.uci.edu, gpollast@ics.uci.edu, brunak@cbs.dtu.dk, paolo@dsi.unifi.it."
            },
            "slug": "Exploiting-the-past-and-the-future-in-protein-Baldi-Brunak",
            "title": {
                "fragments": [],
                "text": "Exploiting the past and the future in protein secondary structure prediction"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A family of novel architectures which can learn to make predictions based on variable ranges of dependencies are introduced, extending recurrent neural networks and introducing non-causal bidirectional dynamics to capture both upstream and downstream information."
            },
            "venue": {
                "fragments": [],
                "text": "Bioinform."
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2028880"
                        ],
                        "name": "G. Pollastri",
                        "slug": "G.-Pollastri",
                        "structuredName": {
                            "firstName": "Gianluca",
                            "lastName": "Pollastri",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Pollastri"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144902513"
                        ],
                        "name": "P. Baldi",
                        "slug": "P.-Baldi",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Baldi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Baldi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 273,
                                "start": 247
                            }
                        ],
                        "text": "…metrics for assessing contact map prediction remain to be developed, we have used here a variety of measures to address some of these problems and to allow comparisons with results published in the literature, especially Fariselli et al. (2001), Pollastri and Baldi (2002), Pollastri et al. (2003)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 11691128,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5a8f37cd03fa4023700baf3bf1bff6b861ee533f",
            "isKey": false,
            "numCitedBy": 156,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "MOTIVATION\nAccurate prediction of protein contact maps is an important step in computational structural proteomics. Because contact maps provide a translation and rotation invariant topological representation of a protein, they can be used as a fundamental intermediary step in protein structure prediction.\n\n\nRESULTS\nWe develop a new set of flexible machine learning architectures for the prediction of contact maps, as well as other information processing and pattern recognition tasks. The architectures can be viewed as recurrent neural network implemantations of a class of Bayesian networks we call generalized input-output HMMs (GIOHMMs). For the specific case of contact maps, contextual information is propagated laterally through four hidden planes, one for each cardinal corner. We show that these architectures can be trained from examples and yield contact map predictors that outperform previously reported methods. While several extensions and improvements are in progress, the current version can accurately predict 60.5% of contacts at a distance cutoff of 8 A and 45% of distant contacts at 10 A, for proteins of length up to 300."
            },
            "slug": "Prediction-of-contact-maps-by-GIOHMMs-and-recurrent-Pollastri-Baldi",
            "title": {
                "fragments": [],
                "text": "Prediction of contact maps by GIOHMMs and recurrent neural networks using lateral propagation from all four cardinal corners"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "A new set of flexible machine learning architectures for the prediction of contact maps, as well as other information processing and pattern recognition tasks, are developed and it is shown that these architectures can be trained from examples and yield contact map predictors that outperform previously reported methods."
            },
            "venue": {
                "fragments": [],
                "text": "ISMB"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "41231471"
                        ],
                        "name": "A. Micheli",
                        "slug": "A.-Micheli",
                        "structuredName": {
                            "firstName": "Alessio",
                            "lastName": "Micheli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Micheli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749815"
                        ],
                        "name": "A. Sperduti",
                        "slug": "A.-Sperduti",
                        "structuredName": {
                            "firstName": "Alessandro",
                            "lastName": "Sperduti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Sperduti"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1678493"
                        ],
                        "name": "A. Starita",
                        "slug": "A.-Starita",
                        "structuredName": {
                            "firstName": "Antonina",
                            "lastName": "Starita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Starita"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1734576"
                        ],
                        "name": "A. Bianucci",
                        "slug": "A.-Bianucci",
                        "structuredName": {
                            "firstName": "Anna",
                            "lastName": "Bianucci",
                            "middleNames": [
                                "Maria"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bianucci"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 840581,
            "fieldsOfStudy": [
                "Chemistry",
                "Biology"
            ],
            "id": "56402b8f02babbd5adfd293cfbc71617bd1138a0",
            "isKey": false,
            "numCitedBy": 72,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "An application of recursive cascade correlation (CC) neural networks to quantitative structure-activity relationship (QSAR) studies is presented, with emphasis on the study of the internal representations developed by the neural networks. Recursive CC is a neural network model recently proposed for the processing of structured data. It allows the direct handling of chemical compounds as labeled ordered directed graphs, and constitutes a novel approach to QSAR. The adopted representation of molecular structure captures, in a quite general and flexible way, significant topological aspects and chemical functionalities for each specific class of molecules showing a particular chemical reactivity or biological activity. A class of 1,4-benzodiazepin-2-ones is analyzed by the proposed approach. It compares favorably versus the traditional QSAR treatment based on equations. To show the ability of the model in capturing most of the structural features that account for the biological activity, the internal representations developed by the networks are analyzed by principal component analysis. This analysis shows that the networks are able to discover relevant structural features just on the basis of the association between the molecular morphology and the target property (affinity)."
            },
            "slug": "Analysis-of-the-Internal-Representations-Developed-Micheli-Sperduti",
            "title": {
                "fragments": [],
                "text": "Analysis of the Internal Representations Developed by Neural Networks for Structures Applied to Quantitative Structure-Activity Relationship Studies of Benzodiazepines"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "An application of recursive cascade correlation neural networks to quantitative structure-activity relationship (QSAR) studies is presented, with emphasis on the study of the internal representations developed by the neural networks."
            },
            "venue": {
                "fragments": [],
                "text": "J. Chem. Inf. Comput. Sci."
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749815"
                        ],
                        "name": "A. Sperduti",
                        "slug": "A.-Sperduti",
                        "structuredName": {
                            "firstName": "Alessandro",
                            "lastName": "Sperduti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Sperduti"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1678493"
                        ],
                        "name": "A. Starita",
                        "slug": "A.-Starita",
                        "structuredName": {
                            "firstName": "Antonina",
                            "lastName": "Starita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Starita"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 238,
                                "start": 224
                            }
                        ],
                        "text": "…systematically to many large-scale problems, by itself it is not new and can be traced, in more or less obscure form, to a number of publications including Baldi and Chauvin (1996), Bengio and Frasconi (1996), Sperduti and Starita (1997), Goller (1997), LeCun et al. (1998), Frasconi et al. (1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5942593,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3e33eca03933caaec671e20692e79d1acc9527e1",
            "isKey": false,
            "numCitedBy": 486,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "Standard neural networks and statistical methods are usually believed to be inadequate when dealing with complex structures because of their feature-based approach. In fact, feature-based approaches usually fail to give satisfactory solutions because of the sensitivity of the approach to the a priori selection of the features, and the incapacity to represent any specific information on the relationships among the components of the structures. However, we show that neural networks can, in fact, represent and classify structured patterns. The key idea underpinning our approach is the use of the so called \"generalized recursive neuron\", which is essentially a generalization to structures of a recurrent neuron. By using generalized recursive neurons, all the supervised networks developed for the classification of sequences, such as backpropagation through time networks, real-time recurrent networks, simple recurrent networks, recurrent cascade correlation networks, and neural trees can, on the whole, be generalized to structures. The results obtained by some of the above networks (with generalized recursive neurons) on the classification of logic terms are presented."
            },
            "slug": "Supervised-neural-networks-for-the-classification-Sperduti-Starita",
            "title": {
                "fragments": [],
                "text": "Supervised neural networks for the classification of structures"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is shown that neural networks can, in fact, represent and classify structured patterns and all the supervised networks developed for the classification of sequences can, on the whole, be generalized to structures."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Neural Networks"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2028880"
                        ],
                        "name": "G. Pollastri",
                        "slug": "G.-Pollastri",
                        "structuredName": {
                            "firstName": "Gianluca",
                            "lastName": "Pollastri",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Pollastri"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144902513"
                        ],
                        "name": "P. Baldi",
                        "slug": "P.-Baldi",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Baldi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Baldi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3255005"
                        ],
                        "name": "Alessandro Vullo",
                        "slug": "Alessandro-Vullo",
                        "structuredName": {
                            "firstName": "Alessandro",
                            "lastName": "Vullo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alessandro Vullo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688235"
                        ],
                        "name": "P. Frasconi",
                        "slug": "P.-Frasconi",
                        "structuredName": {
                            "firstName": "Paolo",
                            "lastName": "Frasconi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Frasconi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 36
                            }
                        ],
                        "text": "(2001), Pollastri and Baldi (2002), Pollastri et al. (2003). In particular we have used: • Percentage of correctly predicted contacts and non-contacts at each threshold cutoff."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 120,
                                "start": 96
                            }
                        ],
                        "text": "The BRNN takes as input the profile obtained from PSI-BLAST multiple alignments as described in Pollastri et al. (2001b), plus secondary structure and solvent accessibility of each residue."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 501,
                                "start": 113
                            }
                        ],
                        "text": "Predictors for the first step based on recurrent neural networks have been described in Baldi and Brunak (2001), Pollastri et al. (2001a,b). Methods to address the third step have been developed in the NMR literature (Nilges et al., 1988a,b) and elsewhere (Vendruscolo et al., 1997) and typically use ideas from distance geometry, molecular dynamics, and stochastic optimization to recover 3D coordinates from contacts. These methods, however, will not be discussed here (see Yanover and Weiss (2002) for an application of graphical models to the problem of placing side chains)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 102
                            }
                        ],
                        "text": "It is also possible to consider situations where the topology of the DAG varies with the input, as in Pollastri et al. (2003) where coarse contacts are represented directly by edges between nodes representing secondary structure elements."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 74
                            }
                        ],
                        "text": "CMEDIUM: Proteins of length 300 at most are selected, for comparison with Pollastri et al. (2003), leading to a set of 709 proteins, of which 355 are selected for training and the remaining are split between validation and test."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 62
                            }
                        ],
                        "text": "In its absence, results are substantially similar to those in Pollastri et al. (2003). Introducing amino-acid level information, though, causes a noticeable improvement, roughly 10% in terms of F1 for all sets."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 92,
                                "start": 68
                            }
                        ],
                        "text": "We use profiles derived using the PSI-BLAST program as described in Pollastri et al. (2001b)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 394,
                                "start": 36
                            }
                        ],
                        "text": "(2001), Pollastri and Baldi (2002), Pollastri et al. (2003). In particular we have used: • Percentage of correctly predicted contacts and non-contacts at each threshold cutoff. • Percentage of correctly predicted contacts and non-contacts at each threshold cutoff in an offdiagonal band, corresponding to amino acids i and j with |i− j| ≥ 7 for fine grained maps, as in Fariselli et al. (2001). For coarse grained map the difference between diagonal and off-diagonal terms is less significant."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 160,
                                "start": 137
                            }
                        ],
                        "text": "Various algorithms for the prediction of contacts (Shindyalov et al., 1994, Olmea and Valencia, 1997, Fariselli and Casadio, 1999, 2000, Pollastri et al., 2001a), distances (Aszodi et al., 1995, Lund et al., 1997, Gorodkin et al., 1999), and contact maps (Fariselli et al., 2001) have been…"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 291,
                                "start": 268
                            }
                        ],
                        "text": "…specific structural features can also be added to each input such as the secondary structure classification and the relative solvent accessibility, a percentage indicator of whether a residue is on the surface or buried in the hydrophobic core of a globular protein (Pollastri et al., 2001a)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 237,
                                "start": 214
                            }
                        ],
                        "text": "These BRNN architectures have been used in the first stage of the prediction pipeline of Figure 1 giving rise to state-of-the-art predictors for secondary structure, solvent accessibility, and coordination number (Pollastri et al., 2001a,b) available through: http://www.igb.uci. edu/tools.htm."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 516731,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b57db2bdd731b298471721b8172b4f099ff68b68",
            "isKey": false,
            "numCitedBy": 1,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "We develop and test new machine learning methods for the prediction of topological representations of protein structures in the form of coarse- or fine-grained contact or distance maps that are translation and rotation invariant. The methods are based on generalized input-output hidden Markov models (GIOHMMs) and generalized recursive neural networks (GRNNs). The methods are used to predict topology directly in the fine-grained case and, in the coarse-grained case, indirectly by first learning how to score candidate graphs and then using the scoring function to search the space of possible configurations. Computer simulations show that the predictors achieve state-of-the-art performance."
            },
            "slug": "Prediction-of-Protein-Topologies-Using-Generalized-Pollastri-Baldi",
            "title": {
                "fragments": [],
                "text": "Prediction of Protein Topologies Using Generalized IOHMMS and RNNs"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "New machine learning methods based on generalized input-output hidden Markov models and generalized recursive neural networks for the prediction of topological representations of protein structures in the form of coarse- or fine-grained contact or distance maps that are translation and rotation invariant are developed and tested."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1751762"
                        ],
                        "name": "Yoshua Bengio",
                        "slug": "Yoshua-Bengio",
                        "structuredName": {
                            "firstName": "Yoshua",
                            "lastName": "Bengio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yoshua Bengio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688235"
                        ],
                        "name": "P. Frasconi",
                        "slug": "P.-Frasconi",
                        "structuredName": {
                            "firstName": "Paolo",
                            "lastName": "Frasconi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Frasconi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 209,
                                "start": 183
                            }
                        ],
                        "text": "…systematically to many large-scale problems, by itself it is not new and can be traced, in more or less obscure form, to a number of publications including Baldi and Chauvin (1996), Bengio and Frasconi (1996), Sperduti and Starita (1997), Goller (1997), LeCun et al. (1998), Frasconi et al. (1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 141,
                                "start": 138
                            }
                        ],
                        "text": "DAG connections within the input and/or output layer are also possible, as well as DAG-RNN architectures with no outputs, no inputs (e.g. HMMs), or even no inputs and no outputs (e.g. Markov chains)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 69
                            }
                        ],
                        "text": "This is essentially the connectivity pattern of an input-output HMM (Bengio and Frasconi, 1996), augmented with a backward chain of hidden states."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14298205,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "25bdc473f8377c1200adbd691fbb3cc77fa7bf70",
            "isKey": false,
            "numCitedBy": 338,
            "numCiting": 96,
            "paperAbstract": {
                "fragments": [],
                "text": "We consider problems of sequence processing and propose a solution based on a discrete-state model in order to represent past context. We introduce a recurrent connectionist architecture having a modular structure that associates a subnetwork to each state. The model has a statistical interpretation we call input-output hidden Markov model (IOHMM). It can be trained by the estimation-maximization (EM) or generalized EM (GEM) algorithms, considering state trajectories as missing data, which decouples temporal credit assignment and actual parameter estimation. The model presents similarities to hidden Markov models (HMMs), but allows us to map input sequences to output sequences, using the same processing style as recurrent neural networks. IOHMMs are trained using a more discriminant learning paradigm than HMMs, while potentially taking advantage of the EM algorithm. We demonstrate that IOHMMs are well suited for solving grammatical inference problems on a benchmark problem. Experimental results are presented for the seven Tomita grammars, showing that these adaptive models can attain excellent generalization."
            },
            "slug": "Input-output-HMMs-for-sequence-processing-Bengio-Frasconi",
            "title": {
                "fragments": [],
                "text": "Input-output HMMs for sequence processing"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is demonstrated that IOHMMs are well suited for solving grammatical inference problems on a benchmark problem and able to map input sequences to output sequences, using the same processing style as recurrent neural networks."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Neural Networks"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2028880"
                        ],
                        "name": "G. Pollastri",
                        "slug": "G.-Pollastri",
                        "structuredName": {
                            "firstName": "Gianluca",
                            "lastName": "Pollastri",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Pollastri"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39788994"
                        ],
                        "name": "Darisz Przybylski",
                        "slug": "Darisz-Przybylski",
                        "structuredName": {
                            "firstName": "Darisz",
                            "lastName": "Przybylski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Darisz Przybylski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49967661"
                        ],
                        "name": "B. Rost",
                        "slug": "B.-Rost",
                        "structuredName": {
                            "firstName": "Burkhard",
                            "lastName": "Rost",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Rost"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144902513"
                        ],
                        "name": "P. Baldi",
                        "slug": "P.-Baldi",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Baldi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Baldi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18221187,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4bfaa2c7691f98eae380d1a83bfdbb15dfac9946",
            "isKey": false,
            "numCitedBy": 775,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "Secondary structure predictions are increasingly becoming the workhorse for several methods aiming at predicting protein structure and function. Here we use ensembles of bidirectional recurrent neural network architectures, PSI‐BLAST‐derived profiles, and a large nonredundant training set to derive two new predictors: (a) the second version of the SSpro program for secondary structure classification into three categories and (b) the first version of the SSpro8 program for secondary structure classification into the eight classes produced by the DSSP program. We describe the results of three different test sets on which SSpro achieved a sustained performance of about 78% correct prediction. We report confusion matrices, compare PSI‐BLAST to BLAST‐derived profiles, and assess the corresponding performance improvements. SSpro and SSpro8 are implemented as web servers, available together with other structural feature predictors at: http://promoter.ics.uci.edu/BRNN‐PRED/. Proteins 2002;47:228–235. © 2002 Wiley‐Liss, Inc."
            },
            "slug": "Improving-the-prediction-of-protein-secondary-in-Pollastri-Przybylski",
            "title": {
                "fragments": [],
                "text": "Improving the prediction of protein secondary structure in three and eight classes using recurrent neural networks and profiles"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Ensembles of bidirectional recurrent neural network architectures, PSI‐BLAST‐derived profiles, and a large nonredundant training set are used to derive two new predictors for secondary structure predictions, and confusion matrices are reported."
            },
            "venue": {
                "fragments": [],
                "text": "Proteins"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1785465"
                        ],
                        "name": "P. Fariselli",
                        "slug": "P.-Fariselli",
                        "structuredName": {
                            "firstName": "Piero",
                            "lastName": "Fariselli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Fariselli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2886611"
                        ],
                        "name": "O. Olmea",
                        "slug": "O.-Olmea",
                        "structuredName": {
                            "firstName": "O.",
                            "lastName": "Olmea",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Olmea"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145786321"
                        ],
                        "name": "A. Valencia",
                        "slug": "A.-Valencia",
                        "structuredName": {
                            "firstName": "Alfonso",
                            "lastName": "Valencia",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Valencia"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1753858"
                        ],
                        "name": "R. Casadio",
                        "slug": "R.-Casadio",
                        "structuredName": {
                            "firstName": "Rita",
                            "lastName": "Casadio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Casadio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18566824,
            "fieldsOfStudy": [
                "Computer Science",
                "Biology"
            ],
            "id": "64453fd476063a6910a4ce12d2e0359362b279a1",
            "isKey": false,
            "numCitedBy": 221,
            "numCiting": 64,
            "paperAbstract": {
                "fragments": [],
                "text": "Contact maps of proteins are predicted with neural network-based methods, using as input codings of increasing complexity including evolutionary information, sequence conservation, correlated mutations and predicted secondary structures. Neural networks are trained on a data set comprising the contact maps of 173 non-homologous proteins as computed from their well resolved three-dimensional structures. Proteins are selected from the Protein Data Bank database provided that they align with at least 15 similar sequences in the corresponding families. The predictors are trained to learn the association rules between the covalent structure of each protein and its contact map with a standard back propagation algorithm and tested on the same protein set with a cross-validation procedure. Our results indicate that the method can assign protein contacts with an average accuracy of 0.21 and with an improvement over a random predictor of a factor >6, which is higher than that previously obtained with methods only based either on neural networks or on correlated mutations. Furthermore, filtering the network outputs with a procedure based on the residue coordination numbers, the accuracy of predictions increases up to 0.25 for all the proteins, with an 8-fold deviation from a random predictor. These scores are the highest reported so far for predicting protein contact maps."
            },
            "slug": "Prediction-of-contact-maps-with-neural-networks-and-Fariselli-Olmea",
            "title": {
                "fragments": [],
                "text": "Prediction of contact maps with neural networks and correlated mutations."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The results indicate that the method can assign protein contacts with an average accuracy of 0.21 and with an improvement over a random predictor of a factor >6, which is higher than that previously obtained with methods only based either on neural networks or on correlated mutations."
            },
            "venue": {
                "fragments": [],
                "text": "Protein engineering"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2571487"
                        ],
                        "name": "C. Yanover",
                        "slug": "C.-Yanover",
                        "structuredName": {
                            "firstName": "Chen",
                            "lastName": "Yanover",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Yanover"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30400079"
                        ],
                        "name": "Yair Weiss",
                        "slug": "Yair-Weiss",
                        "structuredName": {
                            "firstName": "Yair",
                            "lastName": "Weiss",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yair Weiss"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1980213,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ef3b7dfe68dbd78e609e95b0f8a595e19cdabb9b",
            "isKey": false,
            "numCitedBy": 133,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "Side-chain prediction is an important subtask in the protein-folding problem. We show that finding a minimal energy side-chain configuration is equivalent to performing inference in an undirected graphical model. The graphical model is relatively sparse yet has many cycles. We used this equivalence to assess the performance of approximate inference algorithms in a real-world setting. Specifically we compared belief propagation (BP), generalized BP (GBP) and naive mean field (MF). \n \nIn cases where exact inference was possible, max-product BP always found the global minimum of the energy (except in few cases where it failed to converge), while other approximation algorithms of similar complexity did not. In the full protein data set, max-product BP always found a lower energy configuration than the other algorithms, including a widely used protein-folding software (SCWRL)."
            },
            "slug": "Approximate-Inference-and-Protein-Folding-Yanover-Weiss",
            "title": {
                "fragments": [],
                "text": "Approximate Inference and Protein-Folding"
            },
            "tldr": {
                "abstractSimilarityScore": 64,
                "text": "It is shown that finding a minimal energy side-chain configuration is equivalent to performing inference in an undirected graphical model, and this equivalence was used to assess the performance of approximate inference algorithms in a real-world setting."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1774524"
                        ],
                        "name": "J. Gorodkin",
                        "slug": "J.-Gorodkin",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Gorodkin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gorodkin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145467231"
                        ],
                        "name": "O. Lund",
                        "slug": "O.-Lund",
                        "structuredName": {
                            "firstName": "Ole",
                            "lastName": "Lund",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Lund"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3175570"
                        ],
                        "name": "C. A. Andersen",
                        "slug": "C.-A.-Andersen",
                        "structuredName": {
                            "firstName": "Claus",
                            "lastName": "Andersen",
                            "middleNames": [
                                "A.",
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. A. Andersen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8169197"
                        ],
                        "name": "S. Brunak",
                        "slug": "S.-Brunak",
                        "structuredName": {
                            "firstName": "Søren",
                            "lastName": "Brunak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Brunak"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3111527,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f75f7d3fe11208c6d4287fc789301c12393aaa7c",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 71,
            "paperAbstract": {
                "fragments": [],
                "text": "Correlations between sequence separation (in residues) and distance (in Angstrom) of any pair of amino acids in polypeptide chains are investigated. For each sequence separation we define a distance threshold. For pairs of amino acids where the distance between C alpha atoms is smaller than the threshold, a characteristic sequence (logo) motif, is found. The motifs change as the sequence separation increases: for small separations they consist of one peak located in between the two residues, then additional peaks at these residues appear, and finally the center peak smears out for very large separations. We also find correlations between the residues in the center of the motif. This and other statistical analysis are used to design neural networks with enhanced performance compared to earlier work. Importantly, the statistical analysis explains why neural networks perform better than simple statistical data-driven approaches such as pair probability density functions. The statistical results also explain characteristics of the network performance for increasing sequence separation. The improvement of the new network design is significant in the sequence separation range 10-30 residues. Finally, we find that the performance curve for increasing sequence separation is directly correlated to the corresponding information content. A WWW server, distanceP, is available at http://www.cbs.dtu.dk/services/distanceP/."
            },
            "slug": "Using-Sequence-Motifs-for-Enhanced-Neural-Network-Gorodkin-Lund",
            "title": {
                "fragments": [],
                "text": "Using Sequence Motifs for Enhanced Neural Network Prediction of Protein Distance Constraints"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The statistical analysis explains why neural networks perform better than simple statistical data-driven approaches such as pair probability density functions and finds that the performance curve for increasing sequence separation is directly correlated to the corresponding information content."
            },
            "venue": {
                "fragments": [],
                "text": "ISMB"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144902513"
                        ],
                        "name": "P. Baldi",
                        "slug": "P.-Baldi",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Baldi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Baldi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2952703"
                        ],
                        "name": "Y. Chauvin",
                        "slug": "Y.-Chauvin",
                        "structuredName": {
                            "firstName": "Yves",
                            "lastName": "Chauvin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Chauvin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 342,
                                "start": 200
                            }
                        ],
                        "text": "Although this approach has not been applied systematically to many large-scale problems, by itself it is not new and can be traced, in more or less obscure form, to a number of publications including Baldi and Chauvin (1996), Bengio and Frasconi (1996), Sperduti and Starita (1997), Goller (1997), LeCun et al. (1998), Frasconi et al. (1998). What is new here is the derivation of a number of specific classes of architectures that can process a wide range of data structures with variable sizes and dimensions together with their systematic application to protein structure prediction problems."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 695,
                                "start": 200
                            }
                        ],
                        "text": "Although this approach has not been applied systematically to many large-scale problems, by itself it is not new and can be traced, in more or less obscure form, to a number of publications including Baldi and Chauvin (1996), Bengio and Frasconi (1996), Sperduti and Starita (1997), Goller (1997), LeCun et al. (1998), Frasconi et al. (1998). What is new here is the derivation of a number of specific classes of architectures that can process a wide range of data structures with variable sizes and dimensions together with their systematic application to protein structure prediction problems. The results we describe expand and improve on those previously reported in Pollastri et al. (2003) associated with the contact map predictor that obtained results similar to the CORNET predictor of Fariselli et al."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 181,
                                "start": 157
                            }
                        ],
                        "text": "…systematically to many large-scale problems, by itself it is not new and can be traced, in more or less obscure form, to a number of publications including Baldi and Chauvin (1996), Bengio and Frasconi (1996), Sperduti and Starita (1997), Goller (1997), LeCun et al. (1998), Frasconi et al. (1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 318,
                                "start": 200
                            }
                        ],
                        "text": "Although this approach has not been applied systematically to many large-scale problems, by itself it is not new and can be traced, in more or less obscure form, to a number of publications including Baldi and Chauvin (1996), Bengio and Frasconi (1996), Sperduti and Starita (1997), Goller (1997), LeCun et al. (1998), Frasconi et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 818,
                                "start": 200
                            }
                        ],
                        "text": "Although this approach has not been applied systematically to many large-scale problems, by itself it is not new and can be traced, in more or less obscure form, to a number of publications including Baldi and Chauvin (1996), Bengio and Frasconi (1996), Sperduti and Starita (1997), Goller (1997), LeCun et al. (1998), Frasconi et al. (1998). What is new here is the derivation of a number of specific classes of architectures that can process a wide range of data structures with variable sizes and dimensions together with their systematic application to protein structure prediction problems. The results we describe expand and improve on those previously reported in Pollastri et al. (2003) associated with the contact map predictor that obtained results similar to the CORNET predictor of Fariselli et al. (2001) during the CASP5 (Critical Assessment of Techniques for Protein Structure Prediction) experiment (http://predictioncenter."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 225,
                                "start": 200
                            }
                        ],
                        "text": "Although this approach has not been applied systematically to many large-scale problems, by itself it is not new and can be traced, in more or less obscure form, to a number of publications including Baldi and Chauvin (1996), Bengio and Frasconi (1996), Sperduti and Starita (1997), Goller (1997), LeCun et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17404701,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0bdedf988d9a1de26d949daee0c0ed768510e3b7",
            "isKey": false,
            "numCitedBy": 55,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a hybrid modeling approach where the parameters of a model are calculated and modulated by another model, typically a neural network (NN), to avoid both overfitting and underfitting. We develop the approach for the case of Hidden Markov Models (HMMs), by deriving a class of hybrid HMM/NN architectures. These architectures can be trained with unified algorithms that blend HMM dynamic programming with NN backpropagation. In the case of complex data, mixtures of HMMs or modulated HMMs must be used. NNs can then be applied both to the parameters of each single HMM, and to the switching or modulation of the models, as a function of input or context. Hybrid HMM/NN architectures provide a flexible NN parameterization for the control of model structure and complexity. At the same time, they can capture distributions that, in practice, are inaccessible to single HMMs. The HMM/NN hybrid approach is tested, in its simplest form, by constructing a model of the immunoglobulin protein family. A hybrid model is trained, and a multiple alignment derived, with less than a fourth of the number of parameters used with previous single HMMs."
            },
            "slug": "Hybrid-Modeling,-HMM/NN-Architectures,-and-Protein-Baldi-Chauvin",
            "title": {
                "fragments": [],
                "text": "Hybrid Modeling, HMM/NN Architectures, and Protein Applications"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The HMM/NN hybrid approach is tested, in its simplest form, by constructing a model of the immunoglobulin protein family, with less than a fourth of the number of parameters used with previous single HMMs."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1785465"
                        ],
                        "name": "P. Fariselli",
                        "slug": "P.-Fariselli",
                        "structuredName": {
                            "firstName": "Piero",
                            "lastName": "Fariselli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Fariselli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1753858"
                        ],
                        "name": "R. Casadio",
                        "slug": "R.-Casadio",
                        "structuredName": {
                            "firstName": "Rita",
                            "lastName": "Casadio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Casadio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 102
                            }
                        ],
                        "text": "Various algorithms for the prediction of contacts (Shindyalov et al., 1994, Olmea and Valencia, 1997, Fariselli and Casadio, 1999, 2000, Pollastri et al., 2001a), distances (Aszodi et al., 1995, Lund et al., 1997, Gorodkin et al., 1999), and contact maps (Fariselli et al., 2001) have been…"
                    },
                    "intents": []
                }
            ],
            "corpusId": 6954194,
            "fieldsOfStudy": [
                "Biology",
                "Computer Science"
            ],
            "id": "2c72876b29bee6ae7625e827f498d6fc68c6f73e",
            "isKey": false,
            "numCitedBy": 177,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a method based on neural networks for predicting contact maps of proteins using as input chemicophysical and evolutionary information. Neural networks are trained on a data set comprising the contact maps of 200 non-homologous proteins of well resolved three-dimensional structures. The systems learn the association rules between the covalent structure of each protein and its correspondent contact map by means of a standard back propagation algorithm. Validation of the predictor on the training set and on 408 proteins of known structure which are not homologous to those contained in the training set indicate that this method scores higher than statistical approaches previously described and based on correlated mutations and sequence information."
            },
            "slug": "A-neural-network-based-predictor-of-residue-in-Fariselli-Casadio",
            "title": {
                "fragments": [],
                "text": "A neural network based predictor of residue contacts in proteins."
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A method based on neural networks for predicting contact maps of proteins using as input chemicophysical and evolutionary information that scores higher than statistical approaches previously described and based on correlated mutations and sequence information is described."
            },
            "venue": {
                "fragments": [],
                "text": "Protein engineering"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145467231"
                        ],
                        "name": "O. Lund",
                        "slug": "O.-Lund",
                        "structuredName": {
                            "firstName": "Ole",
                            "lastName": "Lund",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Lund"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4229781"
                        ],
                        "name": "K. Frimand",
                        "slug": "K.-Frimand",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Frimand",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Frimand"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1774524"
                        ],
                        "name": "J. Gorodkin",
                        "slug": "J.-Gorodkin",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Gorodkin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gorodkin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145819543"
                        ],
                        "name": "H. Bohr",
                        "slug": "H.-Bohr",
                        "structuredName": {
                            "firstName": "Henrik",
                            "lastName": "Bohr",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Bohr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144145286"
                        ],
                        "name": "J. Bohr",
                        "slug": "J.-Bohr",
                        "structuredName": {
                            "firstName": "Jakob",
                            "lastName": "Bohr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bohr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107831487"
                        ],
                        "name": "J. Hansen",
                        "slug": "J.-Hansen",
                        "structuredName": {
                            "firstName": "John-E.",
                            "lastName": "Hansen",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hansen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8169197"
                        ],
                        "name": "S. Brunak",
                        "slug": "S.-Brunak",
                        "structuredName": {
                            "firstName": "Søren",
                            "lastName": "Brunak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Brunak"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15809496,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6f73b75994e3ce860fe23a6497b764c4f3676aed",
            "isKey": false,
            "numCitedBy": 154,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "We predict interatomic Calpha distances by two independent data driven methods. The first method uses statistically derived probability distributions of the pairwise distance between two amino acids, whilst the latter method consists of a neural network prediction approach equipped with windows taking the context of the two residues into account. These two methods are used to predict whether distances in independent test sets were above or below given thresholds. We investigate which distance thresholds produce the most information-rich constraints and, in turn, the optimal performance of the two methods. The predictions are based on a data set derived using a new threshold which defines when sequence similarity implies structural similarity. We show that distances in proteins are predicted more accurately by neural networks than by probability density functions. We show that the accuracy of the predictions can be further increased by using sequence profiles. A threading method based on the predicted distances is presented. A homepage with software, predictions and data related to this paper is available at http://www.cbs.dtu.dk/services/CPHmodels/."
            },
            "slug": "Protein-distance-constraints-predicted-by-neural-Lund-Frimand",
            "title": {
                "fragments": [],
                "text": "Protein distance constraints predicted by neural networks and probability density functions."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "It is shown that distances in proteins are predicted more accurately by neural networks than by probability density functions, and that the accuracy of the predictions can be further increased by using sequence profiles."
            },
            "venue": {
                "fragments": [],
                "text": "Protein engineering"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2118773845"
                        ],
                        "name": "D. Baker",
                        "slug": "D.-Baker",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Baker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Baker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152390738"
                        ],
                        "name": "A. Sali",
                        "slug": "A.-Sali",
                        "structuredName": {
                            "firstName": "Andrej",
                            "lastName": "Sali",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Sali"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 215,
                                "start": 195
                            }
                        ],
                        "text": "We are currently combining the contact map predictors with a 3D reconstruction algorithm to produce a complete predictor of protein tertiary structures that is complementary to other approaches (Baker and Sali, 2001, Simons et al., 2001), and can be used for largescale structural proteomic projects."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 501,
                                "start": 88
                            }
                        ],
                        "text": "Predictors for the first step based on recurrent neural networks have been described in Baldi and Brunak (2001), Pollastri et al. (2001a,b). Methods to address the third step have been developed in the NMR literature (Nilges et al., 1988a,b) and elsewhere (Vendruscolo et al., 1997) and typically use ideas from distance geometry, molecular dynamics, and stochastic optimization to recover 3D coordinates from contacts. These methods, however, will not be discussed here (see Yanover and Weiss (2002) for an application of graphical models to the problem of placing side chains)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 88
                            }
                        ],
                        "text": "Predictors for the first step based on recurrent neural networks have been described in Baldi and Brunak (2001), Pollastri et al."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 7193705,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "2a37e40d53eb79e0543c2b031b44a4f0cf2e4234",
            "isKey": false,
            "numCitedBy": 1547,
            "numCiting": 70,
            "paperAbstract": {
                "fragments": [],
                "text": "Genome sequencing projects are producing linear amino acid sequences, but full understanding of the biological role of these proteins will require knowledge of their structure and function. Although experimental structure determination methods are providing high-resolution structure information about a subset of the proteins, computational structure prediction methods will provide valuable information for the large fraction of sequences whose structures will not be determined experimentally. The first class of protein structure prediction methods, including threading and comparative modeling, rely on detectable similarity spanning most of the modeled sequence and at least one known structure. The second class of methods, de novo or ab initio methods, predict the structure from sequence alone, without relying on similarity at the fold level between the modeled sequence and any of the known structures. In this Viewpoint, we begin by describing the essential features of the methods, the accuracy of the models, and their application to the prediction and understanding of protein function, both for single proteins and on the scale of whole genomes. We then discuss the important role that protein structure prediction methods play in the growing worldwide effort in structural genomics."
            },
            "slug": "Protein-Structure-Prediction-and-Structural-Baker-Sali",
            "title": {
                "fragments": [],
                "text": "Protein Structure Prediction and Structural Genomics"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This Viewpoint begins by describing the essential features of the methods, the accuracy of the models, and their application to the prediction and understanding of protein function, both for single proteins and on the scale of whole genomes."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2028880"
                        ],
                        "name": "G. Pollastri",
                        "slug": "G.-Pollastri",
                        "structuredName": {
                            "firstName": "Gianluca",
                            "lastName": "Pollastri",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Pollastri"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144902513"
                        ],
                        "name": "P. Baldi",
                        "slug": "P.-Baldi",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Baldi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Baldi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48965970"
                        ],
                        "name": "P. Fariselli",
                        "slug": "P.-Fariselli",
                        "structuredName": {
                            "firstName": "Pietro",
                            "lastName": "Fariselli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Fariselli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1753858"
                        ],
                        "name": "R. Casadio",
                        "slug": "R.-Casadio",
                        "structuredName": {
                            "firstName": "Rita",
                            "lastName": "Casadio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Casadio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6244295,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d3f734ee319deb8512852941a2a9ebc33a891fd0",
            "isKey": false,
            "numCitedBy": 258,
            "numCiting": 69,
            "paperAbstract": {
                "fragments": [],
                "text": "Knowing the coordination number and relative solvent accessibility of all the residues in a protein is crucial for deriving constraints useful in modeling protein folding and protein structure and in scoring remote homology searches. We develop ensembles of bidirectional recurrent neural network architectures to improve the state of the art in both contact and accessibility prediction, leveraging a large corpus of curated data together with evolutionary information. The ensembles are used to discriminate between two different states of residue contacts or relative solvent accessibility, higher or lower than a threshold determined by the average value of the residue distribution or the accessibility cutoff. For coordination numbers, the ensemble achieves performances ranging within 70.6–73.9% depending on the radius adopted to discriminate contacts (6Å–12Å). These performances represent gains of 16–20% over the baseline statistical predictor, always assigning an amino acid to the largest class, and are 4–7% better than any previous method. A combination of different radius predictors further improves performance. For accessibility thresholds in the relevant 15–30% range, the ensemble consistently achieves a performance above 77%, which is 10–16% above the baseline prediction and better than other existing predictors, by up to several percentage points. For both problems, we quantify the improvement due to evolutionary information in the form of PSI‐BLAST‐generated profiles over BLAST profiles. The prediction programs are implemented in the form of two web servers, CONpro and ACCpro, available at http://promoter.ics.uci.edu/BRNN‐PRED/. Proteins 2002;47:142–153. © 2002 Wiley‐Liss, Inc."
            },
            "slug": "Prediction-of-coordination-number-and-relative-in-Pollastri-Baldi",
            "title": {
                "fragments": [],
                "text": "Prediction of coordination number and relative solvent accessibility in proteins"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Ensembles of bidirectional recurrent neural network architectures are developed to improve the state of the art in both contact and accessibility prediction, leveraging a large corpus of curated data together with evolutionary information."
            },
            "venue": {
                "fragments": [],
                "text": "Proteins"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144902513"
                        ],
                        "name": "P. Baldi",
                        "slug": "P.-Baldi",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Baldi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Baldi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2028880"
                        ],
                        "name": "G. Pollastri",
                        "slug": "G.-Pollastri",
                        "structuredName": {
                            "firstName": "Gianluca",
                            "lastName": "Pollastri",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Pollastri"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16576859,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3eecec6d450dbd7e3eb104a276ef5876a80700fd",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "or function (or both) is largely unknown. Proteomics is the protein counterpart to genomics, the large-scale analysis of complete genomes. Proteomes contain a cell’s total protein expression at a given time. Proteome analysis not only deals with determining protein-encoding genes’ sequence and function, but is also strongly concerned with the precise biochemical state of each protein in its posttranslational form—that is, the form it takes after it has been translated from its original DNA encoding. Traditional experimental techniques for determining a protein’s structure and function, such as x-ray diffraction or Nuclear Magnetic Resonance methods, remain slow and laborious, and do not scale up to current sequencing speeds. Furthermore, using experiments to determine how proteins function is a daunting task: Protein interactions are complex, and their native operating environments are very specific, which can be difficult to replicate in the laboratory. Researchers are developing many new highthroughput experimental techniques for proteomics applications, including mass spectrometry and protein chips. Still, given proteins’ fundamental importance to biology, biotechnology, and medicine, we must continue developing computer methods that can rapidly sift through massive amounts of data and help determine the structure and function of all the proteins in a given genome. We’re applying machine-learning methods to proteomic problems, and have developed a novel strategy for completely predicting protein 3D coordinates. The strategy has three stages: structural features prediction, topology prediction, and coordinate prediction. Here, we offer an overview of the domain and our machine-learning techniques, and describe the software suite we’ve developed, which is available at http://promoter.ics.uci.edu/BRNN-PRED/."
            },
            "slug": "A-Machine-Learning-Strategy-for-Protein-Analysis-Baldi-Pollastri",
            "title": {
                "fragments": [],
                "text": "A Machine-Learning Strategy for Protein Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work is applying machine-learning methods to proteomic problems, and has developed a novel strategy for completely predicting protein 3D coordinates, which has three stages: structural features prediction, topology prediction, and coordinate prediction."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Intell. Syst."
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36975577"
                        ],
                        "name": "K. Simons",
                        "slug": "K.-Simons",
                        "structuredName": {
                            "firstName": "Kim T.",
                            "lastName": "Simons",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Simons"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144465303"
                        ],
                        "name": "C. Strauss",
                        "slug": "C.-Strauss",
                        "structuredName": {
                            "firstName": "Charlie",
                            "lastName": "Strauss",
                            "middleNames": [
                                "E.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Strauss"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3408909"
                        ],
                        "name": "D. Baker",
                        "slug": "D.-Baker",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Baker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Baker"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 236,
                                "start": 217
                            }
                        ],
                        "text": "We are currently combining the contact map predictors with a 3D reconstruction algorithm to produce a complete predictor of protein tertiary structures that is complementary to other approaches (Baker and Sali, 2001, Simons et al., 2001), and can be used for largescale structural proteomic projects."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8392871,
            "fieldsOfStudy": [
                "Chemistry",
                "Biology"
            ],
            "id": "967cfc9237bf789e25ef81efca203700c9ffe51f",
            "isKey": false,
            "numCitedBy": 191,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "We present the results of a large-scale testing of the ROSETTA method for ab initio protein structure prediction. Models were generated for two independently generated lists of small proteins (up to 150 amino acid residues), and the results were evaluated using traditional rmsd based measures and a novel measure based on the structure-based comparison of the models to the structures in the PDB using DALI. For 111 of 136 all alpha and alpha/beta proteins 50 to 150 residues in length, the method produced at least one model within 7 A rmsd of the native structure in 1000 attempts. For 60 of these proteins, the closest structure match in the PDB to at least one of the ten most frequently generated conformations was found to be structurally related (four standard deviations above background) to the native protein. These results suggest that ab initio structure prediction approaches may soon be useful for generating low resolution models and identifying distantly related proteins with similar structures and perhaps functions for these classes of proteins on the genome scale."
            },
            "slug": "Prospects-for-ab-initio-protein-structural-Simons-Strauss",
            "title": {
                "fragments": [],
                "text": "Prospects for ab initio protein structural genomics."
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The results suggest that ab initio structure prediction approaches may soon be useful for generating low resolution models and identifying distantly related proteins with similar structures and perhaps functions for these classes of proteins on the genome scale."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of molecular biology"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117167085"
                        ],
                        "name": "M. Vendruscolo",
                        "slug": "M.-Vendruscolo",
                        "structuredName": {
                            "firstName": "Michele",
                            "lastName": "Vendruscolo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Vendruscolo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2762039"
                        ],
                        "name": "E. Kussell",
                        "slug": "E.-Kussell",
                        "structuredName": {
                            "firstName": "Edo",
                            "lastName": "Kussell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Kussell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2426224"
                        ],
                        "name": "E. Domany",
                        "slug": "E.-Domany",
                        "structuredName": {
                            "firstName": "Eytan",
                            "lastName": "Domany",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Domany"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 140,
                                "start": 116
                            }
                        ],
                        "text": "Methods to address the third step have been developed in the NMR literature (Nilges et al., 1988a,b) and elsewhere (Vendruscolo et al., 1997) and typically use ideas from distance geometry, molecular dynamics, and stochastic optimization to recover 3D coordinates from contacts."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": ", 1988a,b) and elsewhere (Vendruscolo et al., 1997) and typically use ideas from distance geometry, molecular dynamics, and stochastic optimization to recover 3D coordinates from contacts."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Although this is beyond the scope of this article, our experience (see also Vendruscolo et al. (1997)) shows that the 12Åmaps are the most useful for 3D reconstruction."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 199,
                                "start": 174
                            }
                        ],
                        "text": "6Å 8Å 10Å 12Å Non-Contact 99.9 99.8 99.2 98.9\nContact 71.2 65.3 52.2 46.6 All 98.5 97.1 93.2 88.5\nAlthough this is beyond the scope of this article, our experience (see also Vendruscolo et al. (1997)) shows that the 12Å maps are the most useful for 3D reconstruction."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8735298,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8d2d547f564162b1b73d75d7f8eaf2dad60e6589",
            "isKey": true,
            "numCitedBy": 259,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Recovery-of-protein-structure-from-contact-maps.-Vendruscolo-Kussell",
            "title": {
                "fragments": [],
                "text": "Recovery of protein structure from contact maps."
            },
            "venue": {
                "fragments": [],
                "text": "Folding & design"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2598638"
                        ],
                        "name": "U. Hobohm",
                        "slug": "U.-Hobohm",
                        "structuredName": {
                            "firstName": "Uwe",
                            "lastName": "Hobohm",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Hobohm"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2059653099"
                        ],
                        "name": "M. Scharf",
                        "slug": "M.-Scharf",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Scharf",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Scharf"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2069507994"
                        ],
                        "name": "R. Schneider",
                        "slug": "R.-Schneider",
                        "structuredName": {
                            "firstName": "Reinhard",
                            "lastName": "Schneider",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Schneider"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144882390"
                        ],
                        "name": "C. Sander",
                        "slug": "C.-Sander",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Sander",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Sander"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 196,
                                "start": 177
                            }
                        ],
                        "text": "SMALL and XLARGE: The training and testing data sets in the SMALL and XLARGE sets are extracted from the Protein Data Bank (PDB) of solved structures using the PDB select list (Hobohm et al., 1992) of February 2001, containing 1520 proteins."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2558294,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b67b4991dffe2b367cd9ce5087e11fd5ee43abc5",
            "isKey": false,
            "numCitedBy": 778,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "The Protein Data Bank currently contains about 600 data sets of three‐dimensional protein coordinates determined by X‐ray crystallography or NMR. There is considerable redundancy in the data base, as many protein pairs are identical or very similar in sequence. However, statistical analyses of protein sequence‐structure relations require nonredundant data. We have developed two algorithms to extract from the data base representative sets of protein chains with maximum coverage and minimum redundancy. The first algorithm focuses on optimizing a particular property of the selected proteins and works by successive selection of proteins from an ordered list and exclusion of all neighbors of each selected protein. The other algorithm aims at maximizing the size of the selected set and works by successive thinning out of clusters of similar proteins. Both algorithms are generally applicable to other data bases in which criteria of similarity can be defined and relate to problems in graph theory. The largest nonredundant set extracted from the current release of the Protein Data Bank has 155 protein chains. In this set, no two proteins have sequence similarity higher than a certain cutoff (30% identical residues for aligned subsequences longer than 80 residues), yet all structurally unique protein families are represented. Periodically updated lists of representative data sets are available by electronic mail from the file server “netserv@embl‐heidelberg.de.” The selection may be useful in statistical approaches to protein folding as well as in the analysis and documentation of the known spectrum of three‐dimensional protein structures."
            },
            "slug": "Selection-of-representative-protein-data-sets-Hobohm-Scharf",
            "title": {
                "fragments": [],
                "text": "Selection of representative protein data sets"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Two algorithms are developed to extract from the data base representative sets of protein chains with maximum coverage and minimum redundancy and are generally applicable to other data bases in which criteria of similarity can be defined and relate to problems in graph theory."
            },
            "venue": {
                "fragments": [],
                "text": "Protein science : a publication of the Protein Society"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2145522"
                        ],
                        "name": "I. Shindyalov",
                        "slug": "I.-Shindyalov",
                        "structuredName": {
                            "firstName": "Ilya",
                            "lastName": "Shindyalov",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Shindyalov"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47715456"
                        ],
                        "name": "N. A. Kolchanov",
                        "slug": "N.-A.-Kolchanov",
                        "structuredName": {
                            "firstName": "Nicolay",
                            "lastName": "Kolchanov",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. A. Kolchanov"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144882390"
                        ],
                        "name": "C. Sander",
                        "slug": "C.-Sander",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Sander",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Sander"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 74,
                                "start": 51
                            }
                        ],
                        "text": "Various algorithms for the prediction of contacts (Shindyalov et al., 1994, Olmea and Valencia, 1997, Fariselli and Casadio, 1999, 2000, Pollastri et al., 2001a), distances (Aszodi et al., 1995, Lund et al., 1997, Gorodkin et al., 1999), and contact maps (Fariselli et al., 2001) have been…"
                    },
                    "intents": []
                }
            ],
            "corpusId": 22177305,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "662b4c217381e5c75eb8fa848bfc3b4e886e8c96",
            "isKey": false,
            "numCitedBy": 269,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A method has been developed to detect pairs of positions with correlated mutations in protein multiple sequence alignments. The method is based on reconstruction of the phylogenetic tree for a set of sequences and statistical analysis of the distribution of mutations in the branches of the tree. The database of homology-derived protein structures (HSSP) is used as the source of multiple sequence alignments for proteins of known three-dimensional structure. We analyse pairs of positions with correlated mutations in 67 protein families and show quantitatively that the presence of such positions is a typical feature of protein families. A significant but weak tendency is observed for correlated residue pairs to be close in the three-dimensional structure. With further improvements, methods of this type may be useful for the prediction of residue--residue contacts and subsequent prediction of protein structure using distance geometry algorithms. In conclusion, we suggest a new experimental approach to protein structure determination in which selection of functional mutants after random mutagenesis and analysis of correlated mutations provide sufficient proximity constraints for calculation of the protein fold."
            },
            "slug": "Can-three-dimensional-contacts-in-protein-be-by-of-Shindyalov-Kolchanov",
            "title": {
                "fragments": [],
                "text": "Can three-dimensional contacts in protein structures be predicted by analysis of correlated mutations?"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A new experimental approach to protein structure determination is suggested in which selection of functional mutants after random mutagenesis and analysis of correlated mutations provide sufficient proximity constraints for calculation of the protein fold."
            },
            "venue": {
                "fragments": [],
                "text": "Protein engineering"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688882"
                        ],
                        "name": "Yann LeCun",
                        "slug": "Yann-LeCun",
                        "structuredName": {
                            "firstName": "Yann",
                            "lastName": "LeCun",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yann LeCun"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52184096"
                        ],
                        "name": "L. Bottou",
                        "slug": "L.-Bottou",
                        "structuredName": {
                            "firstName": "Léon",
                            "lastName": "Bottou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Bottou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1751762"
                        ],
                        "name": "Yoshua Bengio",
                        "slug": "Yoshua-Bengio",
                        "structuredName": {
                            "firstName": "Yoshua",
                            "lastName": "Bengio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yoshua Bengio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1721248"
                        ],
                        "name": "P. Haffner",
                        "slug": "P.-Haffner",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Haffner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Haffner"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14542261,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "162d958ff885f1462aeda91cd72582323fd6a1f4",
            "isKey": false,
            "numCitedBy": 35268,
            "numCiting": 248,
            "paperAbstract": {
                "fragments": [],
                "text": "Multilayer neural networks trained with the back-propagation algorithm constitute the best example of a successful gradient based learning technique. Given an appropriate network architecture, gradient-based learning algorithms can be used to synthesize a complex decision surface that can classify high-dimensional patterns, such as handwritten characters, with minimal preprocessing. This paper reviews various methods applied to handwritten character recognition and compares them on a standard handwritten digit recognition task. Convolutional neural networks, which are specifically designed to deal with the variability of 2D shapes, are shown to outperform all other techniques. Real-life document recognition systems are composed of multiple modules including field extraction, segmentation recognition, and language modeling. A new learning paradigm, called graph transformer networks (GTN), allows such multimodule systems to be trained globally using gradient-based methods so as to minimize an overall performance measure. Two systems for online handwriting recognition are described. Experiments demonstrate the advantage of global training, and the flexibility of graph transformer networks. A graph transformer network for reading a bank cheque is also described. It uses convolutional neural network character recognizers combined with global training techniques to provide record accuracy on business and personal cheques. It is deployed commercially and reads several million cheques per day."
            },
            "slug": "Gradient-based-learning-applied-to-document-LeCun-Bottou",
            "title": {
                "fragments": [],
                "text": "Gradient-based learning applied to document recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This paper reviews various methods applied to handwritten character recognition and compares them on a standard handwritten digit recognition task, and Convolutional neural networks are shown to outperform all other techniques."
            },
            "venue": {
                "fragments": [],
                "text": "Proc. IEEE"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144038421"
                        ],
                        "name": "F. Pazos",
                        "slug": "F.-Pazos",
                        "structuredName": {
                            "firstName": "Florencio",
                            "lastName": "Pazos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Pazos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1401633900"
                        ],
                        "name": "M. Helmer-Citterich",
                        "slug": "M.-Helmer-Citterich",
                        "structuredName": {
                            "firstName": "Manuela",
                            "lastName": "Helmer-Citterich",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Helmer-Citterich"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31864533"
                        ],
                        "name": "G. Ausiello",
                        "slug": "G.-Ausiello",
                        "structuredName": {
                            "firstName": "Gabriele",
                            "lastName": "Ausiello",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Ausiello"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145786321"
                        ],
                        "name": "A. Valencia",
                        "slug": "A.-Valencia",
                        "structuredName": {
                            "firstName": "Alfonso",
                            "lastName": "Valencia",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Valencia"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 105
                            }
                        ],
                        "text": "A second type of input consideration is the use of profiles and correlated mutation (Gobel et al., 1994, Pazos et al., 1997, Olmea et al., 1999, Fariselli et al., 2001)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17654644,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "2fc8cd91a78b9ca4592c602532db1412fd2fd4cf",
            "isKey": false,
            "numCitedBy": 531,
            "numCiting": 73,
            "paperAbstract": {
                "fragments": [],
                "text": "Many proteins have evolved to form specific molecular complexes and the specificity of this interaction is essential for their function. The network of the necessary inter-residue contacts must consequently constrain the protein sequences to some extent. In other words, the sequence of an interacting protein must reflect the consequence of this process of adaptation. It is reasonable to assume that the sequence changes accumulated during the evolution of one of the interacting proteins must be compensated by changes in the other. Here we apply a method for detecting correlated changes in multiple sequence alignments to a set of interacting protein domains and show that positions where changes occur in a correlated fashion in the two interacting molecules tend to be close to the protein-protein interfaces. This leads to the possibility of developing a method for predicting contacting pairs of residues from the sequence alone. Such a method would not need the knowledge of the structure of the interacting proteins, and hence would be both radically different and more widely applicable than traditional docking methods. We indeed demonstrate here that the information about correlated sequence changes is sufficient to single out the right inter-domain docking solution amongst many wrong alternatives of two-domain proteins. The same approach is also used here in one case (haemoglobin) where we attempt to predict the interface of two different proteins rather than two protein domains. Finally, we report here a prediction about the inter-domain contact regions of the heat- shock protein Hsc70 based only on sequence information."
            },
            "slug": "Correlated-mutations-contain-information-about-Pazos-Helmer-Citterich",
            "title": {
                "fragments": [],
                "text": "Correlated mutations contain information about protein-protein interaction."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This work applies a method for detecting correlated changes in multiple sequence alignments to a set of interacting protein domains and shows that positions where changes occur in a correlated fashion in the two interacting molecules tend to be close to the protein-protein interfaces."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of molecular biology"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2886611"
                        ],
                        "name": "O. Olmea",
                        "slug": "O.-Olmea",
                        "structuredName": {
                            "firstName": "O.",
                            "lastName": "Olmea",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Olmea"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49967661"
                        ],
                        "name": "B. Rost",
                        "slug": "B.-Rost",
                        "structuredName": {
                            "firstName": "Burkhard",
                            "lastName": "Rost",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Rost"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145786321"
                        ],
                        "name": "A. Valencia",
                        "slug": "A.-Valencia",
                        "structuredName": {
                            "firstName": "Alfonso",
                            "lastName": "Valencia",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Valencia"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 891,
                                "start": 8
                            }
                        ],
                        "text": ", 1997, Olmea et al., 1999, Fariselli et al., 2001). Profiles, essentially in the form of alignment of homologous proteins, implicitly contain evolutionary and 3D structural information about related proteins. This information is relatively easy to collect using well-known alignment algorithms that ignore 3D structure and can be applied to very large data sets of proteins, including many proteins of unknown structure. The use of profiles is known to improve the prediction of secondary structure by several percentage points, presumably because secondary structure is more conserved than primary amino acid sequence. As in the case of secondary structure prediction, the input can be enriched by taking the profile vectors at positions i and j, yielding two 20-dimensional probability vectors. We use profiles derived using the PSI-BLAST program as described in Pollastri et al. (2001b). When a distant pair (i, j) of positions in a multiple alignment is considered, horizontal correlations in the sequences may exist (“correlated mutations”) that are completely lost when profiles with independent columns are used."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 16167106,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6e67413d33ea0896f8a1d3685d123526be6bdcc2",
            "isKey": false,
            "numCitedBy": 174,
            "numCiting": 112,
            "paperAbstract": {
                "fragments": [],
                "text": "Protein families are a rich source of information; sequence conservation and sequence correlation are two of the main properties that can be derived from the analysis of multiple sequence alignments. Sequence conservation is related to the direct evolutionary pressure to retain the chemical characteristics of some positions in order to maintain a given function. Sequence correlation is attributed to the small sequence adjustments needed to maintain protein stability against constant mutational drift. Here, we showed that sequence conservation and correlation were each frequently informative enough to detect incorrectly folded proteins. Furthermore, combining conservation, correlation, and polarity, we achieved an almost perfect discrimination between native and incorrectly folded proteins. Thus, we made use of this information for threading by evaluating the models suggested by a threading method according to the degree of proximity of the corresponding correlated, conserved, and apolar residues. The results showed that the fold recognition capacity of a given threading approach could be improved almost fourfold by selecting the alignments that score best under the three different sequence-based approaches."
            },
            "slug": "Effective-use-of-sequence-correlation-and-in-fold-Olmea-Rost",
            "title": {
                "fragments": [],
                "text": "Effective use of sequence correlation and conservation in fold recognition."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "It is shown that sequence conservation and correlation were each frequently informative enough to detect incorrectly folded proteins, and the fold recognition capacity of a given threading approach could be improved almost fourfold by selecting the alignments that score best under the three different sequence-based approaches."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of molecular biology"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1759124"
                        ],
                        "name": "C. Goller",
                        "slug": "C.-Goller",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Goller",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Goller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35388031,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2b19ab7f0d9a5ef60be7045bc80539590b00605a",
            "isKey": false,
            "numCitedBy": 40,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Automated deduction has a long tradition in computer science and most of the symbolic AI systems perform some kind of logic-based deductive inference. The central problem in automated deduction is the explosive growth of search spaces with deduction length. Methods of guiding and controlling the search process are indispensable. I will present a connectionist approach for learning search-control heuristics from examples of successful deductions. It originated in the context of the relatively new and still emerging eld of hybrid (symbolic/connectionist) systems. The goal of this eld is the identiication of strengths and weaknesses in the symbolic and the connectionist paradigms, and based on such insights, the design of hybrid systems that can beneet from the strengths of both. I begin with brieey comparing search-control heuristics for automated deduction systems with other methods that improve the eeciency of search, such as search strategies, calculus reenements and extensions, and analogical reasoning. The most important characteristics of heuristics are that they are simple and useful in most cases, however, they are not guaranteed to help. Search-control heuristics can be viewed as approximations to unknown and almost never realizable perfect search-control strategies. Approximation on the other hand is an inherent characteristic of connectionist methods, especially of the most successful and widespread backpropagation (BP) networks. Search-control heuristics for automated deduction systems are traditionally represented by heuristic evaluation functions for states or inference steps in the search space. These heuristic evaluation functions compute ratings for symbolic structures (e.g. graphs, trees, terms, formulas) of arbitrary size. Representing and processing the symbolic structures traditionally used in AI, belong to the most important and challenging open questions in the connectionist community. Most of the previous connectionist approaches for learning heuris-tic evaluation functions use a xed, a priori deened set of features for symbolic structures SF71, SE90, SE91, SG93, Gol94, Fuc96]. The deenition and selection of features, however, introduces a very strong bias and severely limits the class of relations that can be expressed and learned. It can be stated that the selection of a good set of features is already more than half the way to nding a good evaluation function. Compared to the feature-selection and deenition problem, the particular learning method which is applied is only of minor importance. I present a new and very powerful approach for adaptive structure processing which automatically nds the features which are relevant for the task at hand: folding architecture networks (FA-networks) …"
            },
            "slug": "A-connectionist-approach-for-learning-heuristics-Goller",
            "title": {
                "fragments": [],
                "text": "A connectionist approach for learning search-control heuristics for automated deduction systems"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A connectionist approach for learning search-control heuristics for automated deduction systems with other methods that improve the eeciency of search, such as search strategies, calculus reenements and extensions, and analogical reasoning."
            },
            "venue": {
                "fragments": [],
                "text": "DISKI"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1971879"
                        ],
                        "name": "A. Lesk",
                        "slug": "A.-Lesk",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Lesk",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Lesk"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32480291"
                        ],
                        "name": "L. Lo Conte",
                        "slug": "L.-Lo-Conte",
                        "structuredName": {
                            "firstName": "L",
                            "lastName": "Lo Conte",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Lo Conte"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8126949"
                        ],
                        "name": "T. Hubbard",
                        "slug": "T.-Hubbard",
                        "structuredName": {
                            "firstName": "Tim",
                            "lastName": "Hubbard",
                            "middleNames": [
                                "J.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Hubbard"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27334872,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "98f21e08c8590f821b0efccb11493c173781426f",
            "isKey": false,
            "numCitedBy": 101,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "In the Novel Fold category, three types of predictions were assessed: three‐dimensional structures, secondary structures, and residue‐residue contacts. For predictions of three‐dimensional models, CASP4 targets included 5 domains or structures with novel folds, and 13 on the borderline between Novel Fold and Fold Recognition categories. These elicited 1863 predictions of these and other targets by methods more general than comparative modeling or fold recognition techniques. The group of Bonneau, Tsai, Ruczinski, and Baker stood out as performing well with the greatest consistency. In many cases, several groups were able to predict fragments of the target correctly—often at a level somewhat larger than standard supersecondary structures—but were not able to assemble fragments into a correct global topology. The methods of Bonneau, Tsai, Ruczinski, and Baker have been successful in addressing the fragment assembly problem for many but not all the target structures. Proteins 2001;Suppl 5:98–118. © 2002 Wiley‐Liss, Inc."
            },
            "slug": "Assessment-of-novel-fold-targets-in-CASP4:-of-and-Lesk-Conte",
            "title": {
                "fragments": [],
                "text": "Assessment of novel fold targets in CASP4: Predictions of three‐dimensional structures, secondary structures, and interresidue contacts"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "In many cases, several groups were able to predict fragments of the target correctly—often at a level somewhat larger than standard supersecondary structures—but were not able to assemble fragments into a correct global topology."
            },
            "venue": {
                "fragments": [],
                "text": "Proteins"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2692972"
                        ],
                        "name": "R. Abagyan",
                        "slug": "R.-Abagyan",
                        "structuredName": {
                            "firstName": "Ruben",
                            "lastName": "Abagyan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Abagyan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3121759"
                        ],
                        "name": "S. Batalov",
                        "slug": "S.-Batalov",
                        "structuredName": {
                            "firstName": "Sergei",
                            "lastName": "Batalov",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Batalov"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 711,
                                "start": 107
                            }
                        ],
                        "text": "To avoid biases, the set is redundancyreduced, with an identity threshold based on the distance derived in Abagyan and Batalov (1997), which corresponds to a sequence identity of roughly 22% for long alignments, and higher for shorter ones. This set is further reduced by excluding chains that are shorter than 30 amino acids (these often do not have well defined 3D structures), or have resolution worse than 2.5Å, or result from NMR rather than X-ray experiments, or contain non standard amino acids, or contain more than 4 contiguous Xs, or have interrupted backbones. To extract 3D coordinates, together with secondary structure and solvent accessibility we run the DSSP program of Kabsch and Sander (1983) on all the PDB files in the PDB select list, excluding those for which DSSP crashes due, for instance, to missing entries or format errors."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 133,
                                "start": 107
                            }
                        ],
                        "text": "To avoid biases, the set is redundancyreduced, with an identity threshold based on the distance derived in Abagyan and Batalov (1997), which corresponds to a sequence identity of roughly 22% for long alignments, and higher for shorter ones."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 16476,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "61ae6c65f42c9de5115efafd82136a0e2c545e34",
            "isKey": false,
            "numCitedBy": 245,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "Sequence comparison remains a powerful tool to assess the structural relatedness of two proteins. To develop a sensitive sequence-based procedure for fold recognition, we performed an exhaustive global alignment (with zero end gap penalties) between sequences of protein domains with known three-dimensional folds. The subset of 1.3 million alignments between sequences of structurally unrelated domains was used to derive a set of analytical functions that represent the probability of structural significance for any sequence alignment at a given sequence identity, sequence similarity and alignment score. Analysis of overlap between structurally significant and insignificant alignments shows that sequence identity and sequence similarity measures are poor indicators of structural relatedness in the \"twilight zone\", while the alignment score allows much better discrimination between alignments of structurally related and unrelated sequences for a wide variety of alignment settings. A fold recognition benchmark was used to compare eight different substitution matrices with eight sets of gap penalties. The best performing matrices were Gonnet and Blosum50 with normalized gap penalties of 2.4/0.15 and 2.0/0.15, respectively, while the positive matrices were the worst performers. The derived functions and parameters can be used for fold recognition via a multilink chain of probability weighted pairwise sequence alignments."
            },
            "slug": "Do-aligned-sequences-share-the-same-fold-Abagyan-Batalov",
            "title": {
                "fragments": [],
                "text": "Do aligned sequences share the same fold?"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Analysis of overlap between structurally significant and insignificant alignments shows that sequence identity and sequence similarity measures are poor indicators of structural relatedness in the \"twilight zone\", while the alignment score allows much better discrimination between alignments of structurally related and unrelated sequences for a wide variety of alignment settings."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of molecular biology"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2156365355"
                        ],
                        "name": "Ulrike Göbel",
                        "slug": "Ulrike-Göbel",
                        "structuredName": {
                            "firstName": "Ulrike",
                            "lastName": "Göbel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ulrike Göbel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144022589"
                        ],
                        "name": "Chris Sander",
                        "slug": "Chris-Sander",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Sander",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chris Sander"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2069507994"
                        ],
                        "name": "R. Schneider",
                        "slug": "R.-Schneider",
                        "structuredName": {
                            "firstName": "Reinhard",
                            "lastName": "Schneider",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Schneider"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145786321"
                        ],
                        "name": "A. Valencia",
                        "slug": "A.-Valencia",
                        "structuredName": {
                            "firstName": "Alfonso",
                            "lastName": "Valencia",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Valencia"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 85
                            }
                        ],
                        "text": "A second type of input consideration is the use of profiles and correlated mutation (Gobel et al., 1994, Pazos et al., 1997, Olmea et al., 1999, Fariselli et al., 2001)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14978727,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "399ba1fca36b0fd64e1412d0d62ba7788dddd7a1",
            "isKey": false,
            "numCitedBy": 824,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "The maintenance of protein function and structure constrains the evolution of amino acid sequences. This fact can be exploited to interpret correlated mutations observed in a sequence family as an indication of probable physical contact in three dimensions. Here we present a simple and general method to analyze correlations in mutational behavior between different positions in a multiple sequence alignment. We then use these correlations to predict contact maps for each of 11 protein families and compare the result with the contacts determined by crystallography. For the most strongly correlated residue pairs predicted to be in contact, the prediction accuracy ranges from 37 to 68% and the improvement ratio relative to a random prediction from 1.4 to 5.1. Predicted contact maps can be used as input for the calculation of protein tertiary structure, either from sequence information alone or in combination with experimental information. © 1994 John Wiley & Sons, Inc."
            },
            "slug": "Correlated-mutations-and-residue-contacts-in-Göbel-Sander",
            "title": {
                "fragments": [],
                "text": "Correlated mutations and residue contacts in proteins"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A simple and general method is presented to analyze correlations in mutational behavior between different positions in a multiple sequence alignment to predict contact maps for each of 11 protein families and compare the result with the contacts determined by crystallography."
            },
            "venue": {
                "fragments": [],
                "text": "Proteins"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1735589"
                        ],
                        "name": "M. Nilges",
                        "slug": "M.-Nilges",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Nilges",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Nilges"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145308389"
                        ],
                        "name": "G. Clore",
                        "slug": "G.-Clore",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Clore",
                            "middleNames": [
                                "Marius"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Clore"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145497003"
                        ],
                        "name": "A. Gronenborn",
                        "slug": "A.-Gronenborn",
                        "structuredName": {
                            "firstName": "Angela",
                            "lastName": "Gronenborn",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Gronenborn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18226584,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "8078efbe373ac2878f43f536efa17f55eb93ebf4",
            "isKey": false,
            "numCitedBy": 655,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Determination-of-three‐dimensional-structures-of-by-Nilges-Clore",
            "title": {
                "fragments": [],
                "text": "Determination of three‐dimensional structures of proteins from interproton distance data by hybrid distance geometry‐dynamical simulated annealing calculations"
            },
            "venue": {
                "fragments": [],
                "text": "FEBS letters"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1735589"
                        ],
                        "name": "M. Nilges",
                        "slug": "M.-Nilges",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Nilges",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Nilges"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145308389"
                        ],
                        "name": "G. Clore",
                        "slug": "G.-Clore",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Clore",
                            "middleNames": [
                                "Marius"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Clore"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145497003"
                        ],
                        "name": "A. Gronenborn",
                        "slug": "A.-Gronenborn",
                        "structuredName": {
                            "firstName": "Angela",
                            "lastName": "Gronenborn",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Gronenborn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 77
                            }
                        ],
                        "text": "Methods to address the third step have been developed in the NMR literature (Nilges et al., 1988a,b) and elsewhere (Vendruscolo et al., 1997) and typically use ideas from distance geometry, molecular dynamics, and stochastic optimization to recover 3D coordinates from contacts."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8614495,
            "fieldsOfStudy": [
                "Chemistry"
            ],
            "id": "39d5ff561ca3a3ee4a6a3a999451203d7da26d8e",
            "isKey": false,
            "numCitedBy": 475,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Determination-of-three‐dimensional-structures-of-by-Nilges-Clore",
            "title": {
                "fragments": [],
                "text": "Determination of three‐dimensional structures of proteins from interproton distance data by dynamical simulated annealing from a random array of atoms Circumventing problems associated with folding"
            },
            "venue": {
                "fragments": [],
                "text": "FEBS letters"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1785465"
                        ],
                        "name": "P. Fariselli",
                        "slug": "P.-Fariselli",
                        "structuredName": {
                            "firstName": "Piero",
                            "lastName": "Fariselli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Fariselli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1753858"
                        ],
                        "name": "R. Casadio",
                        "slug": "R.-Casadio",
                        "structuredName": {
                            "firstName": "Rita",
                            "lastName": "Casadio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Casadio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 870,
                                "start": 8
                            }
                        ],
                        "text": ", 1999, Fariselli et al., 2001). Profiles, essentially in the form of alignment of homologous proteins, implicitly contain evolutionary and 3D structural information about related proteins. This information is relatively easy to collect using well-known alignment algorithms that ignore 3D structure and can be applied to very large data sets of proteins, including many proteins of unknown structure. The use of profiles is known to improve the prediction of secondary structure by several percentage points, presumably because secondary structure is more conserved than primary amino acid sequence. As in the case of secondary structure prediction, the input can be enriched by taking the profile vectors at positions i and j, yielding two 20dimensional probability vectors. We use profiles derived using the PSI-BLAST program as described in Pollastri et al. (2001b). When a distant pair (i, j) of positions in a multiple alignment is considered, horizontal correlations in the sequences may exist (“correlated mutations”) that are completely lost when profiles with independent columns are used."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 102
                            }
                        ],
                        "text": "Various algorithms for the prediction of contacts (Shindyalov et al., 1994, Olmea and Valencia, 1997, Fariselli and Casadio, 1999, 2000, Pollastri et al., 2001a), distances (Aszodi et al., 1995, Lund et al., 1997, Gorodkin et al., 1999), and contact maps (Fariselli et al., 2001) have been…"
                    },
                    "intents": []
                }
            ],
            "corpusId": 647878,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6dd8e40661aa1836e733e34ab9510cb2cc921848",
            "isKey": false,
            "numCitedBy": 30,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "Knowing the number of residue contacts in a protein is crucial for deriving constraints useful in modeling protein folding and/or scoring remote homology search. Here we focus on the prediction of residue contacts and show that this figure can be predicted with a neural network based method. The accuracy of the prediction is 12 percentage points higher than that of a simple statistical method. The neural network is used to discriminate between two different states of residue contacts, characterized by a contact number higher or lower than the average value of the residue distribution. When evolutionary information is taken into account, our method correctly predicts 69% of the residue states in the data base and it adds to the prediction of residue solvent accessibility. The predictor is available at htpp://www.biocomp.unibo.it"
            },
            "slug": "Prediction-of-the-Number-of-Residue-Contacts-in-Fariselli-Casadio",
            "title": {
                "fragments": [],
                "text": "Prediction of the Number of Residue Contacts in Proteins"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "This work shows that the number of residue contacts in a protein can be predicted with a neural network based method and correctly predicts 69% of the residue states in the data base and it adds to the prediction of residue solvent accessibility."
            },
            "venue": {
                "fragments": [],
                "text": "ISMB"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34597549"
                        ],
                        "name": "A. Aszódi",
                        "slug": "A.-Aszódi",
                        "structuredName": {
                            "firstName": "András",
                            "lastName": "Aszódi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Aszódi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14179795"
                        ],
                        "name": "M. J. Gradwell",
                        "slug": "M.-J.-Gradwell",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Gradwell",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. J. Gradwell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145865915"
                        ],
                        "name": "W. Taylor",
                        "slug": "W.-Taylor",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Taylor",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Taylor"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 21813532,
            "fieldsOfStudy": [
                "Chemistry"
            ],
            "id": "26166e9025fb7e205e6ff8b01cd6c949e84c1006",
            "isKey": false,
            "numCitedBy": 130,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "We have designed a distance geometry-based method for obtaining the tertiary fold of a protein from a limited number of structure-specific distance restraints and the secondary structure assignment. Interresidue distances were predicted from patterns of conserved hydrophobic amino acids deduced from multiple alignments. A simple model chain representing the protein was then folded by projecting its distance matrix into Euclidean spaces with gradually decreasing dimensionality until a final three-dimensional embedding was achieved. Tangled conformations produced by the projection steps were eliminated using a novel filtering algorithm. Information on various aspects of protein structure such as accessibility and chirality was incorporated into the conformation refinement, increasing the robustness of the algorithm. The method successfully identified the correct folds of three small proteins from a small number of restraints, indicating that it could serve as a useful computational tool in protein structure determination from NMR data."
            },
            "slug": "Global-fold-determination-from-a-small-number-of-Aszódi-Gradwell",
            "title": {
                "fragments": [],
                "text": "Global fold determination from a small number of distance restraints."
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The method successfully identified the correct folds of three small proteins from a small number of restraints, indicating that it could serve as a useful computational tool in protein structure determination from NMR data."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of molecular biology"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6252802"
                        ],
                        "name": "W. Kabsch",
                        "slug": "W.-Kabsch",
                        "structuredName": {
                            "firstName": "Wolfgang",
                            "lastName": "Kabsch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Kabsch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144766425"
                        ],
                        "name": "C. Sander",
                        "slug": "C.-Sander",
                        "structuredName": {
                            "firstName": "Christian",
                            "lastName": "Sander",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Sander"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 29185760,
            "fieldsOfStudy": [
                "Chemistry"
            ],
            "id": "225ba9111ed4b4e0f5bbe12c69e7235e353ff3ff",
            "isKey": false,
            "numCitedBy": 13105,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "For a successful analysis of the relation between amino acid sequence and protein structure, an unambiguous and physically meaningful definition of secondary structure is essential. We have developed a set of simple and physically motivated criteria for secondary structure, programmed as a pattern‐recognition process of hydrogen‐bonded and geometrical features extracted from x‐ray coordinates. Cooperative secondary structure is recognized as repeats of the elementary hydrogen‐bonding patterns “turn” and “bridge.” Repeating turns are “helices,” repeating bridges are “ladders,” connected ladders are “sheets.” Geometric structure is defined in terms of the concepts torsion and curvature of differential geometry. Local chain “chirality” is the torsional handedness of four consecutive Cα positions and is positive for right‐handed helices and negative for ideal twisted β‐sheets. Curved pieces are defined as “bends.” Solvent “exposure” is given as the number of water molecules in possible contact with a residue. The end result is a compilation of the primary structure, including SS bonds, secondary structure, and solvent exposure of 62 different globular proteins. The presentation is in linear form: strip graphs for an overall view and strip tables for the details of each of 10.925 residues. The dictionary is also available in computer‐readable form for protein structure prediction work."
            },
            "slug": "Dictionary-of-protein-secondary-structure:-Pattern-Kabsch-Sander",
            "title": {
                "fragments": [],
                "text": "Dictionary of protein secondary structure: Pattern recognition of hydrogen‐bonded and geometrical features"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A set of simple and physically motivated criteria for secondary structure, programmed as a pattern‐recognition process of hydrogen‐bonded and geometrical features extracted from x‐ray coordinates is developed."
            },
            "venue": {
                "fragments": [],
                "text": "Biopolymers"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2886611"
                        ],
                        "name": "O. Olmea",
                        "slug": "O.-Olmea",
                        "structuredName": {
                            "firstName": "O.",
                            "lastName": "Olmea",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Olmea"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145786321"
                        ],
                        "name": "A. Valencia",
                        "slug": "A.-Valencia",
                        "structuredName": {
                            "firstName": "Alfonso",
                            "lastName": "Valencia",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Valencia"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 105
                            }
                        ],
                        "text": "A second type of input consideration is the use of profiles and correlated mutation (Gobel et al., 1994, Pazos et al., 1997, Olmea et al., 1999, Fariselli et al., 2001)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 12604377,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "042cf80ce8f872892dd435e62c0d7879d82be947",
            "isKey": false,
            "numCitedBy": 228,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Improving-contact-predictions-by-the-combination-of-Olmea-Valencia",
            "title": {
                "fragments": [],
                "text": "Improving contact predictions by the combination of correlated mutations and other sources of sequence information."
            },
            "venue": {
                "fragments": [],
                "text": "Folding & design"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "41231471"
                        ],
                        "name": "A. Micheli",
                        "slug": "A.-Micheli",
                        "structuredName": {
                            "firstName": "Alessio",
                            "lastName": "Micheli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Micheli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749815"
                        ],
                        "name": "A. Sperduti",
                        "slug": "A.-Sperduti",
                        "structuredName": {
                            "firstName": "Alessandro",
                            "lastName": "Sperduti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Sperduti"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1678493"
                        ],
                        "name": "A. Starita",
                        "slug": "A.-Starita",
                        "structuredName": {
                            "firstName": "Antonina",
                            "lastName": "Starita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Starita"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1734576"
                        ],
                        "name": "A. Bianucci",
                        "slug": "A.-Bianucci",
                        "structuredName": {
                            "firstName": "Anna",
                            "lastName": "Bianucci",
                            "middleNames": [
                                "Maria"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bianucci"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 213,
                                "start": 192
                            }
                        ],
                        "text": "Thus we believe these architectures are suitable for processing other data, besides biological sequences, in applications as diverse as machine vision, games, and computational chemistry (see Micheli et al. (2001))."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 197254618,
            "fieldsOfStudy": [
                "Chemistry"
            ],
            "id": "0db66fd5a71c99039cfc0ce3bf40f81e9a46b077",
            "isKey": false,
            "numCitedBy": 3,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Analysis-of-the-Internal-Representations-Developed-Micheli-Sperduti",
            "title": {
                "fragments": [],
                "text": "Analysis of the Internal Representations Developed by Neural Networks for Structures Applied to Quantitative Structure—Activity Relationship Studies of Benzodiazepines."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16491491"
                        ],
                        "name": "G. Grant",
                        "slug": "G.-Grant",
                        "structuredName": {
                            "firstName": "Gregory",
                            "lastName": "Grant",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Grant"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 137,
                                "start": 115
                            }
                        ],
                        "text": "The unobserved entries can be set to zero or regularized to small non-zero values using standard Dirichlet priors (Baldi and Brunak, 2001)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 111,
                                "start": 88
                            }
                        ],
                        "text": "Predictors for the first step based on recurrent neural networks have been described in Baldi and Brunak (2001), Pollastri et al. (2001a,b)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 22799724,
            "fieldsOfStudy": [
                "Computer Science",
                "Biology"
            ],
            "id": "cf171d57f8232ba90a0696f8cb46144b39380d0b",
            "isKey": false,
            "numCitedBy": 514,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Bioinformatics-The-Machine-Learning-Approach-Grant",
            "title": {
                "fragments": [],
                "text": "Bioinformatics - The Machine Learning Approach"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Chem."
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 209,
                                "start": 183
                            }
                        ],
                        "text": "…systematically to many large-scale problems, by itself it is not new and can be traced, in more or less obscure form, to a number of publications including Baldi and Chauvin (1996), Bengio and Frasconi (1996), Sperduti and Starita (1997), Goller (1997), LeCun et al. (1998), Frasconi et al. (1998)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 141,
                                "start": 138
                            }
                        ],
                        "text": "DAG connections within the input and/or output layer are also possible, as well as DAG-RNN architectures with no outputs, no inputs (e.g. HMMs), or even no inputs and no outputs (e.g. Markov chains)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 69
                            }
                        ],
                        "text": "This is essentially the connectivity pattern of an input-output HMM (Bengio and Frasconi, 1996), augmented with a backward chain of hidden states."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Input-output HMM's for sequence processing"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. on Neural Networks"
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Determination of three - dimensional structures of proteins from interproton distance data by dynamical simulated annealing from a random array of atoms"
            },
            "venue": {
                "fragments": [],
                "text": "FEBS Lett ."
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Selection of representative data sets"
            },
            "venue": {
                "fragments": [],
                "text": "Prot . Sci ."
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "DAG-RNNs and the Protein Structure Problem"
            },
            "venue": {
                "fragments": [],
                "text": "DAG-RNNs and the Protein Structure Problem"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 196,
                                "start": 177
                            }
                        ],
                        "text": "SMALL and XLARGE: The training and testing data sets in the SMALL and XLARGE sets are extracted from the Protein Data Bank (PDB) of solved structures using the PDB select list (Hobohm et al., 1992) of February 2001, containing 1520 proteins."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Selection of representative data"
            },
            "venue": {
                "fragments": [],
                "text": "sets. Prot. Sci.,"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Example of exact (bottom-left) and predicted fine contact map for protein 1IG5. Grey scale, white=0 (non-contact), black =1 (contact)"
            },
            "venue": {
                "fragments": [],
                "text": "and Pollastri Figure"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 131,
                                "start": 118
                            }
                        ],
                        "text": "This paper describes several classes of RNN architectures for large-scale applications that are derived using the DAG-RNN approach."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 74,
                                "start": 51
                            }
                        ],
                        "text": "Various algorithms for the prediction of contacts (Shindyalov et al., 1994, Olmea and Valencia, 1997, Fariselli and Casadio, 1999, 2000, Pollastri et al., 2001a), distances (Aszodi et al., 1995, Lund et al., 1997, Gorodkin et al., 1999), and contact maps (Fariselli et al., 2001) have been…"
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Can three-dimensional contacts of proteins be predicted by analysis of correlated mutations?"
            },
            "venue": {
                "fragments": [],
                "text": "Protein Engineering"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 77
                            }
                        ],
                        "text": "Methods to address the third step have been developed in the NMR literature (Nilges et al., 1988a,b) and elsewhere (Vendruscolo et al., 1997) and typically use ideas from distance geometry, molecular dynamics, and stochastic optimization to recover 3D coordinates from contacts."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Determination of three-dimensional structures of proteins from interproton distance data by dynamical simulated annealing from a random array of atoms"
            },
            "venue": {
                "fragments": [],
                "text": "FEBS Lett"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 273,
                                "start": 247
                            }
                        ],
                        "text": "…metrics for assessing contact map prediction remain to be developed, we have used here a variety of measures to address some of these problems and to allow comparisons with results published in the literature, especially Fariselli et al. (2001), Pollastri and Baldi (2002), Pollastri et al. (2003)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Predition of contact maps by GIOHMMs and recurrent neural networks using lateral propagation from all four cardinal corners. Bioinformatics, 18 Supplement 1:S62–S70"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the ISMB 2002 Conference"
            },
            "year": 2002
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 196,
                                "start": 177
                            }
                        ],
                        "text": "SMALL and XLARGE: The training and testing data sets in the SMALL and XLARGE sets are extracted from the Protein Data Bank (PDB) of solved structures using the PDB select list (Hobohm et al., 1992) of February 2001, containing 1520 proteins."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Selection of representative data sets"
            },
            "venue": {
                "fragments": [],
                "text": "Prot. Sci"
            },
            "year": 1992
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 11,
            "methodology": 15,
            "result": 5
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 46,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/The-Principled-Design-of-Large-Scale-Recursive-and-Baldi-Pollastri/1b7a0048801f9d43dc48a8f04367be813146b05a?sort=total-citations"
}