{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2026553"
                        ],
                        "name": "O. Selfridge",
                        "slug": "O.-Selfridge",
                        "structuredName": {
                            "firstName": "Oliver",
                            "lastName": "Selfridge",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Selfridge"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4907109"
                        ],
                        "name": "U. Neisser",
                        "slug": "U.-Neisser",
                        "structuredName": {
                            "firstName": "Ulric",
                            "lastName": "Neisser",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Neisser"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 96
                            }
                        ],
                        "text": "[19] O. G. Selfridge, \"Pandemonium: a paradigm for learning,\" in [C] [20] O. G. Selfridge and U Neisser, \"Pattern recognition by machine,\" Sci."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 118,
                                "start": 114
                            }
                        ],
                        "text": "A general review of Doyle's work and other pattern-recognition experiments will be found in Selfridge and Neisser [20]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 91
                            }
                        ],
                        "text": "A general review of Doyle’s work and other pattern-recognition experiments will be found in Selfridge and Neisser [20]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 14956427,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8def1503d588f2dc413e0b3e769be5e033d9e737",
            "isKey": false,
            "numCitedBy": 263,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Can a machine think? The answer to this old chestnut is certainly \"yes\": Computers have been made to play chess and checkers, to prove theorems, to solve intricate problems of strategy. Yet the intelligence implied by such activities has an elusive, unnatural quality. It is not based on any orderly development of cognitive skills. In particular, the machines are not well equipped to select from their environment the things, or the relations, they are going to think about. In this they are sharply distinguished from intelligent living organisms. Every child learns to analyze speech into meaningful patterns long before he can prove any propositions. Computers can find proofs, but they cannot understand the simplest spoken instructions. Even the earliest computers could do arithmetic superbly, but only very recently have they begun to read the written digits that a child recognizes before he learns to add them. Understanding speech and reading print are examples of a basic intellectual skill that can variously be called cognition, abstraction or perception; perhaps the best general termfor it is patternrecognition. Except for their inability to recognize patterns, machines (or, more accurately, the programs that tell machines what to do) have now met most of the classic criteria of intelligence that skeptics have proposed. They can outperform their designers: The checker-playing program devised by Arthur L. Samuel of International Business Machines Corporation (1959a) usually beats him. They are original: The \"Logic Theorist,\" a creation of a group from the Carnegie Institute of Technology and the RAND Corporation [Newell, Simon, and Shaw (1956a, 19576)] has found proofs for many of the theorems in Principia Mathematica, the"
            },
            "slug": "Pattern-recognition-by-machine-Selfridge-Neisser",
            "title": {
                "fragments": [],
                "text": "Pattern recognition by machine"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Except for their inability to recognize patterns, machines have now met most of the classic criteria of intelligence that skeptics have proposed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2144219245"
                        ],
                        "name": "Hao Wang",
                        "slug": "Hao-Wang",
                        "structuredName": {
                            "firstName": "Hao",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hao Wang"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18424476,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cba1bf72e90a1ead0dd6a924dfed7676e0477bf0",
            "isKey": false,
            "numCitedBy": 401,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "Certain preliminary results on doing mathematics by machines (“mechanical mathematics”) were reported in an earlier paper [20]. The writer suggested developing inferential analysis as a branch of applied logic and as a sister discipline of numerical analysis. This analogy rests on the basic distinction of pure existence proofs, elegant procedures which in theory always terminate, and efficient procedures which are more complex to describe but can more feasibly be carried out in practice. In contrast with pure logic, the chief emphasis of inferential analysis is on the efficiency of algorithms, which is usually attained by paying a great deal more attention to the detailed structures of the problems and their solutions, to take advantage of possible systematic short cuts. The possibilities of much more elaborate calculations by machines provide an incentive to studying a group of rather minute questions which were formerly regarded as of small theoretical interest. When the range of actual human computation was narrow, there seemed little point in obtaining faster procedures which were still far beyond what was feasible. Furthermore, on account of the versatility of machines, it now appears that as more progress is made, strategies in the search for proofs, or what are often called heuristic methods, will also gradually become part of the subject matter of inferential analysis. An analogous situation in numerical analysis would be, for example, to make the machine choose to apply different tricks such as taking the Fourier transform to obtain a solution of some differential equation."
            },
            "slug": "Proving-theorems-by-pattern-recognition-I-Wang",
            "title": {
                "fragments": [],
                "text": "Proving theorems by pattern recognition I"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "It now appears that as more progress is made, strategies in the search for proofs, or what are often called heuristic methods, will also gradually become part of the subject matter of inferential analysis."
            },
            "venue": {
                "fragments": [],
                "text": "Commun. ACM"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40425341"
                        ],
                        "name": "R. Friedberg",
                        "slug": "R.-Friedberg",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Friedberg",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Friedberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16951291,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "46bed4c578e96e05fa3e5704620c4ffa0746d78f",
            "isKey": false,
            "numCitedBy": 409,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Machines would be more useful if they could learn to perform tasks for which they were not given precise methods. Difficulties that attend giving a machine this ability are discussed. It is proposed that the program of a stored-program computer be gradually improved by a learning procedure which tries many programs and chooses, from the instructions that may occupy a given location, the one most often associated with a successful result. An experimental test of this principle is described in detail. Preliminary results, which show limited success, are reported and interpreted. Further results and conclusions will appear in the second part of the paper."
            },
            "slug": "A-Learning-Machine:-Part-I-Friedberg",
            "title": {
                "fragments": [],
                "text": "A Learning Machine: Part I"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "It is proposed that the program of a stored-program computer be gradually improved by a learning procedure which tries many programs and chooses, from the instructions that may occupy a given location, the one most often associated with a successful result."
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. Dev."
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2969408"
                        ],
                        "name": "H. Gelernter",
                        "slug": "H.-Gelernter",
                        "structuredName": {
                            "firstName": "Herbert",
                            "lastName": "Gelernter",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Gelernter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143635905"
                        ],
                        "name": "N. Rochester",
                        "slug": "N.-Rochester",
                        "structuredName": {
                            "firstName": "Nathaniel",
                            "lastName": "Rochester",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Rochester"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28472029,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1615a6e18b65dfe65b1ed3ba82d57d8bb6f613b8",
            "isKey": false,
            "numCitedBy": 69,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "As one step in the study of intelligent behavior in machines, the authors consider the particular case of a machine that can prove theorems in elementary Euclidean plane geometry. The device uses no advanced decision algorithm, but relies rather on rudimentary mathematics and \"ingenuity\" in the manner, for example, of a clever high-school student. \n \nThis paper discusses heuristic methods and learning machines and introduces the concept of a theory machine as an extension of a theorem-proving machine."
            },
            "slug": "Intelligent-Behavior-in-Problem-Solving-Machines-Gelernter-Rochester",
            "title": {
                "fragments": [],
                "text": "Intelligent Behavior in Problem-Solving Machines"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "The concept of a theory machine as an extension of a theorem-proving machine is introduced and the authors consider the particular case of a machine that can prove theorems in elementary Euclidean plane geometry."
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. Dev."
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1800629"
                        ],
                        "name": "S. Unger",
                        "slug": "S.-Unger",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Unger",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Unger"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 156,
                                "start": 151
                            }
                        ],
                        "text": "Among the important works not reviewed here should be mentioned those of Bomba [33] and Grimsdale, et al. [34], which involve elements of description, Unger [35] and Holland [36] for parallel processing schemes, Hebb [31] who is concerned with physiological description models, and the work of the Gestalt psychologists, notably Kohler [38] who have certainly raised, if not solved, a number of important questions."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 55,
                                "start": 51
                            }
                        ],
                        "text": "[34], which involve elements of description, Unger [35] and Holland [36] for parallel processing schemes, Hebb [31] who is concerned with physiological description models, and the work of the Gestalt psychologists, notably Kohler [38] who have certainly raised, if not solved, a number of important questions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 11
                            }
                        ],
                        "text": "[35] S. H. Unger, Pattern detection and recognition\" PROC."
                    },
                    "intents": []
                }
            ],
            "corpusId": 51663722,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3e30741fff23756c36fbc3670da2a6345a42eb7c",
            "isKey": false,
            "numCitedBy": 143,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Two types of pattern-processing problems are discussed in this paper. The first, termed \"pattern detection,\" consists of examining an arbitrary set of figures and selecting those having some specified form. The second problem, \"pattern recognition,\" consists of identifying a given figure which is known to belong to one of a finite set of classes. This is the problem encountered when reading alphanumeric characters. Both recognition and detection have been successfully carried out on an IBM 704 computer which was programmed to simulate a spatial computer (a stored-program machine comprised of a master control unit directing a network of logical modules). One of the programs tested consisted of a recognition process for reading hand-lettered sans-serif alphanumeric characters. This process permits large variations in the size, shape, and proportions of the input figures and can tolerate random noise when it is well scattered in small specks. Programs for detecting L-shaped (or A-shaped) figures in the presence of other randomly drawn patterns have also been successfully tested."
            },
            "slug": "Pattern-Detection-and-Recognition-Unger",
            "title": {
                "fragments": [],
                "text": "Pattern Detection and Recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "Two types of pattern-processing problems are discussed in this paper and recognition and detection have been successfully carried out on an IBM 704 computer programmed to simulate a spatial computer (a stored-program machine comprised of a master control unit directing a network of logical modules)."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IRE"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48603437"
                        ],
                        "name": "A. Newell",
                        "slug": "A.-Newell",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Newell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Newell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144774845"
                        ],
                        "name": "J. Shaw",
                        "slug": "J.-Shaw",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Shaw",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Shaw"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94059053"
                        ],
                        "name": "H. Simon",
                        "slug": "H.-Simon",
                        "structuredName": {
                            "firstName": "Herbert",
                            "lastName": "Simon",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Simon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 15553334,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7b202896ca3151fabb4c4197c329b530491c2b3e",
            "isKey": false,
            "numCitedBy": 169,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper is a case study in problem solving, representing part of a program of research on complex information-processing systems. We have specified a system for finding proofs of theorems in elementary symbolic logic, and by programming a computer to these specifications, have obtained empirical data on the problem-solving process in elementary logic. The program is called the Logic Theory Machine (LT); it was devised to learn how it is possible to solve difficult problems such as proving mathematical theorems, discovering scientific laws from data, playing chess, or understanding the meaning of English prose."
            },
            "slug": "Empirical-explorations-of-the-logic-theory-machine:-Newell-Shaw",
            "title": {
                "fragments": [],
                "text": "Empirical explorations of the logic theory machine: a case study in heuristic"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The Logic Theory Machine is devised to learn how it is possible to solve difficult problems such as proving mathematical theorems, discovering scientific laws from data, playing chess, or understanding the meaning of English prose."
            },
            "venue": {
                "fragments": [],
                "text": "IRE-AIEE-ACM '57 (Western)"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143805236"
                        ],
                        "name": "J. McCarthy",
                        "slug": "J.-McCarthy",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "McCarthy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. McCarthy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 63812173,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "ff433838bb2b178e1d6b1f045b0215385e1757f5",
            "isKey": false,
            "numCitedBy": 117,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Consider the problem of designing a machine to solve well-defined intellectual problems. We call a problem well-defined if there is a test which can be applied to a proposed solution. In case the proposed solution is a solution, the test must confirm this in a finite number of steps. If the proposed solution is not correct, we may either require that the test indicate this in a finite number of steps or else allow it to go on indefinitely. Since any test may be regarded as being performed by a Turing machine, this means that welldefined intellectual problems may be regarded as those of inverting functions and partial functions defined by Turing machines. Let fm(n) be the partial function computed by the m th Turing machine. It is not defined for a given value of n if the computation does not come to an end. This paper deals with the problem of designing a Turing machine which, when confronted by the number pair (m, r), computes as efficiently as possible a function g(m, r) such that fm(g(m, r)) = r. Again, for particular values of m and r no g(m, r) need exist. In fact, it has been shown that the existence of g(m, r) is an undecidable question in that there does not exist a Turing machine which will eventually come to a stop and print a 1 if g(m, r) does not exist. In spite of this, it is easy to show that a Turing machine exists which will"
            },
            "slug": "The-Inversion-of-Functions-Defined-by-Turing-McCarthy",
            "title": {
                "fragments": [],
                "text": "The Inversion of Functions Defined by Turing Machines"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This paper deals with the problem of designing a Turing machine which, when confronted by the number pair, computes as efficiently as possible a function g(m, r) such that fm(g( m, r)) = r."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2616117"
                        ],
                        "name": "S. Gorn",
                        "slug": "S.-Gorn",
                        "structuredName": {
                            "firstName": "Saul",
                            "lastName": "Gorn",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Gorn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 6420705,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "fc436c311b9d6144297e92c0837e8349e0353d9e",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-the-Mechanical-Simulation-of-Habit-Forming-and-Gorn",
            "title": {
                "fragments": [],
                "text": "On the Mechanical Simulation of Habit-Forming and Learning"
            },
            "venue": {
                "fragments": [],
                "text": "Inf. Control."
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40425341"
                        ],
                        "name": "R. Friedberg",
                        "slug": "R.-Friedberg",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Friedberg",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Friedberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "100649252"
                        ],
                        "name": "B. Dunham",
                        "slug": "B.-Dunham",
                        "structuredName": {
                            "firstName": "Bradford",
                            "lastName": "Dunham",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Dunham"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46741777"
                        ],
                        "name": "J. H. North",
                        "slug": "J.-H.-North",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "North",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. H. North"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 3392996,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "898f507d92bf88de087a5f858c5c73046a7cdea9",
            "isKey": false,
            "numCitedBy": 113,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "An effort is made to improve the performance of the learning machine described in Part I, and the over-all effect of various changes is considered. Comparative runs by machines without the scoring mechanism indicate that the grading of individual instructions can aid in the learning process. A releted study is mQde in which eutemetie debugging of programs is taken as a special case of machine search. The ability to partition problems and fo deal with parts in order of difficulty proves helpful."
            },
            "slug": "A-Learning-Machine:-Part-II-Friedberg-Dunham",
            "title": {
                "fragments": [],
                "text": "A Learning Machine: Part II"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "An effort is made to improve the performance of the learning machine described in Part I, and the over-all effect of various changes is considered."
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. Dev."
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1847175"
                        ],
                        "name": "M. Minsky",
                        "slug": "M.-Minsky",
                        "structuredName": {
                            "firstName": "Marvin",
                            "lastName": "Minsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Minsky"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62175351,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "374fc3a9e8d3b518cd73113da1a326a738313158",
            "isKey": false,
            "numCitedBy": 54,
            "numCiting": 197,
            "paperAbstract": {
                "fragments": [],
                "text": "This listing is intended as an introduction to the literature on Artificial Intelligence?i.e., to the literature dealing with the problem of making machines behave intelligently. We have divided this area into categories and cross-indexed the references accordingly. Large bibliographies, without some classification facility, are next to useless. This particular field is still young, but there are already many instances in which workers have wasted much time in rediscovering (for better for for worse) schemes already reported. In the last year or two this problem has become worse, and in such a situation just about any information is better than none."
            },
            "slug": "A-Selected-Descriptor-Indexed-Bibliography-to-the-Minsky",
            "title": {
                "fragments": [],
                "text": "A Selected Descriptor-Indexed Bibliography to the Literature on Artificial Intelligence"
            },
            "tldr": {
                "abstractSimilarityScore": 95,
                "text": "This listing is intended as an introduction to the literature on Artificial Intelligence?i.e., the literature dealing with the problem of making machines behave intelligently, which has been divided into categories and cross-indexed the references accordingly."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113641402"
                        ],
                        "name": "Martin D. Davis",
                        "slug": "Martin-D.-Davis",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Davis",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Martin D. Davis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1790161"
                        ],
                        "name": "H. Putnam",
                        "slug": "H.-Putnam",
                        "structuredName": {
                            "firstName": "Hilary",
                            "lastName": "Putnam",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Putnam"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 31888376,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "7dbf4c5424c676f7e04010a0a6678cab40e71332",
            "isKey": false,
            "numCitedBy": 2922,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The hope that mathematical methods employed in the investigation of formal logic would lead to purely computational methods for obtaining mathematical theorems goes back to Leibniz and has been revived by Peano around the turn of the century and by Hilbert's school in the 1920's. Hilbert, noting that all of classical mathematics could be formalized within quantification theory, declared that the problem of finding an algorithm for determining whether or not a given formula of quantification theory is valid was the central problem of mathematical logic. And indeed, at one time it seemed as if investigations of this “decision” problem were on the verge of success. However, it was shown by Church and by Turing that such an algorithm can not exist. This result led to considerable pessimism regarding the possibility of using modern digital computers in deciding significant mathematical questions. However, recently there has been a revival of interest in the whole question. Specifically, it has been realized that while no decision procedure exists for quantification theory there are many proof procedures available—that is, uniform procedures which will ultimately locate a proof for any formula of quantification theory which is valid but which will usually involve seeking “forever” in the case of a formula which is not valid—and that some of these proof procedures could well turn out to be feasible for use with modern computing machinery.\n Hao Wang [9] and P. C. Gilmore [3] have each produced working programs which employ proof procedures in quantification theory. Gilmore's program employs a form of a basic theorem of mathematical logic due to Herbrand, and Wang's makes use of a formulation of quantification theory related to those studied by Gentzen. However, both programs encounter decisive difficulties with any but the simplest formulas of quantification theory, in connection with methods of doing propositional calculus. Wang's program, because of its use of Gentzen-like methods, involves exponentiation on the total number of truth-functional connectives, whereas Gilmore's program, using normal forms, involves exponentiation on the number of clauses present. Both methods are superior in many cases to truth table methods which involve exponentiation on the total number of variables present, and represent important initial contributions, but both run into difficulty with some fairly simple examples.\nIn the present paper, a uniform proof procedure for quantification theory is given which is feasible for use with some rather complicated formulas and which does not ordinarily lead to exponentiation. The superiority of the present procedure over those previously available is indicated in part by the fact that a formula on which Gilmore's routine for the IBM 704 causes the machine to computer for 21 minutes without obtaining a result was worked successfully by hand computation using the present method in 30 minutes. Cf. §6, below.\nIt should be mentioned that, before it can be hoped to employ proof procedures for quantification theory in obtaining proofs of theorems belonging to “genuine” mathematics, finite axiomatizations, which are “short,” must be obtained for various branches of mathematics. This last question will not be pursued further here; cf., however, Davis and Putnam [2], where one solution to this problem is given for ele"
            },
            "slug": "A-Computing-Procedure-for-Quantification-Theory-Davis-Putnam",
            "title": {
                "fragments": [],
                "text": "A Computing Procedure for Quantification Theory"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "In the present paper, a uniform proof procedure for quantification theory is given which is feasible for use with some rather complicated formulas and which does not ordinarily lead to exponentiation."
            },
            "venue": {
                "fragments": [],
                "text": "JACM"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691341"
                        ],
                        "name": "R. L. Grimsdale",
                        "slug": "R.-L.-Grimsdale",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Grimsdale",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. Grimsdale"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "24348125"
                        ],
                        "name": "F. Sumner",
                        "slug": "F.-Sumner",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Sumner",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Sumner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16929711"
                        ],
                        "name": "C. J. Tunis",
                        "slug": "C.-J.-Tunis",
                        "structuredName": {
                            "firstName": "Cyril",
                            "lastName": "Tunis",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. J. Tunis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34704748"
                        ],
                        "name": "T. Kilburn",
                        "slug": "T.-Kilburn",
                        "structuredName": {
                            "firstName": "Tom",
                            "lastName": "Kilburn",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kilburn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[34], which involve elements of description, Unger [35] and Holland [36] for parallel processing schemes, Hebb [31] who is concerned with physiological description models, and the work of the Gestalt psychologists, notably Kohler [38] who have certainly raised, if not solved, a number of important questions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 57111671,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "726e2870e754dd2c3b30dfe9486ff23fceb01730",
            "isKey": false,
            "numCitedBy": 91,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "The paper describes a new method for the automatic recognition of patterns. The method may be applied to any form of spatial pattern, but in the present instance, patterns consisting of line figures are considered. The pattern is presented to a flying-spot scanner connected to a digital computer. The shape of the pattern is analysed and a statement is prepared describing the basic features of the pattern. The pattern is then recognized by comparing this statement with a number of others already stored in the computer which relate to named patterns. Patterns are recognized independently of the angle at which they are presented to the scanner, and may be of any size provided that limits imposed by the resolution of the scanner are not exceeded. The average time to recognize a character is 60 seconds with the system programmed on a medium-speed computer. Special-purpose equipment built to perform certain of the stages of the process, together with the use of higher-speed computers now envisaged, will reduce this time by at least a thousandfold. If a new pattern is presented to the machine it will indicate its inability to recognize the pattern, but by giving the machine the name of the pattern, it may become one of the standard patterns which it can subsequently recognize. All the patterns recognized by the machine are hand-drawn and consist of such symbols as the capital letters of the alphabet and numerals, although the system is in no way limited to any special set of characters. Using exactly the same method but with an increase in the degree of complexity, it will be possible for machines to read handwriting. Special allowances are made for imperfections in the patterns, including breaks and general ill-definition. Where there is some confusion and an unknown pattern resembles two or more of the standard patterns, the relative degrees of similarity of the unknown to each of these standard patterns is printed out by the machine."
            },
            "slug": "A-system-for-the-automatic-recognition-of-patterns-Grimsdale-Sumner",
            "title": {
                "fragments": [],
                "text": "A system for the automatic recognition of patterns"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "A new method for the automatic recognition of patterns consisting of line figures, using exactly the same method but with an increase in the degree of complexity, it will be possible for machines to read handwriting."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2144219245"
                        ],
                        "name": "Hao Wang",
                        "slug": "Hao-Wang",
                        "structuredName": {
                            "firstName": "Hao",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hao Wang"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38586500,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "34fce7ae570071c7a01468cea9fca519fd54f10d",
            "isKey": false,
            "numCitedBy": 255,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Results are reported here of a rather successful attempt at proving all theorems, totalling near 400, of Principia Mathematica which are strictly in the realm of logic, viz., the restricted predicate calculus with equality. A number of other problems of the same type are discussed. It is suggested that the time is ripe for a new branch of applied logic which may be called \"inferential\" analysis, which treats proofs as numerical analysis does calculations. This discipline seems capable, in the not too remote future, of leading to machine proofs of difficult new theorems. An easier preparatory task is to use machines to formalize proofs of known theorems. This line of work may also lead to mechanical checks of new mathematical results comparable to the debugging of a program."
            },
            "slug": "Toward-Mechanical-Mathematics-Wang",
            "title": {
                "fragments": [],
                "text": "Toward Mechanical Mathematics"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Results are reported here of a rather successful attempt at proving all theorems, totalling near 400, of Principia Mathematica which are strictly in the realm of logic, viz., the restricted predicate calculus with equality."
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. Dev."
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7991309"
                        ],
                        "name": "A. Samuel",
                        "slug": "A.-Samuel",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Samuel",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Samuel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 27
                            }
                        ],
                        "text": "29 It should be noted that [2] describes also a rather successful checker-playing program based on recording and retrieving iniformation about positionls encountered in the past, a less abstract way of exploiting past experience."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 264,
                                "start": 261
                            }
                        ],
                        "text": "17 See the discussion of Bernstein [481 and the more extensive review and discussion in the very suggestive paper of Newell, Shaw, and Simon [49]; one should not overlook the pioneering paper of Newell [501, and Samuel's discussion of the minimaxing process in [2]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 108,
                                "start": 105
                            }
                        ],
                        "text": "16 Samuel's Program for Checkers: In Samuel's \"generalization learning\" program for the game of checkers [2] we find a novel heuristic technique which could be regarded as a simple example of the \"expectation reinforcement\" notion."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 50,
                                "start": 47
                            }
                        ],
                        "text": "In Samuel's coefficient-optimiiizinig program1 [2] [see Sectioni II I-C, 1) ], there is a most inigeniious comiipromnise betweeni the exponietitial anid the uniiforimi averagilig methods: the value of N in (2) above beginis at 16 aind"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2126705,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e9e6bb5f2a04ae30d8ecc9287f8b702eedd7b772",
            "isKey": true,
            "numCitedBy": 3043,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract A new signature-table technique is described together with an improved book-learning procedure which is thought to be much superior to the linear polynomial method. Full use is made of the so-called “alpha-beta” pruning and several forms of forward pruning to restrict the spread of the move tree and to permit the program to look ahead to a much greater depth than it otherwise could do. While still unable to outplay checker masters, the program's playing ability has been greatly improved.tplay checker masters, the"
            },
            "slug": "Some-Studies-in-Machine-Learning-Using-the-Game-of-Samuel",
            "title": {
                "fragments": [],
                "text": "Some Studies in Machine Learning Using the Game of Checkers"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "A new signature-table technique is described together with an improved book-learning procedure which is thought to be much superior to the linear polynomial method and to permit the program to look ahead to a much greater depth than it otherwise could do."
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. Dev."
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39828682"
                        ],
                        "name": "R. R. Bush",
                        "slug": "R.-R.-Bush",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Bush",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. R. Bush"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47976263"
                        ],
                        "name": "F. Mosteller",
                        "slug": "F.-Mosteller",
                        "structuredName": {
                            "firstName": "Frederick",
                            "lastName": "Mosteller",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Mosteller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 31
                            }
                        ],
                        "text": "[45] Robert R. Bush, Frederick Mosteller: A Mathematical Model for Simple Learning."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 131
                            }
                        ],
                        "text": "Some theory of such \"linear\" learning operators, generalized to several stimuli and responses, will be found in Bush and Mosteller [45]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 44326807,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "702d41e340cd345e50c2054182a84d9b5ae97e7a",
            "isKey": false,
            "numCitedBy": 223,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A mathematical model for simple learning is presented. Changes in the probability of occurrence of a response in a small time h are described with the aid of mathematical operators. The parameters which appear in the operator equations are related to experimental variables such as the amount of reward and work. Relations between the probability and empirical measures of rate of responding and latent time are defined. Acquisition and extinction of behavior habits are discussed for the simple runway and for the Skinner box. Equations of mean latent time as a function of trial number are derived for the runway problem; equations for the mean rate of responding and cumulative numbers of responses versus time are derived for the Skinner box experiments. An attempt is made to analyze the learning process with various schedules of partial reinforcement in the Skinner type experiment. Wherever possible, the correspondence between the present model and the work of Estes [2] is pointed out."
            },
            "slug": "A-mathematical-model-for-simple-learning.-Bush-Mosteller",
            "title": {
                "fragments": [],
                "text": "A mathematical model for simple learning."
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "An attempt is made to analyze the learning process with various schedules of partial reinforcement in the Skinner type experiment with the aid of mathematical operators."
            },
            "venue": {
                "fragments": [],
                "text": "Psychological review"
            },
            "year": 1951
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7675581"
                        ],
                        "name": "G. P. Dinneen",
                        "slug": "G.-P.-Dinneen",
                        "structuredName": {
                            "firstName": "Gerald",
                            "lastName": "Dinneen",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. P. Dinneen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 9
                            }
                        ],
                        "text": "(Dineeni [13] describes how these processes"
                    },
                    "intents": []
                }
            ],
            "corpusId": 17423064,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "e7269ba40686ddc3c38ff5240fe26fd2e829831b",
            "isKey": false,
            "numCitedBy": 109,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Everyone likes to speculate, and recently there has been a lot of talk about reading machines and hearing machines. We know it is possible to simulate speech. This raises lots of interesting questions such as: If the machines can speak, will they squawk when you ask them to divide by zero? And can two machines carry on an intelligent conversation, say in Gaelic? And, of course, there is the expression \"electronic brain\" and the question, Do machines think? These questions are more philosophical than technical and I am going to duck them."
            },
            "slug": "Programming-pattern-recognition-Dinneen",
            "title": {
                "fragments": [],
                "text": "Programming pattern recognition"
            },
            "venue": {
                "fragments": [],
                "text": "AFIPS '55 (Western)"
            },
            "year": 1955
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48603437"
                        ],
                        "name": "A. Newell",
                        "slug": "A.-Newell",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Newell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Newell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144774845"
                        ],
                        "name": "J. Shaw",
                        "slug": "J.-Shaw",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Shaw",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Shaw"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94059053"
                        ],
                        "name": "H. Simon",
                        "slug": "H.-Simon",
                        "structuredName": {
                            "firstName": "Herbert",
                            "lastName": "Simon",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Simon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16650779,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f8117e2fa9be7f65d0c0cd19d1473ef0bdf2de69",
            "isKey": false,
            "numCitedBy": 334,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "In 1956 a group at Los Alamos programmed maniac-I to play chess (Kister et al, 1957). The Los Alamos program is an almost perfect example of the type of system specified by Shannon. As shown in the Table, all alternatives were considered: all continuations were explored to a depth of two moves (i. e., two moves for Black and two for White): the static evaluation function consisted of a sum of material and mobility measures; the values were integrated by a minimax procedure,* and the best alternative in terms of the effective value was chosen for the move."
            },
            "slug": "Chess-Playing-Programs-and-the-Problem-of-Newell-Shaw",
            "title": {
                "fragments": [],
                "text": "Chess-Playing Programs and the Problem of Complexity"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "The Los Alamos program is an almost perfect example of the type of system specified by Shannon, and the static evaluation function consisted of a sum of material and mobility measures."
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. Dev."
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1887705"
                        ],
                        "name": "R. Kirsch",
                        "slug": "R.-Kirsch",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "Kirsch",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kirsch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2069928052"
                        ],
                        "name": "L. Cahn",
                        "slug": "L.-Cahn",
                        "structuredName": {
                            "firstName": "Leonard",
                            "lastName": "Cahn",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Cahn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48929363"
                        ],
                        "name": "C. Ray",
                        "slug": "C.-Ray",
                        "structuredName": {
                            "firstName": "C",
                            "lastName": "Ray",
                            "middleNames": [
                                "B"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Ray"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35445395"
                        ],
                        "name": "G. Urban",
                        "slug": "G.-Urban",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Urban",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Urban"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14570817,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d75690f1ce3060fbed301c4de93ee2ee34dcd6d7",
            "isKey": false,
            "numCitedBy": 101,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "In almost all digital data processing machine applications, the input data made available to the machine are the result of some prior processing. This processing is done manually in many applications. Thus, such inputs as punched cards, magnetic tape, and punched paper tape often are the result of a manual processing operation in which a human being is required to inspect visually an array of printed characters and to describe these data in a form capable of being processed by machine. In recognition of the importance of automating such operations, many investigations have been undertaken to devise automatic character sensing equipment. Suppose, however, that we attempt to view such efforts in proper perspective. We find a more fundamental problem that has, heretofore, failed to receive the attention that it warrants. The problem is one of making directly available to a computer pictorial information which would ordinarily be visually processed by human beings before being fed to a data processing system. This pictorial information may range from such highly stylized forms as printed characters, diagrams, schematic drawings, emblems, and designs through less stylized forms in cartoons and handwritten characters to such highly amorphous forms as photographs of real objects, e.g., people, aerial views, and microscopic and telescopic images."
            },
            "slug": "Experiments-in-processing-pictorial-information-a-Kirsch-Cahn",
            "title": {
                "fragments": [],
                "text": "Experiments in processing pictorial information with a digital computer"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "In almost all digital data processing machine applications, the input data made available to the machine are the result of a manual processing operation in which a human being is required to inspect visually an array of printed characters and to describe these data in a form capable of being processed by machine."
            },
            "venue": {
                "fragments": [],
                "text": "IRE-ACM-AIEE '57 (Eastern)"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48603437"
                        ],
                        "name": "A. Newell",
                        "slug": "A.-Newell",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Newell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Newell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1888963"
                        ],
                        "name": "F. Tonge",
                        "slug": "F.-Tonge",
                        "structuredName": {
                            "firstName": "Fred",
                            "lastName": "Tonge",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Tonge"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 16609075,
            "fieldsOfStudy": [
                "Computer Science",
                "Linguistics"
            ],
            "id": "0f8b1d1e84ae2417e3a5d224494e10693e3fb2e4",
            "isKey": false,
            "numCitedBy": 41,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "~ ~ ~ ~,,~, ill ̧ ..... :i '.~1 h~ troduction a ~\" Tbis paper is an informal introduction t,o Information ~:~.~:, i}:: }~r{(essit~g Language V (IPL-V), a symbol and list-struc'~ ~}:>:< << ~ure lnatfipulacing language present ly implemented on the IBM (i50, 704 :rod 709. I t contains a discussion of the p'ot,lem context; in which a series of Information Processi~)g L:mguages has developed and of the basic concepts i~corporated in [PL-V. t A complete description of the hmguage can be found in the I P L V Programmer's Manual 51."
            },
            "slug": "An-introduction-to-information-processing-language-Newell-Tonge",
            "title": {
                "fragments": [],
                "text": "An introduction to information processing language V"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "This paper is an informal introduction to Language V (IPL-V), a symbol and list-struc language present ly implemented on the IBM and contains a discussion of the hmguage, a series of Information Processes developed and of the basic concepts in [PL-V."
            },
            "venue": {
                "fragments": [],
                "text": "Commun. ACM"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4605464"
                        ],
                        "name": "W. McCulloch",
                        "slug": "W.-McCulloch",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "McCulloch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. McCulloch"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 60
                            }
                        ],
                        "text": "On problems of volition we are in general agreement with\n55\nMcCulloch [75] that our freedom of will \"presumably means no more than that we can distinguish between what we intend [i.e., our plan], and some intervention in our action.\""
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 50,
                                "start": 41
                            }
                        ],
                        "text": "In their pioneering paper 1947 Pitts and McCulloch [10] describe a general technique for forming invariant properties from noninvariant ones, assuming that the transformation space has a certain (group) structure."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 185,
                                "start": 176
                            }
                        ],
                        "text": "May 1958 [82] N. Rochester, et al., \"Tests on a cell assembly theory of the action of the brain, using a large digital computer,\" in [L] [83] J. Y. Lettvin, H. Maturana, W. S. McCulloch, and W. Pitts \"What the frog’s eye tells the frog’s brain,\" Proc."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 11
                            }
                        ],
                        "text": "[75] W. S. McCulloch, \"Through the den of the metaphysician,\" Brit."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 24
                            }
                        ],
                        "text": "[10] W. Pitts and W. S. McCulloch, \"How we know universals,\" Bull."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 13
                            }
                        ],
                        "text": "55 McCulloch [75] that our freedom of will \"presumably means no more than that we can distinguish between what we intend [i."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2575570,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "8ded7cd1ae23f98166a190ba2bb4a9d8ca59e94a",
            "isKey": true,
            "numCitedBy": 20,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "W E are again in one of those prodigious periods of scientific progress —in its own way like the pre-Socratic period to which we are still indebted for the crisp formulation of our physical problems and, consequently, for our epistemological quandary. Anyone who has had the good fortune to listen to Wiener and von Neumann and Rosenblucth and Pitts wrestling with the problems of modern computing machines that know and want, has a strange sense that he is listening to a colloquy of the ancients. But they would be the first to tell you that they themselves are drunk with an American wine of an older vintage ; they quote liberally from Charles Peirce and from Josiah Willard Gibbs. These men have altered our metaphysics by altering our physics. It is epistemology that is most affected, for it is the physics of communication which is today receiving an adequate theoretical treatment. For the first time in the history of science we know how we know and hence are able to state it clearly. Physiologists, working on the central nervous system, have long had such a goal in mind, Rudolph Magnus, inspired by Immanuel Kant, made his last great lecture one on ' the physiology of the a priori' by which he meant how those mechanisms work that determine for us the three-dimensional nature of our world, its axes and its angles, and that give to us our sense of velocity and acceleration, from which he held our notion of time to be in large measure derived. Perhaps the most notable attempt of this sort was by Sir Charles Sherrington, entitled Man on his Nature, for, near the end of a life spent on studying the ways of the brain, he was forced to the conclusion that ' in this world, Mind goes more ghostly than a ghost'. The reason for his failure was simply that his physics was not adequate to the problem that he had undertaken. That has so regularly been the shortcoming of scientists who would have approached this problem, that even Clerk Maxwell, who wanted nodiing more than to know the relation between thoughts and the molecular morions of the brain, cut short his query with the memorable phrase, ' but does not the way to"
            },
            "slug": "THROUGH-THE-DEN-OF-THE-METAPHYSICIAN*-McCulloch",
            "title": {
                "fragments": [],
                "text": "THROUGH THE DEN OF THE METAPHYSICIAN*"
            },
            "venue": {
                "fragments": [],
                "text": "The British Journal for the Philosophy of Science"
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117178130"
                        ],
                        "name": "W. H. F. Barnes",
                        "slug": "W.-H.-F.-Barnes",
                        "structuredName": {
                            "firstName": "Winston",
                            "lastName": "Barnes",
                            "middleNames": [
                                "H.",
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. H. F. Barnes"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 84,
                                "start": 80
                            }
                        ],
                        "text": "Concerning the \"mind-brain\" problem, one should consider the arguments of Craik [77], Hayek [78] and Pask [79]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 81,
                                "start": 76
                            }
                        ],
                        "text": "[76] D. M. MacKay, \"Operational aspects of intellect,\" in [C] [77] K. J. W. Craik \"The Nature of Explanation,\" Cambridge Univ. Press, 1952."
                    },
                    "intents": []
                }
            ],
            "corpusId": 4084461,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "ee66f87c06337fb430a90897112de06fb61f6a9f",
            "isKey": false,
            "numCitedBy": 914,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "AT a time when professional philosophers are trying to persuade us that philosophy is an attempt to answer questions which should never have been asked, and professional scientists are taking over the task of answering the questions, it is refreshing to come upon a writer on philosophy who, after a few preliminary skirmishes with the modern sceptics, unhesitatingly attacks a philosophical problem by the plain scientific method. Dr. Craik makes his philosophical point of view crystal clear. He believes in the methods of the observational scientists as the only methods of explanation. He is intolerant only of those who will not experiment and who consider that the virtue of thought is analytic precision rather than fruitfulness in the experimental field. He confesses that he has no gift for analytic precision and is particularly addicted to confusing similar concepts. He is, quite clearly, not deeply versed in traditional philosophy. This gives his book a certain freshness of outlook, although it makes his criticisms of the great philosophers, particularly Kant, appear rather naïve.The Nature of ExplanationBy Dr. K. J. W. Craik. Pp. viii + 124. (Cambridge: At the University Press, 1943.) 6s. net."
            },
            "slug": "The-Nature-of-Explanation-Barnes",
            "title": {
                "fragments": [],
                "text": "The Nature of Explanation"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1944
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66999827"
                        ],
                        "name": "Kenneth L. Artis",
                        "slug": "Kenneth-L.-Artis",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Artis",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kenneth L. Artis"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 57665954,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "0366fb9db0e086800f0c8189499275a39a8f0b02",
            "isKey": false,
            "numCitedBy": 958,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "During the past 20 years, research in the behavioral sciences has become increasingly sophisticated. New findings concerning the brain and behavior have forced upon us the unpleasant necessity of reexamining our models. Concepts once useful, such as \"the unconscious,\" \"regression,\" and \"motivation,\" no longer serve to adequately encompass the data. Ashby is a representative of this new order of sophistication in research, as he proceeds to investigate the problem of the brain's orderliness. He accepts, as fact, that the nervous system behaves adaptively and assumes that it is, in its essentials, mechanistic. These two data are approached as not irreconcilable. From this point, he proceeds to examine dynamic systems from the standpoint of rigorous scientific —dominantly mathematical—logic until he has evolved a theoretical counterpart of brain functioning. He then builds and experiments with a prototype electronic model, which he names the \"Homeostat,\" and tests various aspects of his theories of"
            },
            "slug": "Design-for-a-Brain-Artis",
            "title": {
                "fragments": [],
                "text": "Design for a Brain"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Ashby accepts, as fact, that the nervous system behaves adaptively and assumes that it is, in its essentials, mechanistic, and examines dynamic systems from the standpoint of rigorous scientific —dominantly mathematical—logic until he has evolved a theoretical counterpart of brain functioning."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66830300"
                        ],
                        "name": "I. S. Gradshteĭn",
                        "slug": "I.-S.-Gradshteĭn",
                        "structuredName": {
                            "firstName": "I.",
                            "lastName": "Gradshteĭn",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. S. Gradshteĭn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 33
                            }
                        ],
                        "text": "The view expressed by Rosenbloom [73] that minds (or brains) can transcend machines is based, apparently, on an erroneous interpretation of the meaning of the \"unsolvability theorems\" of Godel."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 27,
                                "start": 17
                            }
                        ],
                        "text": "\" in [K] [73] P. Rosenbloom, \"Elements of Mathematical Logic,\" Dover Publications, New York, N. Y., 1951 [74] H. Rogers, \"Review of ’Godel’s Proof’ by Newman and Nagel,\" Am."
                    },
                    "intents": []
                }
            ],
            "corpusId": 58433606,
            "fieldsOfStudy": [
                "Philosophy",
                "Mathematics"
            ],
            "id": "99338adde12a235040c93333fec78765b0541880",
            "isKey": false,
            "numCitedBy": 119,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "THE-ELEMENTS-OF-MATHEMATICAL-LOGIC-Gradshteĭn",
            "title": {
                "fragments": [],
                "text": "THE ELEMENTS OF MATHEMATICAL LOGIC"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145103341"
                        ],
                        "name": "H. Rogers",
                        "slug": "H.-Rogers",
                        "structuredName": {
                            "firstName": "Hartley",
                            "lastName": "Rogers",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Rogers"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49957888"
                        ],
                        "name": "E. Nagel",
                        "slug": "E.-Nagel",
                        "structuredName": {
                            "firstName": "Ernest",
                            "lastName": "Nagel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Nagel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "98375441"
                        ],
                        "name": "J. R. Newman",
                        "slug": "J.-R.-Newman",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Newman",
                            "middleNames": [
                                "Roy"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. R. Newman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124507034,
            "fieldsOfStudy": [
                "Philosophy",
                "Computer Science",
                "Mathematics"
            ],
            "id": "89845967c1bfeeec0b0fd280bb778c7e15884934",
            "isKey": false,
            "numCitedBy": 30,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "In 1931 Kurt Godel published his fundamental paper, \"On Formally Undecidable Propositions of \"Principia Mathematica\" and Related Systems.\" This revolutionary paper challenged certain basic assumptions underlying much research in mathematics and logic. Godel received public recognition of his work in 1951 when he was awarded the first Albert Einstein Award for achievement in the natural sciences perhaps the highest award of its kind in the United States. The award committee described his work in mathematical logic as \"one of the greatest contributions to the sciences in recent times.\" However, few mathematicians of the time were equipped to understand the young scholar's complex proof. Ernest Nagel and James Newman provide a readable and accessible explanation to both scholars and non-specialists of the main ideas and broad implications of Godel's discovery. It offers every educated person with a taste for logic and philosophy the chance to understand a previously difficult and inaccessible subject. New York University Press is proud to publish this special edition of one of its bestselling books. With a new introduction by Douglas R. Hofstadter, this book will appeal students, scholars, and professionals in the fields of mathematics, computer science, logic and philosophy, and science.\""
            },
            "slug": "Godel's-Proof.-Rogers-Nagel",
            "title": {
                "fragments": [],
                "text": "Godel's Proof."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2026553"
                        ],
                        "name": "O. Selfridge",
                        "slug": "O.-Selfridge",
                        "structuredName": {
                            "firstName": "Oliver",
                            "lastName": "Selfridge",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Selfridge"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 24
                            }
                        ],
                        "text": "The papers of Selfridge [12], [43], have beeni a major influence on work in this general area."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 23,
                                "start": 14
                            }
                        ],
                        "text": "The papers of Selfridge [12], [43], have been a major influence on work in this general area."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 91
                            }
                        ],
                        "text": "A general review of Doyle’s work and other pattern-recognition experiments will be found in Selfridge and Neisser [20]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 11
                            }
                        ],
                        "text": "[19] O. G. Selfridge, \"Pandemonium: a paradigm for learning,\" in [C] [20] O. G. Selfridge and U Neisser, \"Pattern recognition by machine,\" Sci."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 9,
                                "start": 0
                            }
                        ],
                        "text": "Selfridge describes how the machine might learn new useful properties."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 91
                            }
                        ],
                        "text": "F. Generating Properties The problem of generating useful properties has been discussed by Selfridge [12]; we shall summarize his approach."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 89
                            }
                        ],
                        "text": "These nets resemble the general schematic diagrams proposed in the “Pandemonium” model of [Selfridge 19, Fig."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 29,
                                "start": 20
                            }
                        ],
                        "text": "21\nOur Ei units are Selfridge’s \"data demons.”"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 28
                            }
                        ],
                        "text": "[07] M. L. Minsky and O. G. Selfridge, \"Learning in random nets,\" in [H]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 80,
                                "start": 76
                            }
                        ],
                        "text": "The problem of generating useful properties has been discussed by Selfridge [12]; we shall summarize his approach."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 91
                            }
                        ],
                        "text": "[11] N. Wiener, \"Cybernetics,\" John Wiley and Sons, Inc., New York, N. Y., 1948 [12] O. G. Selfridge, \"Pattern recognition and modern computers,\" [13] G. P. Dinneen, \"Programming pattern recognition,\" in [A]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 21
                            }
                        ],
                        "text": "One may think of the Selfridge proposal as a system that uses a finite-state language to describe its properties."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 111,
                                "start": 102
                            }
                        ],
                        "text": "[42] N. Tinbergen, \"The Study of Instinct,\" Oxford University Press, New York, N. Y., 1951 [43] O. G. Selfridge, \" Pattern recognition and learning\" in [J] [44] B. F. Skinner, \"Science and Human Behavior,\" The Macmillan Co., New York, N. Y., 1953."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 38,
                                "start": 34
                            }
                        ],
                        "text": "I consider the lines of attack in [12], [15], [18] and [55], although still incomplete, to be of the"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8721044,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "48bb173e9586949d263086926d01d6e66cc177d5",
            "isKey": true,
            "numCitedBy": 150,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "We consider the process we call Pattern Recognition. By this we mean the extraction of the significant features of data from a background of irrelevant detail. What we are interested in is simulating this process on digital computers. We give examples on three levels of complexity corresponding to the subjects of the other three speakers here today. We examine in detail the problem on the second level, visual recognition of simple shapes."
            },
            "slug": "Pattern-recognition-and-modern-computers-Selfridge",
            "title": {
                "fragments": [],
                "text": "Pattern recognition and modern computers"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "This work considers the process the authors call Pattern Recognition, the extraction of the significant features of data from a background of irrelevant detail, and examines in detail the problem on the second level, visual recognition of simple shapes."
            },
            "venue": {
                "fragments": [],
                "text": "AFIPS '55 (Western)"
            },
            "year": 1955
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1822658"
                        ],
                        "name": "C. Mooers",
                        "slug": "C.-Mooers",
                        "structuredName": {
                            "firstName": "Calvin",
                            "lastName": "Mooers",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Mooers"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 57926755,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c3e12390899a4af23a9c40336518da5e7287cda4",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "It is a pleasure, as a visitor to your country, to find myself invited to talk to this audience about information retrieval. The invitation, as it came to me, contained the implication that there was a considerable curiosity here about my activities in this field in the United States. Some preliminary reconnoitring before the meeting convinced me that this was indeed the case. Your curiosity, then, furnishes me with an excellent excuse to talk about a number of things that I have been doing over the past few years."
            },
            "slug": "ZATOCODING-AND-DEVELOPMENTS-IN-INFORMATION-Mooers",
            "title": {
                "fragments": [],
                "text": "ZATOCODING AND DEVELOPMENTS IN INFORMATION RETRIEVAL"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "It is a pleasure, as a visitor to your country, to find myself invited to talk to this audience about information retrieval, and your curiosity furnishes me with an excellent excuse to talk about a number of things that I have been doing over the past few years."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5647202"
                        ],
                        "name": "J. Lettvin",
                        "slug": "J.-Lettvin",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Lettvin",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lettvin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2701850"
                        ],
                        "name": "H. Maturana",
                        "slug": "H.-Maturana",
                        "structuredName": {
                            "firstName": "Humberto",
                            "lastName": "Maturana",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Maturana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4605464"
                        ],
                        "name": "W. McCulloch",
                        "slug": "W.-McCulloch",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "McCulloch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. McCulloch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50314979"
                        ],
                        "name": "W. Pitts",
                        "slug": "W.-Pitts",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Pitts",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pitts"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[83] is related to the theories in [19]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8739509,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bc4e084831b9f987826b2cf184356e347ee155f8",
            "isKey": false,
            "numCitedBy": 1756,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we analyze the activity of single fibers in the optic nerve of a frog. Our method is to find what sort of stimulus causes the largest activity in one nerve fiber and then what is the exciting aspect of that stimulus such that variations in everything else cause little change in the response. It has been known for the past 20 years that each fiber is connected not to a few rods and cones in the retina but to very many over a fair area. Our results show that for the most part within that area, it is not the light intensity itself but rather the pattern of local variation of intensity that is the exciting factor. There are four types of fibers, each type concerned with a different sort of pattern. Each type is uniformly distributed over the whole retina of the frog. Thus, there are four distinct parallel distributed channels whereby the frog's eye informs his brain about the visual image in terms of local pattern independent of average illumination. We describe the patterns and show the functional and anatomical separation of the channels. This work has been done on the frog, and our interpretation applies only to the frog."
            },
            "slug": "What-the-Frog's-Eye-Tells-the-Frog's-Brain-Lettvin-Maturana",
            "title": {
                "fragments": [],
                "text": "What the Frog's Eye Tells the Frog's Brain"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The results show that for the most part within that area of the optic nerve of a frog, it is not the light intensity itself but rather the pattern of local variation of intensity that is the exciting factor."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IRE"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144052502"
                        ],
                        "name": "A. Bernstein",
                        "slug": "A.-Bernstein",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Bernstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bernstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2073906848"
                        ],
                        "name": "T. Arbuckle",
                        "slug": "T.-Arbuckle",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Arbuckle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Arbuckle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102710714"
                        ],
                        "name": "M. D. Roberts",
                        "slug": "M.-D.-Roberts",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Roberts",
                            "middleNames": [
                                "de",
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. D. Roberts"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38710334"
                        ],
                        "name": "M. A. Belsky",
                        "slug": "M.-A.-Belsky",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Belsky",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. A. Belsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14587022,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "23568b2f2e092fb6c8233ce91c9985b0865650b4",
            "isKey": false,
            "numCitedBy": 39,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes the program which enables a human being to play a game of chess with the International Business Machines Corporation (IBM) 704 computer. The machine may play either white or black, and is capable of playing a complete game of chess, including such moves as castling, promoting, and capturing en passant."
            },
            "slug": "A-chess-playing-program-for-the-IBM-704-Bernstein-Arbuckle",
            "title": {
                "fragments": [],
                "text": "A chess playing program for the IBM 704"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "The program which enables a human being to play a game of chess with theIBM 704 computer is described, which is capable of playing a complete game of Chess, including such moves as castling, promoting, and capturing en passant."
            },
            "venue": {
                "fragments": [],
                "text": "IRE-ACM-AIEE '58 (Western)"
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "114531657"
                        ],
                        "name": "Noam Chomsky",
                        "slug": "Noam-Chomsky",
                        "structuredName": {
                            "firstName": "Noam",
                            "lastName": "Chomsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Noam Chomsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2114422629"
                        ],
                        "name": "G. A. Miller",
                        "slug": "G.-A.-Miller",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Miller",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. A. Miller"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 288,
                                "start": 284
                            }
                        ],
                        "text": "There is quite a literature concerning this subject, but we shall discuss only one approach which currently seems to us the most promising; this is what we might call the \"grammatical induction\" schemes of Solomonoff [55], [16], [17], based partly on work of Chomsky and Miller [80], [81]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 722338,
            "fieldsOfStudy": [
                "Computer Science",
                "Linguistics"
            ],
            "id": "1c2c6558d2b7be61d1f4910d7ff438ffbda52890",
            "isKey": false,
            "numCitedBy": 373,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Finite-State-Languages-Chomsky-Miller",
            "title": {
                "fragments": [],
                "text": "Finite State Languages"
            },
            "venue": {
                "fragments": [],
                "text": "Inf. Control."
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "150339870"
                        ],
                        "name": "William M. Smith",
                        "slug": "William-M.-Smith",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Smith",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "William M. Smith"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1678200"
                        ],
                        "name": "J. Bruner",
                        "slug": "J.-Bruner",
                        "structuredName": {
                            "firstName": "Jérôme",
                            "lastName": "Bruner",
                            "middleNames": [
                                "Seymour"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bruner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47450227"
                        ],
                        "name": "J. Goodnow",
                        "slug": "J.-Goodnow",
                        "structuredName": {
                            "firstName": "Jacqueline",
                            "lastName": "Goodnow",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Goodnow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "115893834"
                        ],
                        "name": "G. A. Austin",
                        "slug": "G.-A.-Austin",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Austin",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. A. Austin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 146920833,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "224f5b57675009dcf3b82452fba16dd922181038",
            "isKey": false,
            "numCitedBy": 1401,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A Study of Thinking is a pioneering account of how human beings achieve a measure of rationality in spite of the constraints imposed by bias, limited attention and memory, and the risks of error imposed by pressures of time and ignorance. First published in 1956 and hailed at its appearance as a groundbreaking study, it is still read three decades later as a major contribution to our understanding of the mind. In their insightful new introduction, the authors relate the book to the cognitive revolution and its handmaiden, artificial intelligence."
            },
            "slug": "A-Study-of-Thinking-Smith-Bruner",
            "title": {
                "fragments": [],
                "text": "A Study of Thinking"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144461837"
                        ],
                        "name": "C. Shannon",
                        "slug": "C.-Shannon",
                        "structuredName": {
                            "firstName": "Claude",
                            "lastName": "Shannon",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Shannon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 110843509,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4c748a41adc3ea4362054c945ffa4f6b56b131dc",
            "isKey": false,
            "numCitedBy": 758,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "THE theory of switching circuits may be divided into two major divisions, analysis and synthesis. The problem of analysis, determining the manner of operation of a given switching circuit, is comparatively simple. The inverse problem of finding a circuit satisfying certain given operating conditions, and in particular the best circuit is, in general, more difficult and more important from the practical standpoint. A basic part of the general synthesis problem is the design of a two-terminal network with given operating characteristics, and we shall consider some aspects of this problem."
            },
            "slug": "The-synthesis-of-two-terminal-switching-circuits-Shannon",
            "title": {
                "fragments": [],
                "text": "The synthesis of two-terminal switching circuits"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A basic part of the general synthesis problem is the design of a two-terminal network with given operating characteristics, and this work shall consider some aspects of this problem."
            },
            "venue": {
                "fragments": [],
                "text": "Bell Syst. Tech. J."
            },
            "year": 1949
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145686497"
                        ],
                        "name": "W. Doyle",
                        "slug": "W.-Doyle",
                        "structuredName": {
                            "firstName": "Worthie",
                            "lastName": "Doyle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Doyle"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 6
                            }
                        ],
                        "text": "Doyle [26] without normalization but with quite sophisticated properties"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 18604898,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "59fd78cc37b9aeee1490639b6d0fbaf09a393536",
            "isKey": false,
            "numCitedBy": 44,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "This report describes a pattern recognition scheme particularly intended to handle noisy and highly distorted data. The sample is subjected to a set of tests at the conclusion of which a single decision is made. The decision is made on the basis of experience obtained from prior processing of labelled samples. The method has been applied to hand-printed English capitals but is evidently general. Results are given for some trials made on the IBM 709."
            },
            "slug": "Recognition-of-sloppy,-hand-printed-characters-Doyle",
            "title": {
                "fragments": [],
                "text": "Recognition of sloppy, hand-printed characters"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "A pattern recognition scheme particularly intended to handle noisy and highly distorted data, which has been applied to hand-printed English capitals but is evidently general."
            },
            "venue": {
                "fragments": [],
                "text": "IRE-AIEE-ACM '60 (Western)"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143805236"
                        ],
                        "name": "J. McCarthy",
                        "slug": "J.-McCarthy",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "McCarthy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. McCarthy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 62564854,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "494aedf82da4755badc1fe74e4d21cf5fc029e9d",
            "isKey": false,
            "numCitedBy": 1146,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : This paper discusses programs to manipulate in a suitable formal language (most likely a part of the predicate calculus) common instrumental statements. The basic program will draw immediate conclusions from a list of premises. These conclusions will be either declarative or imperative sentences. When an imperative sentence is deduced the program takes a corresponding action. These actions may include printing sentences, moving sentences on lists, and reinitiating the basic deduction process on these lists."
            },
            "slug": "Programs-with-common-sense-McCarthy",
            "title": {
                "fragments": [],
                "text": "Programs with common sense"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "This paper discusses programs to manipulate in a suitable formal language (most likely a part of the predicate calculus) common instrumental statements, where the basic program will draw immediate conclusions from a list of premises."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143635905"
                        ],
                        "name": "N. Rochester",
                        "slug": "N.-Rochester",
                        "structuredName": {
                            "firstName": "Nathaniel",
                            "lastName": "Rochester",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Rochester"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144404817"
                        ],
                        "name": "J. Holland",
                        "slug": "J.-Holland",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Holland",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Holland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "29386434"
                        ],
                        "name": "L. Haibt",
                        "slug": "L.-Haibt",
                        "structuredName": {
                            "firstName": "L.",
                            "lastName": "Haibt",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Haibt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34594658"
                        ],
                        "name": "W. Duda",
                        "slug": "W.-Duda",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Duda",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Duda"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 3045897,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "878d615b84cf779e162f62c4a9192d6bddeefbf9",
            "isKey": false,
            "numCitedBy": 306,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Theories by D.O. Hebb and P.M. Milner on how the brain works were tested by simulating neuron nets on the IBM Type 704 Electronic Calculator. The formation of cell assemblies from an unorganized net of neurons was demonstrated, as well as a plausible mechanism for short-term memory and the phenomena of growth and fractionation of cell assemblies. The cell assemblies do not yet act just as the theory requires, but changes in the theory and the simulation offer promise for further experimentation."
            },
            "slug": "Tests-on-a-cell-assembly-theory-of-the-action-of-a-Rochester-Holland",
            "title": {
                "fragments": [],
                "text": "Tests on a cell assembly theory of the action of the brain, using a large digital computer"
            },
            "venue": {
                "fragments": [],
                "text": "IRE Trans. Inf. Theory"
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16928065"
                        ],
                        "name": "F. Hohn",
                        "slug": "F.-Hohn",
                        "structuredName": {
                            "firstName": "Franz",
                            "lastName": "Hohn",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Hohn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16782303"
                        ],
                        "name": "S. Seshu",
                        "slug": "S.-Seshu",
                        "structuredName": {
                            "firstName": "Sundaram",
                            "lastName": "Seshu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Seshu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16927519"
                        ],
                        "name": "D. Aufenkamp",
                        "slug": "D.-Aufenkamp",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Aufenkamp",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Aufenkamp"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 206673125,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "4824ab96dd8ceb7a594ee6e4de9dba0451823181",
            "isKey": false,
            "numCitedBy": 45,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents the general concept of a weighted directed graph which we call a net. Illustrative examples leading up to the definition of a net indicate its applicability to a wide variety of problems in communication and network theory. A number of theorems concerning the proper paths of a net are established. A non-arithmetic matrix calculus is developed to facilitate computations and formalize proofs. In later papers, the techniques presented here will be exploited in the study of the theory of sequential machines."
            },
            "slug": "The-Theory-of-Nets-Hohn-Seshu",
            "title": {
                "fragments": [],
                "text": "The Theory of Nets"
            },
            "tldr": {
                "abstractSimilarityScore": 64,
                "text": "This paper presents the general concept of a weighted directed graph which is called a net, and a non-arithmetic matrix calculus is developed to facilitate computations and formalize proofs."
            },
            "venue": {
                "fragments": [],
                "text": "IRE Trans. Electron. Comput."
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50314979"
                        ],
                        "name": "W. Pitts",
                        "slug": "W.-Pitts",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Pitts",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pitts"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4605464"
                        ],
                        "name": "W. McCulloch",
                        "slug": "W.-McCulloch",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "McCulloch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. McCulloch"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36971397,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "0e9b804adcedfe82d5139b572c5c165fa161efb7",
            "isKey": false,
            "numCitedBy": 753,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Two neural mechanisms are described which exhibit recognition of forms. Both are independent of small perturbations at synapses of excitation, threshold, and synchrony, and are referred to partiular appropriate regions of the nervous system, thus suggesting experimental verification. The first mechanism averages an apparition over a group, and in the treatment of this mechanism it is suggested that scansion plays a significant part. The second mechanism reduces an apparition to a standard selected from among its many legitimate presentations. The former mechanism is exemplified by the recognition of chords regardless of pitch and shapes regardless of size. The latter is exemplified here only in the reflexive mechanism translating apparitions to the fovea. Both are extensions to contemporaneous functions of the knowing of universals heretofore treated by the authors only with respect to sequence in time."
            },
            "slug": "How-we-know-universals;-the-perception-of-auditory-Pitts-McCulloch",
            "title": {
                "fragments": [],
                "text": "How we know universals; the perception of auditory and visual forms."
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "Two neural mechanisms are described which exhibit recognition of forms which are independent of small perturbations at synapses of excitation, threshold, and synchrony, and are referred to partiular appropriate regions of the nervous system, thus suggesting experimental verification."
            },
            "venue": {
                "fragments": [],
                "text": "The Bulletin of mathematical biophysics"
            },
            "year": 1947
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34099369"
                        ],
                        "name": "B. Farley",
                        "slug": "B.-Farley",
                        "structuredName": {
                            "firstName": "B.",
                            "lastName": "Farley",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Farley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113802893"
                        ],
                        "name": "W. A. Clark",
                        "slug": "W.-A.-Clark",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Clark",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. A. Clark"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 36
                            }
                        ],
                        "text": ", in the machines of [22], [25] and [92], etc."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 110
                            }
                        ],
                        "text": "Some important omissions are in the area of ’brain models\"; the early work of Belmont Farley and Wesley Clark [92] (also Farley’s paper in [D], often unknowingly duplicated, and the work of Nathaniel Rochester [82] and Peter Milner [D]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 108,
                                "start": 77
                            }
                        ],
                        "text": "Some important omissions are in the area of ’brain models\"; the early work of Belmont Farley and Wesley Clark [92] (also Farley’s paper in [D], often unknowingly duplicated, and the work of Nathaniel Rochester [82] and Peter Milner [D].)"
                    },
                    "intents": []
                }
            ],
            "corpusId": 28327238,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "879650714f3dce59b666346ccf63fd73250259d6",
            "isKey": true,
            "numCitedBy": 263,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "A general discussion of ideas and definitions relating to self-organizing systems and their synthesis is given, together with remarks concerning their simulation by digital computer. Synthesis and simulation of an actual system is then described. This system, initially randomly organized within wide limits, organizes itself to perform a simple prescribed task."
            },
            "slug": "Simulation-of-self-organizing-systems-by-digital-Farley-Clark",
            "title": {
                "fragments": [],
                "text": "Simulation of self-organizing systems by digital computer"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A general discussion of ideas and definitions relating to self-organizing systems and their synthesis is given, together with remarks concerning their simulation by digital computer."
            },
            "venue": {
                "fragments": [],
                "text": "Trans. IRE Prof. Group Inf. Theory"
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2078504"
                        ],
                        "name": "M. Shubik",
                        "slug": "M.-Shubik",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Shubik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Shubik"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 16
                            }
                        ],
                        "text": ", Martin Shubik [85]; and Psychology, e."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 220,
                                "start": 207
                            }
                        ],
                        "text": "There are entire literatures we have hardly even sampled-the bold pioneering of Nicholas Rashevsky (c. 1929) and his later co-workers [95]; Theories of Learning, e.g., Saul Gorn [84]; Theory of Games, e.g., Martin Shubik [85]; and Psychology, e.g., Jerome Bruner, et al. [861."
                    },
                    "intents": []
                }
            ],
            "corpusId": 154529139,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "b57a293914ebf09249b4a8759da0d7a9fd886bcf",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "A survey of the current relationship between the many different problem areas investigated by means of Game Theory and the study of Industrial Organization is presented. Several examples are provided to illustrate the nature and relevance of work on 1 two-person constant-sum games; 2 the extensive form of a game; 3 theories of solution for n-person games; 4 theories of solutions for games against nature; and 5 theories of solution for dynamic games. The nature and state of the current applications of game theory to organizational problems and to parts of the behavorial sciences are summarized."
            },
            "slug": "Games-Decisions-and-Industrial-Organization-Shubik",
            "title": {
                "fragments": [],
                "text": "Games Decisions and Industrial Organization"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A survey of the current relationship between the many different problem areas investigated by means of Game Theory and the study of Industrial Organization is presented."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1798583"
                        ],
                        "name": "W. Bledsoe",
                        "slug": "W.-Bledsoe",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Bledsoe",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Bledsoe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2085594395"
                        ],
                        "name": "I. Browning",
                        "slug": "I.-Browning",
                        "structuredName": {
                            "firstName": "I.",
                            "lastName": "Browning",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Browning"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 110,
                                "start": 90
                            }
                        ],
                        "text": "[23] W. H. Highleyman and L. A. Kamentsky, \"Comments on a character recognition method of Bledsoe and Browning\" (Correspondence), IRE Trans."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 34,
                                "start": 26
                            }
                        ],
                        "text": "[24] W. W. Bledsoe and I. Browning, \"Pattern recognition and reading by machine, in [F]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 0
                            }
                        ],
                        "text": "Bledsoe and Browning [24] claim good results with point-pair properties."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 21
                            }
                        ],
                        "text": "Bledsoe and Browning [24] claim good results with poinit-pair properties."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15672245,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f6e7311b9e560f3a12c895b751d275bac161b31b",
            "isKey": true,
            "numCitedBy": 399,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Many efforts have been made to discriminate, categorize, and quantitate patterns, and to reduce them into a usable machine language. The results have ordinarily been methods or devices with a high degree of specificity. For example, some devices require a special type font; others can read only one type font; still others require magnetic ink."
            },
            "slug": "Pattern-recognition-and-reading-by-machine-Bledsoe-Browning",
            "title": {
                "fragments": [],
                "text": "Pattern recognition and reading by machine"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "Many efforts have been made to discriminate, categorize, and quantitate patterns, and to reduce them into a usable machine language, and the results have ordinarily been methods or devices with a high degree of specificity."
            },
            "venue": {
                "fragments": [],
                "text": "IRE-AIEE-ACM '59 (Eastern)"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144711616"
                        ],
                        "name": "M. Mead",
                        "slug": "M.-Mead",
                        "structuredName": {
                            "firstName": "Margaret",
                            "lastName": "Mead",
                            "middleNames": [
                                "."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Mead"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1622724519"
                        ],
                        "name": "W. P. McN",
                        "slug": "W.-P.-McN",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "McN",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. P. McN"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2624198"
                        ],
                        "name": "H. Abramson",
                        "slug": "H.-Abramson",
                        "structuredName": {
                            "firstName": "Harold",
                            "lastName": "Abramson",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Abramson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 215625491,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "47c457802197a7ad5812d6b156a97233f47dac87",
            "isKey": false,
            "numCitedBy": 713,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "pared, and the successive stages of implantation and placental formation in various mammals are compared with those in man. Although the authors have quite successfully attempted to keep the book as short as possible, they have succeeded in putting much of great value in it with the result that it can be highly recommended. No biological library is complete without a copy of this excellent account of human development."
            },
            "slug": "Cybernetics-Mead-McN",
            "title": {
                "fragments": [],
                "text": "Cybernetics"
            },
            "venue": {
                "fragments": [],
                "text": "The Yale Journal of Biology and Medicine"
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2074588531"
                        ],
                        "name": "J. S. Bomba",
                        "slug": "J.-S.-Bomba",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Bomba",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. S. Bomba"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 15837412,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f084ef9fa0c3ac26e64ee1254b703f35835df4f1",
            "isKey": false,
            "numCitedBy": 43,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a demonstration of the recognition of thirty-four alpha-numeric characters. The IBM 704 EDPM was used as a tool to study the method which led to this demonstration. The Generalized Scanner was used as an input transducer for this study."
            },
            "slug": "Alpha-numeric-character-recognition-using-local-Bomba",
            "title": {
                "fragments": [],
                "text": "Alpha-numeric character recognition using local operations"
            },
            "tldr": {
                "abstractSimilarityScore": 86,
                "text": "This paper describes a demonstration of the recognition of thirty-four alpha-numeric characters through the use of the IBM 704 EDPM."
            },
            "venue": {
                "fragments": [],
                "text": "IRE-AIEE-ACM '59 (Eastern)"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16593401"
                        ],
                        "name": "J. Wozencraft",
                        "slug": "J.-Wozencraft",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Wozencraft",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Wozencraft"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2352437"
                        ],
                        "name": "M. Horstein",
                        "slug": "M.-Horstein",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Horstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Horstein"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 11325609,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5d411caf99b38259ebac4c4eb0ff6b11157af07d",
            "isKey": false,
            "numCitedBy": 60,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "\"January 3, 1961.\" \"Presented at the fourth London Symposium on Information Theory ... 1960.\""
            },
            "slug": "Coding-for-two-way-channels-Wozencraft-Horstein",
            "title": {
                "fragments": [],
                "text": "Coding for two-way channels"
            },
            "tldr": {
                "abstractSimilarityScore": 53,
                "text": "This paper was presented at the fourth London Symposium on Information Theory in 1960 and presented as a monograph on information theory and its applications to science and technology."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2150578122"
                        ],
                        "name": "Gary R Lichtenstein",
                        "slug": "Gary-R-Lichtenstein",
                        "structuredName": {
                            "firstName": "Gary",
                            "lastName": "Lichtenstein",
                            "middleNames": [
                                "R"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gary R Lichtenstein"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4067636,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "01602375916754adcd87c0892bdb6f52108fe69d",
            "isKey": false,
            "numCitedBy": 711,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The dark greyish interior of the meteorite consists of a dull ground-mass relieved by numerous black chondrules and spangles of a brassy mineral which is probably troilite (ferrous sulphide). The chondrules are very hard and compact and may quite easily be rubbed away from the friable ground-mass by the fingers."
            },
            "slug": "[Letter-to-the-Editor]-Lichtenstein",
            "title": {
                "fragments": [],
                "text": "[Letter to the Editor]"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The dark greyish interior of the meteorite consists of a dull ground-mass relieved by numerous black chondrules and spangles of a brassy mineral which is probably troilite (ferrous sulphide)."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1931
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70383240"
                        ],
                        "name": "M. Kneale",
                        "slug": "M.-Kneale",
                        "structuredName": {
                            "firstName": "Martha",
                            "lastName": "Kneale",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Kneale"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145260364"
                        ],
                        "name": "F. Hayek",
                        "slug": "F.-Hayek",
                        "structuredName": {
                            "firstName": "Friedrich",
                            "lastName": "Hayek",
                            "middleNames": [
                                "August",
                                "von"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Hayek"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 27
                            }
                        ],
                        "text": "But the argument, e.g., of Hayek (See 8.69 and 8.79 of [78]) —that we cannot \"fully comprehend the unitary order\" (of our own minds)— ignores the power of recursive description."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 6
                            }
                        ],
                        "text": "79 of [78]) —that we cannot \"fully comprehend the unitary order\" (of our own minds)— ignores the power of recursive description."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 92
                            }
                        ],
                        "text": "Concerning the \"mind-brain\" problem, one should consider the arguments of Craik [77], Hayek [78] and Pask [79]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 11
                            }
                        ],
                        "text": "[78] F. A. Hayek, \"The Sensory Order,\" Routledge and Kegan Paul, London, 1952 [79] G. Pask, \"Physical analogues to the growth of a concept,\" in [C] [80] A. N. Chomsky, \"Syntactic Structures,\" Mouton, The Hague [81] N. Chomsky and G. A. Miller, \"Finite State languages\", Information and Control, v."
                    },
                    "intents": []
                }
            ],
            "corpusId": 144871495,
            "fieldsOfStudy": [
                "Computer Science",
                "Psychology"
            ],
            "id": "fcdcb1ac1a23c765b58d10afaa895d7d46459839",
            "isKey": true,
            "numCitedBy": 448,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Sensory-Order-Kneale-Hayek",
            "title": {
                "fragments": [],
                "text": "The Sensory Order."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1954
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 19,
                                "start": 15
                            }
                        ],
                        "text": ", originate in [14] but seem useful in describing parts of the \"GPS\" system of [57] and [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 155,
                                "start": 151
                            }
                        ],
                        "text": "The geometry machine of Gelernter and Rochester [62], [69] uses such a semantic model with excellent results; it follows closely the lines proposed in [14]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 56
                            }
                        ],
                        "text": "The generatinig problem is discussed further in Minisky [14]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 55
                            }
                        ],
                        "text": "arranged to form some kind of directed-graph structure [14], [57], [62]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Heuristic Aspects of the Artificial Intelligence Problem"
            },
            "venue": {
                "fragments": [],
                "text": "Lincoln Lab., M.I.T., Lexington, Mass., Group Rept. 34-55, ASTIA Doc. No. 236885; December, 1956. (M.I.T. Hayden Library No. H-58.)"
            },
            "year": 1956
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 45,
                                "start": 42
                            }
                        ],
                        "text": "16 uniquely defined Haar measure: the set [F] can be computed without repetitions by scanning through the application of all the transforms T to the given figure so that the invariant property can be defined by their integration over that measure."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 108,
                                "start": 105
                            }
                        ],
                        "text": "} to be the set of all figures equivalent to F under the given set of transformations; further, define P [F] to be the set {P (F1), P (F2), ."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 123
                            }
                        ],
                        "text": "In the case of continuous transformation spaces, there will have to be a measure or the equivalent associated with the set [F] with respect to which the operation AVERAGE is defined, say, as an integration."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 150,
                                "start": 147
                            }
                        ],
                        "text": "The idea behind their mathematical argument is this: suppose that we have a function P of figures, and suppose that for a given figure F we define [F] = {F1, F2 ."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 19
                            }
                        ],
                        "text": "Finally, define P* [F] to be AVERAGE (P [F])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 94
                            }
                        ],
                        "text": "We have to be sure that when different representatives are chosen from a class the collection [F] will always be the same in each case."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "EJCC"
            },
            "venue": {
                "fragments": [],
                "text": "December"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 56,
                                "start": 46
                            }
                        ],
                        "text": "6’ Dev., vol. 3, pp. 282-287, July, [55] R. J. Solomonoff, \"An inductive inference machine,\" 1957 IRE National Convention Record, pt. 2, pp. 56—62 [56] C. D. Darlington, The Evolution of Genetics\", Basic Books, New York, N."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 87
                            }
                        ],
                        "text": "No. 125, Second Intl Congress on Cybernetics Namur, Belgium- September 1958 [17] R. J. Solomonoff \"A new method for discovering the grammars of phrase structure languages,\" in [E]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 11
                            }
                        ],
                        "text": "[16] R. J. Solomonoff, \"The Mechanization of Linguistic Learning,\" Zator Co., Cambridge, Mass., Zator Tech."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 221,
                                "start": 217
                            }
                        ],
                        "text": "There is quite a literature concerning this subject, but we shall discuss only one approach which currently seems to us the most promising; this is what we might call the \"grammatical induction\" schemes of Solomonoff [55], [16], [17], based partly on work of Chomsky and Miller [80], [81]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 11
                            }
                        ],
                        "text": "[18] R. J. Solomonoff, \"A Preliminary Report on a General Theory of Inductive Inference,\" Zator Co., Cambridge, Mass., Zator Tech."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 48
                            }
                        ],
                        "text": "In our own area, perhaps the work of Solomonoff [55], while overly cryptic, shows the most thorough consideration of this dependency, on training sequences."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 55
                            }
                        ],
                        "text": "I consider the lines of attack in [12], [15], [18] and [55], although still incomplete, to be of the greatest importance."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 0
                            }
                        ],
                        "text": "Solomonoff [18 and [55] proposes some techniques for discovering common features of a set of expressions, e.g., of the descriptions of those properties of already established utility; the methods can then be applied to generate new properties with the same common features."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 27
                            }
                        ],
                        "text": "The possible importance of Solomonoff’s work [18] is that it may point the way toward systematic mathematical ways to explore this discovery problem."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Solomonoff, \"An inductive inference machine,"
            },
            "venue": {
                "fragments": [],
                "text": "IRE"
            },
            "year": 1957
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 25
                            }
                        ],
                        "text": "364, June 25, [41] M. E. Stevens, \"A Survey of Automatic Reading Techniques,\" NBS, U. S. Dept. of Commerce, Washington, D. C., Rept."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 121,
                                "start": 117
                            }
                        ],
                        "text": "[21], for discussion of a number of interesting computer image-processing techniques, and see Minot [40] and Stevens [41] for reviews of the reading machine and related problems."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 140,
                                "start": 133
                            }
                        ],
                        "text": "See also Kirsch, et al. [21], for discussion of a number of interesting computer image-processing techniques, and see Minot [40] and Stevens [41] for reviews of the reading machine and related problems."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A Survey of Automatic Reading Techniques"
            },
            "venue": {
                "fragments": [],
                "text": "NBS, U. S. Dept. of Commerce"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144461837"
                        ],
                        "name": "C. Shannon",
                        "slug": "C.-Shannon",
                        "structuredName": {
                            "firstName": "Claude",
                            "lastName": "Shannon",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Shannon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120613413,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "285da5a9c498ea41209005a74e440e0af69b92a6",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Game-playing-machines-Shannon",
            "title": {
                "fragments": [],
                "text": "Game playing machines"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1955
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48493782"
                        ],
                        "name": "H. Evans",
                        "slug": "H.-Evans",
                        "structuredName": {
                            "firstName": "Howard",
                            "lastName": "Evans",
                            "middleNames": [
                                "Ensign"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Evans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 52
                            }
                        ],
                        "text": "One should also examine some biological work, e.g., Tinbergen [42] to see instances in which some discriminations which seem, at first glance very complicated are explained on the basis of a few apparently simple properties arranged in simple decision trees."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 12
                            }
                        ],
                        "text": ", Tinbergen [42] to see instances in which some discriminations which seem, at first glance very complicated are explained on the basis of a few apparently simple properties arranged in simple decision trees."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 8
                            }
                        ],
                        "text": "[42] N. Tinbergen, \"The Study of Instinct,\" Oxford University Press, New York, N. Y., 1951 [43] O. G. Selfridge, \" Pattern recognition and learning\" in [J] [44] B. F. Skinner, \"Science and Human Behavior,\" The Macmillan Co., New York, N. Y., 1953."
                    },
                    "intents": []
                }
            ],
            "corpusId": 87021072,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "26677d48ffc3b9ea7736ea46e12222ae8f7c6f52",
            "isKey": false,
            "numCitedBy": 1033,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Study-of-Instinct-Evans",
            "title": {
                "fragments": [],
                "text": "The Study of Instinct"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1952
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39274396"
                        ],
                        "name": "D. Mackay",
                        "slug": "D.-Mackay",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Mackay",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mackay"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 86529910,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "667401fe63e5df61d127d8670a6dc63d049f3631",
            "isKey": false,
            "numCitedBy": 121,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Epistemological-Problem-for-Automata-Mackay",
            "title": {
                "fragments": [],
                "text": "The Epistemological Problem for Automata"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48603437"
                        ],
                        "name": "A. Newell",
                        "slug": "A.-Newell",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Newell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Newell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144774845"
                        ],
                        "name": "J. Shaw",
                        "slug": "J.-Shaw",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Shaw",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Shaw"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94059053"
                        ],
                        "name": "H. Simon",
                        "slug": "H.-Simon",
                        "structuredName": {
                            "firstName": "Herbert",
                            "lastName": "Simon",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Simon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 195969354,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "4afdf586d99d77660179b833d63e2ef12a95b526",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Empirical-Explorations-Of-The-Logic-Theory-Machine,-Newell-Shaw",
            "title": {
                "fragments": [],
                "text": "Empirical Explorations Of The Logic Theory Machine, A Case Study In Heuristic"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1899
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94653581"
                        ],
                        "name": "J. H. Holland",
                        "slug": "J.-H.-Holland",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Holland",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. H. Holland"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 63368120,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1ed7dc1a78fc1787baef129b6676107c6240ed8e",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-Iterative-Circuit-Computers-Constructed-of-and-Holland",
            "title": {
                "fragments": [],
                "text": "On Iterative Circuit Computers Constructed of Microelectronic Components and Systems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1899
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3396767"
                        ],
                        "name": "W. Ashby",
                        "slug": "W.-Ashby",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Ashby",
                            "middleNames": [
                                "Ross"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Ashby"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 64117217,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "858ae857ed7fd5e3fe9d288f294f62d07596a0fd",
            "isKey": false,
            "numCitedBy": 59,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Design-for-an-Intelligence-Amplifier-Ashby",
            "title": {
                "fragments": [],
                "text": "Design for an Intelligence-Amplifier"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5853144"
                        ],
                        "name": "A. M. Uttley",
                        "slug": "A.-M.-Uttley",
                        "structuredName": {
                            "firstName": "Albert",
                            "lastName": "Uttley",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. M. Uttley"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 63818901,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cf474fe09c8a41e72f6e990a36f0ec70fd92ba6c",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Temporal-and-Spatial-Patterns-in-a-Conditional-Uttley",
            "title": {
                "fragments": [],
                "text": "Temporal and Spatial Patterns in a Conditional Probability Machine"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48603437"
                        ],
                        "name": "A. Newell",
                        "slug": "A.-Newell",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Newell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Newell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144774845"
                        ],
                        "name": "J. Shaw",
                        "slug": "J.-Shaw",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Shaw",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Shaw"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94059053"
                        ],
                        "name": "H. Simon",
                        "slug": "H.-Simon",
                        "structuredName": {
                            "firstName": "Herbert",
                            "lastName": "Simon",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Simon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61618872,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0060344c7de6d7294c6c4bc8ed56a0f5da47596e",
            "isKey": false,
            "numCitedBy": 1154,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Elements-of-a-theory-of-human-problem-solving.-Newell-Shaw",
            "title": {
                "fragments": [],
                "text": "Elements of a theory of human problem solving."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50478329"
                        ],
                        "name": "J. Pierce",
                        "slug": "J.-Pierce",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Pierce",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pierce"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 51633550,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "61ad4f94beb77814f5ddd104ea2b809277a1100d",
            "isKey": false,
            "numCitedBy": 59,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Proceedings-of-the-IRE-Pierce",
            "title": {
                "fragments": [],
                "text": "The Proceedings of the IRE"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IRE"
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "73310562"
                        ],
                        "name": "H. Sherman",
                        "slug": "H.-Sherman",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Sherman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Sherman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 11,
                                "start": 8
                            }
                        ],
                        "text": "Sherman [8], Haller [39] and others have completed programs using line-tracing operations for topological classification."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 35426353,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1d034e72ffc7d604277c52aa0cc4cb1804243c79",
            "isKey": false,
            "numCitedBy": 46,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-quasi-topological-method-for-the-recognition-of-Sherman",
            "title": {
                "fragments": [],
                "text": "A quasi-topological method for the recognition of line patterns"
            },
            "venue": {
                "fragments": [],
                "text": "IFIP Congress"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48603437"
                        ],
                        "name": "A. Newell",
                        "slug": "A.-Newell",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Newell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Newell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144774845"
                        ],
                        "name": "J. Shaw",
                        "slug": "J.-Shaw",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Shaw",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Shaw"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94059053"
                        ],
                        "name": "H. Simon",
                        "slug": "H.-Simon",
                        "structuredName": {
                            "firstName": "Herbert",
                            "lastName": "Simon",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Simon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35199622,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "97876c2195ad9c7a4be010d5cb4ba6af3547421c",
            "isKey": false,
            "numCitedBy": 595,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Report-on-a-general-problem-solving-program-Newell-Shaw",
            "title": {
                "fragments": [],
                "text": "Report on a general problem-solving program"
            },
            "venue": {
                "fragments": [],
                "text": "IFIP Congress"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727567"
                        ],
                        "name": "R. Solomonoff",
                        "slug": "R.-Solomonoff",
                        "structuredName": {
                            "firstName": "Ray",
                            "lastName": "Solomonoff",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Solomonoff"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 49
                            }
                        ],
                        "text": "cal induction\" schemes of Solomonoff [55], [16], [17],"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 29731328,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "6a252d390b991573be65fd2de148a721003e6ee4",
            "isKey": false,
            "numCitedBy": 65,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-new-method-for-discovering-the-grammars-of-phrase-Solomonoff",
            "title": {
                "fragments": [],
                "text": "A new method for discovering the grammars of phrase structure languages"
            },
            "venue": {
                "fragments": [],
                "text": "IFIP Congress"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2793874"
                        ],
                        "name": "W. Highleyman",
                        "slug": "W.-Highleyman",
                        "structuredName": {
                            "firstName": "Wilbur",
                            "lastName": "Highleyman",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Highleyman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "15805169"
                        ],
                        "name": "L. Kamentsky",
                        "slug": "L.-Kamentsky",
                        "structuredName": {
                            "firstName": "Louis",
                            "lastName": "Kamentsky",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Kamentsky"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 57
                            }
                        ],
                        "text": "characters, single-point properties do surprisingly well [23]; this amounts to just \"averaging\" many samples."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 40833808,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bc1c959226d801522621c026b1bf547fe89c83e3",
            "isKey": false,
            "numCitedBy": 21,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Comments-on-a-Character-Recognition-Method-of-and-Highleyman-Kamentsky",
            "title": {
                "fragments": [],
                "text": "Comments on a Character Recognition Method of Bledsoe and Browning"
            },
            "venue": {
                "fragments": [],
                "text": "IRE Trans. Electron. Comput."
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116056609"
                        ],
                        "name": "D. C. Dashfield",
                        "slug": "D.-C.-Dashfield",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Dashfield",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. C. Dashfield"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 46,
                                "start": 43
                            }
                        ],
                        "text": "Several of these are described or cited in [C] and [D]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 147377426,
            "fieldsOfStudy": [
                "Sociology"
            ],
            "id": "5b19e99592c20de854698f3e71a01b2af4b144df",
            "isKey": false,
            "numCitedBy": 1300,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "HER-MAJESTY'S-STATIONERY-OFFICE-Dashfield",
            "title": {
                "fragments": [],
                "text": "HER MAJESTY'S STATIONERY OFFICE"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1954
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proc. EJCC and WJCC (Eastern and Western Joint Computer Conferences.) 4) IRE National Convention Record"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. EJCC and WJCC (Eastern and Western Joint Computer Conferences.) 4) IRE National Convention Record"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Review of ’Godel’s Proof"
            },
            "venue": {
                "fragments": [],
                "text": "by Newman and Nagel,\" Am. Math. Monthly,"
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "AAutomlata Studies"
            },
            "venue": {
                "fragments": [],
                "text": "N. J"
            },
            "year": 1956
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Review of 'Godel's Proof"
            },
            "venue": {
                "fragments": [],
                "text": "Am. Math. Monthly"
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Preprinits of Conf. on Symbol Manipulation Programs"
            },
            "venue": {
                "fragments": [],
                "text": "Preprinits of Conf. on Symbol Manipulation Programs"
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Mathematical Biophysics,\" Dover Publications, Inc"
            },
            "venue": {
                "fragments": [],
                "text": "New York, N. Y.,"
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Review of ' Godel ' s Proof ' by Newmani anid Nagel"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1951
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "TACM) 7) IRE Transactions on Information Theory A more informative bibliography, by the present author should appear shortly in the IRE Trans. on Human Factors in Electronics"
            },
            "venue": {
                "fragments": [],
                "text": "TACM) 7) IRE Transactions on Information Theory A more informative bibliography, by the present author should appear shortly in the IRE Trans. on Human Factors in Electronics"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Topics in Dynamic Programming 11"
            },
            "venue": {
                "fragments": [],
                "text": "Topics in Dynamic Programming 11"
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "How to Solve ItPatterns of Plausible Inference,\" 2 vols"
            },
            "venue": {
                "fragments": [],
                "text": "Induction and Analogy in Mathematics N. J"
            },
            "year": 1945
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proving theorems by patteru recognitioni, I"
            },
            "venue": {
                "fragments": [],
                "text": "Proving theorems by patteru recognitioni, I"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Simiulation of self-organizinig systemiis by digital computer"
            },
            "venue": {
                "fragments": [],
                "text": "IRE TRANS. ON INFORMATION rHEORY"
            },
            "year": 1954
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 12,
                                "start": 8
                            }
                        ],
                        "text": "Roberts [25] describes a series of experiments in this general area."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 34,
                                "start": 30
                            }
                        ],
                        "text": ", in the imiachinies of [22], [25] anid [92], etc."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Pattern recognition with an adaptive network"
            },
            "venue": {
                "fragments": [],
                "text": "IRE INTERNATIONAL CONVENTION RECORD"
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Heuristic Aspects of the Artificial Intelligence Problem"
            },
            "venue": {
                "fragments": [],
                "text": "M.I.T. Hayden Library No. H-58"
            },
            "year": 1956
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "N. Y"
            },
            "venue": {
                "fragments": [],
                "text": "N. Y"
            },
            "year": 1956
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A computer program for solving integration 64 problems in 'Freshman Calculus"
            },
            "venue": {
                "fragments": [],
                "text": "I.T"
            },
            "year": 1961
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Preprints of Conf. on Symbol Manipulation Programs"
            },
            "venue": {
                "fragments": [],
                "text": "Preprints of Conf. on Symbol Manipulation Programs"
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An inductive inference machine"
            },
            "venue": {
                "fragments": [],
                "text": "IRE NATIONAL CONVENTION RECORD"
            },
            "year": 1957
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Cani a machine think?"
            },
            "venue": {
                "fragments": [],
                "text": "Cani a machine think?"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The logic theory machine"
            },
            "venue": {
                "fragments": [],
                "text": "The logic theory machine"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "See also the article of Hawkins in this issue"
            },
            "venue": {
                "fragments": [],
                "text": "See also the article of Hawkins in this issue"
            },
            "year": 1958
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Realizationi of a geometry-proving machinie"
            },
            "venue": {
                "fragments": [],
                "text": "Realizationi of a geometry-proving machinie"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Mechanization of Linguistic Learning Zator Co"
            },
            "venue": {
                "fragments": [],
                "text": "Zator Tech. Bull. No. 125, presented at the Second Internatl. Congress on Cybernetics"
            },
            "year": 1958
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Hayden Library No. H-82). See especially sec. I-E"
            },
            "venue": {
                "fragments": [],
                "text": "Hayden Library No. H-82). See especially sec. I-E"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Automatic Devices for Recognition of Visible Two-dimensional Patterns: A Survey of the Field"
            },
            "venue": {
                "fragments": [],
                "text": "U. S. Naval Electronics Lab. Tech. Memo"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "How we know universals"
            },
            "venue": {
                "fragments": [],
                "text": "Bull. Math. Biophys"
            },
            "year": 1947
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Work in this area seems to be currently prominent in the following periodicals: 1) IBM J.Res.&Dev. 2) Information and Control"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. EJCC and WJCC (EASTERN AND WESTERN JOINT COMPUTER CONFS.) 4) IRE NATIONAL CONVENTION RECORD. 5) J. Assoc. Comp. Mach. (J. A CM"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Neural Nets and the Brain Model Problem"
            },
            "venue": {
                "fragments": [],
                "text": "N. J"
            },
            "year": 1954
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the shortest path through a maze"
            },
            "venue": {
                "fragments": [],
                "text": "Proc Intl. Symp. on the Theory of Switching"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "WJCC"
            },
            "venue": {
                "fragments": [],
                "text": "March"
            },
            "year": 1955
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The W orld of Mathematics"
            },
            "venue": {
                "fragments": [],
                "text": "Similoii anid SchuLster"
            },
            "year": 1956
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Weight of evidence and false target probabilities"
            },
            "venue": {
                "fragments": [],
                "text": "Weight of evidence and false target probabilities"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The chess machine"
            },
            "venue": {
                "fragments": [],
                "text": "The chess machine"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proc. Internatl. Conf. on Information Processing"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Internatl. Conf. on Information Processing"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Intelligent behavior in prob lem-solving machines"
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. & Dez"
            },
            "year": 1958
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The epistemological problem for autotmata"
            },
            "venue": {
                "fragments": [],
                "text": "The epistemological problem for autotmata"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "IRE Trans. On Information Theory"
            },
            "venue": {
                "fragments": [],
                "text": "IRE Trans. On Information Theory"
            },
            "year": 1956
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Experimilenits inl mnachine thinking and learninlg"
            },
            "venue": {
                "fragments": [],
                "text": "Experimilenits inl mnachine thinking and learninlg"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Simiulation of selforganizinig systemiis by digital computer"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Neural Nets and the Brain Model Problem \" Ph.D"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1954
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 88,
                                "start": 85
                            }
                        ],
                        "text": "\" I regard this as an important notion, especially in the light of Shannon's results [4] on two-terminal switching circuits that the \"average\" n-variable switching function requires about 2\"/n contacts."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Synthesis of two-terminal switching networks"
            },
            "venue": {
                "fragments": [],
                "text": "Bell Sys. Tech. J"
            },
            "year": 1949
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the shortest path through a mlaze"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Internati. Symp. on the Theory of Switching"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 6
                            }
                        ],
                        "text": "22 of [21) oni assigning credit for a change in \"Delta."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Some mathematical models of learning"
            },
            "venue": {
                "fragments": [],
                "text": "Some mathematical models of learning"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Syntactic Structures The HaguLe"
            },
            "venue": {
                "fragments": [],
                "text": "Syntactic Structures The HaguLe"
            },
            "year": 1957
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "6) Trans. Assoc. Comp. Mach"
            },
            "venue": {
                "fragments": [],
                "text": "6) Trans. Assoc. Comp. Mach"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proc. EJCC; December"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. EJCC; December"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Mathematical Biophysics N. Y"
            },
            "venue": {
                "fragments": [],
                "text": "Mathematical Biophysics N. Y"
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Syntactic Structures"
            },
            "venue": {
                "fragments": [],
                "text": "Syntactic Structures"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Many citations below were published in these volumes: [A] Proc. WJCC"
            },
            "venue": {
                "fragments": [],
                "text": "Many citations below were published in these volumes: [A] Proc. WJCC"
            },
            "year": 1955
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A mathematical theory of discrete classification"
            },
            "venue": {
                "fragments": [],
                "text": "A mathematical theory of discrete classification"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 43
                            }
                        ],
                        "text": "cal induction\" schemes of Solomonoff [55], [16], [17],"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Mechanization of Linguistic Learning"
            },
            "venue": {
                "fragments": [],
                "text": "Zator Co., Cambridge, Mass., Zator Tech. Bull. No. 125, presented at  the Second Internatl. Congress on Cybernetics, Namur, Belgium; September, 1958."
            },
            "year": 1958
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "How to Solve ItInduction and Analogy in MathematicsPatterns of Plausible Inference,\" 2 vols"
            },
            "venue": {
                "fragments": [],
                "text": "How to Solve ItInduction and Analogy in MathematicsPatterns of Plausible Inference,\" 2 vols"
            },
            "year": 1945
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Automata Studies"
            },
            "venue": {
                "fragments": [],
                "text": "Automata Studies"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Introduction to IPL-V"
            },
            "venue": {
                "fragments": [],
                "text": "Commun. A CM"
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 24,
                                "start": 20
                            }
                        ],
                        "text": "Sherman [8], Haller [39] and others have completed programs using line-tracing operations for topological classification."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 8
                            }
                        ],
                        "text": "[39] N. Haller, \"Line Tracing for Character Recognition,\" M.S.E.E. thesis, M.I.T., Cambridge, Mass., 1959 [40] N. Minot, \"Automatic Devices for Recognition of Visible Two-dimensional Patterns: A Survey of the Field\" U. S. Naval Electronics Lab., San Diego, Calif., Tech."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 19
                            }
                        ],
                        "text": "In Sherman (8] and Haller [391 we find computer programs which can deal with such equivalences."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Line Tracing for Character Recognition,\" M.S.E.E"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Experiments in machine thinking and learning"
            },
            "venue": {
                "fragments": [],
                "text": "Experiments in machine thinking and learning"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Realization of a geometry-proving machine"
            },
            "venue": {
                "fragments": [],
                "text": "Realization of a geometry-proving machine"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Some aspects of heuristic programming and artificial intelligence"
            },
            "venue": {
                "fragments": [],
                "text": "Some aspects of heuristic programming and artificial intelligence"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Pattern recognition and learning"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern recognition and learning"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Review of 'Godel's Proof' by Newmani anid Nagel"
            },
            "venue": {
                "fragments": [],
                "text": "Am. Math. Mfonthly"
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "TIhe theory of nets"
            },
            "venue": {
                "fragments": [],
                "text": "IRE TRANS. ON ELECTRONIC COMPUTERS"
            },
            "year": 1957
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Information retrieval on structured content"
            },
            "venue": {
                "fragments": [],
                "text": "Information retrieval on structured content"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Aufenkamp, \"The theory of nets,"
            },
            "venue": {
                "fragments": [],
                "text": "IRE Trans. on Electronic Computers,"
            },
            "year": 1957
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Realizationi of a geometryproving machinie"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A more informative bibliography, compiled by the present author, should appear shortly in the IRE TRANS"
            },
            "venue": {
                "fragments": [],
                "text": "ON HUMAN FACTORS IN ELECTRONICS"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On Mechanization of Thought Processes, Her Majesty's Stationery Office"
            },
            "venue": {
                "fragments": [],
                "text": "On Mechanization of Thought Processes, Her Majesty's Stationery Office"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Line Tracing for Character Recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Line Tracing for Character Recognition"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Topics in Dynamic Programming II"
            },
            "venue": {
                "fragments": [],
                "text": "M.I.T. Hayden Library No. H-82). See especially sec. I-E"
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A computer program for solving integration problems in 'Freshman Calculus',\" thesis in preparation"
            },
            "venue": {
                "fragments": [],
                "text": "I.T"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Mathematical Biophysics N. Y"
            },
            "venue": {
                "fragments": [],
                "text": "Mathematical Biophysics N. Y"
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Sensorv Order"
            },
            "venue": {
                "fragments": [],
                "text": "Routledge and Kegan PauLl"
            },
            "year": 1952
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proc. EJCC"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. EJCC"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Programming a digital computer for playing chess"
            },
            "venue": {
                "fragments": [],
                "text": "Programming a digital computer for playing chess"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proc. Intl. Conf. on Information Processing"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Intl. Conf. on Information Processing"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Conditional probability machines \" and \"Temporal and spatial patterns in a conditional probability 62 machine"
            },
            "venue": {
                "fragments": [],
                "text": "Conditional probability machines \" and \"Temporal and spatial patterns in a conditional probability 62 machine"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An inductive inference machine,\" 1957 IRE National Convention Record"
            },
            "venue": {
                "fragments": [],
                "text": "An inductive inference machine,\" 1957 IRE National Convention Record"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "J. Assoc. Comp. Mach. (JACM)"
            },
            "venue": {
                "fragments": [],
                "text": "J. Assoc. Comp. Mach. (JACM)"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On the mechanical simulation of learning and habitforming"
            },
            "venue": {
                "fragments": [],
                "text": "Inform. and Control"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An inductive inference machine,\" 1957 IRE National Convention Record"
            },
            "venue": {
                "fragments": [],
                "text": "An inductive inference machine,\" 1957 IRE National Convention Record"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "J. Assoc. Comp. Mach. (JACM)"
            },
            "venue": {
                "fragments": [],
                "text": "J. Assoc. Comp. Mach. (JACM)"
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 27,
            "methodology": 5
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 142,
        "totalPages": 15
    },
    "page_url": "https://www.semanticscholar.org/paper/Steps-toward-Artificial-Intelligence-Minsky/b8ff8c7ab23eb70d4179c15a8a6b0efa1a493b8b?sort=total-citations"
}