{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145339648"
                        ],
                        "name": "M. Srinivasan",
                        "slug": "M.-Srinivasan",
                        "structuredName": {
                            "firstName": "Mandyam",
                            "lastName": "Srinivasan",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Srinivasan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2161090"
                        ],
                        "name": "S. Laughlin",
                        "slug": "S.-Laughlin",
                        "structuredName": {
                            "firstName": "Simon",
                            "lastName": "Laughlin",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Laughlin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32531540"
                        ],
                        "name": "A. Dubs",
                        "slug": "A.-Dubs",
                        "structuredName": {
                            "firstName": "Andreas",
                            "lastName": "Dubs",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Dubs"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24698209,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a95311474d799499fbb50b4b7e765a9af99791d9",
            "isKey": false,
            "numCitedBy": 975,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "Interneurons exhibiting centre-surround antagonism within their receptive fields are commonly found in peripheral visual pathways. We propose that this organization enables the visual system to encode spatial detail in a manner that minimizes the deleterious effects of intrinsic noise, by exploiting the spatial correlation that exists within natural scenes. The antagonistic surround takes a weighted mean of the signals in neighbouring receptors to generate a statistical prediction of the signal at the centre. The predicted value is subtracted from the actual centre signal, thus minimizing the range of outputs transmitted by the centre. In this way the entire dynamic range of the interneuron can be devoted to encoding a small range of intensities, thus rendering fine detail detectable against intrinsic noise injected at later stages in processing. This predictive encoding scheme also reduces spatial redundancy, thereby enabling the array of interneurons to transmit a larger number of distinguishable images, taking into account the expected structure of the visual world. The profile of the required inhibitory field is derived from statistical estimation theory. This profile depends strongly upon the signal: noise ratio and weakly upon the extent of lateral spatial correlation. The receptive fields that are quantitatively predicted by the theory resemble those of X-type retinal ganglion cells and show that the inhibitory surround should become weaker and more diffuse at low intensities. The latter property is unequivocally demonstrated in the first-order interneurons of the fly’s compound eye. The theory is extended to the time domain to account for the phasic responses of fly interneurons. These comparisons suggest that, in the early stages of processing, the visual system is concerned primarily with coding the visual image to protect against subsequent intrinsic noise, rather than with reconstructing the scene or extracting specific features from it. The treatment emphasizes that a neuron’s dynamic range should be matched to both its receptive field and the statistical properties of the visual pattern expected within this field. Finally, the analysis is synthetic because it is an extension of the background suppression hypothesis (Barlow & Levick 1976), satisfies the redundancy reduction hypothesis (Barlow 1961 a, b) and is equivalent to deblurring under certain conditions (Ratliff 1965)."
            },
            "slug": "Predictive-coding:-a-fresh-view-of-inhibition-in-Srinivasan-Laughlin",
            "title": {
                "fragments": [],
                "text": "Predictive coding: a fresh view of inhibition in the retina"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Comparisons suggest that, in the early stages of processing, the visual system is concerned primarily with coding the visual image to protect against subsequent intrinsic noise, rather than with reconstructing the scene or extracting specific features from it."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2281877"
                        ],
                        "name": "J. Atick",
                        "slug": "J.-Atick",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Atick",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Atick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144513847"
                        ],
                        "name": "A. Redlich",
                        "slug": "A.-Redlich",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Redlich",
                            "middleNames": [
                                "Norman"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Redlich"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 163,
                                "start": 141
                            }
                        ],
                        "text": "…it is now straightforward to explain its information theoretic interpretation, Minimizing the first term in equation 2,2 is equivalent (see Atick and Redlich 1990) to minimizing the sum of bit entropies Li Hi = - Li J dOiP(Oj) 10g(P(Oj)j, where P(Oj) the probability density for the ith…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 172,
                                "start": 150
                            }
                        ],
                        "text": "…a somewhat simplified approach to the problem with noise, As discussed earlier, instead of doing a fullfledged information theoretic analysis (as in Atick and Redlich 1990), we work in a formalism where the signal is first low-pass filtered to eliminate noise, The resulting signal is then…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 170,
                                "start": 148
                            }
                        ],
                        "text": "…case too there is an effective decrease in the spatial signal to noise ratio, so it is also evidence for noise suppre$~ion,\nIn a, :previous paper (Atick and Redlich 1990) we found an informatiOIi: theoretic formalism that unifies redundancy reduction and noise suppres~ion, That formalism…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 28154878,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "03128ecdd3c3dfb9752861d8555b97535e1cfc14",
            "isKey": false,
            "numCitedBy": 531,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a theory of the early processing in the mammalian visual pathway. The theory is formulated in the language of information theory and hypothesizes that the goal of this processing is to recode in order to reduce a generalized redundancy subject to a constraint that specifies the amount of average information preserved. In the limit of no noise, this theory becomes equivalent to Barlow's redundancy reduction hypothesis, but it leads to very different computational strategies when noise is present. A tractable approach for finding the optimal encoding is to solve the problem in successive stages where at each stage the optimization is performed within a restricted class of transfer functions. We explicitly find the solution for the class of encodings to which the parvocellular retinal processing belongs, namely linear and nondivergent transformations. The solution shows agreement with the experimentally observed transfer functions at all levels of signal to noise."
            },
            "slug": "Towards-a-Theory-of-Early-Visual-Processing-Atick-Redlich",
            "title": {
                "fragments": [],
                "text": "Towards a Theory of Early Visual Processing"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "A theory of the early processing in the mammalian visual pathway is proposed and the solution for the class of encodings to which the parvocellular retinal processing belongs, namely linear and nondivergent transformations is found."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49649079"
                        ],
                        "name": "D. Field",
                        "slug": "D.-Field",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Field",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Field"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1600874,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aeb37769d72999bcbfb0582b73607fd8d23f4545",
            "isKey": false,
            "numCitedBy": 3274,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "The relative efficiency of any particular image-coding scheme should be defined only in relation to the class of images that the code is likely to encounter. To understand the representation of images by the mammalian visual system, it might therefore be useful to consider the statistics of images from the natural environment (i.e., images with trees, rocks, bushes, etc). In this study, various coding schemes are compared in relation to how they represent the information in such natural images. The coefficients of such codes are represented by arrays of mechanisms that respond to local regions of space, spatial frequency, and orientation (Gabor-like transforms). For many classes of image, such codes will not be an efficient means of representing information. However, the results obtained with six natural images suggest that the orientation and the spatial-frequency tuning of mammalian simple cells are well suited for coding the information in such images if the goal of the code is to convert higher-order redundancy (e.g., correlation between the intensities of neighboring pixels) into first-order redundancy (i.e., the response distribution of the coefficients). Such coding produces a relatively high signal-to-noise ratio and permits information to be transmitted with only a subset of the total number of cells. These results support Barlow's theory that the goal of natural vision is to represent the information in the natural environment with minimal redundancy."
            },
            "slug": "Relations-between-the-statistics-of-natural-images-Field",
            "title": {
                "fragments": [],
                "text": "Relations between the statistics of natural images and the response properties of cortical cells."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The results obtained with six natural images suggest that the orientation and the spatial-frequency tuning of mammalian simple cells are well suited for coding the information in such images if the goal of the code is to convert higher-order redundancy into first- order redundancy."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2954333"
                        ],
                        "name": "F. L. V. Nes",
                        "slug": "F.-L.-V.-Nes",
                        "structuredName": {
                            "firstName": "Floris",
                            "lastName": "Nes",
                            "middleNames": [
                                "L.",
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. L. V. Nes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2610663"
                        ],
                        "name": "M. A. Bouman",
                        "slug": "M.-A.-Bouman",
                        "structuredName": {
                            "firstName": "Maarten",
                            "lastName": "Bouman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. A. Bouman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 764,
                                "start": 761
                            }
                        ],
                        "text": "R then Kexp '\" 111~/2 which is a De Vries-Rose behavior 10Kexp '\" 1~/2 This predicted transition from Weber to De Vries-Rose with in:creasing frequency is in agreement with what is generally found (see Kelly 1972 Fig, 3),\nGiven the explicit expression in equation 2,7 and the choice of quantum noise for N we can generate a set of kernels as a function of 10, The resulting family is shown for primates in Figure 4, We need to emphasize that there are no free parameters here which depend on 10, The only variables that needed to be fixed were the numbers fe,\np,\nand N' and they are independent of 10, Also we work in units of synaptic noise no, so the synaptic noise power N5 is set to one, We have superimposed on this family the data from the experiments of Van Ness and Bouman (1967) on human psychophysical contrast sensitivity, It does not take"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 232,
                                "start": 210
                            }
                        ],
                        "text": "…fe,\np,\nand N' and they are independent of 10, Also we work in units of synaptic noise no, so the synaptic noise power N5 is set to one, We have superimposed on this family the data from the experiments of Van Ness and Bouman (1967) on human psychophysical contrast sensitivity, It does not take"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 268,
                                "start": 265
                            }
                        ],
                        "text": "E\" and Weaver, W, 1949, The Mathematical Theory of Communication, The University of Illinois Press, Urbana,\nSrinivisan, M, V\" Laughlin, S, 8., and Dubs, A, 1982, Predictive coding: A fresh view of inhibition in the retina, Proc, R, Sac, London Ser, B 216, 427-459,\nVan Ness, F. L., and Bouman, M, A, 1967, Spatial modulation transfer in the human eye, J, Opt, Sac, Am, 401-406,\nReceived 15 July 1991; accepted 3 October 1991."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 102,
                                "start": 80
                            }
                        ],
                        "text": "The data are from human psychophysical contrast sensitivity measurements of Van Ness and Bouman (1967)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 123101848,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "8c35d110f8e5b55508821492618741645518abd2",
            "isKey": true,
            "numCitedBy": 660,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "The contrast sensitivity of the human eye for sinusoidal illuminance changes was measured as a function of spatial frequency, for monochromatic light with wavelengths of 450, 525, and 650 nm. At each wavelength, data were obtained for a number of illuminance levels. All observations were taken at equal accommodation, and corrected for chromatic aberration. If the wavelength-dependent effects of diffraction on the modulation transfer are taken into account, no difference is found between the photopic contrast-sensitivity functions for red, green, or blue. For mean retinal illuminances B0 smaller than 300 td, threshold modulation M at a given frequency is found to increase in proportion to B0-12 (de Vries–Rose law). For B0 greater than 300 td M remains a constant fraction of it (Weber–Fechner law). After separation of the optical modulation transfer of the eye media from the measured psychophysical data, the remaining function can be considered as composed of a neural and a light-diffusion transfer function. The latter can be compared with the analytic transfer function of photographic film."
            },
            "slug": "Spatial-Modulation-Transfer-in-the-Human-Eye-Nes-Bouman",
            "title": {
                "fragments": [],
                "text": "Spatial Modulation Transfer in the Human Eye"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2281877"
                        ],
                        "name": "J. Atick",
                        "slug": "J.-Atick",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Atick",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Atick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144513847"
                        ],
                        "name": "A. Redlich",
                        "slug": "A.-Redlich",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Redlich",
                            "middleNames": [
                                "Norman"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Redlich"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 207599521,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7e1482c67fc0c96dbd1d190e5040ab113a53e544",
            "isKey": false,
            "numCitedBy": 101,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "An unsupervised developmental algorithm for linear maps is derived which reduces the pixel-entropy (using the measure introduced in previous work) at every update and thus removes pairwise correlations between pixels. Since the measure of pixel-entropy has only a global minimum the algorithm is guaranteed to converge to the minimum entropy map. Such optimal maps have recently been shown to possess cognitively desirable properties and are likely to be used by the nervous system to organize sensory information. The algorithm derived here turns out to be one proposed by Goodall for pairwise decorrelation. It is biologically plausible since in a neural network implementation it requires only data available locally to a neuron. In training over ensembles of two-dimensional input signals with the same spatial power spectrum as natural scenes, networks develop output neurons with center-surround receptive fields similar to those of ganglion cells in the retina. Some technical issues pertinent to developmental algorithms of this sort, such as symmetry fixing, are also discussed."
            },
            "slug": "Convergent-Algorithm-for-Sensory-Receptive-Field-Atick-Redlich",
            "title": {
                "fragments": [],
                "text": "Convergent Algorithm for Sensory Receptive Field Development"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "An unsupervised developmental algorithm for linear maps is derived which reduces the pixel-entropy at every update and thus removes pairwise correlations between pixels, and is biologically plausible since in a neural network implementation it requires only data available locally to a neuron."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113588000"
                        ],
                        "name": "R. L. de Valois",
                        "slug": "R.-L.-de-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "de Valois",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. de Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152172276"
                        ],
                        "name": "H. Morgan",
                        "slug": "H.-Morgan",
                        "structuredName": {
                            "firstName": "H",
                            "lastName": "Morgan",
                            "middleNames": [
                                "C"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Morgan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "80561269"
                        ],
                        "name": "D. Snodderly",
                        "slug": "D.-Snodderly",
                        "structuredName": {
                            "firstName": "D",
                            "lastName": "Snodderly",
                            "middleNames": [
                                "Max"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Snodderly"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32781738,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "3b015c3abf24abff0902832bfef3c1e06c7bf9cc",
            "isKey": false,
            "numCitedBy": 414,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Psychophysical-studies-of-monkey-vision.-3.-Spatial-Valois-Morgan",
            "title": {
                "fragments": [],
                "text": "Psychophysical studies of monkey vision. 3. Spatial luminance contrast sensitivity tests of macaque and human observers."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2281877"
                        ],
                        "name": "J. Atick",
                        "slug": "J.-Atick",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Atick",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Atick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5062473"
                        ],
                        "name": "Zhaoping Li",
                        "slug": "Zhaoping-Li",
                        "structuredName": {
                            "firstName": "Zhaoping",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zhaoping Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144513847"
                        ],
                        "name": "A. Redlich",
                        "slug": "A.-Redlich",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Redlich",
                            "middleNames": [
                                "Norman"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Redlich"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 104,
                                "start": 87
                            }
                        ],
                        "text": "All of these space-time-color-Iuminance interactions are explored in a separate paper (Atick et al. 1992),\nAcknowledgment\nWork supported in part by a grant from the Seaver Institute,\nReferences\nAtick, J, J\" and Redlich, A, N, 1990, Towards a theory of early visual processing, Neural Comp, 308-320;…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 105,
                                "start": 86
                            }
                        ],
                        "text": "All of these space-time-color-Iuminance interactions are explored in a separate paper (Atick et al. 1992),"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8487334,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4bd9b030a5ef8071119fe237a6fa04e67e032ab8",
            "isKey": false,
            "numCitedBy": 139,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "A previously proposed theory of visual processing, based on redundancy reduction, is used to derive the retinal transfer function including color. The predicted kernels show the nontrivial mixing of space-time with color coding observed in experiments. The differences in color-coding between species are found to be due to differences among the chromatic autocorrelators for natural scenes in different environments."
            },
            "slug": "Understanding-Retinal-Color-Coding-from-First-Atick-Li",
            "title": {
                "fragments": [],
                "text": "Understanding Retinal Color Coding from First Principles"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The predicted kernels show the nontrivial mixing of space-time with color coding observed in experiments, and differences in color-coding between species are found to be due to differences among the chromatic autocorrelators for natural scenes in different environments."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143912557"
                        ],
                        "name": "D. H. Kelly",
                        "slug": "D.-H.-Kelly",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Kelly",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. H. Kelly"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 157,
                                "start": 147
                            }
                        ],
                        "text": "…10Kexp '\" 1~/2 This predicted transition from Weber to De Vries-Rose with in:creasing frequency is in agreement with what is generally found (see Kelly 1972 Fig, 3),\nGiven the explicit expression in equation 2,7 and the choice of quantum noise for N we can generate a set of kernels as a…"
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 194,
                                "start": 182
                            }
                        ],
                        "text": "…100 SpaUal freqUeDCY, c/de.\nFigure 1: Retinal filters (A, C) in Fourier space at high mean luminosities, taken from the contrast sensitivity data of De Valois et aI, (1974) (A) and Kelly (1972)\n(C), B (D) is the data in A (C) multiplied by l/lfl, which is the amplitude spectrum of natural scenes."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 111,
                                "start": 99
                            }
                        ],
                        "text": "The data shown in Figure lA are from De Valois et al. (1974)1 whil~ the data in Figure lC are from Kelly (1972)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 31914217,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "30f91160ba9fd018d6ce1a4ecdb95c30b1b2beb7",
            "isKey": false,
            "numCitedBy": 243,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Adaptation-effects-on-spatio-temporal-sine-wave-Kelly",
            "title": {
                "fragments": [],
                "text": "Adaptation effects on spatio-temporal sine-wave thresholds."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15685782,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1c387b70f37fd902735e6c2b76d9715a251d1b5e",
            "isKey": false,
            "numCitedBy": 1059,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "The striate cortex of the macaque monkey is subdivided into two independent and overlapping systems of columns termed “orientation columns” and “ocular dominance columns.” The present paper is concerned with the orientation columns, particularly their geometry and the relationship between successive columns. The arrangement of the columns is highly ordered; in the great majority of oblique or tangential microelectrode penetrations the preferred orientations of cells changed systematically with electrode position, in a clockwise or counterclockwise direction. Graphs of orientation vs. electrode track distance were virtually straight lines over distances of up to several millimeters; such orderly sequences were often terminated by sudden changes in the direction of orientation shifts, from clockwise to counterclockwise or back. The orientations at which these reversals occurred were quite unpredictable. Total rotations of 180–360° were frequently seen between reversals. In tangential or almost tangential penetrations orientation shifts occurred almost every time the electrode was moved forward, indicating that the columns were either not discrete or had a thickness of less than 25–50 μ, the smallest order of distance that our methods could resolve. In penetrations that were almost perpendicular to the surface, the graphs of orientation vs. track distance were relatively flatter, as expected if the surfaces of constant orientation are perpendicular to the cortical surface. Stepwise changes in orientation of about 10° could sometimes be seen in perpendicular penetrations, each orientation persisting through several clear advances of the electrode, suggesting a set of discrete columnar subdivisions. The possibility of some kind of continuous variation in orientation with horizontal distance along the cortex was not, however, completely ruled out. Occasionally a highly ordered sequence was broken by an abrupt large shift in orientation of up to 90°. Shifts in ocular dominance occurred roughly every 0.25–0.5 mm and were independent of orientation shifts. In multiple parallel penetrations spaced closer than about 250 μ the slopes of the orientation vs. track distance curves were almost the same; reconstruction of these penetrations indicated that the regions of constant orientation are parallel sheets. On crossing perpendicular to these sheets, a total orientation shift of 180° took place over a distance of 0.5–1.0 mm. Column thickness, size of shifts in orientation, and the rate of change of orientation with distance along the cortex seemed to be independent of eccentricity, at least between 2° and 15° from the fovea. A few penetrations made in area 17 of the cat and in area 18 of the monkey showed similar orderly sequences of receptive‐field orientation shifts."
            },
            "slug": "Sequence-regularity-and-geometry-of-orientation-in-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Sequence regularity and geometry of orientation columns in the monkey striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Column thickness, size of shifts in orientation, and the rate of change of orientation with distance along the cortex seemed to be independent of eccentricity, at least between 2° and 15° from the fovea."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144513847"
                        ],
                        "name": "A. Redlich",
                        "slug": "A.-Redlich",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Redlich",
                            "middleNames": [
                                "Norman"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Redlich"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5242294,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cceb0fdf30bc69b7af0d0e4f43541c7fafe67cbc",
            "isKey": false,
            "numCitedBy": 127,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "A redundancy reduction strategy, which can be applied in stages, is proposed as a way to learn as efficiently as possible the statistical properties of an ensemble of sensory messages. The method works best for inputs consisting of strongly correlated groups, that is features, with weaker statistical dependence between different features. This is the case for localized objects in an image or for words in a text. A local feature measure determining how much a single feature reduces the total redundancy is derived which turns out to depend only on the probability of the feature and of its components, but not on the statistical properties of any other features. The locality of this measure makes it ideal as the basis for a \"neural\" implementation of redundancy reduction, and an example of a very simple non-Hebbian algorithm is given. The effect of noise on learning redundancy is also discussed."
            },
            "slug": "Redundancy-Reduction-as-a-Strategy-for-Unsupervised-Redlich",
            "title": {
                "fragments": [],
                "text": "Redundancy Reduction as a Strategy for Unsupervised Learning"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A local feature measure determining how much a single feature reduces the total redundancy is derived which turns out to depend only on the probability of the feature and of its components, but not on the statistical properties of any other features."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2577641"
                        ],
                        "name": "R. Linsker",
                        "slug": "R.-Linsker",
                        "structuredName": {
                            "firstName": "Ralph",
                            "lastName": "Linsker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Linsker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 162,
                                "start": 148
                            }
                        ],
                        "text": "…explanations for whitening physical bottleneck in the retina or computational bottleneck in cortex must be mutually exclusive, Also, to paraphrase Linsker (1989), the brain may create physiological capacity limitations at one stage in order to force an encoding whose true utility is in its use…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 18127428,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "efd2c547114d5296b38fbbdd5bff0acd324132f0",
            "isKey": false,
            "numCitedBy": 187,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper addresses the problem of determining the weights for a set of linear filters (model \"cells\") so as to maximize the ensemble-averaged information that the cells' output values jointly convey about their input values, given the statistical properties of the ensemble of input vectors. The quantity that is maximized is the Shannon information rate, or equivalently the average mutual information between input and output. Several models for the role of processing noise are analyzed, and the biological motivation for considering them is described. For simple models in which nearby input signal values (in space or time) are correlated, the cells resulting from this optimization process include center-surround cells and cells sensitive to temporal variations in input signal."
            },
            "slug": "An-Application-of-the-Principle-of-Maximum-to-Linsker",
            "title": {
                "fragments": [],
                "text": "An Application of the Principle of Maximum Information Preservation to Linear Systems"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "This paper addresses the problem of determining the weights for a set of linear filters so as to maximize the ensemble-averaged information that the cells' output values jointly convey about their input values, given the statistical properties of the ensemble of input vectors."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3558981"
                        ],
                        "name": "A. Derrington",
                        "slug": "A.-Derrington",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Derrington",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Derrington"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4433870"
                        ],
                        "name": "P. Lennie",
                        "slug": "P.-Lennie",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Lennie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Lennie"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 39217988,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bdeaaf3ee6e0333783e0ec4b5e2a2f7904aab1aa",
            "isKey": false,
            "numCitedBy": 162,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The discharges of single X and Y ganglion cells (distinguished by a test of linearity of spatial summation) were recorded in the optic tract of anaesthetized, paralysed cats."
            },
            "slug": "The-influence-of-temporal-frequency-and-adaptation-Derrington-Lennie",
            "title": {
                "fragments": [],
                "text": "The influence of temporal frequency and adaptation level on receptive field organization of retinal ganglion cells in cat"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "The discharges of single X and Y ganglion cells (distinguished by a test of linearity of spatial summation) were recorded in the optic tract of anaesthetized, paralysed cats."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144513847"
                        ],
                        "name": "A. Redlich",
                        "slug": "A.-Redlich",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Redlich",
                            "middleNames": [
                                "Norman"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Redlich"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27820793,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e6c9aa374f3f5e1338a5cd9bbbd0bddea212788e",
            "isKey": false,
            "numCitedBy": 34,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "Factorial learning, finding a statistically independent representation of a sensory imagea factorial codeis applied here to solve multilayer supervised learning problems that have traditionally required backpropagation. This lends support to Barlow's argument for factorial sensory processing, by demonstrating how it can solve actual pattern recognition problems. Two techniques for supervised factorial learning are explored, one of which gives a novel distributed solution requiring only positive examples. Also, a new nonlinear technique for factorial learning is introduced that uses neural networks based on almost reversible cellular automata. Due to the special functional connectivity of these networkswhich resemble some biological microcircuitslearning requires only simple local algorithms. Also, supervised factorial learning is shown to be a viable alternative to backpropagation. One significant advantage is the existence of a measure for the performance of intermediate learning stages."
            },
            "slug": "Supervised-Factorial-Learning-Redlich",
            "title": {
                "fragments": [],
                "text": "Supervised Factorial Learning"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work lends support to Barlow's argument for factorial sensory processing, by demonstrating how it can solve actual pattern recognition problems, and two techniques for supervised factorial learning are explored, one of which gives a novel distributed solution requiring only positive examples."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1391863648"
                        ],
                        "name": "M. Goodall",
                        "slug": "M.-Goodall",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Goodall",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Goodall"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4266472,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "2a77eeb1b608548dbb92690f36358ee07fec2af5",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "STOCHASTIC nets have been proposed by several authors1–3 as models of cognitive activity. So far, these have been dominated by heuristic constraints designed to show some analogy with the nervous system or merely for ease of computation. An adequate mathematical theory has, as was recognized by Uttley4, to show how such a device can learn relations."
            },
            "slug": "Performance-of-a-Stochastic-Net-Goodall",
            "title": {
                "fragments": [],
                "text": "Performance of a Stochastic Net"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "An adequate mathematical theory has been recognized to show how aSTOCHASTIC nets can learn relations, as was recognized by Uttley4."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144742303"
                        ],
                        "name": "K. Miller",
                        "slug": "K.-Miller",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Miller",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Miller"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 84253012,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5a10fae94911a65a71021c7221c04fde90bd1e0d",
            "isKey": false,
            "numCitedBy": 1,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Introduction:-The-use-of-models-in-the-Miller",
            "title": {
                "fragments": [],
                "text": "Introduction: The use of models in the neurosciences"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144187514"
                        ],
                        "name": "R. Durbin",
                        "slug": "R.-Durbin",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Durbin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Durbin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7912930"
                        ],
                        "name": "C. Miall",
                        "slug": "C.-Miall",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Miall",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Miall"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145666307"
                        ],
                        "name": "G. Mitchison",
                        "slug": "G.-Mitchison",
                        "structuredName": {
                            "firstName": "Graeme",
                            "lastName": "Mitchison",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Mitchison"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 194,
                                "start": 171
                            }
                        ],
                        "text": "The idea that the brain is attempting to transform its sensory input to a statistically independent basis has been suggested by Goodall (1960) and Barlow (1989) (see also Barlow and Foldiak 1989), and has been discussed by many others."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 61649254,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c6e32b4f82c2a1833ef7ae32967ce2f3685fa1c5",
            "isKey": false,
            "numCitedBy": 289,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-computing-neuron-Durbin-Miall",
            "title": {
                "fragments": [],
                "text": "The computing neuron"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 194,
                                "start": 171
                            }
                        ],
                        "text": "The idea that the brain is attempting to transform its sensory input to a statistically independent basis has been suggested by Goodall (1960) and Barlow (1989) (see also Barlow and Foldiak 1989), and has been discussed by many others."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Computing Neuron, Addison-Wesley, New York"
            },
            "venue": {
                "fragments": [],
                "text": "Neural Comp,"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 145,
                                "start": 124
                            }
                        ],
                        "text": "Figure 1: Retinal filters (A, C) in Fourier space at high mean luminosities, taken from the contrast sensitivity data of De Valois et al. (1974) (A) and Kelly (1972)"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 40
                            }
                        ],
                        "text": "The data shown in Figure lA are from De Valois et al. (1974)1 whil~ the data in Figure lC are from Kelly (1972)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Psychophysical studies of monkey vision-111"
            },
            "venue": {
                "fragments": [],
                "text": "spatial luminance contrast sensitivity tests of macaque and human observers. Vision Res. 14, 75-81."
            },
            "year": 1974
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Mathematicd Theory of Communication"
            },
            "venue": {
                "fragments": [],
                "text": "The University of Illinois Press, Urbana. Srinivisan, M. V., Laughlin,"
            },
            "year": 1949
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Predictive coding: A fresh"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 40
                            }
                        ],
                        "text": "The data shown in Figure lA are from De Valois et al. (1974)1 whil~ the data in Figure lC are from Kelly (1972). Now to see how the power spectrum is modified by the retina, we need only multiply the input spectrum R(f) by K(f)K* (f) since the average output spectrum is (O(f)O* (f)) = ((K(f)L(f))(K(f)L(f))* )."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 40
                            }
                        ],
                        "text": "The data shown in Figure lA are from De Valois et al. (1974)1 whil~ the data in Figure lC are from Kelly (1972)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Psychophysical studies of monkey vision-ill, spatial luminance contrast sensitivity tests of macaque"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 5,
            "methodology": 4,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 21,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/What-Does-the-Retina-Know-about-Natural-Scenes-Atick-Redlich/841cd4a6cac86fa0cfb0e8542eac5ed164f23f50?sort=total-citations"
}