{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688682"
                        ],
                        "name": "R. Woodham",
                        "slug": "R.-Woodham",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Woodham",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Woodham"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 126249039,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b7ce42b4f9386880b371065c3b3c58a7d9d9e591",
            "isKey": false,
            "numCitedBy": 225,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper introduces a novel technique called photometric stereo. The idea of photometric stereo is to vary the direction of the incident illumination between successive views while holding the viewing direction constant. This provides enough information to determine surface orientation at each picture element. Traditional stereo techniques determine range by relating two images of an object viewed from different directions. If the correspondence between picture elements is known, then distance to the object can be calculated by triangulation. Unfortunately, it is difficult to determine this correspondence. In photometric stereo, the imaging geometry does not change. Therefore, the correspondence between picture elements is known a priori. This stereo technique is photometric because it uses the intensity values recorded at a single picture element, in successive views, rather than the relative positions of features."
            },
            "slug": "Photometric-Stereo:-A-Reflectance-Map-Technique-For-Woodham",
            "title": {
                "fragments": [],
                "text": "Photometric Stereo: A Reflectance Map Technique For Determining Surface Orientation From Image Intensity"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "This paper introduces a novel technique called photometric stereo, which uses the intensity values recorded at a single picture element, in successive views, rather than the relative positions of features, to vary the direction of the incident illumination between successive views."
            },
            "venue": {
                "fragments": [],
                "text": "Optics & Photonics"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688682"
                        ],
                        "name": "R. Woodham",
                        "slug": "R.-Woodham",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Woodham",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Woodham"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8291629,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "512b1e948758d825e397b00d31e295a1896f9033",
            "isKey": false,
            "numCitedBy": 62,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper addresses the problem of determining local surface orientation from the intensity information contained in a single monocular view. It represents another look at the problem of obtaining shape from shading information. This problem was first formulated by as the solution of first-order non-linear partial differential equations. It was subsequently reformulated by to take advantage of the geometric insight provided by the gradient space approach popularized by and ."
            },
            "slug": "A-Cooperative-Algorithm-for-Determining-Surface-a-Woodham",
            "title": {
                "fragments": [],
                "text": "A Cooperative Algorithm for Determining Surface Orientation from a Single View"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "This paper addresses the problem of determining local surface orientation from the intensity information contained in a single monocular view by exploiting the geometric insight provided by the gradient space approach popularized by and."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2079889700"
                        ],
                        "name": "Brett L. Bachman",
                        "slug": "Brett-L.-Bachman",
                        "structuredName": {
                            "firstName": "Brett",
                            "lastName": "Bachman",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Brett L. Bachman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6774987,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "b12c575bac42a2b769544edc6f9f371642cda030",
            "isKey": false,
            "numCitedBy": 87,
            "numCiting": 58,
            "paperAbstract": {
                "fragments": [],
                "text": "A number of image analysis tasks can benefit from registration of the image with a model of the surface being imaged. Automatic navigation using visible light or radar images requires exact alignment of such images with digital terrain models. In addition, automatic classification of terrain, using satellite imagery, requires such alignment to deal correctly with the effects of varying sun angle and surface slope. Even inspection techniques for certain industrial parts may be improved by this means.\nWe achieve the required alignment by matching the real image with a synthetic image obtained from a surface model and known positions of the light sources. The synthetic image intensity is calculated using the reflectance map, a convenient way of describing surface reflection as a function of surface gradient. We illustrate the technique using LANDSAT images and digital terrain models."
            },
            "slug": "Using-synthetic-images-to-register-real-images-with-Horn-Bachman",
            "title": {
                "fragments": [],
                "text": "Using synthetic images to register real images with surface models"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "This work achieves the required alignment by matching the real image with a synthetic image obtained from a surface model and known positions of the light sources, and illustrates the technique using LANDSAT images and digital terrain models."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696931"
                        ],
                        "name": "H. Barrow",
                        "slug": "H.-Barrow",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Barrow",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Barrow"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144592244"
                        ],
                        "name": "J. Tenenbaum",
                        "slug": "J.-Tenenbaum",
                        "structuredName": {
                            "firstName": "Jay",
                            "lastName": "Tenenbaum",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Tenenbaum"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14892007,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bd580fad7a14f93d6d59765a5fe91974e2653281",
            "isKey": false,
            "numCitedBy": 922,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "We suggest that an appropriate role of early visual processing is to describe a scene in terms of intrinsic (vertical) characteristics -- such as range, orientation, reflectance, and incident illumination -- of the surface element visible at each point in the image. Support for this idea comes from three sources: the obvious utility of intrinsic characteristics for higher-level scene analysis; the apparent ability of humans to determine these characteristics, regardless of viewing conditions or familiarity with the scene; and a theoretical argument that such a description is obtainable, by a noncognitive and nonpurposive process, at least, for simple scene domains. The central problem in recovering intrinsic scene characteristics is that the information is confounded in the original light-intensity image: a single intensity value encodes all the characteristics of the corresponding scene point. Recovery depends on exploiting constraints, derived from assumptions about the nature of the scene and the physics of the imaging process."
            },
            "slug": "RECOVERING-INTRINSIC-SCENE-CHARACTERISTICS-FROM-Barrow-Tenenbaum",
            "title": {
                "fragments": [],
                "text": "RECOVERING INTRINSIC SCENE CHARACTERISTICS FROM IMAGES"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "It is suggested that an appropriate role of early visual processing is to describe a scene in terms of intrinsic (vertical) characteristics -- such as range, orientation, reflectance, and incident illumination -- of the surface element visible at each point in the image."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1773252"
                        ],
                        "name": "T. Rindfleisch",
                        "slug": "T.-Rindfleisch",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Rindfleisch",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Rindfleisch"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 128369141,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ddc6c65c9981a1e71d7180c26f872a076cbd639c",
            "isKey": false,
            "numCitedBy": 91,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "A general and rigorous treatment is given of the photometric method for deriving surface elevation information from a single picture of the surface. In the course of the derivation a brief indication is given of possible photometric function symmetries yielding exact solutions to the problem. It is shown that the photometric properties of the lunar maria are sufficient to produce an exact solution but with an inherent practical difficulty. The resulting equations are then specialized to the case of lunar photography and applied to the Ranger pictures as part of a digital processing procedure. Examples of the resulting elevation maps are given. INTRODUCTION QUANTITATIVE ELEVATION INFORMATION about a surface can be derived from pictures both by stereoscopic and by photometric methods. The second method, which is of interest here, was first suggested by van Diggelen (Ref. 1) in 1951. Extending his original formulation of the problem, it is desired to reconstruct quantitatively the shape of a surface being photographed using the imaging geometry, the facsi mile system transfer characteristics, and the surface photometric properties. A rigorous solution to this problem is presented and the results are applied to the lunar pictures taken by the three Ranger impacting spacecraft. CALCULATION OF ELEVATIONS IN TEl{]vIS OF A LENS-CENTERED COORDINATE SYSTEM The pertinent photometry of extended surfaces can be summarized as follows. For simplicity, it will be assumed that the surface possesses homogenous photometric properties at least over the local area under consideration. The photometric geometry can be com pletely defined in terms of three angles; the incidence angle i (angle between the direction of incident light and the surface normal), the emission angle e (angle between the direction of emitted light and the surface normal), and the phase angle g (angle between the directions of incident and emitted light). This geometry is shown in Figure 1. For uniform collimated illumination of the surface, such as with sunlight, the luminence b can be written b(i, e, g) = poEo¢(i, e, g) (1) where Po is the normal albedo of the surface, Eo is the uniform illumination intensity, and ¢ (i, e, g) is the surface photometric function. The normalization of ¢ is such that ¢(O, 0, 0) = 1. * This paper presents the results of one phase of research conducted at J.P.L., California Institute of Technology, under Contract No. NAS 7-100, sponsored by NASA. The paper has been cleared for United States publication by the Technical Information Section, J. P.L. A form of the paper has appeared as a copyrighted ].P.L. Laboratory Technical Report No. 32-786, September 15, 1965."
            },
            "slug": "Photometric-method-for-lunar-topography.-Rindfleisch",
            "title": {
                "fragments": [],
                "text": "Photometric method for lunar topography."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16964060"
                        ],
                        "name": "F. E. Nicodemus",
                        "slug": "F.-E.-Nicodemus",
                        "structuredName": {
                            "firstName": "Fred",
                            "lastName": "Nicodemus",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. E. Nicodemus"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52314106"
                        ],
                        "name": "J. Richmond",
                        "slug": "J.-Richmond",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Richmond",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Richmond"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33878926"
                        ],
                        "name": "J. Hsia",
                        "slug": "J.-Hsia",
                        "structuredName": {
                            "firstName": "Jack",
                            "lastName": "Hsia",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hsia"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33704040"
                        ],
                        "name": "I. Ginsberg",
                        "slug": "I.-Ginsberg",
                        "structuredName": {
                            "firstName": "Irving",
                            "lastName": "Ginsberg",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Ginsberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69408740"
                        ],
                        "name": "T. Limperis",
                        "slug": "T.-Limperis",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Limperis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Limperis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18645782,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0709f019c495a97b2a0369ded5ec18fe52e8672c",
            "isKey": false,
            "numCitedBy": 1950,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "Report issued by the U.S. National Bureau of Standards discussing specifications of reflectance and proposed nomenclature. As stated in the introduction, \"this monograph presents a unified approach to the specification of reflectance in relation to the beam geometry of both the incident and the reflected flux in any reflectometer or in any application of measured reflectance data\" (p. 1). This report includes illustrations."
            },
            "slug": "Geometrical-considerations-and-nomenclature-for-Nicodemus-Richmond",
            "title": {
                "fragments": [],
                "text": "Geometrical considerations and nomenclature for reflectance"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "This monograph presents a unified approach to the specification of reflectance in relation to the beam geometry of both the incident and the reflected flux in any reflectometer or in any application of measured reflectance data."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 40432985,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "40547d8242d86845c55f1b252dae69ebab8445e5",
            "isKey": false,
            "numCitedBy": 731,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Understanding-Image-Intensities-Horn",
            "title": {
                "fragments": [],
                "text": "Understanding Image Intensities"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2192229"
                        ],
                        "name": "D. Gennery",
                        "slug": "D.-Gennery",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Gennery",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gennery"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2915080,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0ccf495dc086476505b40c6639f2ceffe10594a2",
            "isKey": false,
            "numCitedBy": 82,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Several techniques for use in a stereo vision system are described. These include a stereo camera model solver, a high resolution stereo correlator for producing accurate matches with accuracy and confidence estimates, a search technique for using the correlator to produce a dense sampling of matched points for a pair of pictures, and a ground surface finder for distinguishing the ground from objects, in the resulting three-dimensional data. Possible ways of using these techniques in an autonomous vehicle designed to explore its environment are discussed. An example is given showing the detection of objects from a stereo pair of pictures."
            },
            "slug": "A-Stereo-Vision-System-for-an-Autonomous-Vehicle-Gennery",
            "title": {
                "fragments": [],
                "text": "A Stereo Vision System for an Autonomous Vehicle"
            },
            "tldr": {
                "abstractSimilarityScore": 95,
                "text": "Several techniques for use in a stereo vision system include a stereo camera model solver, a high resolution stereo correlator for producing accurate matches with accuracy and confidence estimates, a search technique for using the correlator to produce a dense sampling of matched points for a pair of pictures, and a ground surface finder for distinguishing the ground from objects."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49457554"
                        ],
                        "name": "S. Liebes",
                        "slug": "S.-Liebes",
                        "structuredName": {
                            "firstName": "Sidney",
                            "lastName": "Liebes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Liebes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152247228"
                        ],
                        "name": "A. Schwartz",
                        "slug": "A.-Schwartz",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Schwartz",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Schwartz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 129432989,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "bf724098db7dc4c147fe962c2b178fb7995cd550",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "A novel computerized interactive video Stereophotogrammetry system has been developed for analysis of Viking 1975 lander imaging data. Prompt, accurate, and versatile performance is achieved. Earth-returned digital imagery data are driven from a computer to a pair of video monitors. Powerful computer support enables a photogrammetrist, stereoscopically viewing the video displays, to create diverse topographic products. Profiles, representing the intersection of any definable surface with the Martian relief, are readily generated. Vertical profiles and elevation contour maps, including stereo versions, are produced. Computer overlays of map products on stereo images aid map interpretation and permit independent quality evaluation. Slaved monitors enable parallel viewing. Maps span from the immediate foreground to the remote limits of ranging capability. Surface sampler arm specific vertical profiles enable direct reading of arm commands required for sample acquisition, rock rolling, and trenching. The ranging accuracy of ±2 cm throughout the sample area degrades to ±20 m at 100-m range."
            },
            "slug": "Viking-1975-Mars-Lander-interactive-computerized-Liebes-Schwartz",
            "title": {
                "fragments": [],
                "text": "Viking 1975 Mars Lander interactive computerized video stereophotogrammetry"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144901036"
                        ],
                        "name": "H. Nishihara",
                        "slug": "H.-Nishihara",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Nishihara",
                            "middleNames": [
                                "Keith"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nishihara"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 43759520,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bdf9b8f4de001f5f37bc844efbce1210d581d599",
            "isKey": false,
            "numCitedBy": 2323,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The human visual process can be studied by examining the computational problems associated with deriving useful information from retinal images. In this paper, we apply this approach to the problem of representing three-dimensional shapes for the purpose of recognition. 1. Three criteria, accessibility, scope and uniqueness, and stability and sensitivity, are presented for judging the usefulness of a representation for shape recognition. 2. Three aspects of a representation’s design are considered, (i) the representation’s coordinate system, (ii) its primitives, which are the primary units of shape information used in the representation, and (iii) the organization the representation imposes on the information in its descriptions. 3. In terms of these design issues and the criteria presented, a shape representation for recognition should: (i) use an object-centred coordinate system, (ii) include volumetric primitives of varied sizes, and (iii) have a modular organization. A representation based on a shape’s natural axes (for example the axes identified by a stick figure) follows directly from these choices. 4. The basic process for deriving a shape description in this representation must involve: (i) a means for identifying the natural axes of a shape in its image and (ii) a mechanism for transforming viewer-centred axis specifications to specifications in an object-centred coordinate system. 5. Shape recognition involves: (i) a collection of stored shape descriptions, and (ii) various indexes into the collection that allow a newly derived description to be associated with an appropriate stored description. The most important of these indexes allows shape recognition to proceed conservatively from the general to the specific based on the specificity of the information available from the image. 6. New constraints supplied by a conservative recognition process can be used to extract more information from the image. A relaxation process for carrying out this constraint analysis is described."
            },
            "slug": "Representation-and-recognition-of-the-spatial-of-Marr-Nishihara",
            "title": {
                "fragments": [],
                "text": "Representation and recognition of the spatial organization of three-dimensional shapes"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "The human visual process can be studied by examining the computational problems associated with deriving useful information from retinal images by applying the approach to the problem of representing three-dimensional shapes for the purpose of recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 767650,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6bb6eba248b6ef8d228dc33e6113c3e12dd48fee",
            "isKey": false,
            "numCitedBy": 1168,
            "numCiting": 82,
            "paperAbstract": {
                "fragments": [],
                "text": "The extraction of stereo-disparity information from two images depends upon establishing a correspondence between them. In this article we analyze the nature of the correspondence computation and derive a cooperative algorithm that implements it. We show that this algorithm successfully extracts information from random-dot stereograms, and its implications for the psychophysics and neurophysiology of the visual system are briefly discussed."
            },
            "slug": "Cooperative-computation-of-stereo-disparity.-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "Cooperative computation of stereo disparity."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that this algorithm successfully extracts information from random-dot stereograms, and its implications for the psychophysics and neurophysiology of the visual system are briefly discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688682"
                        ],
                        "name": "R. Woodham",
                        "slug": "R.-Woodham",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Woodham",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Woodham"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5425508,
            "fieldsOfStudy": [
                "Materials Science"
            ],
            "id": "71d464754d55ae1b7a465653d76efe6da52311c2",
            "isKey": false,
            "numCitedBy": 105,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Thesis. 1977. Ph.D.--Massachusetts Institute of Technology. Dept. of Electrical Engineering and Computer Science."
            },
            "slug": "Reflectance-map-techniques-for-analyzing-surface-in-Woodham",
            "title": {
                "fragments": [],
                "text": "Reflectance map techniques for analyzing surface defects in metal castings"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This paper presents a meta-modelling system that automates the very labor-intensive and therefore time-heavy and therefore expensive and expensive process of computer programming called “hacking”."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60545300,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "75d5b6239679642070a29859ec009874f3be9a4a",
            "isKey": false,
            "numCitedBy": 380,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "An Algorithm is proposed for solving the stereoscopic matching problem. The algorithm consists of five steps: (1) Each image is filtered with bar masks of four sizes that vary with eccentricity; the equivalent filters are about one octave wide. (2) Zero-crossings of the mask values are localized, and positions that correspond to terminations are found; (3) For each mask size, matching takes place between pairs of zero- crossings or terminations of the same sign in the two images, for a range of disparities up to about the vergence movements, thus causing small masks to come into correspondence; (5) When a correspondence is achieved, it is written into a dynamic buffer, called the 2 1/2 D sketch. It is shown that this proposal provides a theoretical framework for most existing phychophysical and neurophysiological data about stereopsis. Several critical experimental predictions are also made, for instance, about the wsize of Panum?s area under various conditions. The results of such experiments would tell us whether, for example, cooperativity is necessary for the fusion process."
            },
            "slug": "A-Theory-of-Human-Stereo-Vision-Marr-Poggio",
            "title": {
                "fragments": [],
                "text": "A Theory of Human Stereo Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This proposal provides a theoretical framework for most existing phychophysical and neurophysiological data about stereopsis, and several critical experimental predictions are made, for instance, about the wsize of Panum?s area under various conditions."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47894946"
                        ],
                        "name": "J. V. Diggelen",
                        "slug": "J.-V.-Diggelen",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Diggelen",
                            "middleNames": [
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. V. Diggelen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 128256825,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "26ddbe31dc9d2c2d7c44ba8bac93a41db9097799",
            "isKey": false,
            "numCitedBy": 55,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-photometric-investigation-of-the-slopes-and-the-Diggelen",
            "title": {
                "fragments": [],
                "text": "A photometric investigation of the slopes and the heights of the ranges of hills in the Maria of the Moon"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1951
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "80235812"
                        ],
                        "name": "M. Minnaert",
                        "slug": "M.-Minnaert",
                        "structuredName": {
                            "firstName": "Marcel",
                            "lastName": "Minnaert",
                            "middleNames": [
                                "Gilles",
                                "Jozef"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Minnaert"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121646354,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "8409d798bdacb65580143a2d630bc85c585ea240",
            "isKey": false,
            "numCitedBy": 584,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-reciprocity-principle-in-lunar-photometry-Minnaert",
            "title": {
                "fragments": [],
                "text": "The reciprocity principle in lunar photometry"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1941
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A Photometric Investigation of the Slopes and Heights of the Ranges"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1951
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Determining Shape from Shading"
            },
            "venue": {
                "fragments": [],
                "text": "Psychology of Computer Vision"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "B8 Stereomat Automated Plotter"
            },
            "venue": {
                "fragments": [],
                "text": "Wild Heerbrugg & Raytheon"
            },
            "year": 1171
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Gestalt Photomapping System: Photo~rammetric"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Geometrical Considerations a n d Nomenclature for Reflectance"
            },
            "venue": {
                "fragments": [],
                "text": "NBS Monograph"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Operational use of the Gestalt Photo Mapper 11,\" paper prepared for American Society of Photogrammetry Semi-Annual Meeting"
            },
            "venue": {
                "fragments": [],
                "text": "Operational use of the Gestalt Photo Mapper 11,\" paper prepared for American Society of Photogrammetry Semi-Annual Meeting"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Operational use of the Gestalt Photo Mapper 11,\" paper prepared for American Society of Photogrammetry Semi-Annual Meeting, Little Rock Arkansas"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Local Context in Matching Edges for Stereo Vision"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. DARPA Image Understanding Workshop"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Gestalt Photomapping System: Photo~rammetric engineer in^ and Remote Sensinp"
            },
            "venue": {
                "fragments": [],
                "text": "The Gestalt Photomapping System: Photo~rammetric engineer in^ and Remote Sensinp"
            },
            "year": 1977
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\" Photometric Stereo , \" A . I . Memo"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "AS-11B-X Automated Stereo Mapper RADC-TR-76-100 Rome Air Development Center, %: Criffis Air Force Base"
            },
            "venue": {
                "fragments": [],
                "text": "AS-11B-X Automated Stereo Mapper RADC-TR-76-100 Rome Air Development Center, %: Criffis Air Force Base"
            },
            "year": 1181
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\" Photometric Method for Lunar Topography , \" Photonrammetric Engineering , March 1966"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 27,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/Determining-Shape-and-Reflectance-Using-Multiple-Horn-Woodham/a750e60a696f934168a022c01dd41d6aecc1a8be?sort=total-citations"
}