{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107584303"
                        ],
                        "name": "J. P. Jones",
                        "slug": "J.-P.-Jones",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Jones",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. P. Jones"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "82179721"
                        ],
                        "name": "A. Stepnoski",
                        "slug": "A.-Stepnoski",
                        "structuredName": {
                            "firstName": "A",
                            "lastName": "Stepnoski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Stepnoski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3459632"
                        ],
                        "name": "L. Palmer",
                        "slug": "L.-Palmer",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Palmer",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Palmer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41153313,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "75a1bd03f96fe18c25b1c3b2e46ce0e5b0fa4aff",
            "isKey": false,
            "numCitedBy": 180,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "1. A quantitative, general purpose method was developed for measuring the responses of visual neurons to stimuli distributed with high resolution over the two-dimensional (2D) spatial frequency domain. The stimuli consisted of drifting sinusoidal gratings of nonsaturating contrasts whose spatial frequency and orientation were drawn in random order from a 16 X 16 array of coordinates covering each neuron's responsive area. This method was applied to a population of 36 simple cells in area 17 of cat. 2. The response of each simple cell to drifting sinusoidal gratings appeared as a rectified sinusoidal modulation of the spike frequency. The degree of rectification varied from cell to cell, but for each cell, the form of the response was constant irrespective of stimulus spatial frequency, orientation, or contrast. The amplitude of the average response at the stimulus temporal frequency was used as the response metric at all spectral coordinates. Variations in this amplitude over two spectral dimensions forms a surface that we call the 2D spectral response profile. 3. For each cell, the 2D spectral response profile was localized to a limited region of the complete 2D spatial frequency domain. In bidirectionally responsive cells, there were two lobes in the surface disposed with mirror symmetry about the origin. In all cells, each lobe exhibited a single maximum and the response decayed smoothly in every direction away from the maximum. Isoresponse amplitude contours were elliptical and often, but not always, elongated about an axis of symmetry passing through the origin. 4. We tested the hypothesis that orientation and spatial frequency tuning are independent by forming scaled radial and angular sections through 2D spectral response profiles. In virtually every case polar separability did not obtain, that is, orientation selectivity depended on spatial frequency and vice versa. 5. In contrast, more than half the cells had 2D spectral response profiles that were Cartesian separable. The 2D spectral response profiles of most of the remaining cells were neither polar nor Cartesian separable, because the response profiles were elongated about an axis of symmetry that did not pass through the origin. 6. These results are discussed in terms of the constraints they place on models of the contributions simple cells make toward the neural representation of images."
            },
            "slug": "The-two-dimensional-spectral-structure-of-simple-in-Jones-Stepnoski",
            "title": {
                "fragments": [],
                "text": "The two-dimensional spectral structure of simple receptive fields in cat striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "A quantitative, general purpose method was developed for measuring the responses of visual neurons to stimuli distributed with high resolution over the two-dimensional (2D) spatial frequency domain and the hypothesis that orientation and spatial frequency tuning are independent was tested by forming scaled radial and angular sections through 2D spectral response profiles."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107584303"
                        ],
                        "name": "J. P. Jones",
                        "slug": "J.-P.-Jones",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Jones",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. P. Jones"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3459632"
                        ],
                        "name": "L. Palmer",
                        "slug": "L.-Palmer",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Palmer",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Palmer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17527051,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "43e0874cb25bfe27dde52776852b154564a8d3a3",
            "isKey": false,
            "numCitedBy": 833,
            "numCiting": 56,
            "paperAbstract": {
                "fragments": [],
                "text": "1. A reverse correlation (6, 8, 25, 35) method is developed that allows quantitative determination of visual receptive-field structure in two spatial dimensions. This method is applied to simple cells in the cat striate cortex. 2. It is demonstrated that the reverse correlation method yields results with several desirable properties, including convergence and reproducibility independent of modest changes in stimulus parameters. 3. In contrast to results obtained with moving stimuli, we find that the bright and dark excitatory subregions in simple receptive fields do not overlap to any great extent. This difference in results may be attributed to confounding the independent variables space and time when using moving stimuli. 4. All simple receptive fields have subregions that vary smoothly in all directions in space. There are no sharp transitions either between excitatory subregions or between subregions and the area surrounding the receptive field. 5. Simple receptive fields vary both in the number of subregions observed, in the elongation of each subregion, and in the overall elongation of the field. In contrast with results obtained using moving stimuli, we find that subregions within a given receptive field need not be the same length. 6. The hypothesis that simple receptive fields can be modeled as either even symmetric or odd symmetric about a central axis is evaluated. This hypothesis is found to be false in general. Most simple receptive fields are neither even symmetric nor odd symmetric. 7. The hypothesis that simple receptive fields can be modeled as the product of a width response profile and an orthogonal length response profile (Cartesian separability) is evaluated. This hypothesis is found to be true for only approximately 50% of the cells in our sample."
            },
            "slug": "The-two-dimensional-spatial-structure-of-simple-in-Jones-Palmer",
            "title": {
                "fragments": [],
                "text": "The two-dimensional spatial structure of simple receptive fields in cat striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "A reverse correlation method is developed that allows quantitative determination of visual receptive-field structure in two spatial dimensions and it is demonstrated that thereverse correlation method yields results with several desirable properties, including convergence and reproducibility independent of modest changes in stimulus parameters."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707107"
                        ],
                        "name": "J. Movshon",
                        "slug": "J.-Movshon",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Movshon",
                            "middleNames": [
                                "Anthony"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Movshon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1935795"
                        ],
                        "name": "I. Thompson",
                        "slug": "I.-Thompson",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Thompson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Thompson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5659259,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d435143b4a7b2d7c56a696504e87db39157c3449",
            "isKey": false,
            "numCitedBy": 963,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "1. We have examined the responses of simple cells in the cat's atriate cortex to visual patterns that were designed to reveal the extent to which these cells may be considered to sum light‐evoked influences linearly across their receptive fields. We used one‐dimensional luminance‐modulated bars and grating as stimuli; their orientation was always the same as the preferred orientation of the neurone under study. The stimuli were presented on an oscilloscope screen by a digital computer, which also accumulated neuronal responses and controlled a randomized sequence of stimulus presentations. 2. The majority of simple cells respond to sinusoidal gratings that are moving or whose contrast is modulated in time in a manner consistent with the hypothesis that they have linear spatial summation. Their responses to moving gratings of all spatial frequencies are modulated in synchrony with the passage of the gratings' bars across their receptive fields, and they do not produce unmodulated responses even at the highest spatial frequencies. Many of these cells respond to temporally modulated stationary gratings simply by changing their response amplitude sinusoidally as the spatial phase of the grating the grating is varied. Nonetheless, their behavior appears to indicate linear spatial summation, since we show in an Appendix that the absence of a 'null' phase in a visual neurone need not indicate non‐linear spatial summation, and further that a linear neurone lacking a 'null' phase should give responses of the form that we have observed in this type of simple cell. 3. A minority of simple cells appears to have significant non‐linearities of spatial summation. These neurones respond to moving gratings of high spatial frequency with a partially or totally unmodulated elevation of firing rate. They have no 'null' phases when tested with stationary gratings, and reveal their non‐linearity by giving responses to gratings of some spatial phases that are composed partly or wholly of even harmonics of the stimulus frequency ('on‐off' responses). 4. We compared simple receptive fields with their sensitivity to sinusoidal gratings of different spatial frequencies. Qualitatively, the most sensitive subregions of simple cells' receptive fields are roughly the same width as the individual bars of the gratings to which they are most sensitive. Quantitatively, their receptive field profiles measured with thin stationary lines, agree well with predicted profiles derived by Fourier synthesis of their spatial frequency tuning curves."
            },
            "slug": "Spatial-summation-in-the-receptive-fields-of-simple-Movshon-Thompson",
            "title": {
                "fragments": [],
                "text": "Spatial summation in the receptive fields of simple cells in the cat's striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "The responses of simple cells in the cat's atriate cortex to visual patterns that were designed to reveal the extent to which these cells may be considered to sum light‐evoked influences linearly across their receptive fields are examined."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781325"
                        ],
                        "name": "J. Daugman",
                        "slug": "J.-Daugman",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Daugman",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Daugman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 10
                            }
                        ],
                        "text": "Following Daugman, we refer to these functions as 2D Gabor filters."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 89,
                                "start": 86
                            }
                        ],
                        "text": "To fairly evaluate the 2D Gabor filter hypothesis, we must allow for its general form (7)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 58
                            }
                        ],
                        "text": "It is essentially equivalent to the form given by Daugman (7), except in the expression of the decay parameters er: and b, which he writes in a form reciprocal to the one given here."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 34,
                                "start": 31
                            }
                        ],
                        "text": "Using Daugman’s generalization (7) of Gabor’s concepts (16), we may think of simple receptive fields as occupying hypervolumes in a four-dimensional information space, the coordinates of which specify spatial position in 2D and spatial frequency position in 2D."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 162,
                                "start": 159
                            }
                        ],
                        "text": "In general, these results provide convincing empirical support for Marcelja’s original hypothesis (26) and Daugman’s extension of it to two spatial dimensions (7)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 130,
                                "start": 127
                            }
                        ],
                        "text": "Using the two-dimensional (2D) spatial and spectral response profiles described in the previous two reports, we test Daugman’s (7) generalization of Marcelja’s hypothesis (26) that simple receptive fields belong to a class of linear spatial filters analogous to those described by Gabor ( 16) and referred to here as 2D Gabor filters."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 107,
                                "start": 100
                            }
                        ],
                        "text": "If Gabor’s optimization principle is to apply to spatial vision, it must first be generalized to 2D. Daugman (7) noted that in 2D form, resolution for the two coordinates of spatial position enters into an uncertainty relation with resolution for the two coordinates of the 2D spatial frequency domain (interpretable as orientation and spatial frequency), and that the optimal solution to this joint 2D uncertainty problem embraces a family of functions consisting of bivariate elliptic Gaussians modulated by sinusoidal plane waves."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 48,
                                "start": 41
                            }
                        ],
                        "text": "ACKNOWLEDGMENTS\nWe are grateful to J. G. Daugman for many helpful discussions and useful suggestions and to Dr. Martin Pring for help with statistical issues."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 11,
                                "start": 8
                            }
                        ],
                        "text": "Daugman (7) noted that in 2D form, resolution for the two coordinates of spatial position enters into an uncertainty relation with resolution for the two coordinates of the 2D spatial frequency domain (interpretable as orientation and spatial frequency), and that the optimal solution to this joint 2D uncertainty problem embraces a family of functions consisting of bivariate elliptic Gaussians modulated by sinusoidal plane waves."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9271650,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "02f89cd1fd6f013a1a301a292936ff8fb06aff25",
            "isKey": true,
            "numCitedBy": 3420,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "Two-dimensional spatial linear filters are constrained by general uncertainty relations that limit their attainable information resolution for orientation, spatial frequency, and two-dimensional (2D) spatial position. The theoretical lower limit for the joint entropy, or uncertainty, of these variables is achieved by an optimal 2D filter family whose spatial weighting functions are generated by exponentiated bivariate second-order polynomials with complex coefficients, the elliptic generalization of the one-dimensional elementary functions proposed in Gabor's famous theory of communication [J. Inst. Electr. Eng. 93, 429 (1946)]. The set includes filters with various orientation bandwidths, spatial-frequency bandwidths, and spatial dimensions, favoring the extraction of various kinds of information from an image. Each such filter occupies an irreducible quantal volume (corresponding to an independent datum) in a four-dimensional information hyperspace whose axes are interpretable as 2D visual space, orientation, and spatial frequency, and thus such a filter set could subserve an optimally efficient sampling of these variables. Evidence is presented that the 2D receptive-field profiles of simple cells in mammalian visual cortex are well described by members of this optimal 2D filter family, and thus such visual neurons could be said to optimize the general uncertainty relations for joint 2D-spatial-2D-spectral information resolution. The variety of their receptive-field dimensions and orientation and spatial-frequency bandwidths, and the correlations among these, reveal several underlying constraints, particularly in width/length aspect ratio and principal axis organization, suggesting a polar division of labor in occupying the quantal volumes of information hyperspace.(ABSTRACT TRUNCATED AT 250 WORDS)"
            },
            "slug": "Uncertainty-relation-for-resolution-in-space,-and-Daugman",
            "title": {
                "fragments": [],
                "text": "Uncertainty relation for resolution in space, spatial frequency, and orientation optimized by two-dimensional visual cortical filters."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Evidence is presented that the 2D receptive-field profiles of simple cells in mammalian visual cortex are well described by members of this optimal 2D filter family, and thus such visual neurons could be said to optimize the general uncertainty relations for joint 2D-spatial-2D-spectral information resolution."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5624877"
                        ],
                        "name": "S. Marčelja",
                        "slug": "S.-Marčelja",
                        "structuredName": {
                            "firstName": "Stjepan",
                            "lastName": "Marčelja",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Marčelja"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23364863,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "85af5a0b7102919e96eebe9143c082fe9e453e46",
            "isKey": false,
            "numCitedBy": 1317,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "On the basis of measured receptive field profiles and spatial frequency tuning characteristics of simple cortical cells, it can be concluded that the representation of an image in the visual cortex must involve both spatial and spatial frequency variables. In a scheme due to Gabor, an image is represented in terms of localized symmetrical and antisymmetrical elementary signals. Both measured receptive fields and measured spatial frequency tuning curves conform closely to the functional form of Gabor elementary signals. It is argued that the visual cortex representation corresponds closely to the Gabor scheme owing to its advantages in treating the subsequent problem of pattern recognition."
            },
            "slug": "Mathematical-description-of-the-responses-of-simple-Marčelja",
            "title": {
                "fragments": [],
                "text": "Mathematical description of the responses of simple cortical cells."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is argued that the visual cortex representation corresponds closely to the Gabor scheme owing to its advantages in treating the subsequent problem of pattern recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48089152"
                        ],
                        "name": "B. W. Andrews",
                        "slug": "B.-W.-Andrews",
                        "structuredName": {
                            "firstName": "Bryan",
                            "lastName": "Andrews",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. W. Andrews"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1925241"
                        ],
                        "name": "D. Pollen",
                        "slug": "D.-Pollen",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Pollen",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pollen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 28588085,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "dda59b551f8c72c29ee580f6627f1f75a6d3b38b",
            "isKey": false,
            "numCitedBy": 168,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Receptive fields of simple cells in area 17 of the cat were mapped with stationary stimuli. Spatial frequency selectivities of the same cells were measured with drifting sinusoidal gratings. 2. The reconstructed field profile (inverse Fourier transform of selectivity curve) shows qualitative agreement with the mapped profile, and suggests the existence of additional side‐lobes in the field. The side‐lobes may correspond to the 'unresponsive regions' investigated by Maffei & Fiorentini (1976). 3. Our data suggest that the simple cell may perform approximately linear spatial summation of inputs to the visual system. However, the output of the simple cell is generally non‐linear as reflected in its truncated responses to gratings."
            },
            "slug": "Relationship-between-spatial-frequency-selectivity-Andrews-Pollen",
            "title": {
                "fragments": [],
                "text": "Relationship between spatial frequency selectivity and receptive field profile of simple cells."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The data suggest that the simple cell may perform approximately linear spatial summation of inputs to the visual system, however, the output of thesimple cell is generally non‐linear as reflected in its truncated responses to gratings."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 77,
                                "start": 73
                            }
                        ],
                        "text": "Second, striate neurons respond to narrow ranges of stimulus orientation (17) and spatial frequency (6), the angular and radial polar coordinates of the two-dimensional (2D) spatial frequency domain."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 158,
                                "start": 154
                            }
                        ],
                        "text": "First, the receptive fields of striate neurons are well defined, restricted to small regions of space, and in the case of simple cells, highly structured (17)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 21
                            }
                        ],
                        "text": "Neither binocularity (17), nor any time-dependent behavior of simple cells are addressed."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12429,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39409429"
                        ],
                        "name": "R. L. Valois",
                        "slug": "R.-L.-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "Valois",
                            "middleNames": [
                                "L.",
                                "de"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2129244"
                        ],
                        "name": "D. G. Albrecht",
                        "slug": "D.-G.-Albrecht",
                        "structuredName": {
                            "firstName": "Duane",
                            "lastName": "Albrecht",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. G. Albrecht"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40471674"
                        ],
                        "name": "Lisa G. Thorell",
                        "slug": "Lisa-G.-Thorell",
                        "structuredName": {
                            "firstName": "Lisa",
                            "lastName": "Thorell",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lisa G. Thorell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118706047,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6dd77b9c70c3cbcc2a29992b82d5e4612249fc40",
            "isKey": false,
            "numCitedBy": 83,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Until the pioneering work of HUBEL and WIESEL (1, 2, 3), visual scientists could do little more than guess about the functions of cells in visual cortex and the manner in which complex patterns were analyzed. Their initial reports, however, established that cells in Area 17 of cat (and also monkey) were quite unresponsive to full-field illumination, requiring more specific patterns to elicit a response. Their receptive field (RF) maps of simple cells showed an elongated excitatory center and inhibitory flanks, or vice versa; or two adjacent excitatory and inhibitory areas. Initially HUBEL and WIESEL (2) reported that there was summation within the excitatory and inhibitory regions and an antagonism between them. As we shall see, such summation, if true, would have implications not at all foreseen at the time, and would lead one, in fact, to a quite different model of what such cells do from the one which they actually proposed."
            },
            "slug": "Cortical-cells-;-Bar-and-edge-detectors,-or-spatial-Valois-Albrecht",
            "title": {
                "fragments": [],
                "text": "Cortical cells ; Bar and edge detectors, or spatial frequency filters"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Initially HUBEL and WIESEL reported that there was summation within the excitatory and inhibitory regions and an antagonism between them, which would have implications not at all foreseen at the time, and would lead to a quite different model of what such cells do from the one which they actually proposed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4283426"
                        ],
                        "name": "W. Mullikin",
                        "slug": "W.-Mullikin",
                        "structuredName": {
                            "firstName": "W",
                            "lastName": "Mullikin",
                            "middleNames": [
                                "H"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Mullikin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107584303"
                        ],
                        "name": "J. P. Jones",
                        "slug": "J.-P.-Jones",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Jones",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. P. Jones"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3459632"
                        ],
                        "name": "L. Palmer",
                        "slug": "L.-Palmer",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Palmer",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Palmer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 12660906,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "129e0f6bdc7933ca82e066a9200c1bf577b9b01c",
            "isKey": false,
            "numCitedBy": 53,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Quantitative, high-resolution static receptive-field plots (response planes) in cat area 17 revealed simple cells whose receptive fields were composed of four to six excitatory regions alternating in space with up to seven inhibitory regions. The size, shape, and spacing of the excitatory regions within these receptive fields were highly regular, giving the receptive field a periodic appearance in space. We call these periodic simple cells. A periodic simple cell's response to moving stimuli could, in general, be anticipated from the detailed spatiotemporal map of excitatory and inhibitory regions provided by response planes. This observation suggests that periodic simple cells, like the more common simple cells composed of one to three excitatory regions, sum spatially distributed inputs in a roughly linear manner. Based on a quantitative assessment of the spatial distribution and time course of response of single excitatory regions within periodic receptive fields, as described in the previous paper, we characterized periodic simple cells as either X-like or Y-like. Furthermore, we found that periodic simple cells classified as X-like gave a more sustained response to standing contrast and had significantly smaller excitatory regions than those cells classified as Y-like. Periodic simple cells were found in layer III and at the border between layers III and IVab. It is suggested that these cells, which reside outside the primary zone of geniculate termination and include both X-like and Y-like types, may be constructed hierarchically from the convergence of lower order simple cells. In the spatial-frequency domain, periodic simple receptive fields were predicted to have bandwidths at half-maximum ranging from 0.80 to 1.4 octaves. By comparison, the predicted bandwidths of cells composed of two or three excitatory regions ranged from 1.6 to 4.3 octaves. Thus as additional excitatory regions are added to the receptive fields of simple cells, their bandwidth narrows in the spatial-frequency domain."
            },
            "slug": "Periodic-simple-cells-in-cat-area-17.-Mullikin-Jones",
            "title": {
                "fragments": [],
                "text": "Periodic simple cells in cat area 17."
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "It is suggested that periodic simple cells, which reside outside the primary zone of geniculate termination and include both X-like and Y-like types, may be constructed hierarchically from the convergence of lower order simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2087960"
                        ],
                        "name": "M. Morrone",
                        "slug": "M.-Morrone",
                        "structuredName": {
                            "firstName": "Maria",
                            "lastName": "Morrone",
                            "middleNames": [
                                "Concetta"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Morrone"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2299127"
                        ],
                        "name": "D. Burr",
                        "slug": "D.-Burr",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Burr",
                            "middleNames": [
                                "Charles"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Burr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2041558"
                        ],
                        "name": "L. Maffei",
                        "slug": "L.-Maffei",
                        "structuredName": {
                            "firstName": "Lamberto",
                            "lastName": "Maffei",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Maffei"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13362060,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "31ab45d6b9b041159e654a7cf3bc978abd5a3656",
            "isKey": false,
            "numCitedBy": 418,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "Simple and complex cells of striate cortex of anaesthetized and paralysed cats were stimulated with two superimposed one-dimensional grating stimuli of different orientations to investigate inhibitory effects of non-optimally oriented stimuli. We confirmed that a stimulus of orientation orthogonal to a cell’s long axis significantly reduces the cell’s discharge rate. Further experiments revealed the following, (i) The inhibition was typically stronger for simple than for complex cells, (ii) It is very broadly tuned for orientation, all orientations outside the cell’s tuning band having a comparable inhibitory effect. (iii) Similarly, it is broadly tuned for spatial frequency. These last two results suggest that the inhibition arises not from a single cell but from a pool of cells, (iv) The pattern of the discharge of the inhibition in response to stimulation by phase-reversed sinusoidal gratings is consistent with the notion that the inhibition arises from complex cells. A second series of recordings of stimulation by visual noise patterns demonstrated how ‘cross-orientation inhibition’ prevents simple cells from responding to two-dimensional visual noise while allowing them to respond to comparable one-dimensional noise patterns. We suggest that this mechanism may serve to render simple cells selectively sensitive to one-dimensional stimuli, such as the contours or borders of visual objects."
            },
            "slug": "Functional-implications-of-cross-orientation-of-I.-Morrone-Burr",
            "title": {
                "fragments": [],
                "text": "Functional implications of cross-orientation inhibition of cortical visual cells. I. Neurophysiological evidence"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "‘cross-orientation inhibition’ prevents simple cells from responding to two-dimensional visual noise while allowing them to respond to comparable one-dimensional noise patterns, and it is suggested that this mechanism may serve to render simple cells selectively sensitive to one- dimensional stimuli, such as the contours or borders of visual objects."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3426280"
                        ],
                        "name": "K. D. De Valois",
                        "slug": "K.-D.-De-Valois",
                        "structuredName": {
                            "firstName": "Karen",
                            "lastName": "De Valois",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. D. De Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113588000"
                        ],
                        "name": "R. L. de Valois",
                        "slug": "R.-L.-de-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "de Valois",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. de Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2439030"
                        ],
                        "name": "E. Yund",
                        "slug": "E.-Yund",
                        "structuredName": {
                            "firstName": "E.",
                            "lastName": "Yund",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Yund"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 190,
                                "start": 183
                            }
                        ],
                        "text": "These obser\\ vations have given rise to divergent theories according to which striate cells have been considered either as feature detectors (27, 28), or as spatial frequency filters (9, 25)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 24232295,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c7d83779adf4d83f9ddffa8aeec342561d66f9c8",
            "isKey": false,
            "numCitedBy": 245,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Cells in visual cortex have been alternately considered as bar and edge detectors, or as spatial‐frequency filters responding to the two‐dimensional Fourier component of patterns. 2. The responses to gratings and to checkerboards allow one to test these alternate models: the Fourier components of a checkerboard pattern do not occur at the same orientation as the edges, nor do the checkerboard spatial frequencies correspond to the check widths. 3. Knowing the orientation tuning of a cell for gratings, one can precisely predict its orientation tuning to checkerboards from the orientation of the fundamental Fourier components of the patterns, not from the orientation of their edges. This was found for both square and rectangular checkerboards, and held for both simple and complex cortical cells. 4. Knowing the spatial tuning of a cell for sine‐wave gratings, one can precisely predict its spatial tuning to square and rectangular checkerboards from the spatial frequencies of the fundamental Fourier components of the patterns, not from the widths of their checks. 5. When presented with checkerboards in which not the fundamental but the upper harmonics were within its spatial bandpass, a cell's orientation tuning was found to be predictable from the (quite different) orientation of the higher Fourier harmonic components, but not from the orientation of the edges. 6. Knowing a cell's contrast sensitivity for gratings, one can predict the cell's contrast sensitivity for checkerboards much more accurately from the amplitudes of the two‐dimensional Fourier components of the patterns than from the contrasts of the patterns. 7. The orientation tuning, spatial‐frequency tuning and responsiveness of cells to a plaid pattern were also found to be predictable from the pattern's two‐dimensional Fourier spectrum. 8. Both simple and complex striate cortex cells can thus be characterized as two‐dimensional spatial‐frequency filters. Since different cells responsive to the same region in the visual field are tuned to different spatial frequencies and orientations, the ensemble of such cells would fairly precisely encode the two‐dimensional Fourier spectrum of a patch of visual space."
            },
            "slug": "Responses-of-striate-cortex-cells-to-grating-and-Valois-Valois",
            "title": {
                "fragments": [],
                "text": "Responses of striate cortex cells to grating and checkerboard patterns."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The orientation tuning, spatial‐frequency tuning and responsiveness of cells to a plaid pattern were found to be predictable from the pattern's two‐dimensional Fourier spectrum, and both simple and complex striate cortex cells can be characterized as two-dimensional spatial‐ frequencies filters."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2041558"
                        ],
                        "name": "L. Maffei",
                        "slug": "L.-Maffei",
                        "structuredName": {
                            "firstName": "Lamberto",
                            "lastName": "Maffei",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Maffei"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145406237"
                        ],
                        "name": "A. Fiorentini",
                        "slug": "A.-Fiorentini",
                        "structuredName": {
                            "firstName": "Adriana",
                            "lastName": "Fiorentini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Fiorentini"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36077747,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "73e97ec23e41231b45507ef054a56fdd55f5335d",
            "isKey": false,
            "numCitedBy": 672,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-visual-cortex-as-a-spatial-frequency-analyser.-Maffei-Fiorentini",
            "title": {
                "fragments": [],
                "text": "The visual cortex as a spatial frequency analyser."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3426280"
                        ],
                        "name": "K. D. De Valois",
                        "slug": "K.-D.-De-Valois",
                        "structuredName": {
                            "firstName": "Karen",
                            "lastName": "De Valois",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. D. De Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40018119"
                        ],
                        "name": "R. Tootell",
                        "slug": "R.-Tootell",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Tootell",
                            "middleNames": [
                                "B.",
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Tootell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 20044202,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "58b76f07fbb30c0b4338dbb6148a674d1b260f0a",
            "isKey": false,
            "numCitedBy": 140,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "Responses to single and multiple spatial frequency gratings were recorded from eighty‐eight cat striate cortex cells. A cell's response to a grating of its optimum spatial frequency (f) was examined both alone and in the presence of gratings of 1/4, 1/3, 1/2, 2, 3 and 4f, respectively. Some 97% (thirty‐seven of thirty‐eight) of all simple cells showed significant inhibition of f by one or more of the other frequencies. This inhibition was usually fairly narrowly tuned, with only one or two spatial frequencies producing significant inhibition. Thirty‐four simple cells were maximally inhibited by a higher frequency, three by a lower spatial frequency. By far the most common interaction was a considerable inhibition of f by 2f and/or 3f. Of the thirty‐seven simple cells showing inhibition to a complex grating, seventeen responded in a manner dependent on the relative phases of the two components. Some showed only inhibition of f; in others, the response to f was either increased or decreased, depending on the relative phase of the two frequencies. The other twenty simple cells showed phase‐independent inhibition: the inhibition was of approximately equal amplitude regardless of the relative phase angle of the two grating components. Such phase‐independent inhibition cannot be accounted for by linear summation within classical cortical receptive fields. Only eighteen of forty‐eight (38%) of the complex cells showed significant inhibition of f by one or more other spatial frequencies. Fourteen of these (29%) were maximally inhibited by a higher spatial frequency, four (8%) by a lower spatial frequency. Inhibitory interactions in complex cells were never dependent on the relative phase of the two component gratings. Six simple cells (16%) and fourteen complex cells (29%) showed significant facilitation of the response to f by one or more (most often lower) spatial frequencies. This enhanced response was greater than the sum of the responses to each component alone, was usually broadly tuned for spatial frequency, and did not depend on the relative phase of the two components. It thus differs from the increased response sometimes seen in a phase‐dependent interaction. Some of the observed spatial‐frequency‐specific interactions are incompatible with either a strictly hierarchical model of cortical architecture or a simple linear filter model of visual cortical processing. The asymmetry of inhibition suggests that it subserves some function other than (or in addition to) the narrowing of spatial frequency tuning functions."
            },
            "slug": "Spatial‐frequency‐specific-inhibition-in-cat-cortex-Valois-Tootell",
            "title": {
                "fragments": [],
                "text": "Spatial‐frequency‐specific inhibition in cat striate cortex cells."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Some of the observed spatial‐frequency‐specific interactions are incompatible with either a strictly hierarchical model of cortical architecture or a simple linear filter model of visual cortical processing."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52555257"
                        ],
                        "name": "J. Kulikowski",
                        "slug": "J.-Kulikowski",
                        "structuredName": {
                            "firstName": "Janus",
                            "lastName": "Kulikowski",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kulikowski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145606123"
                        ],
                        "name": "P. O. Bishop",
                        "slug": "P.-O.-Bishop",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Bishop",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. O. Bishop"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44579600,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "2efda1f0162865f81c2f8382fbf3a830f5db2df4",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "silent-periodic-cells-in-the-cat-striate-cortex-Kulikowski-Bishop",
            "title": {
                "fragments": [],
                "text": "silent periodic cells in the cat striate cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707107"
                        ],
                        "name": "J. Movshon",
                        "slug": "J.-Movshon",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Movshon",
                            "middleNames": [
                                "Anthony"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Movshon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143662510"
                        ],
                        "name": "A. Dean",
                        "slug": "A.-Dean",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Dean",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Dean"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28977860,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "01e6b2a85cc584a36923d16c696ce65a9dc51011",
            "isKey": false,
            "numCitedBy": 973,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-statistical-reliability-of-signals-in-single-in-Tolhurst-Movshon",
            "title": {
                "fragments": [],
                "text": "The statistical reliability of signals in single neurons in cat and monkey visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113588000"
                        ],
                        "name": "R. L. de Valois",
                        "slug": "R.-L.-de-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "de Valois",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. de Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40471674"
                        ],
                        "name": "Lisa G. Thorell",
                        "slug": "Lisa-G.-Thorell",
                        "structuredName": {
                            "firstName": "Lisa",
                            "lastName": "Thorell",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lisa G. Thorell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2129244"
                        ],
                        "name": "D. G. Albrecht",
                        "slug": "D.-G.-Albrecht",
                        "structuredName": {
                            "firstName": "Duane",
                            "lastName": "Albrecht",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. G. Albrecht"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5954367,
            "fieldsOfStudy": [
                "Biology",
                "Physics"
            ],
            "id": "93df8d93261e7d1abcbe6b38fe22a0dc25c954ed",
            "isKey": false,
            "numCitedBy": 88,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "If striate cells had the simple bipartite or tripartite receptive fields (RF's) classically attributed to them, they should be quite broadly tuned for spatial frequency. Most striate-cortex cells, however, are fairly narrowly tuned and would be expected to have more-periodic RF's. We have examined this question in recordings of the responses of cat and monkey striate-cortex cells to gratings of increasingly large number of cycles, all centered on the cells' RF's. Simple cells narrowly tuned for spatial frequency were found to increase their responses with increasing numbers of stimulus cycles beyond the 1 1/2 cycles expected from the classical RF shape. Broadly tuned simple cells were found to have less-periodic RF's. Whereas narrowly tuned complex cells were also found to respond maximally to many stimulus cycles, other more broadly tuned complex cells did as well (possibly reflecting summation across many broadly tuned simple cells without regard to phase). A suppressive region was often seen just outside the excitatory two-dimensional spatial-frequency region, at off orientations and/or off spatial frequencies and around the whole RF in space. Most striate cells can thus be described as having periodic RF's in the space domain such that they fire just to patterns whose local spatial-frequency spectra fall within a compact, restricted, roughly circular two-dimensional spatial-frequency region, with an encircling suppressive region in both the space and the frequency domains."
            },
            "slug": "Periodicity-of-striate-cortex-cell-receptive-Valois-Thorell",
            "title": {
                "fragments": [],
                "text": "Periodicity of striate-cortex-cell receptive fields."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Most striate cells can be described as having periodic RF's in the space domain such that they fire just to patterns whose local spatial-frequency spectra fall within a compact, restricted, roughly circular two-dimensional spatial- frequencies region, with an encircling suppressive region in both the space and the frequency domains."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6323916"
                        ],
                        "name": "B. Dreher",
                        "slug": "B.-Dreher",
                        "structuredName": {
                            "firstName": "Bogdan",
                            "lastName": "Dreher",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Dreher"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 31145404,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "4e9871fa2d4ee031b610e50d7dec22442ac23018",
            "isKey": false,
            "numCitedBy": 142,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ".here has already been some discussion concerning hierarchical versus parallel processing of information in the striate cortex and I would like to add a few comments. Hubel and Wiesel,' in their classical papers, differentiated three categories of cells in the cat's striate cortex. They further suggested a hierarchical model which would explain the organization of the receptive fields of each type of cell. Thus only simple cells would receive a direct excitatory input from lateral geniculate neurons (LGN), and a number of simple cells with a common optimal orientation and slightly offset receptive-field positions would then provide the excitatory input to the complex cells. Finally, different complex cells with a common preferred orientation but again with offset receptive-field positions would provide excitatory and inhibitory inputs to the hypercomplex cells. The inhibitory input to the hypercomplex cell would explain that the sharp reduction in the discharge, as an optimally oriented stimulus, is elongated beyond the excitatory region in the receptive field. If the Hubel and Wiesel model is correct, one would expect a basic similarity between the responses of complex and hypercomplex cells. However, on the basis of the organization of their receptive field, we have been able to differentiate four classes of cells in the cat's striate cortex: simple, complex, and two distinct classes of hypercomplex cells. The majority of hypercomplex cells (Fig. 1, Type 1) have responses very similar to those of simple cells and their receptive fields can be subdivided into"
            },
            "slug": "Hypercomplex-cells-in-the-cat's-striate-cortex.-Dreher",
            "title": {
                "fragments": [],
                "text": "Hypercomplex cells in the cat's striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "On the basis of the organization of their receptive field, the authors have been able to differentiate four classes of cells in the cat's striate cortex: simple, complex, and two distinct classes of hypercomplex cells."
            },
            "venue": {
                "fragments": [],
                "text": "Investigative ophthalmology"
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 205,
                                "start": 201
                            }
                        ],
                        "text": "Because its parameters are continuously variable, one imagines that the system can be fine-tuned according to the environment in which the organism finds itself, either through early visual experience (18) or by continual reconfiguration throughout the animal’s lifetime ( 14)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 10511297,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "34f989681ef0ed85c9f809e96118e1a360702527",
            "isKey": false,
            "numCitedBy": 1083,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "IN A SERIES OF STUDIES on the cat over the past 5 years we have recorded from single cells in the striate cortex and mapped receptive fields using patterned retinal stimulation. The results suggest that connections between geniculate and striate cortex, and between cortical cells, must be highly specific (5). Indeed, cells in the striate cortex respond in such a characteristic way that departures from the normal adult physiology should be easily recognizable. In the present study we have made similar experiments in kittens ranging in age from l-3 weeks. Our purpose was to learn the age at which cortical cells have normal, adult-type receptive fields, and to find out whether such fields exist even in animals that have had no patterned visual stimulation."
            },
            "slug": "RECEPTIVE-FIELDS-OF-CELLS-IN-STRIATE-CORTEX-OF-VERY-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "RECEPTIVE FIELDS OF CELLS IN STRIATE CORTEX OF VERY YOUNG, VISUALLY INEXPERIENCED KITTENS."
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "The purpose was to learn the age at which cortical cells have normal, adult-type receptive fields, and to find out whether such fields exist even in animals that have had no patterned visual stimulation."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2129244"
                        ],
                        "name": "D. G. Albrecht",
                        "slug": "D.-G.-Albrecht",
                        "structuredName": {
                            "firstName": "Duane",
                            "lastName": "Albrecht",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. G. Albrecht"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113588000"
                        ],
                        "name": "R. L. de Valois",
                        "slug": "R.-L.-de-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "de Valois",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. de Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40471674"
                        ],
                        "name": "Lisa G. Thorell",
                        "slug": "Lisa-G.-Thorell",
                        "structuredName": {
                            "firstName": "Lisa",
                            "lastName": "Thorell",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lisa G. Thorell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 20827031,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1c2c7d5d05884a787373a2b9b5a21ada87c6fec3",
            "isKey": false,
            "numCitedBy": 109,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Neurons in the visual cortex of monkeys and cats have been characterized as either (i) bar and edge detectors or (ii) cells selective for certain spatial frequencies. To assess which of these functional descriptions is more accurate, we measured (i) the selectivity and (ii) the responsivity-sensitivity of these neurons to bars of various widths and gratings of various spatial frequencies. All of the cells recorded from were considerably more selective along the dimension of spatial frequency than along the dimension of bar width. Further, most were more responsive and sensitive to the grating of optimal frequency than to the bar of optimal width."
            },
            "slug": "Visual-cortical-neurons:-are-bars-or-gratings-the-Albrecht-Valois",
            "title": {
                "fragments": [],
                "text": "Visual cortical neurons: are bars or gratings the optimal stimuli?"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "All of the cells recorded from the visual cortex of monkeys and cats were considerably more selective along the dimension of spatial frequency than along thedimension of bar width."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746955"
                        ],
                        "name": "M. Bastiaans",
                        "slug": "M.-Bastiaans",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Bastiaans",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Bastiaans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 74,
                                "start": 68
                            }
                        ],
                        "text": "Because 2D Gabor filters form a quasi-orthogonal complete basis set (3, 4), image information is preserved in a robust representation that makes explicit both spatial and spectral image attributes."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 34727614,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "12a2bd238159c1304fcf500431503c5b0a468eff",
            "isKey": false,
            "numCitedBy": 50,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown how an optical signal can be expanded in Gaussian beams. The expansion is essentially the one suggested by Gabor in 1946, when he proposed to expand a signal into a discrete set of properly shifted and modulated Gaussian elementary signals; determining the expansion coefficients, however, seemed difficult, since the set of Gaussian elementary signals is not orthogonal. A set of functions is described, wnich is bi-orthonormal to the set of Gaussian elementary signals; this bi-orthonormality property allows an easy determination of the expansion coefficients."
            },
            "slug": "The-Expansion-of-an-Optical-Signal-into-a-Discrete-Bastiaans",
            "title": {
                "fragments": [],
                "text": "The Expansion of an Optical Signal into a Discrete Set of Gaussian Beams"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "It is shown how an optical signal can be expanded in Gaussian beams using a set of functions that is bi-orthonormal to the set of Gaussian elementary signals, which allows an easy determination of the expansion coefficients."
            },
            "venue": {
                "fragments": [],
                "text": "DAGM-Symposium"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40018119"
                        ],
                        "name": "R. Tootell",
                        "slug": "R.-Tootell",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Tootell",
                            "middleNames": [
                                "B.",
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Tootell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47660376"
                        ],
                        "name": "M. Silverman",
                        "slug": "M.-Silverman",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Silverman",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Silverman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2087168416"
                        ],
                        "name": "R. D. De Valois",
                        "slug": "R.-D.-De-Valois",
                        "structuredName": {
                            "firstName": "R",
                            "lastName": "De Valois",
                            "middleNames": [
                                "L"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. D. De Valois"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27950865,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "086e18ef8e562b0124fb69412cda480a1aea2c45",
            "isKey": false,
            "numCitedBy": 206,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Using the activity-dependent 2-[14C]deoxy-D-glucose technique, we have demonstrated a columnar organization of spatial frequency--specific sensitivity in striate cortex. Cats viewing patterns containing a single spatial frequency presented at all orientations show columns of increased deoxyglucose uptake extending through all cortical layers. A control stimulus containing all spatial frequencies presented at all orientations produces no columnar density differences within the striate cortex."
            },
            "slug": "Spatial-frequency-columns-in-primary-visual-cortex.-Tootell-Silverman",
            "title": {
                "fragments": [],
                "text": "Spatial frequency columns in primary visual cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 94,
                "text": "Using the activity-dependent 2-[14C]deoxy-D-glucose technique, a columnar organization of spatial frequency--specific sensitivity in striate cortex is demonstrated and Cats viewing patterns containing a single spatial frequency presented at all orientations show columns of increased deoxyglucOSE uptake extending through all cortical layers."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47106318"
                        ],
                        "name": "J. Neyman",
                        "slug": "J.-Neyman",
                        "structuredName": {
                            "firstName": "Jerzy",
                            "lastName": "Neyman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Neyman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4116892,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "92b59783cbdd4e1826880361e9c63b7b267ac642",
            "isKey": false,
            "numCitedBy": 69,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "MR. UDNY YULE'S “Introduction” was the first book on statistics that came into my hands. This was about 1916. I liked it then and learned a lot from it. I like it even more now in its eleventh edition, when it appears in a revised and supplemented form. In fact, in my opinion, this is the best book on the theory of statistics that was ever written. We may regret only that it is an elementary introduction to the theory of statistics and not the theory itself. This still remains to be written.An Introduction to the Theory of Statistics By G. Udny Yule M. G. Kendall. Eleventh edition, revised throughout and re-set. (Griffin's Scientific Text-Books.) Pp. xiii+570. (London: Charles Griffin and Co., Ltd., 1937.) 21s. net."
            },
            "slug": "An-Introduction-to-the-Theory-of-Statistics-Neyman",
            "title": {
                "fragments": [],
                "text": "An Introduction to the Theory of Statistics"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1938
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746955"
                        ],
                        "name": "M. Bastiaans",
                        "slug": "M.-Bastiaans",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Bastiaans",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Bastiaans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 74,
                                "start": 68
                            }
                        ],
                        "text": "Because 2D Gabor filters form a quasi-orthogonal complete basis set (3, 4), image information is preserved in a robust representation that makes explicit both spatial and spectral image attributes."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 46048775,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "a912d821750a5c5ca308a28faf8b234649b95cba",
            "isKey": false,
            "numCitedBy": 379,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "It is proved that Gabor's expansion of a signal into a discrete set of Gaussian elementary signals exists. An expansion into another discrete set of functions is defined, which functions are biorthonormal, to the Gaussian elementary signals. Hence, the expansion coefficients of the two expansions can be determined easily."
            },
            "slug": "Gabor's-expansion-of-a-signal-into-Gaussian-signals-Bastiaans",
            "title": {
                "fragments": [],
                "text": "Gabor's expansion of a signal into Gaussian elementary signals"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145323121"
                        ],
                        "name": "J. Nelder",
                        "slug": "J.-Nelder",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Nelder",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Nelder"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144189443"
                        ],
                        "name": "R. Mead",
                        "slug": "R.-Mead",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Mead",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Mead"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2208295,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "017ddb7e815236defd0566bc46f6ed8401cc6ba6",
            "isKey": false,
            "numCitedBy": 25601,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "A method is described for the minimization of a function of n variables, which depends on the comparison of function values at the (n 41) vertices of a general simplex, followed by the replacement of the vertex with the highest value by another point. The simplex adapts itself to the local landscape, and contracts on to the final minimum. The method is shown to be effective and computationally compact. A procedure is given for the estimation of the Hessian matrix in the neighbourhood of the minimum, needed in statistical estimation problems."
            },
            "slug": "A-Simplex-Method-for-Function-Minimization-Nelder-Mead",
            "title": {
                "fragments": [],
                "text": "A Simplex Method for Function Minimization"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A method is described for the minimization of a function of n variables, which depends on the comparison of function values at the (n 41) vertices of a general simplex, followed by the replacement of the vertex with the highest value by another point."
            },
            "venue": {
                "fragments": [],
                "text": "Comput. J."
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47091658"
                        ],
                        "name": "G. F. Cooper",
                        "slug": "G.-F.-Cooper",
                        "structuredName": {
                            "firstName": "G",
                            "lastName": "Cooper",
                            "middleNames": [
                                "F"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. F. Cooper"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1407756324"
                        ],
                        "name": "C. Enroth-Cugell",
                        "slug": "C.-Enroth-Cugell",
                        "structuredName": {
                            "firstName": "Christina",
                            "lastName": "Enroth-Cugell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Enroth-Cugell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 100
                            }
                        ],
                        "text": "Second, striate neurons respond to narrow ranges of stimulus orientation (17) and spatial frequency (6), the angular and radial polar coordinates of the two-dimensional (2D) spatial frequency domain."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 24250561,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "41e770fcf7d164c3f010f5caece7ce9240617d7c",
            "isKey": false,
            "numCitedBy": 413,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Micro‐electrode recordings have been made from single units in the visual cortex of the cat, during stimulation by moving grating patterns generated on a cathode ray tube."
            },
            "slug": "The-spatial-selectivity-of-the-visual-cells-of-the-Campbell-Cooper",
            "title": {
                "fragments": [],
                "text": "The spatial selectivity of the visual cells of the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "Micro‐electrode recordings have been made from single units in the visual cortex of the cat, during stimulation by moving grating patterns generated on a cathode ray tube."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40692782"
                        ],
                        "name": "M. Kendall",
                        "slug": "M.-Kendall",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Kendall",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Kendall"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4018463,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "28a215515d10b0ccadef846c61894e2e8a4ff65a",
            "isKey": false,
            "numCitedBy": 7265,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "THIS book has done more than any other to popularize the use of modern statistical methods. Thousands of workers have been taught to use statistical machinery without the burdensome necessity of knowing exactly how it works. Six editions have appeared in twelve years, and the number of pages has been steadily increasing. To facilitate reference the numbering of the sections has been kept constant. It would be convenient if the numbers of the sections could be printed at the top of each page. The book maintains its place as the standard work on its subject for the ordinary scientific worker.Statistical Methods for Research WorkersProf.R. A.FisherBy. (Biological Monographs and Manuals.) Sixth edition, revised and enlarged. Pp. xiv + 339. (Edinburgh and London: Oliver and Boyd, 1936.) 15s. net."
            },
            "slug": "Statistical-Methods-for-Research-Workers-Kendall",
            "title": {
                "fragments": [],
                "text": "Statistical Methods for Research Workers"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "This book has done more than any other to popularize the use of modern statistical methods and maintains its place as the standard work on its subject for the ordinary scientific worker."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1937
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70141842"
                        ],
                        "name": "G. V. Kass",
                        "slug": "G.-V.-Kass",
                        "structuredName": {
                            "firstName": "Gordon",
                            "lastName": "Kass",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. V. Kass"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69857560"
                        ],
                        "name": "A. Mood",
                        "slug": "A.-Mood",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Mood",
                            "middleNames": [
                                "McFarlane"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Mood"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6006539"
                        ],
                        "name": "F. Graybill",
                        "slug": "F.-Graybill",
                        "structuredName": {
                            "firstName": "Franklin",
                            "lastName": "Graybill",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Graybill"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8866464"
                        ],
                        "name": "D. Boes",
                        "slug": "D.-Boes",
                        "structuredName": {
                            "firstName": "Duane",
                            "lastName": "Boes",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Boes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124736887,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5993b227af4eed427bf3a2b0e587d49c7d33e737",
            "isKey": false,
            "numCitedBy": 1194,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Introduction-to-the-Theory-of-Statistics,-3rd-ed.-Kass-Mood",
            "title": {
                "fragments": [],
                "text": "Introduction to the Theory of Statistics, 3rd ed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16298171"
                        ],
                        "name": "D. Gabor",
                        "slug": "D.-Gabor",
                        "structuredName": {
                            "firstName": "Dennis",
                            "lastName": "Gabor",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gabor"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61327032,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a8ef7e8990527f01847845da9953896f35e489d5",
            "isKey": false,
            "numCitedBy": 4630,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Theory-of-communication-Gabor",
            "title": {
                "fragments": [],
                "text": "Theory of communication"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1946
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6389940"
                        ],
                        "name": "R. W. Rodieck",
                        "slug": "R.-W.-Rodieck",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Rodieck",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. W. Rodieck"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144469587"
                        ],
                        "name": "J. Stone",
                        "slug": "J.-Stone",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Stone",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Stone"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34598595,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "f0c540aa9eace5735d0e4fc7cf7332210c4f29ef",
            "isKey": false,
            "numCitedBy": 560,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Analysis-of-receptive-fields-of-cat-retinal-cells.-Rodieck-Stone",
            "title": {
                "fragments": [],
                "text": "Analysis of receptive fields of cat retinal ganglion cells."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39274396"
                        ],
                        "name": "D. Mackay",
                        "slug": "D.-Mackay",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Mackay",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mackay"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4367218,
            "fieldsOfStudy": [
                "Computer Science",
                "Medicine"
            ],
            "id": "13cdac78e65d83c1ac0ab63f182cdc4aa7f75a3c",
            "isKey": false,
            "numCitedBy": 62,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Strife-over-visual-cortical-function-Mackay",
            "title": {
                "fragments": [],
                "text": "Strife over visual cortical function"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 88,
                                "start": 85
                            }
                        ],
                        "text": "A more readable (but less complete) presentation can be found in Caceci and Cacheris (5)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "AND CACHERIS, W.P.Fittingcurves to data"
            },
            "venue": {
                "fragments": [],
                "text": "Byte 9:"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "J. Physiol. Land"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol. Land"
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Fittingcurves to data"
            },
            "venue": {
                "fragments": [],
                "text": "Byte"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "J. Physiol. Lond"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol. Lond"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Neuronal group selection in the cerebral cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Dynamic Aspects of Neocortical Function,"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Linearanalysis of the response of simple cells in the cat visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Exp. Brain Res"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proc. R. Sot. Land. B BioZ. Sci"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. R. Sot. Land. B BioZ. Sci"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Neuronal group selection in the cerebral cortex In: Dynamic Aspects of Neocortical Function"
            },
            "venue": {
                "fragments": [],
                "text": "Neuronal group selection in the cerebral cortex In: Dynamic Aspects of Neocortical Function"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Nature Lond"
            },
            "venue": {
                "fragments": [],
                "text": "Nature Lond"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proc. R. Sot. Land. B Biol. Sci"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. R. Sot. Land. B Biol. Sci"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Linearanaly - sis of the response of simple cells in the cat visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Exp . Brain Res ."
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Theory of spatial position and spatial frequency relations in the receptive fields of simple cells in the cat ’ s striate cortex"
            },
            "venue": {
                "fragments": [],
                "text": "BioZ . Cybern ."
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Statistical Methods for Research Workers (13th ed)"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1958
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Theory of spatial position and spatial fre- quency relations in the receptive fields of simple cells in the cat's striate cortex"
            },
            "venue": {
                "fragments": [],
                "text": "BioZ. Cybern"
            },
            "year": 1982
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "J. Physiol. Land"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol. Land"
            },
            "year": 1962
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Fittingcurves to data"
            },
            "venue": {
                "fragments": [],
                "text": "Byte"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "J. Neurophysiol"
            },
            "venue": {
                "fragments": [],
                "text": "J. Neurophysiol"
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 8,
            "methodology": 1,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 48,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/An-evaluation-of-the-two-dimensional-Gabor-filter-Jones-Palmer/0dbf797d5b34f40d16eeadfa7a5b4543c2af2c11?sort=total-citations"
}