{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809308"
                        ],
                        "name": "Isaac Martinat",
                        "slug": "Isaac-Martinat",
                        "structuredName": {
                            "firstName": "Isaac",
                            "lastName": "Martinat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Isaac Martinat"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1789181"
                        ],
                        "name": "Bertrand Coüasnon",
                        "slug": "Bertrand-Coüasnon",
                        "structuredName": {
                            "firstName": "Bertrand",
                            "lastName": "Coüasnon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bertrand Coüasnon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 3
                            }
                        ],
                        "text": "In [5] we presented a table recognition system using a short user description but this system was limited, the row and column numbers were fixed and the row and column hierarchies could not be describe d."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 29600390,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9954d0721f5befe464082ed560a3c75bdd5f1505",
            "isKey": false,
            "numCitedBy": 3,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a system that recognizes tables in archival documents. Many works were carried out on table recognition but very few on tables of historical documents. These are difficult to analyze because they are often damaged due to their age and conservation. Therefore we have to introduce knowledge to compensate for missing information and noise in these documents. As there is a very important number of documents of a same type, the cost is not significant to introduce this explicit knowledge. We also want to minimalize the cost to adapt the system for a given document type. The precision of the knowledge given by the user is dependent on the quality of the document. The more the document is damaged, the more the specification has to be precise. We will show in this article how an external minimal knowledge can be sufficient for an efficient recognition system for tables in archival documents."
            },
            "slug": "A-Minimal-and-Sufficient-Way-of-Introducing-for-in-Martinat-Coüasnon",
            "title": {
                "fragments": [],
                "text": "A Minimal and Sufficient Way of Introducing External Knowledge for Table Recognition in Archival Documents"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "It is shown in this article how an external minimal knowledge can be sufficient for an efficient recognition system for tables in archival documents."
            },
            "venue": {
                "fragments": [],
                "text": "GREC"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1789181"
                        ],
                        "name": "Bertrand Coüasnon",
                        "slug": "Bertrand-Coüasnon",
                        "structuredName": {
                            "firstName": "Bertrand",
                            "lastName": "Coüasnon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bertrand Coüasnon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 24346804,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "72b708230bb11b28682ad55587f960f3a892cfc6",
            "isKey": false,
            "numCitedBy": 84,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "AbstractWe will show in this paper one of the numerous interests of designing a generic recognition system, i.e. the possibility of producing either general or specific systems. We propose the Description and Modification of Segmentation (DMOS) method, which is made of a new grammatical language (Enhanced Position Formalism—EPF) and an associated parser able to deal with noise. From an EPF description of a kind of document structure, a new recognition system is produced by compilation. This method has been successfully used to produce recognition systems on musical scores, mathematical formulae and even tennis courts in videos. This DMOS generic method separates knowledge from program. Therefore, for a same kind of document like table structures, it is possible to define with EPF, more or less specific descriptions to produce more or less specific recognition systems. For example, we have been able to produce a general recognition system of table structures. It can recognize the hierarchical organization \nof a table made with rulings, whatever the number/size of column/rows and the deep of the hierarchy contents in it, as soon as the document has a not too bad quality (no missing rulings for example). We will present the way the description is done using EPF to be general enough to recognize very different table organizations. With the same DMOS generic method, we have also been able to easily define a specific recognition system of the table structure of quite damaged military forms of the 19th century. This specific description was necessary to compensate some missing informations concerning the table structure of those military forms, due to a very bad quality or hidden part of the table. This system has been successfully validated on 88,745 images, showing that this DMOS generic method can be used at an industrial level."
            },
            "slug": "DMOS,-a-generic-document-recognition-method:-to-in-Coüasnon",
            "title": {
                "fragments": [],
                "text": "DMOS, a generic document recognition method: application to table structure analysis in a general and in a specific way"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The Description and Modification of Segmentation (DMOS) method is proposed, which is made of a new grammatical language (Enhanced Position Formalism—EPF) and an associated parser able to deal with noise, which has been successfully used to produce recognition systems on musical scores, mathematical formulae and even tennis courts in videos."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Document Analysis and Recognition (IJDAR)"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1793699"
                        ],
                        "name": "R. Zanibbi",
                        "slug": "R.-Zanibbi",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Zanibbi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Zanibbi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1703931"
                        ],
                        "name": "D. Blostein",
                        "slug": "D.-Blostein",
                        "structuredName": {
                            "firstName": "Dorothea",
                            "lastName": "Blostein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Blostein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1683822"
                        ],
                        "name": "J. Cordy",
                        "slug": "J.-Cordy",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Cordy",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Cordy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 49
                            }
                        ],
                        "text": "Many works were carried out on table recognition [9] but very f w on damaged tables in archival documents."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 49
                            }
                        ],
                        "text": "Many works were carried out on table recognition [9] but very few were carried out on tables of archival documents."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 42236309,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4c92be1e0a4ecb0c0ee28aa7da9ec0a39611e5bc",
            "isKey": false,
            "numCitedBy": 151,
            "numCiting": 117,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract.Table characteristics vary widely. Consequently, a great variety of computational approaches have been applied to table recognition. In this survey, the table recognition literature is presented as an interaction of table models, observations, transformations, and inferences. A table model defines the physical and logical structure of tables; the model is used to detect tables and to analyze and decompose the detected tables. Observations perform feature measurements and data lookup, transformations alter or restructure data, and inferences generate and test hypotheses. This presentation clarifies both the decisions made by a table recognizer and the assumptions and inferencing techniques that underlie these decisions."
            },
            "slug": "A-survey-of-table-recognition-Zanibbi-Blostein",
            "title": {
                "fragments": [],
                "text": "A survey of table recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This presentation clarifies both the decisions made by a table recognizer and the assumptions and inferencing techniques that underlie these decisions."
            },
            "venue": {
                "fragments": [],
                "text": "Document Analysis and Recognition"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1813168"
                        ],
                        "name": "Heath E. Nielson",
                        "slug": "Heath-E.-Nielson",
                        "structuredName": {
                            "firstName": "Heath",
                            "lastName": "Nielson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Heath E. Nielson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144055367"
                        ],
                        "name": "W. Barrett",
                        "slug": "W.-Barrett",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Barrett",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Barrett"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[6] recognized tables whose rows and columns a re eparated by rulings."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 166,
                                "start": 163
                            }
                        ],
                        "text": "To help the archival document recognition, sy stems use an user description [7, 2], a graphical interface [4, 1], information of oth er documents of the same type [6] or user corrections [3]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 16384589,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8098fd7ed3ba9374986339b8da837bababb6e4e1",
            "isKey": false,
            "numCitedBy": 22,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Zoning documents increases the resolution of indexingfrom the image level to the field level. A line-delimited tabulardocument forms a well defined series of regions. However,as image quality decreases, accurate zoning becomesincreasingly difficult. Given a sequence of documents withthe same layout, we present a robust zoning method whichexploits both intra- and inter-document consensus to forma more accurate combined result (template) that can be appliedto any other document with the same layout."
            },
            "slug": "Consensus-based-table-form-recognition-Nielson-Barrett",
            "title": {
                "fragments": [],
                "text": "Consensus-based table form recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A robust zoning method is presented that combines both intra- and inter-document consensus to form a more accurate combined result (template) that can be applied to any other document with the same layout."
            },
            "venue": {
                "fragments": [],
                "text": "Seventh International Conference on Document Analysis and Recognition, 2003. Proceedings."
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2060211572"
                        ],
                        "name": "Kenneth M. Tubbs",
                        "slug": "Kenneth-M.-Tubbs",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Tubbs",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kenneth M. Tubbs"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1694279"
                        ],
                        "name": "D. Embley",
                        "slug": "D.-Embley",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Embley",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Embley"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 76
                            }
                        ],
                        "text": "To help the archival document recognition, sy stems use an user description [7, 2], a graphical interface [4, 1], information of oth er documents of the same type [6] or user corrections [3]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 14
                            }
                        ],
                        "text": "census tables [7] but coordinates for each cell of the tables ar given at hand in an input of 1,451 file lines."
                    },
                    "intents": []
                }
            ],
            "corpusId": 13970646,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d75e6434f66062982e2eab16e00b1957d7a1d894",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "Microfilm documents contain a wealth of information, but extracting and organizing this information by hand is slow, error-prone, and tedious. As an initial step toward automating access to this information, we describe in this paper an algorithmic process to automatically identify record patterns found in microfilm tables for pre-specified application domains. Our table-processing algorithm accepts an XML input file describing the individual cells of a table taken from a microfilm document, and finds for each record in the document the cells that together comprise the record. Two key features drive the algorithm: (1) geometric layout and (2) label matching with respect to a given domain-specific application ontology. The algorithm achieved an accuracy of 92% on our test corpus of genealogical microfilm tables."
            },
            "slug": "Recognizing-records-from-the-extracted-cells-of-Tubbs-Embley",
            "title": {
                "fragments": [],
                "text": "Recognizing records from the extracted cells of microfilm tables"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper describes an algorithmic process to automatically identify record patterns found in microfilm tables for pre-specified application domains, using an XML input file describing the individual cells of a table taken from a microfilm document."
            },
            "venue": {
                "fragments": [],
                "text": "DocEng '02"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1803149"
                        ],
                        "name": "A. Antonacopoulos",
                        "slug": "A.-Antonacopoulos",
                        "structuredName": {
                            "firstName": "Apostolos",
                            "lastName": "Antonacopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Antonacopoulos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1694974"
                        ],
                        "name": "Dimosthenis Karatzas",
                        "slug": "Dimosthenis-Karatzas",
                        "structuredName": {
                            "firstName": "Dimosthenis",
                            "lastName": "Karatzas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dimosthenis Karatzas"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15793605,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "04e94b67d3f89a557027b62c02cda0170dfa8272",
            "isKey": false,
            "numCitedBy": 64,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "Complete collections of invaluable documents of unique historical and political significance are decaying and at the same time they are virtually inaccessible, necessitating the invention of robust and efficient methods for their conversion into a searchable electronic form. We present the issues encountered and problems addressed in the MEMORIAL project, whose goal is the establishment of a digital document workbench enabling the creation of distributed virtual archives based on documents existing in libraries, archives, museums, memorials, and public record offices. Successful approaches are described in the context of the chosen data class: a variety of typewritten documents containing personal information relating to the presence of individuals in World War II Nazi concentration camps."
            },
            "slug": "Document-image-analysis-for-World-War-II-personal-Antonacopoulos-Karatzas",
            "title": {
                "fragments": [],
                "text": "Document image analysis for World War II personal records"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The issues encountered and problems addressed in the MEMORIAL project are presented, whose goal is the establishment of a digital document workbench enabling the creation of distributed virtual archives based on documents existing in libraries, archives, museums, memorials, and public record offices."
            },
            "venue": {
                "fragments": [],
                "text": "First International Workshop on Document Image Analysis for Libraries, 2004. Proceedings."
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1700821"
                        ],
                        "name": "F. Esposito",
                        "slug": "F.-Esposito",
                        "structuredName": {
                            "firstName": "Floriana",
                            "lastName": "Esposito",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Esposito"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738657"
                        ],
                        "name": "D. Malerba",
                        "slug": "D.-Malerba",
                        "structuredName": {
                            "firstName": "Donato",
                            "lastName": "Malerba",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Malerba"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145467353"
                        ],
                        "name": "G. Semeraro",
                        "slug": "G.-Semeraro",
                        "structuredName": {
                            "firstName": "Giovanni",
                            "lastName": "Semeraro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Semeraro"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1725650"
                        ],
                        "name": "S. Ferilli",
                        "slug": "S.-Ferilli",
                        "structuredName": {
                            "firstName": "Stefano",
                            "lastName": "Ferilli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ferilli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3220211"
                        ],
                        "name": "O. Altamura",
                        "slug": "O.-Altamura",
                        "structuredName": {
                            "firstName": "Oronzo",
                            "lastName": "Altamura",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Altamura"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745663"
                        ],
                        "name": "T. Basile",
                        "slug": "T.-Basile",
                        "structuredName": {
                            "firstName": "Teresa",
                            "lastName": "Basile",
                            "middleNames": [
                                "Maria",
                                "Altomare"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Basile"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1692413"
                        ],
                        "name": "Margherita Berardi",
                        "slug": "Margherita-Berardi",
                        "structuredName": {
                            "firstName": "Margherita",
                            "lastName": "Berardi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Margherita Berardi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144841444"
                        ],
                        "name": "Michelangelo Ceci",
                        "slug": "Michelangelo-Ceci",
                        "structuredName": {
                            "firstName": "Michelangelo",
                            "lastName": "Ceci",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michelangelo Ceci"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1718594"
                        ],
                        "name": "Nicola Di Mauro",
                        "slug": "Nicola-Di-Mauro",
                        "structuredName": {
                            "firstName": "Nicola",
                            "lastName": "Di Mauro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nicola Di Mauro"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7058345,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "62ecaa8f2baa9a54458cab5dedc9e9e93121aaee",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "One of the aims of the EU project COLLATE is to design and implement a Web-based collaboratory for archives, scientists and end-users working with digitized cultural material. Since the originals of such a material are often unique and scattered in various archives, severe problems arise for their wide fruition. A solution would be to develop intelligent document processing tools that automatically transform printed documents into a Web-accessible form such as XML. Here, we propose the use of a document processing system, WISDOM++, which uses heavily machine learning techniques in order to perform such a task, and report promising results obtained in preliminary experiments."
            },
            "slug": "Machine-learning-methods-for-automatically-from-to-Esposito-Malerba",
            "title": {
                "fragments": [],
                "text": "Machine learning methods for automatically processing historical documents: from paper acquisition to XML transformation"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This work proposes the use of a document processing system, WISDOM++, which uses heavily machine learning techniques in order to perform such a task, and reports promising results obtained in preliminary experiments."
            },
            "venue": {
                "fragments": [],
                "text": "First International Workshop on Document Image Analysis for Libraries, 2004. Proceedings."
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2168619284"
                        ],
                        "name": "Jingyu He",
                        "slug": "Jingyu-He",
                        "structuredName": {
                            "firstName": "Jingyu",
                            "lastName": "He",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jingyu He"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1798094"
                        ],
                        "name": "A. Downton",
                        "slug": "A.-Downton",
                        "structuredName": {
                            "firstName": "Andy",
                            "lastName": "Downton",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Downton"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 106
                            }
                        ],
                        "text": "To help the archival document recognition, sy stems use an user description [7, 2], a graphical interface [4, 1], information of oth er documents of the same type [6] or user corrections [3]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 120,
                                "start": 117
                            }
                        ],
                        "text": "For other archival document recognition methods, a graphic l interface is used to recognize archive biological cards [4], lists of Word War II [1]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2070419,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2131c5dc71a849b30ca9c7bf23acc8b7ebe10167",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "A configurable archive document image analysis system for digital library construction has been designed using rapid prototyping and top-down iterative development methods. This approach has been found to be essential in order to capture the curators' expertise about existing card archive structures, content and databases. The design currently achieves about 93% correct segmentation of the required archive card fields overall, with 81.3% of all archive cards in a testset of 2000 images having all fields correctly segmented and labeled. Analysis of errors in the testset indicates that heavily-annotated cards and non-standard card formats comprise 5-10% of the overall archive, and a significant proportion of these are unlikely to be resolvable without curatorial intervention."
            },
            "slug": "User-assisted-archive-document-image-analysis-for-He-Downton",
            "title": {
                "fragments": [],
                "text": "User-assisted archive document image analysis for digital library construction"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Analysis of errors in the testset indicates that heavily-annotated cards and non-standard card formats comprise 5-10% of the overall archive, and a significant proportion of these are unlikely to be resolvable without curatorial intervention."
            },
            "venue": {
                "fragments": [],
                "text": "Seventh International Conference on Document Analysis and Recognition, 2003. Proceedings."
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2108023096"
                        ],
                        "name": "Xinxin Wang",
                        "slug": "Xinxin-Wang",
                        "structuredName": {
                            "firstName": "Xinxin",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Xinxin Wang"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 8,
                                "start": 5
                            }
                        ],
                        "text": "Wang [8] proposed a model to edit tables, which is composed of a l gical part and a physical part."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16895319,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bb8327c5b091ea26e42ed924e25a02c564998f19",
            "isKey": false,
            "numCitedBy": 151,
            "numCiting": 88,
            "paperAbstract": {
                "fragments": [],
                "text": "This dissertation investigates the composition of high-quality tables with the use of electronic tools. A generic model is designed to support the different stages of tabular composition, including the editing of logical structure, the specification of layout structure, and the formatting of concrete tables. The model separates table's logical structure from its layout structure, which consists of tabular topology and typographic style. The notion of an abstract table, which describes the logical relationships among tabular items, is formally defined and a set of logical operations is proposed to manipulate tables based on these logical relationships. An abstract table can be visualized through a layout structure specified by a set of topological rules, which determine the relative placement of tabular items in two dimensions, and a set of style rules, which determine the final appearance of different items. The absolute placement of a concrete table can be automatically generated by applying a layout specification to an abstract line. An NP-complete problem arises in the formatting process that uses automatic line breaking and determines the physical dimension of a table to satisfy user-specified size constraints. An algorithm has been designed to solve the formatting problem in polynomial time for typical tables. Based on the tabular model, a prototype tabular composition system has been implemented in a UNIX, X Windows environment. This prototype provides an interactive interface to edit the logical structure, the topology and the styles of tables. It allows us to manipulate tables based on the logical relationships tabular items, regardless of where the items are placed in the layout structure, and capable of presenting a table in different topologies and styles so that we can select a high-quality layout structure."
            },
            "slug": "Tabular-Abstraction,-Editing,-and-Formatting-Wang",
            "title": {
                "fragments": [],
                "text": "Tabular Abstraction, Editing, and Formatting"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "This dissertation investigates the composition of high-quality tables with the use of electronic tools using a generic model designed to support the different stages of tabular composition, including the editing of logical structure, the specification of layout structure, and the formatting of concrete tables."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Karatzas . Document image analysis for world war 2 personal records"
            },
            "venue": {
                "fragments": [],
                "text": "1 st International Workshop on Document Image Analysis for Libraries ( DIAL"
            },
            "year": 2004
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 106
                            }
                        ],
                        "text": "To help the archival document recognition, sy stems use an user description [7, 2], a graphical interface [4, 1], information of oth er documents of the same type [6] or user corrections [3]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 146,
                                "start": 143
                            }
                        ],
                        "text": "For other archival document recognition methods, a graphic l interface is used to recognize archive biological cards [4], lists of Word War II [1]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Document image analysis for w  orld war 2 personal records. In1st International Workshop on Document Image Analysis for Libraries (DIAL"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2004
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 76
                            }
                        ],
                        "text": "To help the archival document recognition, sy stems use an user description [7, 2], a graphical interface [4, 1], information of oth er documents of the same type [6] or user corrections [3]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 19,
                                "start": 16
                            }
                        ],
                        "text": "We presented in [2] a specific description system for militar y forms of the 19th Century."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Dmos, a generic document recognition method: Application to tab le structure analysis in a general and in a specific way.  International Journal of Document Analysis and Recognition (IJDAR"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2006
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 4,
            "methodology": 6
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 12,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/An-Adaptative-Recognition-System-Using-a-Table-for-Martinat-Coüasnon/7ad0202c9e96c5c34b1eed1463b4e5c1d0fc23d1?sort=total-citations"
}