{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32052472"
                        ],
                        "name": "R. Buccigrossi",
                        "slug": "R.-Buccigrossi",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Buccigrossi",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Buccigrossi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11552869,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c854beaaad5a2df840e2061aea474386c7f99e82",
            "isKey": false,
            "numCitedBy": 39,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "We present an embedded image coder based on a statistical characterization of natural images in the wavelet transform domain. We describe the joint distribution between pairs of coefficients at adjacent spatial locations, orientations, and scales. Although the raw coefficients are nearly, uncorrelated, their magnitudes are highly correlated. A linear magnitude predictor coupled with both multiplicative and additive uncertainties, provides a reasonable description of the conditional probability densities. We use this model to construct an image coder called EPWIC (embedded predictive wavelet image coder), in which subband coefficients are encoded one bit-plane at a time using a non-adaptive arithmetic encoder. Bit-planes are ordered using a greedy algorithm that considers the MSE reduction per encoded bit. We demonstrate the quality of the statistical characterization by comparing rate-distortion curves of the coder to several standard coders."
            },
            "slug": "Embedded-wavelet-image-compression-based-on-a-joint-Simoncelli-Buccigrossi",
            "title": {
                "fragments": [],
                "text": "Embedded wavelet image compression based on a joint probability model"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "An embedded image coder based on a statistical characterization of natural images in the wavelet transform domain, in which subband coefficients are encoded one bit-plane at a time using a non-adaptive arithmetic encoder."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of International Conference on Image Processing"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33523605"
                        ],
                        "name": "J. Portilla",
                        "slug": "J.-Portilla",
                        "structuredName": {
                            "firstName": "Javier",
                            "lastName": "Portilla",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Portilla"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 101,
                                "start": 85
                            }
                        ],
                        "text": "We have begun to explore some of these applic tions, and the results are encouraging [28, 26, 29, 19]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17687594,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e07d605178325c2ec2be838703b17c584f482725",
            "isKey": false,
            "numCitedBy": 70,
            "numCiting": 65,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a statistical characterization of texture images in the context of an overcomplete complex wavelet transform. The characterization is based on empirical observations of statistical regularities in such images, and parameterized by (1) the local autocorrelation of the coeÆcients in each subband; (2) both the local auto-correlation and cross-correlation of coeÆcient magnitudes at other orientations and spatial scales; and (3) the rst few moments of the image pixel histogram. We develop an eÆcient algorithm for synthesizing random images subject to these constraints using alternated projections, and demonstrate its e ectiveness on a wide range of synthetic and natural textures. In particular, we show that many important structural elements in textures (e.g., edges, repeated patterns or alternated patches of simpler texture), can be captured through joint second order statistics of the coeÆcient magnitudes. We also show the exibility of the representation, by applying to a variety of tasks which can be viewed as constrained image synthesis problems, such as spatial and spectral extrapolation. 1Instituto de Optica, CSIC, Serrano 121, 28006 Madrid, SPAIN. iodpm79@pinar2.csic.es 2Center for Neural Science, and Courant Inst. of Mathematical Sciences, New York University, New York, NY 10003. eero.simoncelli@nyu.edu JP is supported by a fellowship from the Consejo Superior de Investigaciones Cienti cas (CSIC), and the Comision Interministerial de Ciencia y Tecnologia (CICYT, Spain), under grant TIC97-325. EPS is supported by an Alfred P. Sloan Research Fellowship, NSF CAREER grant MIP-9796040, and the Sloan Center for Theoretical Neurobiology at NYU. Vision is arguably our most important sensory system, judging from both the ubiquity of visual forms of communication, and the large proportion of the human brain devoted to visual processing. Nevertheless, it has proven diÆcult to establish a good mathematical de nition (in the form of a statistical model) for visual images. The set of visual images is enormous, and yet only a small fraction of these are likely to be encountered in a natural setting [43, 25, 19, 54]. Thus, a statistical prior model, even one that partially captures these variations in likelihood, can substantially bene t image processing and arti cial vision systems. In addition, many authors have proposed that biological visual systems have evolved to take advantage of the statistical properties of the signals to which they are exposed [e.g., 3, 4, 2], thus suggesting a direct link between image statistics and visual processing. In order to characterize visual images statistically, one must make some sort of restriction on the probability model. The most common assumptions are locality (the characterization is speci ed on local spatial neighborhoods), stationarity (the statistics depend only on relative spatial position within the image), and a parametric form for the density (e.g., Gaussian). The subclass of images that we commonly call \\visual texture\" seems most consistent with local stationary density models. Traditional de nitions of texture can be classi ed into \\structural\" and \\statistical\" [34], the rst consisting of a set of repeated deterministic features, and the second corresponding to a sample drawn from a probability density. Such a distinction has turned out to be somewhat arti cial: For example, Zhu et al. [69] have demonstrated that is possible to capture and reproduce structural elements in texture using purely statistical models. Furthermore, many real-world textures seem to incorporate both aspects, in that they can be described as a set of repeating structural elements subject to some randomness in their location, size, color, orientation, etc. This observation leads us to seek a single method of representing textures. In this paper, we develop a fully statistical description, and demonstrate that it is also able to capture and reproduce a wide variety of structural elements. Julesz pioneered the statistical characterization of textures by hypothesizing that the Nth-order joint empirical densities (for some unspeci ed N) of neighborhoods of image pixels, could be used to partition textures into classes that are indistinguishable to a human observer [40]. This work thus established the use of both the locality and stationarity assumptions, the goal of determining a minimal set of statistical constraints, and the validation of texture models using human observers. Since then, researchers have explored a wide variety of approaches for texture characterization and synthesis. One of the most basic distinctions between the various approaches is the choice of representation. Starting with Julesz, many authors have worked directly on the statistical attributes of local spatial neighborhoods of pixels, typically in the form of a Markov random eld [e.g., 35, 42, 17]. But most others attempt to simplify the description of the density by rst processing with a set of linear lters, such as Gabor lters or a multiscale basis. The use of localized multi-scale multi-orientation sets of bandpass lters is inspired by what is known of biological visual processing, and justi ed by recent studies of the higher-order statistical properties of such representations (we discuss this further in section 1). These lters may be held xed, or chosen adaptively depending on the image statistics [e.g., 10, 26, 22, 59, 51]. Assuming a preconditioning subband decomposition, most texture characterizations"
            },
            "slug": "Texture-modeling-and-synthesis-using-joint-of-Portilla-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Texture modeling and synthesis using joint statistics of complex wavelet coefficients"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "A statistical characterization of texture images in the context of an overcomplete complex wavelet transform is presented, and it is shown that many important structural elements in textures can be captured through joint second order statistics of the coeÆcient magnitudes."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398268742"
                        ],
                        "name": "Scott M. LePresto",
                        "slug": "Scott-M.-LePresto",
                        "structuredName": {
                            "firstName": "Scott",
                            "lastName": "LePresto",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Scott M. LePresto"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144161012"
                        ],
                        "name": "K. Ramchandran",
                        "slug": "K.-Ramchandran",
                        "structuredName": {
                            "firstName": "Kannan",
                            "lastName": "Ramchandran",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Ramchandran"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9164341"
                        ],
                        "name": "M. Orchard",
                        "slug": "M.-Orchard",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Orchard",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Orchard"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 59
                            }
                        ],
                        "text": "Wavelet coefficient marginals have been previously modeled [15, 10, 30, 13, 11] using a two-parameter “generalized Laplacian” (or “stretched exponential”) den sity function of the form: 2 fs;r(c) = e jc=sjr N(s; r) ; (1) whereN(s; r) = 2s (1=r)=r, and (x) = R1 0 tx 1e t dt, the Gamma function."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[13] model the coefficients as being chosen from a generalized Laplacian density and est imate the model parameters from local neighborhoods."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 10447081,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "34bc9fc70997d9a12232f14a3d61f24717908103",
            "isKey": false,
            "numCitedBy": 310,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "We introduce a new image compression paradigm that combines compression efficiency with speed, and is based on an independent \"infinite\" mixture model which accurately captures the space-frequency characterization of the wavelet image representation. Specifically, we model image wavelet coefficients as being drawn from an independent generalized Gaussian distribution field, of fixed unknown shape for each subband, having zero mean and unknown slowly spatially-varying variances. Based on this model, we develop a powerful \"on the fly\" estimation-quantization (EQ) framework that consists of: (i) first finding the maximum-likelihood estimate of the individual spatially-varying coefficient field variances based on causal and quantized spatial neighborhood contexts; and (ii) then applying an off-line rate-distortion (R-D) optimized quantization/entropy coding strategy, implemented as a fast lookup table, that is optimally matched to the derived variance estimates. A distinctive feature of our paradigm is the dynamic switching between forward and backward adaptation modes based on the reliability of causal prediction contexts. The performance of our coder is extremely competitive with the best published results in the literature across diverse classes of images and target bitrates of interest, in both compression efficiency and processing speed. For example, our coder exceeds the objective performance of the best zerotree-based wavelet coder based on space-frequency-quantization at all bit rates for all tested images at a fraction of its complexity."
            },
            "slug": "Image-coding-based-on-mixture-modeling-of-wavelet-a-LePresto-Ramchandran",
            "title": {
                "fragments": [],
                "text": "Image coding based on mixture modeling of wavelet coefficients and a fast estimation-quantization framework"
            },
            "tldr": {
                "abstractSimilarityScore": 95,
                "text": "A new image compression paradigm that combines compression efficiency with speed, and is based on an independent \"infinite\" mixture model which accurately captures the space-frequency characterization of the wavelet image representation, is introduced."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings DCC '97. Data Compression Conference"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32052472"
                        ],
                        "name": "R. Buccigrossi",
                        "slug": "R.-Buccigrossi",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Buccigrossi",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Buccigrossi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 176,
                                "start": 173
                            }
                        ],
                        "text": "Largemagnitude coefficients tend to occur at neighboring spatial locations, and also at the same relative spatial locations of subbands at adjacent scales and orient ations [3]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 57
                            }
                        ],
                        "text": "Preliminary versions of this work have been published in [3] and [29]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14970,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "74782ee2014b4d815f8276e75253f886695c9b8c",
            "isKey": false,
            "numCitedBy": 55,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a wavelet image coder based on an explicit model of the conditional statistical relationships between coefficients in different subbands. In particular, we construct a parameterized model for the conditional probability of a coefficient given coefficients at a coarser scale. Subband coefficients are encoded one bitplane at a time using a non-adaptive arithmetic encoder. The overall ordering of bitplanes is determined by the ratio of their encoded variance to compressed size. We show rate-distortion comparisons of the coder to first and second-order theoretical entropy bounds and the EZW coder. The coder is inherently embedded, and should prove useful in applications requiring progressive transmission."
            },
            "slug": "Progressive-wavelet-image-coding-based-on-a-model-Buccigrossi-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Progressive wavelet image coding based on a conditional probability model"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "A parameterized model for the conditional probability of a coefficient given coefficients at a coarser scale is constructed in a wavelet image coder based on an explicit model of the conditional statistical relationships between coefficients in different subbands."
            },
            "venue": {
                "fragments": [],
                "text": "1997 IEEE International Conference on Acoustics, Speech, and Signal Processing"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 107,
                                "start": 103
                            }
                        ],
                        "text": "We have begun to explore some of these applications, and the results are encouraging [19], [26], [28], [29]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 1170289,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "11896cb0f8c452e132172617b851ce4b96ac2029",
            "isKey": false,
            "numCitedBy": 201,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "The use of multi-scale decompositions has led to significant advances in representation, compression, restoration, analysis, and synthesis of signals. The fundamental reason for these advances is that the statistics of many natural signals, when decomposed in such bases, are substantially simplified. Choosing a basis that is adapted to statistical properties of the input signal is a classical problem. The traditional solution is principal components analysis (PCA), in which a linear decomposition is chosen to diagonalize the covariance structure of the input. The most well-known description of image statistics is that their Fourier spectra take the form of a power law [e.g., 1, 2, 3]. Coupled with a constraint of translation-invariance, this suggests that the Fourier transform is an appropriate PCA representation. Fourier and related representations are widely used in image processing applications. For example, the classical solution to the noise removal problem is the Wiener filter, which can be derived by assuming a signal model of decorrelated Gaussian-distributed coefficients in the Fourier domain."
            },
            "slug": "Bayesian-Denoising-of-Visual-Images-in-the-Wavelet-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Bayesian Denoising of Visual Images in the Wavelet Domain"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The most well-known description of image statistics is that their Fourier spectra take the form of a power law, which suggests that the Fourier transform is an appropriate PCA representation of Fourier and related representations, widely used in image processing applications."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1681411"
                        ],
                        "name": "M. Antonini",
                        "slug": "M.-Antonini",
                        "structuredName": {
                            "firstName": "Marc",
                            "lastName": "Antonini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Antonini"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144459223"
                        ],
                        "name": "M. Barlaud",
                        "slug": "M.-Barlaud",
                        "structuredName": {
                            "firstName": "Michel",
                            "lastName": "Barlaud",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Barlaud"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30568243"
                        ],
                        "name": "P. Mathieu",
                        "slug": "P.-Mathieu",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Mathieu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Mathieu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737063"
                        ],
                        "name": "I. Daubechies",
                        "slug": "I.-Daubechies",
                        "structuredName": {
                            "firstName": "Ingrid",
                            "lastName": "Daubechies",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Daubechies"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "We utilize a recursive pyramid decomposition based on separable 9/7 tap biorthogonal filter set of [2] which satisfies the one-dimensional system diagram shown in figure 9."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2233231,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "027205a9e2b6e0e1b7f46a028b9be8a0de5fdafe",
            "isKey": false,
            "numCitedBy": 4039,
            "numCiting": 59,
            "paperAbstract": {
                "fragments": [],
                "text": "A scheme for image compression that takes into account psychovisual features both in the space and frequency domains is proposed. This method involves two steps. First, a wavelet transform used in order to obtain a set of biorthogonal subclasses of images: the original image is decomposed at different scales using a pyramidal algorithm architecture. The decomposition is along the vertical and horizontal directions and maintains constant the number of pixels required to describe the image. Second, according to Shannon's rate distortion theory, the wavelet coefficients are vector quantized using a multiresolution codebook. To encode the wavelet coefficients, a noise shaping bit allocation procedure which assumes that details at high resolution are less visible to the human eye is proposed. In order to allow the receiver to recognize a picture as quickly as possible at minimum cost, a progressive transmission scheme is presented. It is shown that the wavelet transform is particularly well adapted to progressive transmission."
            },
            "slug": "Image-coding-using-wavelet-transform-Antonini-Barlaud",
            "title": {
                "fragments": [],
                "text": "Image coding using wavelet transform"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "A scheme for image compression that takes into account psychovisual features both in the space and frequency domains is proposed and it is shown that the wavelet transform is particularly well adapted to progressive transmission."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2167607"
                        ],
                        "name": "C. Chrysafis",
                        "slug": "C.-Chrysafis",
                        "structuredName": {
                            "firstName": "Christos",
                            "lastName": "Chrysafis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Chrysafis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145029825"
                        ],
                        "name": "Antonio Ortega",
                        "slug": "Antonio-Ortega",
                        "structuredName": {
                            "firstName": "Antonio",
                            "lastName": "Ortega",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Antonio Ortega"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 845706,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6aa184373e483e8b9d96f296f2e3b4d9f33d982b",
            "isKey": false,
            "numCitedBy": 136,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "We present an adaptive image coding algorithm based on novel backward-adaptive quantization/classification techniques. We use a simple uniform scalar quantizer to quantize the image subbands. Our algorithm puts the coefficient into one of several classes depending on the values of neighboring previously quantized coefficients. These previously quantized coefficients form contexts which are used to characterize the subband data. To each context type corresponds a different probability model and thus each subband coefficient is compressed with an arithmetic coder having the appropriate model depending on that coefficient's neighborhood. We show how the context selection can be driven by rate-distortion criteria, by choosing the contexts in a way that the total distortion for a given bit rate is minimized. Moreover the probability models for each context are initialized/updated in a very efficient way so that practically no overhead information has to be sent to the decoder. Our results are comparable or in some cases better than the recent state of the art, with our algorithm being simpler than most of the published algorithms of comparable performance."
            },
            "slug": "Efficient-context-based-entropy-coding-for-lossy-Chrysafis-Ortega",
            "title": {
                "fragments": [],
                "text": "Efficient context-based entropy coding for lossy wavelet image compression"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "An adaptive image coding algorithm based on novel backward-adaptive quantization/classification techniques is presented, showing how the context selection can be driven by rate-distortion criteria, by choosing the contexts in a way that the total distortion for a given bit rate is minimized."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings DCC '97. Data Compression Conference"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2302358"
                        ],
                        "name": "P. Burt",
                        "slug": "P.-Burt",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Burt",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Burt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8018433,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "83074157d165b6245915508d891b2d0cd066f3ad",
            "isKey": false,
            "numCitedBy": 6693,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a technique for image encoding in which local operators of many scales but identical shape serve as the basis functions. The representation differs from established techniques in that the code elements are localized in spatial frequency as well as in space. Pixel-to-pixel correlations are first removed by subtracting a lowpass filtered copy of the image from the image itself. The result is a net data compression since the difference, or error, image has low variance and entropy, and the low-pass filtered image may represented at reduced sample density. Further data compression is achieved by quantizing the difference image. These steps are then repeated to compress the low-pass image. Iteration of the process at appropriately expanded scales generates a pyramid data structure. The encoding process is equivalent to sampling the image with Laplacian operators of many scales. Thus, the code tends to enhance salient image features. A further advantage of the present code is that it is well suited for many image analysis tasks as well as for image compression. Fast algorithms are described for coding and decoding."
            },
            "slug": "The-Laplacian-Pyramid-as-a-Compact-Image-Code-Burt-Adelson",
            "title": {
                "fragments": [],
                "text": "The Laplacian Pyramid as a Compact Image Code"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A technique for image encoding in which local operators of many scales but identical shape serve as the basis functions, which tends to enhance salient image features and is well suited for many image analysis tasks as well as for image compression."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Commun."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2344693"
                        ],
                        "name": "J. M. Shapiro",
                        "slug": "J.-M.-Shapiro",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Shapiro",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. M. Shapiro"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 12,
                                "start": 8
                            }
                        ],
                        "text": "Shapiro [24] constructed the Embedded Zerotr e Wavelet (EZW) coder to exploit the fact that a coefficient is likely to have small magnitude if th e coefficients at coarser scales have small magnitudes."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 142
                            }
                        ],
                        "text": "Finally, wavelet decompositions exhibit joint statistica l regularities that have been utilized in a number of recent image coding algorithms [17, 24, 20, 23, 12, 4, 35]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 18047405,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4f6fe641e9110bddb73ab685922b0ad014540c35",
            "isKey": false,
            "numCitedBy": 5781,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": "The embedded zerotree wavelet algorithm (EZW) is a simple, yet remarkably effective, image compression algorithm, having the property that the bits in the bit stream are generated in order of importance, yielding a fully embedded code. The embedded code represents a sequence of binary decisions that distinguish an image from the \"null\" image. Using an embedded coding algorithm, an encoder can terminate the encoding at any point thereby allowing a target rate or target distortion metric to be met exactly. Also, given a bit stream, the decoder can cease decoding at any point in the bit stream and still produce exactly the same image that would have been encoded at the bit rate corresponding to the truncated bit stream. In addition to producing a fully embedded bit stream, the EZW consistently produces compression results that are competitive with virtually all known compression algorithms on standard test images. Yet this performance is achieved with a technique that requires absolutely no training, no pre-stored tables or codebooks, and requires no prior knowledge of the image source. The EZW algorithm is based on four key concepts: (1) a discrete wavelet transform or hierarchical subband decomposition, (2) prediction of the absence of significant information across scales by exploiting the self-similarity inherent in images, (3) entropy-coded successive-approximation quantization, and (4) universal lossless data compression which is achieved via adaptive arithmetic coding. >"
            },
            "slug": "Embedded-image-coding-using-zerotrees-of-wavelet-Shapiro",
            "title": {
                "fragments": [],
                "text": "Embedded image coding using zerotrees of wavelet coefficients"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The embedded zerotree wavelet algorithm (EZW) is a simple, yet remarkably effective, image compression algorithm, having the property that the bits in the bit stream are generated in order of importance, yielding a fully embedded code."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Signal Process."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1687258"
                        ],
                        "name": "R. Rinaldo",
                        "slug": "R.-Rinaldo",
                        "structuredName": {
                            "firstName": "Roberto",
                            "lastName": "Rinaldo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Rinaldo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1730514"
                        ],
                        "name": "G. Calvagno",
                        "slug": "G.-Calvagno",
                        "structuredName": {
                            "firstName": "Giancarlo",
                            "lastName": "Calvagno",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Calvagno"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 142
                            }
                        ],
                        "text": "Finally, wavelet decompositions exhibit joint statistica l regularities that have been utilized in a number of recent image coding algorithms [17, 24, 20, 23, 12, 4, 35]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 16
                            }
                        ],
                        "text": "Several authors [18, 17, 20] have used ve ctorized lookup tables to predict blocks of fine coefficients from blocks of coarse coefficients."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 7432925,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "68522ea27888b80faec6d5035fad911f88d63c46",
            "isKey": false,
            "numCitedBy": 107,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "The redundancy of the multiresolution representation has been clearly demonstrated in the case of fractal images, but it has not been fully recognized and exploited for general images. Fractal block coders have exploited the self-similarity among blocks in images. We devise an image coder in which the causal similarity among blocks of different subbands in a multiresolution decomposition of the image is exploited. In a pyramid subband decomposition, the image is decomposed into a set of subbands that are localized in scale, orientation, and space. The proposed coding scheme consists of predicting blocks in one subimage from blocks in lower resolution subbands with the same orientation. Although our prediction maps are of the same kind of those used in fractal block coders, which are based on an iterative mapping scheme, our coding technique does not impose any contractivity constraint on the block maps. This makes the decoding procedure very simple and allows a direct evaluation of the mean squared error (MSE) between the original and the reconstructed image at coding time. More importantly, we show that the subband pyramid acts as an automatic block classifier, thus making the block search simpler and the block matching more effective. These advantages are confirmed by the experimental results, which show that the performance of our scheme is superior for both visual quality and MSE to that obtainable with standard fractal block coders and also to that of other popular image coders such as JPEG."
            },
            "slug": "Image-coding-by-block-prediction-of-multiresolution-Rinaldo-Calvagno",
            "title": {
                "fragments": [],
                "text": "Image coding by block prediction of multiresolution subimages"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "An image coder in which the causal similarity among blocks of different subbands in a multiresolution decomposition of the image is exploited and the subband pyramid acts as an automatic block classifier, thus making the block search simpler and the block matching more effective."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144994682"
                        ],
                        "name": "A. Pentland",
                        "slug": "A.-Pentland",
                        "structuredName": {
                            "firstName": "Alex",
                            "lastName": "Pentland",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pentland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144152544"
                        ],
                        "name": "B. Horowitz",
                        "slug": "B.-Horowitz",
                        "structuredName": {
                            "firstName": "Bradley",
                            "lastName": "Horowitz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Horowitz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 16
                            }
                        ],
                        "text": "Several authors [17], [18], [21] have used vectorized lookup tables to predict blocks of fine coefficients from blocks of coarse coefficients."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 156,
                                "start": 152
                            }
                        ],
                        "text": "Finally, wavelet decompositions exhibit joint statistical regularities that have been utilized in a number of recent image coding algorithms [4], [12], [17], [21], [24], [25], [37]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 23494005,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "44d39918e9cc2e3d63c1a3864dc8a0cc91a7b2a0",
            "isKey": false,
            "numCitedBy": 42,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Fractal techniques for image compression have recently attracted a great deal of attention. Unfortunately, little in the way of practical algorithms or techniques have been published. We present a technique for image compression that is based on a very simple type of iterative fractal. In our algorithm a wavelet transform (quadrature mirror filter pyramid) is used to decompose an image into bands containing information from different scales (spatial frequencies) and orientations. The conditional probabilities between these different scale bands are then determined, and used as the basis for a predictive coder. We find that the wavelet transform's various scale and orientation bands have a great deal of redundant, self-similar structure. This redundant structure is, however, in the form of multi-modal conditional probabilities, so that linear predictors perform poorly. Our algorithm uses a simple histogram method to determine the multi-modal conditional probabilities between scales. The resulting predictive coder is easily integrated into existing subband coding schemes. Comparison of this fractal-based scheme with our standard wavelet vector coder on 256 X 256 grey-level imagery shows up to a two-fold gain in coding efficiency with no loss in image quality, and up to a four-fold gain with small loss in image quality. Coding and decoding are implemented by small table lookups, making real-time application feasible."
            },
            "slug": "Practical-approach-to-fractal-based-image-Pentland-Horowitz",
            "title": {
                "fragments": [],
                "text": "Practical approach to fractal-based image compression"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This paper presents a technique for image compression that is based on a very simple type of iterative fractal, used to decompose an image into bands containing information from different scales (spatial frequencies) and orientations, and uses the conditional probabilities between these different scale bands as the basis for a predictive coder."
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2055557"
                        ],
                        "name": "R. Hingorani",
                        "slug": "R.-Hingorani",
                        "structuredName": {
                            "firstName": "Rajesh",
                            "lastName": "Hingorani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hingorani"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7863995,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "daa74351eb212549288ab08cbaae015aaab49adf",
            "isKey": false,
            "numCitedBy": 367,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a set of pyramid transforms that decompose an image into a set of basis functions that are (a) spatial frequency tuned, (b) orientation tuned, (c) spatially localized, and (d) self-similar. For computational reasons the set is also (e) orthogonal and lends itself to (f) rapid computation. The systems are derived from concepts in matrix algebra, but are closely connected to decompositions based on quadrature mirror filters. Our computations take place hierarchically, leading to a pyramid representation in which all of the basis functions have the same basic shape, and appear at many scales. By placing the high-pass and low-pass kernels on staggered grids, we can derived odd-tap QMF kernels that are quite compact. We have developed pyramids using separable, quincunx, and hexagonal kernels. Image data compression with the pyramids gives excellent results, both in terms of MSE and visual appearance. A non-orthogonal variant allows good performance with 3-tap basis kernels and the appropriate inverse sampling kernels."
            },
            "slug": "Orthogonal-Pyramid-Transforms-For-Image-Coding.-Adelson-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Orthogonal Pyramid Transforms For Image Coding."
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "A set of pyramid transforms that decompose an image into a set of basis functions that are spatial frequency tuned, orientation tuned, spatially localized, and self-similar are described, leading to a pyramid representation in which all of the basis functions have the same basic shape, and appear at many scales."
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35274820"
                        ],
                        "name": "J. Woods",
                        "slug": "J.-Woods",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Woods",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Woods"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1405616239"
                        ],
                        "name": "S. O'Neil",
                        "slug": "S.-O'Neil",
                        "structuredName": {
                            "firstName": "Sean",
                            "lastName": "O'Neil",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. O'Neil"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "and spatial frequency (scale), have proven to be extremely effective for image compression, e.g., [1], [8], [23], [25], [33], [ 35 ]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 39410886,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "c2d4e1e0b44aa683637d71252b89bbc2367b4c77",
            "isKey": false,
            "numCitedBy": 1125,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Subband coding has become quite popular for the source encoding of speech. This paper presents a simple yet efficient extension of this concept to the source coding of images. We specify the constraints for a set of two-dimensional quadrature mirror filters (QMF's) for a particular frequency-domain partition, and show that these constraints are satisfied by a separable combination of one-dimensional QMF's. Bits are then optimally allocated among the subbands to minimize the mean-squared error for DPCM coding of the subbands. Also, an adaptive technique is developed to allocate the bits within each subband by means of a local variance mask. Optimum quantization is employed with quantizers matched to the Laplacian distribution. Subband coded images are presented along with their signal-to-noise ratios (SNR's). The SNR performance of the subband coder is compared to that of the adaptive discrete cosine transform (DCT), vector quantization, and differential vector quantization for bit rates of 0.67, 1.0, and 2.0 bits per pixel for 256 × 256 monochrome images. The adaptive subband coder has the best SNR performance."
            },
            "slug": "Subband-coding-of-images-Woods-O'Neil",
            "title": {
                "fragments": [],
                "text": "Subband coding of images"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A simple yet efficient extension of this concept to the source coding of images by specifying the constraints for a set of two-dimensional quadrature mirror filters for a particular frequency-domain partition and showing that these constraints are satisfied by a separable combination of one-dimensional QMF's."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Acoust. Speech Signal Process."
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 148,
                                "start": 140
                            }
                        ],
                        "text": "We are working to incorporate the probability model into oth er wavelet-based applications, such as image enhancement and texture synthesis [27, 25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 14163010,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4646e76fe9b59e5a3ba46e388c63a268740acf89",
            "isKey": false,
            "numCitedBy": 342,
            "numCiting": 51,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a parametric statistical model for visual images in the wavelet transform domain. We characterize the joint densities of coefficient magnitudes at adjacent spatial locations, adjacent orientations, and adjacent spatial scales. The model accounts for the statistics of a wide variety of visual images. As a demonstration of this, we used the model to design a progressive image encoder with state-of-the-art rate-distortion performance. We also show promising examples of image restoration and texture synthesis."
            },
            "slug": "Statistical-models-for-images:-compression,-and-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Statistical models for images: compression, restoration and synthesis"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "A parametric statistical model for visual images in the wavelet transform domain is presented and the joint densities of coefficient magnitudes at adjacent spatial locations, adjacent orientations, and adjacent spatial scales are characterized."
            },
            "venue": {
                "fragments": [],
                "text": "Conference Record of the Thirty-First Asilomar Conference on Signals, Systems and Computers (Cat. No.97CB36136)"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144994682"
                        ],
                        "name": "A. Pentland",
                        "slug": "A.-Pentland",
                        "structuredName": {
                            "firstName": "Alex",
                            "lastName": "Pentland",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pentland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144152544"
                        ],
                        "name": "B. Horowitz",
                        "slug": "B.-Horowitz",
                        "structuredName": {
                            "firstName": "Bradley",
                            "lastName": "Horowitz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Horowitz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 142
                            }
                        ],
                        "text": "Finally, wavelet decompositions exhibit joint statistica l regularities that have been utilized in a number of recent image coding algorithms [17, 25, 21, 24, 12, 4, 37]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 16
                            }
                        ],
                        "text": "Several authors [18, 17, 21] have used ve ctorized lookup tables to predict blocks of fine coefficients from blocks of coarse coefficients."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 206601929,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0d744042a9992f0d8f3860f1d897b212f2118cb5",
            "isKey": false,
            "numCitedBy": 54,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "A technique for image compression is based on a very simple type of iterative fractal. A wavelet transform (quadrature mirror filter pyramid) is used to decompose an image into bands containing information from different scales (spatial frequencies) and orientations. The conditional probabilities between these different scale bands are then determined, and used as the basis for a predictive coder. The wavelet transform's various scale and orientation bands have a great deal of redundant, self-similar structure in the form of multi-modal conditional probabilities, so that linear predictors perform poorly. A simple histogram method is used to determine the multi-modal conditional probabilities between scales. The resulting predictive coder is easily integrated into existing subband coding schemes.<<ETX>>"
            },
            "slug": "A-practical-approach-to-fractal-based-image-Pentland-Horowitz",
            "title": {
                "fragments": [],
                "text": "A practical approach to fractal-based image compression"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "A technique for image compression is based on a very simple type of iterative fractal, used to decompose an image into bands containing information from different scales, and used as the basis for a predictive coder."
            },
            "venue": {
                "fragments": [],
                "text": "[1991] Proceedings. Data Compression Conference"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746242"
                        ],
                        "name": "S. Mallat",
                        "slug": "S.-Mallat",
                        "structuredName": {
                            "firstName": "Stéphane",
                            "lastName": "Mallat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mallat"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2356353,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b78626ce1a562c05b1c06f9c805e839f9760b9ab",
            "isKey": false,
            "numCitedBy": 20815,
            "numCiting": 87,
            "paperAbstract": {
                "fragments": [],
                "text": "Multiresolution representations are effective for analyzing the information content of images. The properties of the operator which approximates a signal at a given resolution were studied. It is shown that the difference of information between the approximation of a signal at the resolutions 2/sup j+1/ and 2/sup j/ (where j is an integer) can be extracted by decomposing this signal on a wavelet orthonormal basis of L/sup 2/(R/sup n/), the vector space of measurable, square-integrable n-dimensional functions. In L/sup 2/(R), a wavelet orthonormal basis is a family of functions which is built by dilating and translating a unique function psi (x). This decomposition defines an orthogonal multiresolution representation called a wavelet representation. It is computed with a pyramidal algorithm based on convolutions with quadrature mirror filters. Wavelet representation lies between the spatial and Fourier domains. For images, the wavelet representation differentiates several spatial orientations. The application of this representation to data compression in image coding, texture discrimination and fractal analysis is discussed. >"
            },
            "slug": "A-Theory-for-Multiresolution-Signal-Decomposition:-Mallat",
            "title": {
                "fragments": [],
                "text": "A Theory for Multiresolution Signal Decomposition: The Wavelet Representation"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is shown that the difference of information between the approximation of a signal at the resolutions 2/sup j+1/ and 2/Sup j/ can be extracted by decomposing this signal on a wavelet orthonormal basis of L/sup 2/(R/sup n/), the vector space of measurable, square-integrable n-dimensional functions."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1708655"
                        ],
                        "name": "B. Olshausen",
                        "slug": "B.-Olshausen",
                        "structuredName": {
                            "firstName": "Bruno",
                            "lastName": "Olshausen",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Olshausen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49649079"
                        ],
                        "name": "D. Field",
                        "slug": "D.-Field",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Field",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Field"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9526302,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e309e441a38ccee6456bd02e0f1e894e44180d53",
            "isKey": false,
            "numCitedBy": 618,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "Natural images contain characteristic statistical regularities that set them apart from purely random images. Understanding what these regularities are can enable natural images to be coded more efficiently. In this paper, we describe some of the forms of structure that are contained in natural images, and we show how these are related to the response properties of neurons at early stages of the visual system. Many of the important forms of structure require higher-order (i.e. more than linear, pairwise) statistics to characterize, which makes models based on linear Hebbian learning, or principal components analysis, inappropriate for finding efficient codes for natural images. We suggest that a good objective for an efficient coding of natural scenes is to maximize the sparseness of the representation, and we show that a network that learns sparse codes of natural scenes succeeds in developing localized, oriented, bandpass receptive fields similar to those in the mammalian striate cortex."
            },
            "slug": "Natural-image-statistics-and-efficient-coding.-Olshausen-Field",
            "title": {
                "fragments": [],
                "text": "Natural image statistics and efficient coding."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is suggested that a good objective for an efficient coding of natural Scenes is to maximize the sparseness of the representation, and it is shown that a network that learns sparse codes of natural scenes succeeds in developing localized, oriented, bandpass receptive fields similar to those in the mammalian striate cortex."
            },
            "venue": {
                "fragments": [],
                "text": "Network"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1709392"
                        ],
                        "name": "D. Donoho",
                        "slug": "D.-Donoho",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Donoho",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Donoho"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 15691796,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ed422c3353edd494899163782ac411374156f33b",
            "isKey": false,
            "numCitedBy": 362,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "Noise reduction by constrained reconstructions in the wavelet-transform domain. Department of Mathematics, Dart-NONLINEAR WAVELET METHODS 203 Andrew Bruce and Carl Taswell for many discussions about wavelet software. The NMR datasets were provided by Chris Raphael (Figure 1) and Jee Hoch (Figure 11), the ESCA dataset by Jean-Paul Bib erian, the image dataset by Ingrid Daubechies, the seismic dataset by Paul Donoho. Many thanks to Tina Sharp for intense last-minute editorial work. Consider now a simple recursive nonlinear multiresolution scheme based on decimating by factors of 3. The ne-to-coarse mapping is obtained by grouping the signal in triplets of successive points, and replacing each group of three by a single number { the median of the group of 3. (This is a sort of nonlinear Haar analysis, since dyadic Haar wavelets correspond to grouping data in pairs and keeping only the mean of each pair.) This triadic nonlinear coarsening operator gives rise in an obvious way to a telescoping nonlinear multiresolution decomposition. Figure 28 shows the result of setting to zero the ne scale coeecients of this nonlinear triadic transform applied to the noisy data in Figure 26(b). This clearly performs much better than the linear recovery in Figure 27. Theoretical work to date on nonlinear multiresolution analysis has been done by Ron DeVore (S. Carolina) and Bradley Lucier (Purdue). Interesting applied work with mammograms has been done by Rich Richardson (Univ. of Texas at along with the author, have developed a variety of algorithms based on ideas from robust statistics. Acknowledgements. It is a pleasure to thank Iain Johnstone, G erard Kerkyacharian, and Dominique Picard, with whom much of the theory described here has been developed , and to thank Yves Meyer, Ronald Coifman, and Ingrid Daubechies for encouragement at key moments. Speciic inspirations provided by the work of Ronald DeVore and Bjj orn Jawerth are also gratefully acknowledged, as well as stimulating conversations with Albert Cohen and Bradley Lucier. Thanks to NONLINEAR WAVELET METHODS 201 Of course, in Figure 25 we are showing what happens when the wavelet transform is segmented exactly at the point of discontinuity. How are we to obtain, in analyzing noisy data, information about the proper segmentation point? Viewing the collection of segmented wavelet transforms with diierent values of t as a collection of bases B (t) , this is really a problem of selecting a best basis. Therefore we propose a best-basis segmentation SURE(y; …"
            },
            "slug": "Nonlinear-Wavelet-Methods-for-Recovery-of-Signals,-Donoho",
            "title": {
                "fragments": [],
                "text": "Nonlinear Wavelet Methods for Recovery of Signals, Densities, and Spectra from Indirect and Noisy Da"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "This work focuses on noise reduction by constrained reconstructions in the wavelet-transform domain and proposes a best-basis segmentation SURE(y; …), a telescoping nonlinear multiresolution decomposition based on decimating by factors of 3."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33523605"
                        ],
                        "name": "J. Portilla",
                        "slug": "J.-Portilla",
                        "structuredName": {
                            "firstName": "Javier",
                            "lastName": "Portilla",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Portilla"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 101,
                                "start": 85
                            }
                        ],
                        "text": "We have begun to explore some of these applic tions, and the results are encouraging [28, 26, 29, 19]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5607653,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "0da40d47bd513a468a09b7b26d27c38d8f24d70e",
            "isKey": false,
            "numCitedBy": 251,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a parametric statistical characterization of texture images in the context of an overcomplete complex wavelet frame. The characterization consists of the local autocorrelation of the coefficients in each subband, the local autocorrelation of the coefficent magnitudes, and the cross-correlation of coefficient magnitudes at all orientations and adjacent spatial scales. We develop an efficient algorithm for sampling from an implicit probability density conforming to these statistics, and demonstrate its effectiveness in synthesizing artificial and natural texture images."
            },
            "slug": "Texture-characterization-via-joint-statistics-of-Simoncelli-Portilla",
            "title": {
                "fragments": [],
                "text": "Texture characterization via joint statistics of wavelet coefficient magnitudes"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "An efficient algorithm for sampling from an implicit probability density conforming to these statistics is developed, and its effectiveness in synthesizing artificial and natural texture images is demonstrated."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings 1998 International Conference on Image Processing. ICIP98 (Cat. No.98CB36269)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "150094400"
                        ],
                        "name": "E. L. Schwartz",
                        "slug": "E.-L.-Schwartz",
                        "structuredName": {
                            "firstName": "E.",
                            "lastName": "Schwartz",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. L. Schwartz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2905757"
                        ],
                        "name": "A. Zandi",
                        "slug": "A.-Zandi",
                        "structuredName": {
                            "firstName": "Ahmad",
                            "lastName": "Zandi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Zandi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2704683"
                        ],
                        "name": "M. Boliek",
                        "slug": "M.-Boliek",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Boliek",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Boliek"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 142
                            }
                        ],
                        "text": "Finally, wavelet decompositions exhibit joint statistica l regularities that have been utilized in a number of recent image coding algorithms [17, 24, 20, 23, 12, 4, 35]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 178,
                                "start": 174
                            }
                        ],
                        "text": "Since most of the coefficient values are close to zero, the sig n bit of each coefficient is sent only when needed, immediately after the first non-zero magnitude bit, as in [23]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[23] used adaptive entropy coding to capture conditional statistics of coefficients based on t he most significant bits of each of the eight spatial neighbors and the coefficient at a coarser scale."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 62590176,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7443f354456bd60d6a8950403f85d246392afd40",
            "isKey": false,
            "numCitedBy": 48,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "Compression with reversible embedded wavelets (CREW) is a unified lossless and lossy continuous-tone still image compression system. 'Reversible' wavelets are nonlinear filters which implement exact-reconstruction systems with minimal precision integer arithmetic. Wavelet coefficients are encoded in a bit-significance embedded order, allowing lossy compression by truncating the compressed data. Lossless coding of wavelet coefficients is unique to CREW. In fact, most of the coded data is created by the lessor significant bits of the coefficients. CREW's context-based coding, called Horizon coding, takes advantage of the spatial and spectral information available in the wavelet domain and adapts well to the lessor significant bits. In applications where the size of an image is large, it is desirable to perform compression in one pass using far less workspace memory than the size of the image. A buffering scheme which allows a one-pass implementation with reasonable memory is described."
            },
            "slug": "Implementation-of-compression-with-reversible-Schwartz-Zandi",
            "title": {
                "fragments": [],
                "text": "Implementation of compression with reversible embedded wavelets"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "A buffering scheme which allows a one-pass implementation with reasonable memory of CREW's context-based coding and takes advantage of the spatial and spectral information available in the wavelet domain and adapts well to the lessor significant bits."
            },
            "venue": {
                "fragments": [],
                "text": "Optics & Photonics"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 235072,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "85a1725bfd3b4a2d3fe9a7272d66ebf03c016fed",
            "isKey": false,
            "numCitedBy": 766,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "The classical solution to the noise removal problem is the Wiener filter, which utilizes the second-order statistics of the Fourier decomposition. Subband decompositions of natural images have significantly non-Gaussian higher-order point statistics; these statistics capture image properties that elude Fourier-based techniques. We develop a Bayesian estimator that is a natural extension of the Wiener solution, and that exploits these higher-order statistics. The resulting nonlinear estimator performs a \"coring\" operation. We provide a simple model for the subband statistics, and use it to develop a semi-blind noise removal algorithm based on a steerable wavelet pyramid."
            },
            "slug": "Noise-removal-via-Bayesian-wavelet-coring-Simoncelli-Adelson",
            "title": {
                "fragments": [],
                "text": "Noise removal via Bayesian wavelet coring"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "A Bayesian estimator is developed that is a natural extension of the Wiener solution, and that exploits higher-order statistics of the Fourier decomposition to develop a semi-blind noise removal algorithm based on a steerable wavelet pyramid."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd IEEE International Conference on Image Processing"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143773338"
                        ],
                        "name": "A. Said",
                        "slug": "A.-Said",
                        "structuredName": {
                            "firstName": "Amir",
                            "lastName": "Said",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Said"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1718894"
                        ],
                        "name": "W. Pearlman",
                        "slug": "W.-Pearlman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Pearlman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pearlman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7238742,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "90793c25352c59b2a67fe7762dc7eeecf29bebb1",
            "isKey": false,
            "numCitedBy": 770,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a new image multiresolution transform that is suited for both lossless (reversible) and lossy compression. The new transformation is similar to the subband decomposition, but can be computed with only integer addition and bit-shift operations. During its calculation, the number of bits required to represent the transformed image is kept small through careful scaling and truncations. Numerical results show that the entropy obtained with the new transform is smaller than that obtained with predictive coding of similar complexity. In addition, we propose entropy-coding methods that exploit the multiresolution structure, and can efficiently compress the transformed image for progressive transmission (up to exact recovery). The lossless compression ratios are among the best in the literature, and simultaneously the rate versus distortion performance is comparable to those of the most efficient lossy compression methods."
            },
            "slug": "An-image-multiresolution-representation-for-and-Said-Pearlman",
            "title": {
                "fragments": [],
                "text": "An image multiresolution representation for lossless and lossy compression"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "A new image multiresolution transform that is suited for both lossless (reversible) and lossy compression, and entropy obtained with the new transform is smaller than that obtained with predictive coding of similar complexity."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768236"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Freeman",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2360881"
                        ],
                        "name": "D. Heeger",
                        "slug": "D.-Heeger",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Heeger",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Heeger"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 43701174,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8515604037444b3f079a9d328b0c560f33da0a19",
            "isKey": false,
            "numCitedBy": 1428,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "One of the major drawbacks of orthogonal wavelet transforms is their lack of translation invariance: the content of wavelet subbands is unstable under translations of the input signal. Wavelet transforms are also unstable with respect to dilations of the input signal and, in two dimensions, rotations of the input signal. The authors formalize these problems by defining a type of translation invariance called shiftability. In the spatial domain, shiftability corresponds to a lack of aliasing; thus, the conditions under which the property holds are specified by the sampling theorem. Shiftability may also be applied in the context of other domains, particularly orientation and scale. Jointly shiftable transforms that are simultaneously shiftable in more than one domain are explored. Two examples of jointly shiftable transforms are designed and implemented: a 1-D transform that is jointly shiftable in position and scale, and a 2-D transform that is jointly shiftable in position and orientation. The usefulness of these image representations for scale-space analysis, stereo disparity measurement, and image enhancement is demonstrated. >"
            },
            "slug": "Shiftable-multiscale-transforms-Simoncelli-Freeman",
            "title": {
                "fragments": [],
                "text": "Shiftable multiscale transforms"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "Two examples of jointly shiftable transforms that are simultaneously shiftable in more than one domain are explored and the usefulness of these image representations for scale-space analysis, stereo disparity measurement, and image enhancement is demonstrated."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31703815"
                        ],
                        "name": "R. Joshi",
                        "slug": "R.-Joshi",
                        "structuredName": {
                            "firstName": "Rajan",
                            "lastName": "Joshi",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Joshi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707397"
                        ],
                        "name": "H. Jafarkhani",
                        "slug": "H.-Jafarkhani",
                        "structuredName": {
                            "firstName": "Hamid",
                            "lastName": "Jafarkhani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Jafarkhani"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47307659"
                        ],
                        "name": "J. H. Kasner",
                        "slug": "J.-H.-Kasner",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Kasner",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. H. Kasner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1741288"
                        ],
                        "name": "T. Fischer",
                        "slug": "T.-Fischer",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Fischer",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Fischer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1697791"
                        ],
                        "name": "N. Farvardin",
                        "slug": "N.-Farvardin",
                        "structuredName": {
                            "firstName": "Nariman",
                            "lastName": "Farvardin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Farvardin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1722764"
                        ],
                        "name": "M. Marcellin",
                        "slug": "M.-Marcellin",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Marcellin",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Marcellin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737062"
                        ],
                        "name": "R. Bamberger",
                        "slug": "R.-Bamberger",
                        "structuredName": {
                            "firstName": "Roberto",
                            "lastName": "Bamberger",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bamberger"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[11] adaptively condition the encoding of classification maps of regions of coefficients based upon the classes of the left and parent r egions."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 7259430,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7adda2e366779756fe0b61363e5962ec903491d3",
            "isKey": false,
            "numCitedBy": 181,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper investigates various classification techniques, applied to subband coding of images, as a way of exploiting the nonstationary nature of image subbands. The advantages of subband classification are characterized in a rate-distortion framework in terms of \"classification gain\" and overall \"subband classification gain.\" Two algorithms, maximum classification gain and equal mean-normalized standard deviation classification, which allow unequal number of blocks in each class, are presented. The dependence between the classification maps from different subbands is exploited either directly while encoding the classification maps or indirectly by constraining the classification maps. The trade-off between the classification gain and the amount of side information is explored. Coding results for a subband image coder based on classification are presented. The simulation results demonstrate the value of classification in subband coding."
            },
            "slug": "Comparison-of-different-methods-of-classification-Joshi-Jafarkhani",
            "title": {
                "fragments": [],
                "text": "Comparison of different methods of classification in subband coding of images"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "A new method of classification based on vector quantization of AC energy n-tuples formed by energies of blocks which correspond to the same spatial location in the original image but belong to different subbands, which allows us to reduce the side information at the same time maximizing classification gain for each band under the vector constraint."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2108910126"
                        ],
                        "name": "H. Wang",
                        "slug": "H.-Wang",
                        "structuredName": {
                            "firstName": "Houng-Jyh",
                            "lastName": "Wang",
                            "middleNames": [
                                "Mike"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9363144"
                        ],
                        "name": "C.-C. Jay Kuo",
                        "slug": "C.-C.-Jay-Kuo",
                        "structuredName": {
                            "firstName": "C.-C.",
                            "lastName": "Kuo",
                            "middleNames": [
                                "Jay"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C.-C. Jay Kuo"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 23
                            }
                        ],
                        "text": "[34] H. Wang and C. J. Kuo, “A multi-threshold wavelet coder (MTWC) for high fidelity image compression,” inProc."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 13
                            }
                        ],
                        "text": "Wang and Kuo [34] use a similar technique designed specifically for successive approximation quantization, in which they related the steepest rate-distortion curve with the highest quantization threshold."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 5642364,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "62c9380ab18528fd1ebd0188c242947afa29d4aa",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "An embedded wavelet coder algorithm which adopts different threshold values in different subbands is proposed in this work. The new image coder, called the multi-threshold wavelet coder (MTWC), achieves a better rate-distortion performance than existing embedded wavelet coders for applications requiring higher quality with higher bit rates (e.g. greater than 1 bpp). Another advantage of MTWC is its lower computational complexity. The superior performance of MWC can be explained by examining the evolution of the distortion distribution in each subband as image data are compressed in the embedded coding process. Experimental results are given to demonstrate the performance of MTWC at various bit rates."
            },
            "slug": "A-multi-threshold-wavelet-coder-(MTWC)-for-high-Wang-Kuo",
            "title": {
                "fragments": [],
                "text": "A multi-threshold wavelet coder (MTWC) for high fidelity image compression"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The new image coder, called the multi-threshold wavelet coder (MTWC), achieves a better rate-distortion performance than existing embedded wavelet coders for applications requiring higher quality with higher bit rates (e.g. greater than 1 bpp)."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of International Conference on Image Processing"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145380991"
                        ],
                        "name": "Song-Chun Zhu",
                        "slug": "Song-Chun-Zhu",
                        "structuredName": {
                            "firstName": "Song-Chun",
                            "lastName": "Zhu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Song-Chun Zhu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39092098"
                        ],
                        "name": "Y. Wu",
                        "slug": "Y.-Wu",
                        "structuredName": {
                            "firstName": "Ying",
                            "lastName": "Wu",
                            "middleNames": [
                                "Nian"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Wu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117481816"
                        ],
                        "name": "D. Mumford",
                        "slug": "D.-Mumford",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Mumford",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mumford"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28032474,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d74786e0cd90e85bdea33c709c39f45cb342d2f6",
            "isKey": false,
            "numCitedBy": 120,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, a minimax entropy principle is studied, based on which a novel theory, called FRAME (Filters, Random fields And Minimax Entropy) is proposed for texture modeling. FRAME combines attractive aspects of two important themes in texture modeling: multi-channel filtering and Markov random field (MRF) modeling. It incorporates the responses of a set of well selected filters into the distribution over a random field and hence has a much stronger descriptive ability than the traditional MRF models. Furthermore, it interprets and clarifies many previous concepts and methods for texture analysis and synthesis from a unified point of view. Algorithms are proposed for probability inference, stochastic simulation and filter selection. Experiments on a variety of textures are described to illustrate our theory and to show the performance of our algorithms. These experiments demonstrate that many textures previously considered as different categories can be modeled and synthesized in a common framework."
            },
            "slug": "FRAME:-filters,-random-fields,-and-minimax-entropy-Zhu-Wu",
            "title": {
                "fragments": [],
                "text": "FRAME: filters, random fields, and minimax entropy towards a unified theory for texture modeling"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "These experiments demonstrate that many textures previously considered as different categories can be modeled and synthesized in a common framework, and interprets and clarifies many previous concepts and methods for texture analysis and synthesis from a unified point of view."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings CVPR IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1686164"
                        ],
                        "name": "F. Kossentini",
                        "slug": "F.-Kossentini",
                        "structuredName": {
                            "firstName": "Faouzi",
                            "lastName": "Kossentini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Kossentini"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49100696"
                        ],
                        "name": "W. Chung",
                        "slug": "W.-Chung",
                        "structuredName": {
                            "firstName": "Wilson",
                            "lastName": "Chung",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Chung"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2118904553"
                        ],
                        "name": "Mark J. T. Smith",
                        "slug": "Mark-J.-T.-Smith",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Smith",
                            "middleNames": [
                                "J.",
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mark J. T. Smith"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 20333593,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "39362d161e89f14e0edb5e9844a02ccb565815fb",
            "isKey": false,
            "numCitedBy": 23,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "The mainstream approach to subband coding has been to partition the input signal into subband signals and to code those signals separately with optimal or near-optimal quantizers and entropy coders. A more effective approach, however, is one where the subband coders are optimized jointly so that the average distortion introduced by the subband quantizers is minimized subject to a constraint on the output rate of the subband encoder. A subband coder with jointly optimized multistage residual quantizers and entropy coders is introduced and applied to image coding. The high performance of the coder is attributed to its ability to exploit statistical dependencies within and across the subbands. The efficiency of the multistage residual quantization structure and the effectiveness of the statistical modeling algorithm result in an attractive balance among the reproduction quality, rate, and complexity."
            },
            "slug": "A-jointly-optimized-subband-coder-Kossentini-Chung",
            "title": {
                "fragments": [],
                "text": "A jointly optimized subband coder"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A subband coder with jointly optimized multistage residual quantizers and entropy coders is introduced and applied to image coding and results in an attractive balance among the reproduction quality, rate, and complexity."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2144078950"
                        ],
                        "name": "Xiaolin Wu",
                        "slug": "Xiaolin-Wu",
                        "structuredName": {
                            "firstName": "Xiaolin",
                            "lastName": "Wu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Xiaolin Wu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35725074"
                        ],
                        "name": "Jianhua Chen",
                        "slug": "Jianhua-Chen",
                        "structuredName": {
                            "firstName": "Jianhua",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jianhua Chen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 110
                            }
                        ],
                        "text": "Said and Pearlman [22] use a predictive scheme to give high-quality zerotree coding re sults, and Wu and Chen [35] have extended the EZW coder to use local coefficient “contexts”."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 142
                            }
                        ],
                        "text": "Finally, wavelet decompositions exhibit joint statistica l regularities that have been utilized in a number of recent image coding algorithms [17, 24, 20, 23, 12, 4, 35]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 18
                            }
                        ],
                        "text": "[37] X. Wu and J. Chen, “Context modeling and entropy coding of wavelet coefficients for image compression,” inProc."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 108,
                                "start": 104
                            }
                        ],
                        "text": "Said and Pearlman [23] use a predictive scheme to give high-quality zerotree coding results, and Wu and Chen [37] have extended the EZW coder to use local coefficient “contexts.”"
                    },
                    "intents": []
                }
            ],
            "corpusId": 11275765,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "64cbe31c1a5670909607ee658ea07217867239e9",
            "isKey": true,
            "numCitedBy": 28,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we study the problem of context modeling and entropy coding of the symbol streams generated by the well-known EZW image coder (embedded image coding using zerotrees of wavelet coefficients). We present some simple context modeling techniques that can squeeze out more statistical redundancy in the wavelet coefficients of EZW-type image coders and hence lead to improved coding efficiency."
            },
            "slug": "Context-modeling-and-entropy-coding-of-wavelet-for-Wu-Chen",
            "title": {
                "fragments": [],
                "text": "Context modeling and entropy coding of wavelet coefficients for image compression"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "This paper presents some simple context modeling techniques that can squeeze out more statistical redundancy in the wavelet coefficients of EZW-type image coders and hence lead to improved coding efficiency."
            },
            "venue": {
                "fragments": [],
                "text": "1997 IEEE International Conference on Acoustics, Speech, and Signal Processing"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1780112"
                        ],
                        "name": "R. Coifman",
                        "slug": "R.-Coifman",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Coifman",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Coifman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1709398"
                        ],
                        "name": "M. Wickerhauser",
                        "slug": "M.-Wickerhauser",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Wickerhauser",
                            "middleNames": [
                                "Victor"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wickerhauser"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "We do find, however, that most of these applications require a translation-invariant representation, such as an overcomplete multi-scale pyramid (e.g., [32]) or an image-specific adaptive basis (e.g., [ 5 ], [14])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 546882,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5478a91c183c3a460bd4098acb8927bfc671367c",
            "isKey": false,
            "numCitedBy": 3339,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Adapted waveform analysis uses a library of orthonormal bases and an efficiency functional to match a basis to a given signal or family of signals. It permits efficient compression of a variety of signals, such as sound and images. The predefined libraries of modulated waveforms include orthogonal wavelet-packets and localized trigonometric functions, and have reasonably well-controlled time-frequency localization properties. The idea is to build out of the library functions an orthonormal basis relative to which the given signal or collection of signals has the lowest information cost. The method relies heavily on the remarkable orthogonality properties of the new libraries: all expansions in a given library conserve energy and are thus comparable. Several cost functionals are useful; one of the most attractive is Shannon entropy, which has a geometric interpretation in this context. >"
            },
            "slug": "Entropy-based-algorithms-for-best-basis-selection-Coifman-Wickerhauser",
            "title": {
                "fragments": [],
                "text": "Entropy-based algorithms for best basis selection"
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "Adapted waveform analysis uses a library of orthonormal bases and an efficiency functional to match a basis to a given signal or family of signals, and relies heavily on the remarkable orthogonality properties of the new libraries."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31703815"
                        ],
                        "name": "R. Joshi",
                        "slug": "R.-Joshi",
                        "structuredName": {
                            "firstName": "Rajan",
                            "lastName": "Joshi",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Joshi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2374487"
                        ],
                        "name": "Valerie J. Crump",
                        "slug": "Valerie-J.-Crump",
                        "structuredName": {
                            "firstName": "Valerie",
                            "lastName": "Crump",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Valerie J. Crump"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1741288"
                        ],
                        "name": "T. Fischer",
                        "slug": "T.-Fischer",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Fischer",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Fischer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27750829,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6c541f21ce5119feaf24ef20411b8d263630006b",
            "isKey": false,
            "numCitedBy": 129,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "A method is presented for encoding memoryless sources using trellis coded quantization (TCQ) with uniform thresholds. The trellis symbols are entropy-coded using arithmetic coding. The performance of the arithmetic coded uniform threshold TCQ, for encoding the family of generalized Gaussian densities, is compared with uniform threshold quantization (UTQ) and the Shannon lower bound (SLB). At high rates, the method performs within 0.5 dB of the rate-distortion bound for the family of generalized Gaussian densities. A simple modification of the uniform codebook is shown to result in improved performance at low bit rates. The arithmetic and trellis coding method is used for encoding image subbands. Coding results for monochrome images are presented and compared with other results in the literature. Working C code that implements arithmetic coded uniform threshold TCQ can be obtained using anonymous ftp."
            },
            "slug": "Image-subband-coding-using-arithmetic-coded-trellis-Joshi-Crump",
            "title": {
                "fragments": [],
                "text": "Image subband coding using arithmetic coded trellis coded quantization"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The performance of the arithmetic coded uniform threshold TCQ, for encoding the family of generalized Gaussian densities, is compared with uniform threshold quantization (UTQ) and the Shannon lower bound (SLB)."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Circuits Syst. Video Technol."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1829021"
                        ],
                        "name": "D. Ruderman",
                        "slug": "D.-Ruderman",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Ruderman",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ruderman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1762240"
                        ],
                        "name": "W. Bialek",
                        "slug": "W.-Bialek",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Bialek",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Bialek"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10210242,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4ea293ac6d42d09ccb9ffab7bd72dcf6102c3eab",
            "isKey": false,
            "numCitedBy": 974,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "In order to best understand a visual system one should attempt to characterize the natural images it processes. We gather images from the woods and find that these scenes possess an ensemble scale invariance. Further, they are highly non-Gaussian, and this non-Gaussian character cannot be removed through local linear filtering. We find that including a simple \"gain control\" nonlinearity in the filtering process makes the filter output quite Gaussian, meaning information is maximized at fixed channel variance. Finally, we use the measured power spectrum to place an upper bound on the information conveyed about natural scenes by an array of receptors."
            },
            "slug": "Statistics-of-Natural-Images:-Scaling-in-the-Woods-Ruderman-Bialek",
            "title": {
                "fragments": [],
                "text": "Statistics of Natural Images: Scaling in the Woods"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "This work gathers images from the woods and finds that these scenes possess an ensemble scale invariance, and this non-Gaussian character cannot be removed through local linear filtering, meaning information is maximized at fixed channel variance."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746242"
                        ],
                        "name": "S. Mallat",
                        "slug": "S.-Mallat",
                        "structuredName": {
                            "firstName": "Stéphane",
                            "lastName": "Mallat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Mallat"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2109019649"
                        ],
                        "name": "Zhifeng Zhang",
                        "slug": "Zhifeng-Zhang",
                        "structuredName": {
                            "firstName": "Zhifeng",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zhifeng Zhang"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14427335,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2210a7157565422261b03cf2cdf4e91b583df5a0",
            "isKey": false,
            "numCitedBy": 8852,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors introduce an algorithm, called matching pursuit, that decomposes any signal into a linear expansion of waveforms that are selected from a redundant dictionary of functions. These waveforms are chosen in order to best match the signal structures. Matching pursuits are general procedures to compute adaptive signal representations. With a dictionary of Gabor functions a matching pursuit defines an adaptive time-frequency transform. They derive a signal energy distribution in the time-frequency plane, which does not include interference terms, unlike Wigner and Cohen class distributions. A matching pursuit isolates the signal structures that are coherent with respect to a given dictionary. An application to pattern extraction from noisy signals is described. They compare a matching pursuit decomposition with a signal expansion over an optimized wavepacket orthonormal basis, selected with the algorithm of Coifman and Wickerhauser see (IEEE Trans. Informat. Theory, vol. 38, Mar. 1992). >"
            },
            "slug": "Matching-pursuits-with-time-frequency-dictionaries-Mallat-Zhang",
            "title": {
                "fragments": [],
                "text": "Matching pursuits with time-frequency dictionaries"
            },
            "tldr": {
                "abstractSimilarityScore": 91,
                "text": "The authors introduce an algorithm, called matching pursuit, that decomposes any signal into a linear expansion of waveforms that are selected from a redundant dictionary of functions, chosen in order to best match the signal structures."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Signal Process."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3331654"
                        ],
                        "name": "H. Gharavi",
                        "slug": "H.-Gharavi",
                        "structuredName": {
                            "firstName": "Hamid",
                            "lastName": "Gharavi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Gharavi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1771924"
                        ],
                        "name": "A. Tabatabai",
                        "slug": "A.-Tabatabai",
                        "structuredName": {
                            "firstName": "Ali",
                            "lastName": "Tabatabai",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Tabatabai"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 59576100,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "19260754c9c319e73d1959268bf74a215de05ef9",
            "isKey": false,
            "numCitedBy": 64,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Computer simulation results of sub-band coding of digital images using Quadrature Mirror Filtering (QMF) techniqueb are reported. Conditions specifying two-dimensional QMF design constraints are derived. The spectrum of the input signal is then decomposed non-uniformly into sub-band images. In the coding process, the lowest band is DPCM coded using a two-dimensional prediction scheme. The remaining bands are PCM coded by a quantizer which minimizes the perceived distortion of the reconstructed signal. The results are then presented in terms of subjective quality of the reconstructed pictures, SNR, and the resulting bit rate."
            },
            "slug": "Sub-Band-Coding-Of-Digital-Images-Using-Quadrature-Gharavi-Tabatabai",
            "title": {
                "fragments": [],
                "text": "Sub-Band Coding Of Digital Images Using Two-Dimensional Quadrature Mirror Filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "Computer simulation results of sub-band coding of digital images using Quadrature Mirror Filtering (QMF) techniqueb are reported and are presented in terms of subjective quality of the reconstructed pictures, SNR, and the resulting bit rate."
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145876744"
                        ],
                        "name": "M. Vetterli",
                        "slug": "M.-Vetterli",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Vetterli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Vetterli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 120839836,
            "fieldsOfStudy": [
                "Computer Science",
                "Physics"
            ],
            "id": "95961185d617ad16f0374cdf237fbaaabc91732f",
            "isKey": false,
            "numCitedBy": 494,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Multi-dimensional-sub-band-coding:-Some-theory-and-Vetterli",
            "title": {
                "fragments": [],
                "text": "Multi-dimensional sub-band coding: Some theory and algorithms"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49649079"
                        ],
                        "name": "D. Field",
                        "slug": "D.-Field",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Field",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Field"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1650980,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ff1152582155acaa0e9d0ccbc900a4641504256d",
            "isKey": false,
            "numCitedBy": 1344,
            "numCiting": 85,
            "paperAbstract": {
                "fragments": [],
                "text": "A number of recent attempts have been made to describe early sensory coding in terms of a general information processing strategy. In this paper, two strategies are contrasted. Both strategies take advantage of the redundancy in the environment to produce more effective representations. The first is described as a compact coding scheme. A compact code performs a transform that allows the input to be represented with a reduced number of vectors (cells) with minimal RMS error. This approach has recently become popular in the neural network literature and is related to a process called Principal Components Analysis (PCA). A number of recent papers have suggested that the optimal compact code for representing natural scenes will have units with receptive field profiles much like those found in the retina and primary visual cortex. However, in this paper, it is proposed that compact coding schemes are insufficient to account for the receptive field properties of cells in the mammalian visual pathway. In contrast, it is proposed that the visual system is near to optimal in representing natural scenes only if optimality is defined in terms of sparse distributed coding. In a sparse distributed code, all cells in the code have an equal response probability across the class of images but have a low response probability for any single image. In such a code, the dimensionality is not reduced. Rather, the redundancy of the input is transformed into the redundancy of the firing pattern of cells. It is proposed that the signature for a sparse code is found in the fourth moment of the response distribution (i.e., the kurtosis). In measurements with 55 calibrated natural scenes, the kurtosis was found to peak when the bandwidths of the visual code matched those of cells in the mammalian visual cortex. Codes resembling wavelet transforms are proposed to be effective because the response histograms of such codes are sparse (i.e., show high kurtosis) when presented with natural scenes. It is proposed that the structure of the image that allows sparse coding is found in the phase spectrum of the image. It is suggested that natural scenes, to a first approximation, can be considered as a sum of self-similar local functions (the inverse of a wavelet). Possible reasons for why sensory systems would evolve toward sparse coding are presented."
            },
            "slug": "What-Is-the-Goal-of-Sensory-Coding-Field",
            "title": {
                "fragments": [],
                "text": "What Is the Goal of Sensory Coding?"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is proposed that compact coding schemes are insufficient to account for the receptive field properties of cells in the mammalian visual pathway and suggested that natural scenes, to a first approximation, can be considered as a sum of self-similar local functions (the inverse of a wavelet)."
            },
            "venue": {
                "fragments": [],
                "text": "Neural Computation"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1779692"
                        ],
                        "name": "G. Wornell",
                        "slug": "G.-Wornell",
                        "structuredName": {
                            "firstName": "Gregory",
                            "lastName": "Wornell",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Wornell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 144,
                                "start": 140
                            }
                        ],
                        "text": "The most widely known of these is that wavelet transforms are reasonable approximations to the Karhunen-Loève expansion for fractal signals [28], such as natural images [17]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 121268397,
            "fieldsOfStudy": [
                "Materials Science"
            ],
            "id": "d0b68eb1dfe102efc3bc9b3589c718b4236d345e",
            "isKey": false,
            "numCitedBy": 359,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "It is demonstrated that 1/f fractal processes are, in a broad sense, optimally represented in terms of orthonormal wavelet bases. Specifically, via a useful frequency-domain characterization for 1/f processes, the wavelet expansion's role as a Karhunen-Loeve-type expansion for 1/f processes is developed. As an illustration of potential, it is shown that wavelet-based representations naturally lead to highly efficient solutions to some fundamental detection and estimation problems involving 1/f processes. >"
            },
            "slug": "Wavelet-based-representations-for-the-1/f-family-of-Wornell",
            "title": {
                "fragments": [],
                "text": "Wavelet-based representations for the 1/f family of fractal processes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2360881"
                        ],
                        "name": "D. Heeger",
                        "slug": "D.-Heeger",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Heeger",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Heeger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 47266338,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "38850b393d7132dc14141f7d643aca4cb9c321da",
            "isKey": false,
            "numCitedBy": 844,
            "numCiting": 58,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a method for synthesizing images that match the texture appearance of a given digitized sample. This synthesis is completely automatic and requires only the \"target\" texture as input. It allows generation of as much texture as desired so that any object can be covered. The approach is based on a model of human texture perception, and has potential to be a practically useful tool for image processing and graphics applications."
            },
            "slug": "Pyramid-based-texture-analysis/synthesis-Heeger-Bergen",
            "title": {
                "fragments": [],
                "text": "Pyramid-based texture analysis/synthesis"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "This paper describes a method for synthesizing images that match the texture appearance of a given digitized sample that is based on a model of human texture perception, and has potential to be a practically useful tool for image processing and graphics applications."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings., International Conference on Image Processing"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2167607"
                        ],
                        "name": "C. Chrysafis",
                        "slug": "C.-Chrysafis",
                        "structuredName": {
                            "firstName": "Christos",
                            "lastName": "Chrysafis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Chrysafis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145029825"
                        ],
                        "name": "Antonio Ortega",
                        "slug": "Antonio-Ortega",
                        "structuredName": {
                            "firstName": "Antonio",
                            "lastName": "Ortega",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Antonio Ortega"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 24,
                                "start": 21
                            }
                        ],
                        "text": "Chrysafis and Ortega [3] switch between multiple probability models depending on values of neighboring coefficients."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 24
                            }
                        ],
                        "text": "[4] C. Chrysafis and A. Ortega, “Efficient context-based lossy wavelet image coding,” in Proc."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 178,
                                "start": 152
                            }
                        ],
                        "text": "Finally, wavelet decompositions exhibit joint statistical regularities that have been implicitly utilized in a number of recent image coding algorithms [13, 20, 16, 19, 9, 3, 29]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 0
                            }
                        ],
                        "text": "Chrysafis and Ortega [4] switch between multiple probability models depending on values of neighboring coefficients."
                    },
                    "intents": []
                }
            ],
            "corpusId": 117665089,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5720bac8ac0d2c67d0b7ce2255aad03b10a5a82f",
            "isKey": true,
            "numCitedBy": 7,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Efficient-context-based-entropy-cod-ing-for-lossy-Chrysafis-Ortega",
            "title": {
                "fragments": [],
                "text": "Efficient context-based entropy cod-ing for lossy wavelet image coding"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2167607"
                        ],
                        "name": "C. Chrysafis",
                        "slug": "C.-Chrysafis",
                        "structuredName": {
                            "firstName": "Christos",
                            "lastName": "Chrysafis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Chrysafis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145029825"
                        ],
                        "name": "Antonio Ortega",
                        "slug": "Antonio-Ortega",
                        "structuredName": {
                            "firstName": "Antonio",
                            "lastName": "Ortega",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Antonio Ortega"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 22
                            }
                        ],
                        "text": "Chr ysafis and Ortega [4] switch between multiple probability models depending on values of neighborin g coefficients."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 24
                            }
                        ],
                        "text": "[4] C. Chrysafis and A. Ortega, “Efficient context-based lossy wavelet image coding,” in Proc."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 142
                            }
                        ],
                        "text": "Finally, wavelet decompositions exhibit joint statistica l regularities that have been utilized in a number of recent image coding algorithms [17, 24, 20, 23, 12, 4, 35]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 14
                            }
                        ],
                        "text": "Chrysafis and Ortega [4] switch between multiple probability models depending on values of neighboring coefficients."
                    },
                    "intents": []
                }
            ],
            "corpusId": 58837536,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "51ab58261f4024acc1860797f2577bc3c97cb913",
            "isKey": true,
            "numCitedBy": 11,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Efficient-context-based-lossy-wavelet-image-coding-Chrysafis-Ortega",
            "title": {
                "fragments": [],
                "text": "Efficient context-based lossy wavelet image coding"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 111
                            }
                        ],
                        "text": "Convolution boundaries are handled by symmetric reflection of the image about the edge pixels, as described in [27]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 60558958,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f7d903ecc7ed4edd575629966221a1b156a648d4",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Orthogonal-sub-band-image-transforms-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Orthogonal sub-band image transforms"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2256718"
                        ],
                        "name": "W. Press",
                        "slug": "W.-Press",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Press",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Press"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48590121"
                        ],
                        "name": "S. Teukolsky",
                        "slug": "S.-Teukolsky",
                        "structuredName": {
                            "firstName": "Saul",
                            "lastName": "Teukolsky",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Teukolsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2608024"
                        ],
                        "name": "W. Vetterling",
                        "slug": "W.-Vetterling",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Vetterling",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Vetterling"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35046585"
                        ],
                        "name": "B. Flannery",
                        "slug": "B.-Flannery",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Flannery",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Flannery"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 21409595,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1db212040657728644b1813994d701e68d3608a6",
            "isKey": false,
            "numCitedBy": 4046,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Numerical-Recipes-in-C,-2nd-Edition-Press-Teukolsky",
            "title": {
                "fragments": [],
                "text": "Numerical Recipes in C, 2nd Edition"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[11] adaptively condition the encoding of classification maps of regions of coefficients based upon the classes of the left and parent r egions."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 59
                            }
                        ],
                        "text": "Wavelet coefficient marginals have been previously modeled [15, 10, 30, 13, 11] using a two-parameter “generalized Laplacian” (or “stretched exponential”) den sity function of the form: 2 fs;r(c) = e jc=sjr N(s; r) ; (1) whereN(s; r) = 2s (1=r)=r, and (x) = R1 0 tx 1e t dt, the Gamma function."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Comparison of different methods of classification in subband codi ng of images"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Proc,"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[13] model the coefficients as being chosen from a generalized Laplacian density field and est imate the model parameters from local neighborhoods."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Image codin  g based on mixture modeling of wavelet coefficients and a fast estimation-quantizat  ion frameqork"
            },
            "venue": {
                "fragments": [],
                "text": "InData Compression Conference, March"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Issue Wavelets"
            },
            "venue": {
                "fragments": [],
                "text": "Issue Wavelets"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Orthogonal sub-band image transforms. Master's thesis, Massachusetts Institute of Technology"
            },
            "venue": {
                "fragments": [],
                "text": "Orthogonal sub-band image transforms. Master's thesis, Massachusetts Institute of Technology"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 100
                            }
                        ],
                        "text": "We utilize a recursive pyramid decomposition based on separ able 9/7 tap biorthogonal filter set of [2] which satisfies the one-dimensional system diagram show n in figure 9."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Image coding u  sing wavelet transform"
            },
            "venue": {
                "fragments": [],
                "text": " IEEE Trans. Image Proc, 1:105–220, April"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 65,
                                "start": 61
                            }
                        ],
                        "text": "The arithmetic encoder is similar to th e algorithm found in [19], which encodes a data stream using a probability distribution that is adapt ively computed and stored in a histogram."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Numerical Recipes in C - Second Edition"
            },
            "venue": {
                "fragments": [],
                "text": "Cambridge University Press, Cambridge, MA,"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Orthogonal sub-band image transforms Master's thesis"
            },
            "venue": {
                "fragments": [],
                "text": "Dept. Elect. Eng. Comput. Sci., Mass. Inst. Technol"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 54
                            }
                        ],
                        "text": "The disk radius was drawn uniformly from the interval [8; 24] pixels, and its position was randomized within 8 pixels of the image center."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 65
                            }
                        ],
                        "text": "Preliminary versions of this work have been published in [2] and [24]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Progressive wavelet image compression using linear inter-band magnitude prediction"
            },
            "venue": {
                "fragments": [],
                "text": "In Fourth Int’l Conf on Image Processing,"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 142
                            }
                        ],
                        "text": "Finally, wavelet decompositions exhibit joint statistica l regularities that have been utilized in a number of recent image coding algorithms [17, 24, 20, 23, 12, 4, 35]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 16
                            }
                        ],
                        "text": "Several authors [18, 17, 20] have used ve ctorized lookup tables to predict blocks of fine coefficients from blocks of coarse coefficients."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A practical approach to fract  al-based image compression"
            },
            "venue": {
                "fragments": [],
                "text": "A B Watson, editor,Digital Images and Human Vision. MIT Press,"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 142
                            }
                        ],
                        "text": "Finally, wavelet decompositions exhibit joint statistica l regularities that have been utilized in a number of recent image coding algorithms [17, 25, 21, 24, 12, 4, 37]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A jointly optimized su  bband coder.IEEE"
            },
            "venue": {
                "fragments": [],
                "text": "Trans Image Processing,"
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Sh  iftable multi-scale transforms"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans Information Theory, 38(2):587–607, March"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 18
                            }
                        ],
                        "text": "Said and Pearlman [22] use a predictive scheme to give high-quality zerotree coding re sults, and Wu and Chen [35] have extended the EZW coder to use local coefficient “contexts”."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 23,
                                "start": 15
                            }
                        ],
                        "text": "Said and W. A. Pearlman, “An image multiresolution representation for lossless and lossy compression,”IEEE Trans."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 0
                            }
                        ],
                        "text": "Said and Pearlman [23] use a predictive scheme to give high-quality zerotree coding results, and Wu and Chen [37] have extended the EZW coder to use local coefficient “contexts.”"
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An image multiresolution repres  entation for lossless and lossy compression.IEEE"
            },
            "venue": {
                "fragments": [],
                "text": "Trans. Image Proc,"
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 151,
                                "start": 147
                            }
                        ],
                        "text": ", symmetric) 9-tap filters, and are optimized to nearly satisfy the one-dimensional orthonormal system diagram shown in figure 10, as described in [22]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Subband transforms"
            },
            "venue": {
                "fragments": [],
                "text": "Subband Image Coding,"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Best-adapted wave packet bases"
            },
            "venue": {
                "fragments": [],
                "text": "Numerical Algorithms Research Group"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Image subband coding using arit  hme ic and trellis coded quantization"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Circuits and Systems for Video Technology, 5(6):515–523,"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 174,
                                "start": 170
                            }
                        ],
                        "text": "The most widely known of these is that wavelet transforms are reasonable approximations to the Karhunen-Loève expansion for fractal signals [36], such a s n tural images [22]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Statistics of natural images: Scaling in t  he woods.Phys"
            },
            "venue": {
                "fragments": [],
                "text": "Rev. Letters,"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Matching pursuits with time-frequency dict ionaries.IEEE"
            },
            "venue": {
                "fragments": [],
                "text": "Trans. Signal Proc.,"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 142
                            }
                        ],
                        "text": "Finally, wavelet decompositions exhibit joint statistica l regularities that have been utilized in a number of recent image coding algorithms [17, 24, 20, 23, 12, 4, 35]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A jointly optimiz  ed subband coder"
            },
            "venue": {
                "fragments": [],
                "text": " IEEE Trans Image Processing, 5(9):1311–1323, September"
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 2
                            }
                        ],
                        "text": ", [32]) or an image-specific adaptive basis (e."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Shiftable multi-scale transforms"
            },
            "venue": {
                "fragments": [],
                "text": " IEEE Trans. Inform. Theory, Spec. Issue Wavelets,  vol. 38, pp. 587–607, Mar. 1992."
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Pyramid - based texture analysis / synthesis Image subband coding using arithmetic and trellis coded quantization"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans . Circuits and Systems for Video Technology"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Progressive wavelet image compression using linear inter-band magnitude prediction"
            },
            "venue": {
                "fragments": [],
                "text": "Fourth Int'l Conf on Image Processing"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 16
                            }
                        ],
                        "text": "Several authors [14, 13, 16] have used vectorized lookup tables to predict blocks of fine coefficients from blocks of coarse coefficients."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Fractal-based image compression and interpolation, 1992"
            },
            "venue": {
                "fragments": [],
                "text": "U.S. Patent Number 5,148,497,"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Shi  ftable multi-scale transforms"
            },
            "venue": {
                "fragments": [],
                "text": " IEEE Trans Information Theory, 38(2):587–607, March"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 16
                            }
                        ],
                        "text": "Several authors [18, 17, 21] have used ve ctorized lookup tables to predict blocks of fine coefficients from blocks of coarse coefficients."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Fractal-based imag  e compression and interpolation, 1992. U.S. Patent Number 5,148,497"
            },
            "venue": {
                "fragments": [],
                "text": "Filed 14 Feb 1990,"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 102,
                                "start": 99
                            }
                        ],
                        "text": "We utilize a recursive pyramid decomposition based on separable 9/7 tap biorthogonal filter set of [2] which satisfies the one-dimensional system diagram shown in Fig."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Image coding using wavelet transform,”IEEE"
            },
            "venue": {
                "fragments": [],
                "text": "Trans. Image Processing,"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 16
                            }
                        ],
                        "text": "Several authors [18, 17, 20] have used ve ctorized lookup tables to predict blocks of fine coefficients from blocks of coarse coefficients."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Fractalbased image compression and interpolation, 1992"
            },
            "venue": {
                "fragments": [],
                "text": "U.S. Patent Number 5,148,497. Filed 14 Feb 1  990, issued 15 Sep"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 22
                            }
                        ],
                        "text": "Several authors [17], [18], [21] have used vectorized lookup tables to predict blocks of fine coefficients from blocks of coarse coefficients."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Fractal-based image compression and interpolation"
            },
            "venue": {
                "fragments": [],
                "text": "U.S. Patent 5 148 497, Sept. 15, 1992."
            },
            "year": 1992
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 15,
            "methodology": 25,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 68,
        "totalPages": 7
    },
    "page_url": "https://www.semanticscholar.org/paper/Image-compression-via-joint-statistical-in-the-Buccigrossi-Simoncelli/156ed6cd90506cd1111dffcd8e80e33ff62ca5ae?sort=total-citations"
}