{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2932960"
                        ],
                        "name": "Ross D. Shachter",
                        "slug": "Ross-D.-Shachter",
                        "structuredName": {
                            "firstName": "Ross",
                            "lastName": "Shachter",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ross D. Shachter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 113
                            }
                        ],
                        "text": "Currently, there are several algorithms for performing probabilistic inference using multiply connected networks [17,20, 29]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 48,
                                "start": 40
                            }
                        ],
                        "text": "In particular, investigators have shown [21, 29] that the joint probability of some particular instantiation 1 of all n variables in a belief network can be calculated as follows:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9157064,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3b99793e181ea13b6f79a046b33b65ed692b3614",
            "isKey": false,
            "numCitedBy": 90,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Intelligent-Probabilistic-Inference-Shachter",
            "title": {
                "fragments": [],
                "text": "Intelligent Probabilistic Inference"
            },
            "venue": {
                "fragments": [],
                "text": "UAI"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145430701"
                        ],
                        "name": "J. Pearl",
                        "slug": "J.-Pearl",
                        "structuredName": {
                            "firstName": "Judea",
                            "lastName": "Pearl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pearl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 48,
                                "start": 40
                            }
                        ],
                        "text": "In particular, investigators have shown [21, 29] that the joint probability of some particular instantiation 1 of all n variables in a belief network can be calculated as follows:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 32583695,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "70ef29e6f0ce082bb8a47fd85b9bfb7cc0f20c93",
            "isKey": false,
            "numCitedBy": 18219,
            "numCiting": 230,
            "paperAbstract": {
                "fragments": [],
                "text": "From the Publisher: \nProbabilistic Reasoning in Intelligent Systems is a complete andaccessible account of the theoretical foundations and computational methods that underlie plausible reasoning under uncertainty. The author provides a coherent explication of probability as a language for reasoning with partial belief and offers a unifying perspective on other AI approaches to uncertainty, such as the Dempster-Shafer formalism, truth maintenance systems, and nonmonotonic logic. The author distinguishes syntactic and semantic approaches to uncertainty\u0097and offers techniques, based on belief networks, that provide a mechanism for making semantics-based systems operational. Specifically, network-propagation techniques serve as a mechanism for combining the theoretical coherence of probability theory with modern demands of reasoning-systems technology: modular declarative inputs, conceptually meaningful inferences, and parallel distributed computation. Application areas include diagnosis, forecasting, image interpretation, multi-sensor fusion, decision support systems, plan recognition, planning, speech recognition\u0097in short, almost every task requiring that conclusions be drawn from uncertain clues and incomplete information. \nProbabilistic Reasoning in Intelligent Systems will be of special interest to scholars and researchers in AI, decision theory, statistics, logic, philosophy, cognitive psychology, and the management sciences. Professionals in the areas of knowledge-based systems, operations research, engineering, and statistics will find theoretical and computational tools of immediate practical use. The book can also be used as an excellent text for graduate-level courses in AI, operations research, or applied probability."
            },
            "slug": "Probabilistic-reasoning-in-intelligent-systems-of-Pearl",
            "title": {
                "fragments": [],
                "text": "Probabilistic reasoning in intelligent systems - networks of plausible inference"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The author provides a coherent explication of probability as a language for reasoning with partial belief and offers a unifying perspective on other AI approaches to uncertainty, such as the Dempster-Shafer formalism, truth maintenance systems, and nonmonotonic logic."
            },
            "venue": {
                "fragments": [],
                "text": "Morgan Kaufmann series in representation and reasoning"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35106875"
                        ],
                        "name": "R. Duda",
                        "slug": "R.-Duda",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Duda",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Duda"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3108177"
                        ],
                        "name": "P. Hart",
                        "slug": "P.-Hart",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Hart",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Hart"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144497046"
                        ],
                        "name": "N. Nilsson",
                        "slug": "N.-Nilsson",
                        "structuredName": {
                            "firstName": "Nils",
                            "lastName": "Nilsson",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Nilsson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 90,
                                "start": 87
                            }
                        ],
                        "text": "In the field of artificial intelligence, several classical systems, such as PROSPECTOR [9] and CASNET [30], have used a directed graph to represent probabilistic relationships among events."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 59914956,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c8462629a67c76b5512c3a3c2d6f1cff9fa35fa2",
            "isKey": false,
            "numCitedBy": 303,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The general problem of drawing inferences from uncertain or incomplete evidence has invited a variety of technical approaches, some mathematically rigorous and some largely informal and intuitive. Most current inference systems in artificial intelligence have emphasized intuitive methods, because the absence of adequate statistical samples forces a reliance on the subjective judgment of human experts. We describe in this paper a subjective Bayesian inference method that realizes some of the advantages of both formal and informal approaches. Of particular interest are the modifications needed to deal with the inconsistencies usually found in collections of subjective statements."
            },
            "slug": "Subjective-bayesian-methods-for-rule-based-systems-Duda-Hart",
            "title": {
                "fragments": [],
                "text": "Subjective Bayesian methods for rule-based inference systems"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A subjective Bayesian inference method that realizes some of the advantages of both formal and informal approaches, and modifications needed to deal with the inconsistencies usually found in collections of subjective statements are described."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1726406"
                        ],
                        "name": "G. Cooper",
                        "slug": "G.-Cooper",
                        "structuredName": {
                            "firstName": "Gregory",
                            "lastName": "Cooper",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Cooper"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 120,
                                "start": 113
                            }
                        ],
                        "text": "A more general form of probabilistic inference exists when S~ and S 2 can be propositions in propositional logic [8, 19]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5251286,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8a9112c07a9660443dd720f235fe4ca775799201",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-algorithm-for-computing-probabilistic-Cooper",
            "title": {
                "fragments": [],
                "text": "An algorithm for computing probabilistic propositions"
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Approx. Reason."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145430701"
                        ],
                        "name": "J. Pearl",
                        "slug": "J.-Pearl",
                        "structuredName": {
                            "firstName": "Judea",
                            "lastName": "Pearl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pearl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 131
                            }
                        ],
                        "text": "Probabilistic inference using some topological classes of belief networks has been resistant to any efficient algorithmic solution [20]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 58,
                                "start": 54
                            }
                        ],
                        "text": "In addition to being called a Bayesian belief network [20], it has been termed a causal net [11, 12], causal n e t w o r k [17], probab i l i s t i c causa l n e t w o r k [6], probab i l i s t i c cause -e f f ec t m o d e l [28], a n d probab i l i s t i c i n f luence"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 135
                            }
                        ],
                        "text": "perform probabilistic inference using singly connected networks in time that is linear as a function of the size of the belief network [20]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 113
                            }
                        ],
                        "text": "Currently, there are several algorithms for performing probabilistic inference using multiply connected networks [17,20, 29]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 13723620,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bb0419bccc2244ed33c9c42341f342511262daa3",
            "isKey": true,
            "numCitedBy": 2148,
            "numCiting": 53,
            "paperAbstract": {
                "fragments": [],
                "text": "Belief networks are directed acyclic graphs in which the nodes represent propositions (or variables), the arcs signify direct dependencies between the linked propositions, and the strengths of these dependencies are quantified by conditional probabilities. A network of this sort can be used to represent the generic knowledge of a domain expert, and it turns into a computational architecture if the links are used not merely for storing factual knowledge but also for directing and activating the data flow in the computations which manipulate this knowledge. The first part of the paper deals with the task of fusing and propagating the impacts of new information through the networks in such a way that, when equilibrium is reached, each proposition will be assigned a measure of belief consistent with the axioms of probability theory. It is shown that if the network is singly connected (e.g. tree-structured), then probabilities can be updated by local propagation in an isomorphic network of parallel and autonomous processors and that the impact of new information can be imparted to all propositions in time proportional to the longest path in the network. The second part of the paper deals with the problem of finding a tree-structured representation for a collection of probabilistically coupled propositions using auxiliary (dummy) variables, colloquially called \"hidden causes.\" It is shown that if such a tree-structured representation exists, then it is possible to uniquely uncover the topology of the tree by observing pairwise dependencies among the available propositions (i.e., the leaves of the tree). The entire tree structure, including the strengths of all internal relationships, can be reconstructed in time proportional to n log n, where n is the number of leaves."
            },
            "slug": "Fusion,-Propagation,-and-Structuring-in-Belief-Pearl",
            "title": {
                "fragments": [],
                "text": "Fusion, Propagation, and Structuring in Belief Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It is shown that if the network is singly connected (e.g. tree-structured), then probabilities can be updated by local propagation in an isomorphic network of parallel and autonomous processors and that the impact of new information can be imparted to all propositions in time proportional to the longest path in the network."
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144497046"
                        ],
                        "name": "N. Nilsson",
                        "slug": "N.-Nilsson",
                        "structuredName": {
                            "firstName": "Nils",
                            "lastName": "Nilsson",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Nilsson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9800575,
            "fieldsOfStudy": [
                "Philosophy",
                "Computer Science"
            ],
            "id": "35bbc5ce402e88705e6e599f9aa45f8889b9e369",
            "isKey": false,
            "numCitedBy": 1331,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Probabilistic-Logic-Nilsson",
            "title": {
                "fragments": [],
                "text": "Probabilistic Logic"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37659559"
                        ],
                        "name": "R. M. Chavez",
                        "slug": "R.-M.-Chavez",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Chavez",
                            "middleNames": [
                                "Martin"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. M. Chavez"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1726406"
                        ],
                        "name": "G. Cooper",
                        "slug": "G.-Cooper",
                        "structuredName": {
                            "firstName": "Gregory",
                            "lastName": "Cooper",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Cooper"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 159
                            }
                        ],
                        "text": "These advantages have been key motivations behind the development of several expert systems that use belief networks for diagnosis and for data interpretation [1-3, 6, 15, 16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9666475,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "221392016d23fa35fa72164c36ffaa8f723f5351",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "KNET:-integrating-hypermedia-and-normative-bayesian-Chavez-Cooper",
            "title": {
                "fragments": [],
                "text": "KNET: integrating hypermedia and normative bayesian modeling"
            },
            "venue": {
                "fragments": [],
                "text": "UAI"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145430701"
                        ],
                        "name": "J. Pearl",
                        "slug": "J.-Pearl",
                        "structuredName": {
                            "firstName": "Judea",
                            "lastName": "Pearl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pearl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1988445"
                        ],
                        "name": "Thomas Verma",
                        "slug": "Thomas-Verma",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Verma",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Thomas Verma"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 170,
                                "start": 163
                            }
                        ],
                        "text": "It is necessary to consider only the known dependencies among variables in a domain, rather than to assume that all variables are dependent on all other variables [6, 22]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 40429849,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e97661976fb3a854c2e6b63f4067d3a6f62b19a7",
            "isKey": false,
            "numCitedBy": 142,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Data-dependencies of the type \"x can tell us more about y given that we already know z\" can be represented in various formalisms: Probabilistic Dependencies, Embedded-Multi-Valued Dependencies, Undirected Graphs and Directed-Acyclic Graphs (DAGs). This paper provides an axiomatic basis, called a semigraphoid, which captures the structure common to all four types of dependencies and explores the expressive power of DAGs in representing various types of data dependencies. It is shown that DAGs can represent a richer set of dependencies than undirected graphs, that DAGs completely represent the closure of their specification bases, and that they offer an effective computational device for testing membership in that closure as well as inferring new dependencies from given inputs. These properties might explain the prevailing use of DAGs in causal reasoning and semantic nets."
            },
            "slug": "The-Logic-of-Representing-Dependencies-by-Directed-Pearl-Verma",
            "title": {
                "fragments": [],
                "text": "The Logic of Representing Dependencies by Directed Graphs"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "An axiomatic basis is provided, called a semigraphoid, which captures the structure common to all four types of dependencies and explores the expressive power of DAGs in representing various types of data dependencies."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2031816663"
                        ],
                        "name": "Y. Peng",
                        "slug": "Y.-Peng",
                        "structuredName": {
                            "firstName": "Yun",
                            "lastName": "Peng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Peng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1742049"
                        ],
                        "name": "J. Reggia",
                        "slug": "J.-Reggia",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Reggia",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Reggia"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23091208,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f9877ed8e707401a109e99134fb625f1a3d2d060",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-comfort-measure-for-diagnostic-problem-solving-Peng-Reggia",
            "title": {
                "fragments": [],
                "text": "A comfort measure for diagnostic problem solving"
            },
            "venue": {
                "fragments": [],
                "text": "Inf. Sci."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145634459"
                        ],
                        "name": "M. Garey",
                        "slug": "M.-Garey",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Garey",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Garey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2150444582"
                        ],
                        "name": "David S. Johnson",
                        "slug": "David-S.-Johnson",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Johnson",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David S. Johnson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 55
                            }
                        ],
                        "text": "Futhermore, PIBNETD is NP-complete in the strong sense [10] because all the numbers in the problem can be assigned a fixed precision."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 107,
                                "start": 100
                            }
                        ],
                        "text": "In this paper , we shall transform a well-known NP-complete problem, called 3-Satisfiability (3SAT) [5, 10], to a Decision-problem version of Probabilistic Inference using Belief NETworks (PIBNETD)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2211006,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bdede1e17c947540b50e6e2db9e8467ddc6e7336",
            "isKey": false,
            "numCitedBy": 47655,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "Horn formulae play a prominent role in artificial intelligence and logic programming. In this paper we investigate the problem of optimal compression of propositional Horn production rule knowledge bases. The standard approach to this problem, consisting in the removal of redundant rules from a knowledge base, leads to an \"irredundant\" but not necessarily optimal knowledge base. We prove here that the number of rules in any irredundant Horn knowledge base involving n propositional variables is at most n 0 1 times the minimum possible number of rules. In order to formalize the optimal compression problem, we define a Boolean function of a knowledge base as being the function whose set of true points is the set of models of the knowledge base. In this way the optimal compression of production rule knowledge bases becomes a problem of Boolean function minimization. In this paper we prove that the minimization of Horn functions (i.e. Boolean functions associated to Horn knowledge bases) is..."
            },
            "slug": "Computers-and-Intractability:-A-Guide-to-the-Theory-Garey-Johnson",
            "title": {
                "fragments": [],
                "text": "Computers and Intractability: A Guide to the Theory of NP-Completeness"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This is the second edition of a quarterly column the purpose of which is to provide a continuing update to the list of problems (NP-complete and harder) presented by M. R. Garey and myself in the authors' book ‘‘Computers and Intractability: A Guide to the Theory of NP-Completeness’’."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145129956"
                        ],
                        "name": "A. Rosenthal",
                        "slug": "A.-Rosenthal",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Rosenthal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenthal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 75,
                                "start": 71
                            }
                        ],
                        "text": "Rosenthal has shown this problem to be NP-hard for undirected networks [27]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 119,
                                "start": 115
                            }
                        ],
                        "text": "Similar techniques have been used to solve some types of fault-tree problems [26] and network reliability problems [27]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 123708556,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "db311092f4e7285167ba5e2587a24fd067a3d82c",
            "isKey": false,
            "numCitedBy": 192,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a decomposition procedure for evaluating the reliability of a network whose elements fail independently with known probabilities. A subnetwork is “solved” by computing the probability for classes of failure patterns within which the network performance is constant. We then iterate, combining solved subnetworks until the entire network has been evaluated. The running time for each iteration depends superexponentially on the subnetwork boundary size, but for treelike or “thin” networks total time grows only linearly with total network size. Details of our decomposition scheme are presented for a wide variety of measures of performance. For measures where computing the distribution of performance is too slow we present a quicker method which finds the average performance. Finally, we show that computing network reliability is NP-hard, so that efficiency in special cases is all that can be achieved."
            },
            "slug": "Computing-the-Reliability-of-Complex-Networks-Rosenthal",
            "title": {
                "fragments": [],
                "text": "Computing the Reliability of Complex Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "A decomposition procedure for evaluating the reliability of a network whose elements fail independently with known probabilities is presented and it is shown that computing network reliability is NP-hard, so that efficiency in special cases is all that can be achieved."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3009522"
                        ],
                        "name": "M. Henrion",
                        "slug": "M.-Henrion",
                        "structuredName": {
                            "firstName": "Max",
                            "lastName": "Henrion",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Henrion"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31001714"
                        ],
                        "name": "D. Cooley",
                        "slug": "D.-Cooley",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Cooley",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Cooley"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 159
                            }
                        ],
                        "text": "These advantages have been key motivations behind the development of several expert systems that use belief networks for diagnosis and for data interpretation [1-3, 6, 15, 16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 40368538,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "88e43e0b86af4d75597efaaa680cd65f63e072b0",
            "isKey": false,
            "numCitedBy": 63,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Decision analysis provides a set of techniques for structuring and encoding expert knowledge, comparable with knowledge engineering techniques for rule-based expert systems. In order to compare the expert systems and decision analysis approach, each was applied to the same task, namely the diagnosis and treatment of root disorders in apple trees. This experiment illustrates a variety of theoretical and practical differences between them, including the semantics of the network representations (inference net vs. influence diagram or Bayes' belief net), approaches to modelling uncertainty and preferences, the relative effort required, and their attitudes to human reasoning under uncertainty, as the ideal to be emulated or as unreliable and to be improved upon."
            },
            "slug": "An-Experimental-Comparison-of-Knowledge-Engineering-Henrion-Cooley",
            "title": {
                "fragments": [],
                "text": "An Experimental Comparison of Knowledge Engineering for Expert Systems and for Decision Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This experiment illustrates a variety of theoretical and practical differences between decision analysis and expert systems, including the semantics of the network representations, approaches to modelling uncertainty and preferences, the relative effort required, and their attitudes to human reasoning under uncertainty."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1765456"
                        ],
                        "name": "S. Cook",
                        "slug": "S.-Cook",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Cook",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Cook"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 107,
                                "start": 100
                            }
                        ],
                        "text": "In this paper , we shall transform a well-known NP-complete problem, called 3-Satisfiability (3SAT) [5, 10], to a Decision-problem version of Probabilistic Inference using Belief NETworks (PIBNETD)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 7573663,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "1a8d2e5bb9c646d85308fbd6ce33fce8765e2c26",
            "isKey": false,
            "numCitedBy": 6570,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "It is shown that any recognition problem solved by a polynomial time-bounded nondeterministic Turing machine can be “reduced” to the problem of determining whether a given propositional formula is a tautology. Here “reduced” means, roughly speaking, that the first problem can be solved deterministically in polynomial time provided an oracle is available for solving the second. From this notion of reducible, polynomial degrees of difficulty are defined, and it is shown that the problem of determining tautologyhood has the same polynomial degree as the problem of determining whether the first of two given graphs is isomorphic to a subgraph of the second. Other examples are discussed. A method of measuring the complexity of proof procedures for the predicate calculus is introduced and discussed."
            },
            "slug": "The-complexity-of-theorem-proving-procedures-Cook",
            "title": {
                "fragments": [],
                "text": "The complexity of theorem-proving procedures"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "It is shown that any recognition problem solved by a polynomial time-bounded nondeterministic Turing machine can be “reduced” to the problem of determining whether a given propositional formula is a tautology."
            },
            "venue": {
                "fragments": [],
                "text": "STOC"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1972776"
                        ],
                        "name": "S. Andreassen",
                        "slug": "S.-Andreassen",
                        "structuredName": {
                            "firstName": "Steen",
                            "lastName": "Andreassen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Andreassen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2209769"
                        ],
                        "name": "M. Woldbye",
                        "slug": "M.-Woldbye",
                        "structuredName": {
                            "firstName": "Marianne",
                            "lastName": "Woldbye",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Woldbye"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47643639"
                        ],
                        "name": "B. Falck",
                        "slug": "B.-Falck",
                        "structuredName": {
                            "firstName": "Björn",
                            "lastName": "Falck",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Falck"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46558286"
                        ],
                        "name": "S. K. Andersen",
                        "slug": "S.-K.-Andersen",
                        "structuredName": {
                            "firstName": "Stig",
                            "lastName": "Andersen",
                            "middleNames": [
                                "Kjær"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. K. Andersen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 159
                            }
                        ],
                        "text": "These advantages have been key motivations behind the development of several expert systems that use belief networks for diagnosis and for data interpretation [1-3, 6, 15, 16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6844163,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1b0ea2bf938f8a255aae6dc31afeea8925593def",
            "isKey": false,
            "numCitedBy": 259,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "Experience gained through building a causal network for interpretation of electromyographic findings has shown that probabilistic inference is a realistic possibility in networks of non-trivial size. The use of nodes with many internal states has made it possible to make a conceptually simple and compact representation of knowledge. \"Deep knowledge\" in the form of pathophysiological models are used to reduce the problem of estimating thousands of conditional probabilities to a manageble size. The network has built-in mechanisms that will detect when the network is confronted with a situation outside the limits of its own knowledge and it handles conflicting evidence in a simple and consistent way."
            },
            "slug": "MUNIN-A-Causal-Probabilistic-Network-for-of-Andreassen-Woldbye",
            "title": {
                "fragments": [],
                "text": "MUNIN - A Causal Probabilistic Network for Interpretation of Electromyographic Findings"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Experience gained through building a causal network for interpretation of electromyographic findings has shown that probabilistic inference is a realistic possibility in networks of non-trivial size."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145179124"
                        ],
                        "name": "I. Good",
                        "slug": "I.-Good",
                        "structuredName": {
                            "firstName": "I.",
                            "lastName": "Good",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Good"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120498169,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "205abaabbba341a30b56659163e59ded076856d9",
            "isKey": false,
            "numCitedBy": 259,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Tins paper contains a suggested quantitative explication of probabilistic causality in terms of physical probability.1 The main result is to show that, starting from very reasonable desiderata, there is a unique meaning, up to a continuous increasing transformation, that can be attached to ' the tendency of one event to cause another one '. A reasonable explicatum will also be suggested for the degree to which one event caused another one. It may be possible to find other reasonable explicata for tendency to cause, but, if so, the assumptions made here will have to be changed. I believe that the first clear-cut application in science will be to the foundations of statistics, such as to an improved understanding of the function of randormsation, but I am content for the present to regard the work as contributing to the philosophy of science, and especially to what may be called the ' mathematics of philosophy '. Light may also be shed on problems of allocating blame and credit. I hope to consider applications to statistics on another occasion.2 In a previous note 3 I have tried to give an interpretation of 'an event F caused another event E ' without making reference to time. It was presumably clear from the last three paragraphs, which were added in"
            },
            "slug": "A-CAUSAL-CALCULUS-(I)*-Good",
            "title": {
                "fragments": [],
                "text": "A CAUSAL CALCULUS (I)*"
            },
            "venue": {
                "fragments": [],
                "text": "The British Journal for the Philosophy of Science"
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2071920729"
                        ],
                        "name": "David Lichtenstein",
                        "slug": "David-Lichtenstein",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Lichtenstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David Lichtenstein"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 29,
                                "start": 25
                            }
                        ],
                        "text": "For example, PLANAR 3SAT [18] can be used to show that inferring P(Cs) in a bipartite belief network is NP-hard, even if the bipartite belief network is restricted to be a planar graph."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 207051487,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "159130c8a50702df40a6a59bcb6e98d0474431dc",
            "isKey": false,
            "numCitedBy": 700,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "We define the set of planar boolean formulae, and then show that the set of true quantified planar formulae is polynomial space complete and that the set of satisfiable planar formulae is NP-complete. Using these results, we are able to provide simple and nearly uniform proofs of NP-completeness for planar node cover, planar Hamiltonian circuit and line, geometric connected dominating set, and of polynomial space completeness for planar generalized geography.The NP-completeness of planar node cover and planar Hamiltonian circuit and line were first proved elsewhere [M. R. Garey and D. S. Johnson, The rectilinear Steiner tree is NP-complete, SIAM J. Appl. Math., 32 (1977), pp. 826–834] and [M. R. Garey, D. S. Johnson and R. E. Tarjan, The planar Hamilton circuit problem is NP-complete, SIAM J. Comp., 5 (1976), pp. 704–714]."
            },
            "slug": "Planar-Formulae-and-Their-Uses-Lichtenstein",
            "title": {
                "fragments": [],
                "text": "Planar Formulae and Their Uses"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Using these results, it is able to provide simple and nearly uniform proofs of NP-completeness for planar node cover, planar Hamiltonian circuit and line, geometric connected dominating set, and of polynomial space completeness forPlanar generalized geography."
            },
            "venue": {
                "fragments": [],
                "text": "SIAM J. Comput."
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34671862"
                        ],
                        "name": "J. S. Provan",
                        "slug": "J.-S.-Provan",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Provan",
                            "middleNames": [
                                "Scott"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. S. Provan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6822661"
                        ],
                        "name": "M. Ball",
                        "slug": "M.-Ball",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Ball",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Ball"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 135
                            }
                        ],
                        "text": "More pert inent to PIBNET, Provan and Ball have shown the s - t network reliability problem to be NP-hard for directed, acyclic graphs [25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 3007273,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "895842fb9f629420baca3f21ef21f355b8c386d2",
            "isKey": false,
            "numCitedBy": 713,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Several enumeration and reliability problems are shown to be # P-complete, and hence, at least as hard as NP-complete problems. Included are important problems in network reliability analysis, namely, computing the probability that a graph is connected and counting the number of minimum cardinality $(s,t)$-cuts or directed network cuts. Also shown to be # P-complete are counting vertex covers in a bipartite graph, counting antichains in a partial order, and approximating the probability that a graph is connected and the probability that a pair of vertices is connected."
            },
            "slug": "The-Complexity-of-Counting-Cuts-and-of-Computing-a-Provan-Ball",
            "title": {
                "fragments": [],
                "text": "The Complexity of Counting Cuts and of Computing the Probability that a Graph is Connected"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Several enumeration and reliability problems are shown to be # P-complete, and hence, at least as hard as NP-complete problems."
            },
            "venue": {
                "fragments": [],
                "text": "SIAM J. Comput."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70226956"
                        ],
                        "name": "A. Agogino",
                        "slug": "A.-Agogino",
                        "structuredName": {
                            "firstName": "Alice",
                            "lastName": "Agogino",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Agogino"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2931267"
                        ],
                        "name": "Ashutosh Rege",
                        "slug": "Ashutosh-Rege",
                        "structuredName": {
                            "firstName": "Ashutosh",
                            "lastName": "Rege",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ashutosh Rege"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 56730414,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cb4b25e7aa759a8041bd6808c3df10b3a6287c42",
            "isKey": false,
            "numCitedBy": 59,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "IDES:-influence-diagram-based-expert-system-Agogino-Rege",
            "title": {
                "fragments": [],
                "text": "IDES: influence diagram based expert system"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1726406"
                        ],
                        "name": "G. Cooper",
                        "slug": "G.-Cooper",
                        "structuredName": {
                            "firstName": "Gregory",
                            "lastName": "Cooper",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Cooper"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 178,
                                "start": 167
                            }
                        ],
                        "text": "For example, algorithms have been developed that bound a probability of the form P(xl z), where x is an instantiated variable and Z is a set of instantiated variables [6, 14, 23]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 172
                            }
                        ],
                        "text": "In addition to being called a Bayesian belief network [20], it has been termed a causal net [11, 12], causal n e t w o r k [17], probab i l i s t i c causa l n e t w o r k [6], probab i l i s t i c cause -e f f ec t m o d e l [28], a n d probab i l i s t i c i n f luence"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 170,
                                "start": 163
                            }
                        ],
                        "text": "It is necessary to consider only the known dependencies among variables in a domain, rather than to assume that all variables are dependent on all other variables [6, 22]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 159
                            }
                        ],
                        "text": "These advantages have been key motivations behind the development of several expert systems that use belief networks for diagnosis and for data interpretation [1-3, 6, 15, 16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 58660085,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "373b1817afebdced6119cb6564a6be187b4823a9",
            "isKey": false,
            "numCitedBy": 256,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : In order to address some existing problems in computer-aided medical decision making, a computer program called NESTOR has been developed to aid physicians in determining the most likely diagnostic hypothesis to account for a set of patient findings. The domain of hypercalcemic disorders is used to test solution methods that should be applicable to other medical areas. A key design philosophy underlying NESTOR is that the physicians should have control of the computer interaction to determine what is done and when. In order to provide such controllable, interactive aid, specific technical tasks to be addressed. The unifying philosophy in addressing them is the use of knowledge-based methods within a formal probability theory framework. A user interface module gives the physician control over when and how these tasks are used to aid in diagnosing the cause of a patient's condition. This dissertation presents the problems that are addressed by each of the three tasks, and the details of the methods used to address them. In addition, the results of an evaluation of the hypothesis scoring and search techniques are presented and discussed. Additional keywords: artificial intelligence; expert systems; medical applications; computer aided diagnosis; medical computer applications."
            },
            "slug": "NESTOR:-A-Computer-Based-Medical-Diagnostic-Aid-and-Cooper",
            "title": {
                "fragments": [],
                "text": "NESTOR: A Computer-Based Medical Diagnostic Aid That Integrates Causal and Probabilistic Knowledge."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This dissertation presents the problems that are addressed by each of the three tasks of NESTOR, the use of knowledge-based methods within a formal probability theory framework, and the details of the methods used to address them."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2050895"
                        ],
                        "name": "S. Lauritzen",
                        "slug": "S.-Lauritzen",
                        "structuredName": {
                            "firstName": "Steffen",
                            "lastName": "Lauritzen",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Lauritzen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48616434"
                        ],
                        "name": "D. Spiegelhalter",
                        "slug": "D.-Spiegelhalter",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Spiegelhalter",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Spiegelhalter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 127,
                                "start": 123
                            }
                        ],
                        "text": "In addition to being called a Bayesian belief network [20], it has been termed a causal net [11, 12], causal n e t w o r k [17], probab i l i s t i c causa l n e t w o r k [6], probab i l i s t i c cause -e f f ec t m o d e l [28], a n d probab i l i s t i c i n f luence"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 170,
                                "start": 166
                            }
                        ],
                        "text": "A second example is an algorithm that is able to perform probabilistic inference efficiently on many multiply connected networks that contain small clusters of nodes [17]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 113
                            }
                        ],
                        "text": "Currently, there are several algorithms for performing probabilistic inference using multiply connected networks [17,20, 29]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 58792451,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0a3767909649cf31d32e087693d93171af28ebe0",
            "isKey": false,
            "numCitedBy": 4303,
            "numCiting": 126,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Local-computations-with-probabilities-on-graphical-Lauritzen-Spiegelhalter",
            "title": {
                "fragments": [],
                "text": "Local computations with probabilities on graphical structures and their application to expert systems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145700185"
                        ],
                        "name": "S. Weiss",
                        "slug": "S.-Weiss",
                        "structuredName": {
                            "firstName": "Sholom",
                            "lastName": "Weiss",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Weiss"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3285789"
                        ],
                        "name": "C. Kulikowski",
                        "slug": "C.-Kulikowski",
                        "structuredName": {
                            "firstName": "Casimir",
                            "lastName": "Kulikowski",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Kulikowski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2182836"
                        ],
                        "name": "S. Amarel",
                        "slug": "S.-Amarel",
                        "structuredName": {
                            "firstName": "Saul",
                            "lastName": "Amarel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Amarel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2765291"
                        ],
                        "name": "A. Safir",
                        "slug": "A.-Safir",
                        "structuredName": {
                            "firstName": "Aran",
                            "lastName": "Safir",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Safir"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 106,
                                "start": 102
                            }
                        ],
                        "text": "In the field of artificial intelligence, several classical systems, such as PROSPECTOR [9] and CASNET [30], have used a directed graph to represent probabilistic relationships among events."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8835382,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "da2802b3af2458adfd2246202e3f4a4ca5afe7a0",
            "isKey": false,
            "numCitedBy": 503,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Model-Based-Method-for-Computer-Aided-Medical-Weiss-Kulikowski",
            "title": {
                "fragments": [],
                "text": "A Model-Based Method for Computer-Aided Medical Decision-Making"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2067557636"
                        ],
                        "name": "H. Grunwald",
                        "slug": "H.-Grunwald",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Grunwald",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Grunwald"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 159
                            }
                        ],
                        "text": "These advantages have been key motivations behind the development of several expert systems that use belief networks for diagnosis and for data interpretation [1-3, 6, 15, 16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 116739080,
            "fieldsOfStudy": [
                "Sociology"
            ],
            "id": "497b4f334269c3a57a4cdbee9c03e6bb233aa306",
            "isKey": false,
            "numCitedBy": 8,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Book-reviewIntelligent-decision-systems:-Wokingham,-Grunwald",
            "title": {
                "fragments": [],
                "text": "Book reviewIntelligent decision systems: Addison-Wesley, Wokingham, 1988, xv + 304 pages, US$45.00"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49920629"
                        ],
                        "name": "W. F. Rousseau",
                        "slug": "W.-F.-Rousseau",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Rousseau",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. F. Rousseau"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 230,
                                "start": 226
                            }
                        ],
                        "text": "In addition to being called a Bayesian belief network [20], it has been termed a causal net [11, 12], causal n e t w o r k [17], probab i l i s t i c causa l n e t w o r k [6], probab i l i s t i c cause -e f f ec t m o d e l [28], a n d probab i l i s t i c i n f luence"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 60028025,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e4e71cd52a772cad0da4517f1a746e7cf7926a93",
            "isKey": false,
            "numCitedBy": 21,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-method-for-computing-probabilities-in-complex-Rousseau",
            "title": {
                "fragments": [],
                "text": "A method for computing probabilities in complex situations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2065181223"
                        ],
                        "name": "Homer L. Chin",
                        "slug": "Homer-L.-Chin",
                        "structuredName": {
                            "firstName": "Homer",
                            "lastName": "Chin",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Homer L. Chin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1726406"
                        ],
                        "name": "G. Cooper",
                        "slug": "G.-Cooper",
                        "structuredName": {
                            "firstName": "Gregory",
                            "lastName": "Cooper",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Cooper"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 37
                            }
                        ],
                        "text": "convergence properties in some cases [4], and thus are not always practical to"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 41924543,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f170d23a8e826c283854fb9f47e3adead6f9e1d2",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Bayesian-Belief-Network-Inference-Using-Simulation-Chin-Cooper",
            "title": {
                "fragments": [],
                "text": "Bayesian Belief Network Inference Using Simulation"
            },
            "venue": {
                "fragments": [],
                "text": "UAI"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32549076"
                        ],
                        "name": "S. Holtzman",
                        "slug": "S.-Holtzman",
                        "structuredName": {
                            "firstName": "Samuel",
                            "lastName": "Holtzman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Holtzman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45269236,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ad4a3ef0b12d64eaf71a8c4dd1ac0611cfe81a1c",
            "isKey": false,
            "numCitedBy": 303,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Intelligent-decision-systems-Holtzman",
            "title": {
                "fragments": [],
                "text": "Intelligent decision systems"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35106875"
                        ],
                        "name": "R. Duda",
                        "slug": "R.-Duda",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Duda",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Duda"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3108177"
                        ],
                        "name": "P. Hart",
                        "slug": "P.-Hart",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Hart",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Hart"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144497046"
                        ],
                        "name": "N. Nilsson",
                        "slug": "N.-Nilsson",
                        "structuredName": {
                            "firstName": "Nils",
                            "lastName": "Nilsson",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Nilsson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 207171419,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a47176e0ec512a450c2aed106700fdb3b5f653ca",
            "isKey": false,
            "numCitedBy": 370,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The general problem of drawing inferences from uncertain or incomplete evidence has invited a variety of technical approaches, some mathematically rigorous and some largely informal and intuitive. Most current inference systems in artificial intelligence have emphasized intuitive methods, because the absence of adequate statistical samples forces a reliance on the subjective judgment of human experts. We describe in this paper a subjective Bayesian inference method that realizes some of the advantages of both formal and informal approaches. Of particular interest are the modifications needed to deal with the inconsistencies usually found in collections of subjective statements."
            },
            "slug": "Subjective-bayesian-methods-for-rule-based-systems-Duda-Hart",
            "title": {
                "fragments": [],
                "text": "Subjective bayesian methods for rule-based inference systems"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A subjective Bayesian inference method that realizes some of the advantages of both formal and informal approaches, and modifications needed to deal with the inconsistencies usually found in collections of subjective statements are described."
            },
            "venue": {
                "fragments": [],
                "text": "AFIPS '76"
            },
            "year": 1976
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 159
                            }
                        ],
                        "text": "These advantages have been key motivations behind the development of several expert systems that use belief networks for diagnosis and for data interpretation [1-3, 6, 15, 16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Influence diagram based expert system, Math"
            },
            "venue": {
                "fragments": [],
                "text": "Modelling 8"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 131,
                                "start": 127
                            }
                        ],
                        "text": "Rosenthai has applied a related reduction using the general satisfiability problem to show that solving fault trees is NP-hard [26]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 81,
                                "start": 77
                            }
                        ],
                        "text": "Similar techniques have been used to solve some types of fault-tree problems [26] and network reliability problems [27]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A computer scientist looks at reliability computations"
            },
            "venue": {
                "fragments": [],
                "text": "Reliability and Fault Tree Analysis (SIAM,"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 178,
                                "start": 167
                            }
                        ],
                        "text": "For example, algorithms have been developed that bound a probability of the form P(xl z), where x is an instantiated variable and Z is a set of instantiated variables [6, 14, 23]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Towards efficient probabilistic diagnosis in multiply-connected belief networks"
            },
            "venue": {
                "fragments": [],
                "text": "in: Proceedings Conference on Influence Diagrams,"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 17
                            }
                        ],
                        "text": "Additionally, in [7] we show that computing P(ui = T ] C 1, C 2 ."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The computational complexity of probabilistic inference using belief networks, Rept. KSL-87-27"
            },
            "venue": {
                "fragments": [],
                "text": "Medical Computer Science"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 147,
                                "start": 143
                            }
                        ],
                        "text": "A related method uses Monte Carlo simulation techniques to produce a point-valued probability estimate, plus a standard error of that estimate [13]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Propagating uncertainty by logic sampling in Bayes' networks"
            },
            "venue": {
                "fragments": [],
                "text": "Uncertainty in Artificial Intelligence"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 89
                            }
                        ],
                        "text": "Unfortunately, the representations of many complex, real-world domains, such as medicine [24], seem generally to require large multiply connected networks; furthermore, probabilistic inference using these networks typically involves many uninstantiated variables--for example, the intermediate pathophysiological states in medical belief networks."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The structuring of medical diagnostics, in: P"
            },
            "venue": {
                "fragments": [],
                "text": "Szolovits, ed., Artificial Intelligence in Medicine"
            },
            "year": 1982
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 19,
            "methodology": 9
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 32,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/The-Computational-Complexity-of-Probabilistic-Using-Cooper/ed5324bb3a19f0dcc2e90e482c06373b934fc28c?sort=total-citations"
}