{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2170732251"
                        ],
                        "name": "Fang Liu",
                        "slug": "Fang-Liu",
                        "structuredName": {
                            "firstName": "Fang",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fang Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719389"
                        ],
                        "name": "Rosalind W. Picard",
                        "slug": "Rosalind-W.-Picard",
                        "structuredName": {
                            "firstName": "Rosalind",
                            "lastName": "Picard",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rosalind W. Picard"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 17049261,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1b703ddbea8ccaf7554dae3a70375e7299322ed0",
            "isKey": false,
            "numCitedBy": 41,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "One of the fundamental challenges in pattern recognition is choosing a set of features appropriate to a class of problems. In applications such as image retrieval, if is important that features used by the system in pattern comparison provide good measures of \"perceptual similarity\". The authors present a new set of features and an image model based on the three mutually orthogonal components produced by the 2-D Wold decomposition of random fields. These components have visual properties which approximate the three most important perceptual dimensions of human texture perception. The method presented here is different from the existing Wold-based models in that it tolerates certain local inhomogeneities which arise in natural textures and reduces computation for comparison of patterns subjected to transformations such as rotation. An image retrieval algorithm based on the new texture model is presented. The effectiveness of the new Wold features for retrieving perceptually similar natural textures is demonstrated by comparing it to that of other well-known pattern recognition methods. The Wold model appears to offer a perceptually more satisfying measure of pattern similarity."
            },
            "slug": "Periodicity,-directionality,-and-randomness:-Wold-Liu-Picard",
            "title": {
                "fragments": [],
                "text": "Periodicity, directionality, and randomness: Wold features for perceptual pattern recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The authors present a new set of features and an image model based on the three mutually orthogonal components produced by the 2-D Wold decomposition of random fields which approximate the three most important perceptual dimensions of human texture perception."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 12th IAPR International Conference on Pattern Recognition, Vol. 3 - Conference C: Signal Processing (Cat. No.94CH3440-5)"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719389"
                        ],
                        "name": "Rosalind W. Picard",
                        "slug": "Rosalind-W.-Picard",
                        "structuredName": {
                            "firstName": "Rosalind",
                            "lastName": "Picard",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rosalind W. Picard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2170732251"
                        ],
                        "name": "Fang Liu",
                        "slug": "Fang-Liu",
                        "structuredName": {
                            "firstName": "Fang",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fang Liu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 16339129,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e0c745980719ccc99213ccc13a4053233aabb2e0",
            "isKey": false,
            "numCitedBy": 55,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of measuring perceptual similarity between images is addressed using a new image model based on the Weld decomposition. The model permits separate treatment of image components which correspond approximately to periodicity, directionality, and randomness. The authors compare its performance in an image search application to two other methods-one based on shift-invariant principle components and one based on a multiscale simultaneous autoregressive model. When textured images are ordered by distances between their Wold components, the results appear to be much closer to the human perception of similarity. The authors discuss how decoupling the three components can increase flexibility for measuring image similarity and can save computation, permitting the \"quickest\" matches when the features are the most perceptually \"salient\".<<ETX>>"
            },
            "slug": "A-new-Wold-ordering-for-image-similarity-Picard-Liu",
            "title": {
                "fragments": [],
                "text": "A new Wold ordering for image similarity"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The authors discuss how decoupling the three components can increase flexibility for measuring image similarity and can save computation, permitting the \"quickest\" matches when the features are the most perceptually \"salient\"."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of ICASSP '94. IEEE International Conference on Acoustics, Speech and Signal Processing"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723832"
                        ],
                        "name": "J. M. Francos",
                        "slug": "J.-M.-Francos",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Francos",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. M. Francos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144359964"
                        ],
                        "name": "A. Meiri",
                        "slug": "A.-Meiri",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Meiri",
                            "middleNames": [
                                "Zvi"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Meiri"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2207042"
                        ],
                        "name": "B. Porat",
                        "slug": "B.-Porat",
                        "structuredName": {
                            "firstName": "Boaz",
                            "lastName": "Porat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Porat"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40916012,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0e4ab8c33da601300677a5a62be07df322e48d83",
            "isKey": false,
            "numCitedBy": 218,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "A unified texture model that is applicable to a wide variety of texture types found in natural images is presented. This model leads to the derivation of texture analysis and synthesis algorithms designed to estimate the texture parameters and to reconstruct the original texture field from these parameters. The texture field is assumed to be a realization of a regular homogeneous random field, which is characterized in general by a mixed spectral distribution. The texture field is orthogonally decomposed into a purely indeterministic component and a deterministic component. The deterministic component is further orthogonally decomposed into a harmonic component, and a generalized-evanescent component. Both analytical and experimental results show that the deterministic components should be parameterized separately from the purely indeterministic component. The model is very efficient in terms of the number of parameters required to faithfully represent textures. Reconstructed textures are practically indistinguishable from the originals. >"
            },
            "slug": "A-unified-texture-model-based-on-a-2-D-Wold-like-Francos-Meiri",
            "title": {
                "fragments": [],
                "text": "A unified texture model based on a 2-D Wold-like decomposition"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "A unified texture model that is applicable to a wide variety of texture types found in natural images is presented and results show that the deterministic components should be parameterized separately from the purely indeterministic component."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Signal Process."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1803621"
                        ],
                        "name": "A. Khotanzad",
                        "slug": "A.-Khotanzad",
                        "structuredName": {
                            "firstName": "Alireza",
                            "lastName": "Khotanzad",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Khotanzad"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "103360673"
                        ],
                        "name": "J. Y. Chen",
                        "slug": "J.-Y.-Chen",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Chen",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Y. Chen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 206417297,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "17f3682cddb82faafac7c178def6c1a5612a0261",
            "isKey": false,
            "numCitedBy": 67,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm for unsupervised texture segmentation is developed that is based on detecting changes in textural characteristics of small local regions. Six features derived from two, two-dimensional, noncausal random field models are used to represent texture. These features contain information about gray-level-value variations in the eight principal directions. An algorithm for automatic selection of the size of the observation windows over which textural activity and change are measured has been developed. Effects of changes in individual features are considered simultaneously by constructing a one-dimensional measure of textural change from them. Edges in this measure correspond to the sought-after textural edges. Experiments results with images containing regions of natural texture show that the algorithm performs very well. >"
            },
            "slug": "Unsupervised-Segmentation-of-Textured-Images-by-in-Khotanzad-Chen",
            "title": {
                "fragments": [],
                "text": "Unsupervised Segmentation of Textured Images by Edge Detection in Multidimensional Feature"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "An algorithm for unsupervised texture segmentation is developed that is based on detecting changes in textural characteristics of small local regions, and results with images containing regions of natural texture show that the algorithm performs very well."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2066628043"
                        ],
                        "name": "R. Sriram",
                        "slug": "R.-Sriram",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Sriram",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Sriram"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723832"
                        ],
                        "name": "J. M. Francos",
                        "slug": "J.-M.-Francos",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Francos",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. M. Francos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1718894"
                        ],
                        "name": "W. Pearlman",
                        "slug": "W.-Pearlman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Pearlman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pearlman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7801589,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "528fff6fab182df1d8c3f341c72f0b811f92cf73",
            "isKey": false,
            "numCitedBy": 32,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "A novel approach for coding textured images is presented. The texture field is assumed to be a realization of a regular homogeneous random field, which can have a mixed spectral distribution. On the basis of a 2D Wold-like decomposition, the field is represented as a sum of purely indeterministic, harmonic, and a countable number of evanescent fields. We present an algorithm for estimating and coding the texture model parameters, and show that the suggested algorithm yields high quality reconstructions at low bit rates. The model and the resulting coding algorithm are seen to be applicable to a wide variety of texture types found in natural images."
            },
            "slug": "Texture-coding-using-a-Wold-decomposition-model-Sriram-Francos",
            "title": {
                "fragments": [],
                "text": "Texture coding using a Wold decomposition model"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "An algorithm for estimating and coding the texture model parameters is presented, and it is shown that the suggested algorithm yields high quality reconstructions at low bit rates."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 12th IAPR International Conference on Pattern Recognition, Vol. 2 - Conference B: Computer Vision & Image Processing. (Cat. No.94CH3440-5)"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50591689"
                        ],
                        "name": "B. S. Manjunath",
                        "slug": "B.-S.-Manjunath",
                        "structuredName": {
                            "firstName": "B.",
                            "lastName": "Manjunath",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. S. Manjunath"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712167"
                        ],
                        "name": "Wei-Ying Ma",
                        "slug": "Wei-Ying-Ma",
                        "structuredName": {
                            "firstName": "Wei-Ying",
                            "lastName": "Ma",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Wei-Ying Ma"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15171942,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2989b07819dfd279222a3755d3b7862f1a1a7f53",
            "isKey": false,
            "numCitedBy": 4175,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "Image content based retrieval is emerging as an important research area with application to digital libraries and multimedia databases. The focus of this paper is on the image processing aspects and in particular using texture information for browsing and retrieval of large image data. We propose the use of Gabor wavelet features for texture analysis and provide a comprehensive experimental evaluation. Comparisons with other multiresolution texture features using the Brodatz texture database indicate that the Gabor features provide the best pattern retrieval accuracy. An application to browsing large air photos is illustrated."
            },
            "slug": "Texture-Features-for-Browsing-and-Retrieval-of-Data-Manjunath-Ma",
            "title": {
                "fragments": [],
                "text": "Texture Features for Browsing and Retrieval of Image Data"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Comparisons with other multiresolution texture features using the Brodatz texture database indicate that the Gabor features provide the best pattern retrieval accuracy."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2141915"
                        ],
                        "name": "W. Niblack",
                        "slug": "W.-Niblack",
                        "structuredName": {
                            "firstName": "Wayne",
                            "lastName": "Niblack",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Niblack"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50281905"
                        ],
                        "name": "R. Barber",
                        "slug": "R.-Barber",
                        "structuredName": {
                            "firstName": "Ron",
                            "lastName": "Barber",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Barber"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712308"
                        ],
                        "name": "W. Equitz",
                        "slug": "W.-Equitz",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Equitz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Equitz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712991"
                        ],
                        "name": "M. Flickner",
                        "slug": "M.-Flickner",
                        "structuredName": {
                            "firstName": "Myron",
                            "lastName": "Flickner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Flickner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "123856769"
                        ],
                        "name": "E. Glasman",
                        "slug": "E.-Glasman",
                        "structuredName": {
                            "firstName": "Eduardo",
                            "lastName": "Glasman",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Glasman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143867341"
                        ],
                        "name": "D. Petkovic",
                        "slug": "D.-Petkovic",
                        "structuredName": {
                            "firstName": "Dragutin",
                            "lastName": "Petkovic",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Petkovic"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70341848"
                        ],
                        "name": "P. Yanker",
                        "slug": "P.-Yanker",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Yanker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Yanker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1702392"
                        ],
                        "name": "C. Faloutsos",
                        "slug": "C.-Faloutsos",
                        "structuredName": {
                            "firstName": "Christos",
                            "lastName": "Faloutsos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Faloutsos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1690237"
                        ],
                        "name": "G. Taubin",
                        "slug": "G.-Taubin",
                        "structuredName": {
                            "firstName": "Gabriel",
                            "lastName": "Taubin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Taubin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14145220,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "824aac4970a4d149b35c19a9d2d2dec4c994688e",
            "isKey": false,
            "numCitedBy": 2235,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "In the query by image content (QBIC) project we are studying methods to query large on-line image databases using the images' content as the basis of the queries. Examples of the content we use include color, texture, and shape of image objects and regions. Potential applications include medical (`Give me other images that contain a tumor with a texture like this one'), photo-journalism (`Give me images that have blue at the top and red at the bottom'), and many others in art, fashion, cataloging, retailing, and industry. Key issues include derivation and computation of attributes of images and objects that provide useful query functionality, retrieval methods based on similarity as opposed to exact match, query by image example or user drawn image, the user interfaces, query refinement and navigation, high dimensional database indexing, and automatic and semi-automatic database population. We currently have a prototype system written in X/Motif and C running on an RS/6000 that allows a variety of queries, and a test database of over 1000 images and 1000 objects populated from commercially available photo clip art images. In this paper we present the main algorithms for color texture, shape and sketch query that we use, show example query results, and discuss future directions."
            },
            "slug": "QBIC-project:-querying-images-by-content,-using-and-Niblack-Barber",
            "title": {
                "fragments": [],
                "text": "QBIC project: querying images by content, using color, texture, and shape"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "The main algorithms for color texture, shape and sketch query that are presented, show example query results, and discuss future directions are presented."
            },
            "venue": {
                "fragments": [],
                "text": "Electronic Imaging"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1730627"
                        ],
                        "name": "H. Tamura",
                        "slug": "H.-Tamura",
                        "structuredName": {
                            "firstName": "Hideyuki",
                            "lastName": "Tamura",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Tamura"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2072425643"
                        ],
                        "name": "Shunji Mori",
                        "slug": "Shunji-Mori",
                        "structuredName": {
                            "firstName": "Shunji",
                            "lastName": "Mori",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Shunji Mori"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2066168351"
                        ],
                        "name": "Takashi Yamawaki",
                        "slug": "Takashi-Yamawaki",
                        "structuredName": {
                            "firstName": "Takashi",
                            "lastName": "Yamawaki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Takashi Yamawaki"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32197839,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "597edc3174dc9f26badd67c4e81d0e8a58f9dbb3",
            "isKey": false,
            "numCitedBy": 2434,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "Textural features corresponding to human visual perception are very useful for optimum feature selection and texture analyzer design. We approximated in computational form six basic textural features, namely, coarseness, contrast, directionality, line-likeness, regularity, and roughness. In comparison with psychological measurements for human subjects, the computational measures gave good correspondences in rank correlation of 16 typical texture patterns. Similarity measurements using these features were attempted. The discrepancies between human vision and computerized techniques that we encountered in this study indicate fundamental problems in digital analysis of textures. Some of them could be overcome by analyzing their causes and using more sophisticated techniques."
            },
            "slug": "Textural-Features-Corresponding-to-Visual-Tamura-Mori",
            "title": {
                "fragments": [],
                "text": "Textural Features Corresponding to Visual Perception"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The discrepancies between human vision and computerized techniques that are encountered in this study indicate fundamental problems in digital analysis of textures and could be overcome by analyzing their causes and using more sophisticated techniques."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Systems, Man, and Cybernetics"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4723637"
                        ],
                        "name": "J. Mao",
                        "slug": "J.-Mao",
                        "structuredName": {
                            "firstName": "Jianchang",
                            "lastName": "Mao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mao"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145295484"
                        ],
                        "name": "Anil K. Jain",
                        "slug": "Anil-K.-Jain",
                        "structuredName": {
                            "firstName": "Anil",
                            "lastName": "Jain",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anil K. Jain"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 11686184,
            "fieldsOfStudy": [
                "Mathematics",
                "Environmental Science",
                "Computer Science"
            ],
            "id": "0b1c14ccf1aad87f215bfa5c6678d975d44ffb3a",
            "isKey": false,
            "numCitedBy": 795,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Texture-classification-and-segmentation-using-Mao-Jain",
            "title": {
                "fragments": [],
                "text": "Texture classification and segmentation using multiresolution simultaneous autoregressive models"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719389"
                        ],
                        "name": "Rosalind W. Picard",
                        "slug": "Rosalind-W.-Picard",
                        "structuredName": {
                            "firstName": "Rosalind",
                            "lastName": "Picard",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rosalind W. Picard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "13687267"
                        ],
                        "name": "Tanweer Kabir",
                        "slug": "Tanweer-Kabir",
                        "structuredName": {
                            "firstName": "Tanweer",
                            "lastName": "Kabir",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tanweer Kabir"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2170732251"
                        ],
                        "name": "Fang Liu",
                        "slug": "Fang-Liu",
                        "structuredName": {
                            "firstName": "Fang",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fang Liu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6884754,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2cdfb65cb9d565f831fe11d048c8958c2c5e40f4",
            "isKey": false,
            "numCitedBy": 149,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The Brodatz Album has become the de facto standard for evaluating texture algorithms, with hundreds of studies having been applied to small sets of its images. The authors compare two powerful recognition algorithms, principal components analysis and multiscale autoregressive models, by evaluating them on a 999-image database derived from the entire Brodatz Album. The variety of homogeneous and nonhomogeneous images studied is thus nearly an order of magnitude larger than has been compared before, giving one snapshot of the state of the art in real-time texture recognition.<<ETX>>"
            },
            "slug": "Real-time-recognition-with-the-entire-Brodatz-Picard-Kabir",
            "title": {
                "fragments": [],
                "text": "Real-time recognition with the entire Brodatz texture database"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The authors compare two powerful recognition algorithms, principal components analysis and multiscale autoregressive models, by evaluating them on a 999-image database derived from the entire Brodatz Album, giving one snapshot of the state of the art in real-time texture recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719389"
                        ],
                        "name": "Rosalind W. Picard",
                        "slug": "Rosalind-W.-Picard",
                        "structuredName": {
                            "firstName": "Rosalind",
                            "lastName": "Picard",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rosalind W. Picard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "13687267"
                        ],
                        "name": "Tanweer Kabir",
                        "slug": "Tanweer-Kabir",
                        "structuredName": {
                            "firstName": "Tanweer",
                            "lastName": "Kabir",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tanweer Kabir"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14621455,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6e746ad498b099fa0db388134571cb69f213ab25",
            "isKey": false,
            "numCitedBy": 135,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Automated searching through large sets of images to find a pattern 'similar to this one' is considered. A key recognition method is evaluated on a library of almost 1000 images, based on the entire Brodatz texture album. The features used for searching rely on a significant improvement to the traditional Karhunen-Loeve (KL) transform which makes it shift-invariant. Results are shown for a variety of false alarm rates and for different subsets of KL features.<<ETX>>"
            },
            "slug": "Finding-similar-patterns-in-large-image-databases-Picard-Kabir",
            "title": {
                "fragments": [],
                "text": "Finding similar patterns in large image databases"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "A key recognition method is evaluated on a library of almost 1000 images, based on the entire Brodatz texture album, which relies on a significant improvement to the traditional Karhunen-Loeve transform which makes it shift-invariant."
            },
            "venue": {
                "fragments": [],
                "text": "1993 IEEE International Conference on Acoustics, Speech, and Signal Processing"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144994682"
                        ],
                        "name": "A. Pentland",
                        "slug": "A.-Pentland",
                        "structuredName": {
                            "firstName": "Alex",
                            "lastName": "Pentland",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pentland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719389"
                        ],
                        "name": "Rosalind W. Picard",
                        "slug": "Rosalind-W.-Picard",
                        "structuredName": {
                            "firstName": "Rosalind",
                            "lastName": "Picard",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rosalind W. Picard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749590"
                        ],
                        "name": "S. Sclaroff",
                        "slug": "S.-Sclaroff",
                        "structuredName": {
                            "firstName": "Stan",
                            "lastName": "Sclaroff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sclaroff"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 64046874,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8c051cc68b398327aa6e54b8aadf20a01da27469",
            "isKey": false,
            "numCitedBy": 433,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe the Photobook system, which is a set of interactive tools for browsing and searching images and image sequences. These tools differ from those used in standard image databases in that they make direct use of the image content rather than relying on annotations. Direct search on image content is made possible by use of semantics-preserving image compression, which reduces images to a small set of perceptually significant coefficients. We describe three Photobook tools in particular: one that allows search based on gray-level appearance, one that uses 2-D shape, and a third that allows search based on textural properties."
            },
            "slug": "Photobook:-tools-for-content-based-manipulation-of-Pentland-Picard",
            "title": {
                "fragments": [],
                "text": "Photobook: tools for content-based manipulation of image databases"
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "The Photobook system is described, which is a set of interactive tools for browsing and searching images and image sequences that differ from those used in standard image databases in that they make direct use of the image content rather than relying on annotations."
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32583901"
                        ],
                        "name": "R. Kashyap",
                        "slug": "R.-Kashyap",
                        "structuredName": {
                            "firstName": "Rangasami",
                            "lastName": "Kashyap",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kashyap"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9215658"
                        ],
                        "name": "R. Chellappa",
                        "slug": "R.-Chellappa",
                        "structuredName": {
                            "firstName": "Rama",
                            "lastName": "Chellappa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Chellappa"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32241200,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "eaaacf135e5a63210fd7ec6244b519d14f384627",
            "isKey": false,
            "numCitedBy": 478,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Some aspects of statistical inference for a class of spatial-interaction models for finite images are presented: primarily the simultaneous autoregressive (SAR) models and conditional Markov (CM) models. Each of these models is characterized by a set of neighbors, a set of coefficients, and a noise sequence of specified characteristics. We are concerned with two problems: the estimation of the unknown parameters in both SAR and CM models and the choice of an appropriate model from a class of such competing models. Assuming Gaussian-distributed variables, we discuss maximum likelihood (ML) estimation methods. In general, the ML scheme leads to nonlinear optimization problems. To avoid excessive computation, an iterative scheme is given for SAR models, which gives approximate ML estimates in the Gaussian case and reasonably good estimates in some non-Gaussian situations as well. Likewise, for CM models, an easily computable consistent estimate is given. The asymptotic mean-squared error (mse) of this estimate for a four-neighbor CM model is shown tn be substantially less than the mse of the popular coding estimate. Asymptotically consistent decision rules are given for choosing an appropriate SAR or CM model. The usefulness of the estimation scheme and the decision rule for the choice of neighbors is illustrated by using synthetic patterns. Synthetic patterns obeying known SAR and CM models are generated, and the models corresponding to true and several competing neighbor sets are fitted. The estimation scheme yields estimates close to the parameters of the true models, and the decision rule for the choice of neighbors picks up the true model from the class of competing models."
            },
            "slug": "Estimation-and-choice-of-neighbors-in-models-of-Kashyap-Chellappa",
            "title": {
                "fragments": [],
                "text": "Estimation and choice of neighbors in spatial-interaction models of images"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Some aspects of statistical inference for a class of spatial-interaction models for finite images are presented: primarily the simultaneous autoregressive (SAR) models and conditional Markov (CM) models."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3218315"
                        ],
                        "name": "Tianhorng Chang",
                        "slug": "Tianhorng-Chang",
                        "structuredName": {
                            "firstName": "Tianhorng",
                            "lastName": "Chang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tianhorng Chang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9363144"
                        ],
                        "name": "C.-C. Jay Kuo",
                        "slug": "C.-C.-Jay-Kuo",
                        "structuredName": {
                            "firstName": "C.-C.",
                            "lastName": "Kuo",
                            "middleNames": [
                                "Jay"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C.-C. Jay Kuo"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12508411,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3f466c276cc237759eb2d078ce03c82940d3d30c",
            "isKey": false,
            "numCitedBy": 1565,
            "numCiting": 53,
            "paperAbstract": {
                "fragments": [],
                "text": "A multiresolution approach based on a modified wavelet transform called the tree-structured wavelet transform or wavelet packets is proposed. The development of this transform is motivated by the observation that a large class of natural textures can be modeled as quasi-periodic signals whose dominant frequencies are located in the middle frequency channels. With the transform, it is possible to zoom into any desired frequency channels for further decomposition. In contrast, the conventional pyramid-structured wavelet transform performs further decomposition in low-frequency channels. A progressive texture classification algorithm which is not only computationally attractive but also has excellent performance is developed. The performance of the present method is compared with that of several other methods."
            },
            "slug": "Texture-analysis-and-classification-with-wavelet-Chang-Kuo",
            "title": {
                "fragments": [],
                "text": "Texture analysis and classification with tree-structured wavelet transform"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A progressive texture classification algorithm which is not only computationally attractive but also has excellent performance is developed and is compared with that of several other methods."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143766793"
                        ],
                        "name": "A. Rosenfeld",
                        "slug": "A.-Rosenfeld",
                        "structuredName": {
                            "firstName": "Azriel",
                            "lastName": "Rosenfeld",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rosenfeld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1693428"
                        ],
                        "name": "L. Davis",
                        "slug": "L.-Davis",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Davis",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Davis"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 22338074,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "ae67d5f3a4a8adbbb9174a86a2827c076afe3452",
            "isKey": false,
            "numCitedBy": 102,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper discusses image segmentation techniques from the standpoint of the assumptions that an image should satisfy in order for a particular technique to be applicable to it. These assumptions, which are often not stated explicitly, can be regarded as (perhaps informal) \"models\" for classes of images. The paper emphasizes two basic classes of models: statistical models that describe the pixel population in an image or region, and spatial models that describe the decomposition of an image into regions."
            },
            "slug": "Image-segmentation-and-image-models-Rosenfeld-Davis",
            "title": {
                "fragments": [],
                "text": "Image segmentation and image models"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This paper discusses image segmentation techniques from the standpoint of the assumptions that an image should satisfy in order for a particular technique to be applicable to it."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IEEE"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723832"
                        ],
                        "name": "J. M. Francos",
                        "slug": "J.-M.-Francos",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Francos",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. M. Francos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144359964"
                        ],
                        "name": "A. Meiri",
                        "slug": "A.-Meiri",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Meiri",
                            "middleNames": [
                                "Zvi"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Meiri"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2207042"
                        ],
                        "name": "B. Porat",
                        "slug": "B.-Porat",
                        "structuredName": {
                            "firstName": "Boaz",
                            "lastName": "Porat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Porat"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 299944,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4b81120e9b48a9d9ec6ddbc4fc990d048ba811d4",
            "isKey": false,
            "numCitedBy": 35,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Imposing a total-order on a regular 2-D discrete random eld induces an orthogonal decomposition of the random eld into two components: A purely-indeterministic eld and a deterministic one. The deterministic component is further orthogonally decomposed into a half-plane deterministic eld and a countable number of mutually orthogonal evanescent elds. Each of the evanescent elds is generated by the column-to-column innovations of the deterministic eld with respect to a di erent non-symmetrical-half-plane total-ordering de nition. The half-plane deterministic eld has no innovations, nor column-to-column innovations, with respect to any non-symmetrical-half-plane total-ordering de nition. This decomposition results in a corresponding decomposition of the spectral measure of the regular random eld into a countable sum of mutually singular spectral measures."
            },
            "slug": "A-Wold-Like-Decomposition-of-2-D-Discrete-Random-Francos-Meiri",
            "title": {
                "fragments": [],
                "text": "A Wold-Like Decomposition of 2-D Discrete Homogeneous Random Fields"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "97306284"
                        ],
                        "name": "K. Fu",
                        "slug": "K.-Fu",
                        "structuredName": {
                            "firstName": "King-Sun",
                            "lastName": "Fu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Fu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398005725"
                        ],
                        "name": "J. Mui",
                        "slug": "J.-Mui",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Mui",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mui"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 205011878,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fe7b4e6250f2f3152eeec06752ae048f46e1fc0a",
            "isKey": false,
            "numCitedBy": 865,
            "numCiting": 94,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-survey-on-image-segmentation-Fu-Mui",
            "title": {
                "fragments": [],
                "text": "A survey on image segmentation"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723300"
                        ],
                        "name": "T. Marzetta",
                        "slug": "T.-Marzetta",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Marzetta",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Marzetta"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122500607,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "71f6a6d4f8079e1386422ddc0c11dac8fcfae1eb",
            "isKey": false,
            "numCitedBy": 127,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, a number of results in one-dimensional (1-D) linear prediction theory are extended to the two-dimensional (2-D) case. It is shown that the class of 2-D minimum mean-square linear prediction error filters with continuous support have the minimum-phase property and the correlation-matching property, and that they can be solved by means of a 2-D Levinson algorithm. A significant practical result to emerge from this theory is a reflection coefficient representation for 2-D minimum-phase filters. This representation provides a domain in which to construct 2-D filters, such that the minimum-phase condition is automatically satisfied."
            },
            "slug": "Two-dimensional-linear-prediction:-Autocorrelation-Marzetta",
            "title": {
                "fragments": [],
                "text": "Two-dimensional linear prediction: Autocorrelation arrays, minimum-phase prediction error filters, and reflection coefficient arrays"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145192271"
                        ],
                        "name": "P. Whittle",
                        "slug": "P.-Whittle",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Whittle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Whittle"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122961058,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "609acdfe168e7772b553d803e584cbfc8b9cea1f",
            "isKey": false,
            "numCitedBy": 1508,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "The sampling theory of stationary processes in space is not completely analogous to that of stationary time series, due to the fact that the variate of a time series is influenced only by past values, while for a spatial process dependence extends in all directions. This point is elaborated in ?? 2-4. The estimation and test theory developed in ? 7 is applied in ? 8 to uniformity data for wheat and oranges. The final section is devoted to an examination of some particular two-dimensional processes."
            },
            "slug": "ON-STATIONARY-PROCESSES-IN-THE-PLANE-Whittle",
            "title": {
                "fragments": [],
                "text": "ON STATIONARY PROCESSES IN THE PLANE"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50012345"
                        ],
                        "name": "W. Rudin",
                        "slug": "W.-Rudin",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Rudin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Rudin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 119027153,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f20b8e819512d17f59435043a18573127fea7d82",
            "isKey": false,
            "numCitedBy": 6995,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Preface Prologue: The Exponential Function Chapter 1: Abstract Integration Set-theoretic notations and terminology The concept of measurability Simple functions Elementary properties of measures Arithmetic in [0, ] Integration of positive functions Integration of complex functions The role played by sets of measure zero Exercises Chapter 2: Positive Borel Measures Vector spaces Topological preliminaries The Riesz representation theorem Regularity properties of Borel measures Lebesgue measure Continuity properties of measurable functions Exercises Chapter 3: Lp-Spaces Convex functions and inequalities The Lp-spaces Approximation by continuous functions Exercises Chapter 4: Elementary Hilbert Space Theory Inner products and linear functionals Orthonormal sets Trigonometric series Exercises Chapter 5: Examples of Banach Space Techniques Banach spaces Consequences of Baire's theorem Fourier series of continuous functions Fourier coefficients of L1-functions The Hahn-Banach theorem An abstract approach to the Poisson integral Exercises Chapter 6: Complex Measures Total variation Absolute continuity Consequences of the Radon-Nikodym theorem Bounded linear functionals on Lp The Riesz representation theorem Exercises Chapter 7: Differentiation Derivatives of measures The fundamental theorem of Calculus Differentiable transformations Exercises Chapter 8: Integration on Product Spaces Measurability on cartesian products Product measures The Fubini theorem Completion of product measures Convolutions Distribution functions Exercises Chapter 9: Fourier Transforms Formal properties The inversion theorem The Plancherel theorem The Banach algebra L1 Exercises Chapter 10: Elementary Properties of Holomorphic Functions Complex differentiation Integration over paths The local Cauchy theorem The power series representation The open mapping theorem The global Cauchy theorem The calculus of residues Exercises Chapter 11: Harmonic Functions The Cauchy-Riemann equations The Poisson integral The mean value property Boundary behavior of Poisson integrals Representation theorems Exercises Chapter 12: The Maximum Modulus Principle Introduction The Schwarz lemma The Phragmen-Lindelof method An interpolation theorem A converse of the maximum modulus theorem Exercises Chapter 13: Approximation by Rational Functions Preparation Runge's theorem The Mittag-Leffler theorem Simply connected regions Exercises Chapter 14: Conformal Mapping Preservation of angles Linear fractional transformations Normal families The Riemann mapping theorem The class L Continuity at the boundary Conformal mapping of an annulus Exercises Chapter 15: Zeros of Holomorphic Functions Infinite Products The Weierstrass factorization theorem An interpolation problem Jensen's formula Blaschke products The Muntz-Szas theorem Exercises Chapter 16: Analytic Continuation Regular points and singular points Continuation along curves The monodromy theorem Construction of a modular function The Picard theorem Exercises Chapter 17: Hp-Spaces Subharmonic functions The spaces Hp and N The theorem of F. and M. Riesz Factorization theorems The shift operator Conjugate functions Exercises Chapter 18: Elementary Theory of Banach Algebras Introduction The invertible elements Ideals and homomorphisms Applications Exercises Chapter 19: Holomorphic Fourier Transforms Introduction Two theorems of Paley and Wiener Quasi-analytic classes The Denjoy-Carleman theorem Exercises Chapter 20: Uniform Approximation by Polynomials Introduction Some lemmas Mergelyan's theorem Exercises Appendix: Hausdorff's Maximality Theorem Notes and Comments Bibliography List of Special Symbols Index"
            },
            "slug": "Real-and-complex-analysis-Rudin",
            "title": {
                "fragments": [],
                "text": "Real and complex analysis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723832"
                        ],
                        "name": "J. M. Francos",
                        "slug": "J.-M.-Francos",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Francos",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. M. Francos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144359964"
                        ],
                        "name": "A. Meiri",
                        "slug": "A.-Meiri",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Meiri",
                            "middleNames": [
                                "Zvi"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Meiri"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2207042"
                        ],
                        "name": "B. Porat",
                        "slug": "B.-Porat",
                        "structuredName": {
                            "firstName": "Boaz",
                            "lastName": "Porat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Porat"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 122216506,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "42f5c5d2ccba22ee43d99d1a60127b21f57f3dae",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Wold-Like-Decomposition-of-Two-Dimensional-Random-Francos-Meiri",
            "title": {
                "fragments": [],
                "text": "A Wold-Like Decomposition of Two-Dimensional Discrete Homogeneous Random Fields"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "corpusId": 204861607,
            "fieldsOfStudy": [],
            "id": "97841ca2a546e7527823004c733c82456489ad74",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Maximum likelihood parameter estimation of textures using a wold-decomposition based model"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Image Processing"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723832"
                        ],
                        "name": "J. M. Francos",
                        "slug": "J.-M.-Francos",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Francos",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. M. Francos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 117466313,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "182d727a57d927095c637414890329142a64815b",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "7-Orthogonal-decompositions-of-2D-random-fields-and-Francos",
            "title": {
                "fragments": [],
                "text": "7 Orthogonal decompositions of 2D random fields and their applications for 2D spectral estimation"
            },
            "venue": {
                "fragments": [],
                "text": "Signal Processing and its Applications"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50012345"
                        ],
                        "name": "W. Rudin",
                        "slug": "W.-Rudin",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Rudin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Rudin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 115678964,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "60bf28bc5d451235829bd5dd3329df3c97bd7795",
            "isKey": false,
            "numCitedBy": 1405,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Real-and-complex-analysis,-3rd-ed.-Rudin",
            "title": {
                "fragments": [],
                "text": "Real and complex analysis, 3rd ed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31421868"
                        ],
                        "name": "C. Richardson",
                        "slug": "C.-Richardson",
                        "structuredName": {
                            "firstName": "Craig",
                            "lastName": "Richardson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Richardson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1693333"
                        ],
                        "name": "R. Schafer",
                        "slug": "R.-Schafer",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Schafer",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Schafer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 64392408,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f9235e6c51c6a1ab6cb5d3575e079a68ec0da239",
            "isKey": false,
            "numCitedBy": 2,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-symbolic-manipulation-and-analysis-of-Richardson-Schafer",
            "title": {
                "fragments": [],
                "text": "The symbolic manipulation and analysis of morphological algorithms"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62654730,
            "fieldsOfStudy": [],
            "id": "926b5fd5c452325b2216acb6db9ff4eb7087ce8e",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Towards a texture naming system: Identifying relevant dimensions of texture"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings Visualization '93"
            },
            "year": 1993
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 26,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/Periodicity,-Directionality,-and-Randomness:-Wold-Liu-Picard/b0df54adafa6eb7743e75d5cf0d7d92c1c1eaa72?sort=total-citations"
}