{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145081362"
                        ],
                        "name": "A. Yuille",
                        "slug": "A.-Yuille",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Yuille",
                            "middleNames": [
                                "Loddon"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Yuille"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 67846367,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "78f69782f0be04c8a321316c29e82bc8a728db7a",
            "isKey": false,
            "numCitedBy": 106,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "We prove that the scale map of the zero crossings of almost all signals filtered by a Gaussian filter of variable size determines the signal uniquely, up to a constant scaling. The proof assumes that the filtered signal can be represented as a polynomial of finite, albeit possibly high, order. The result applies to zero and level crossings of linear differential operators of Gaussian filters. In this case the signal is determined uniquely, modulus the null space of the linear operator. The theorem can be extended to two-dimensional functions. These results are reminiscent of Logan’s theorem [ Bell Syst. Tech. J.56, 487 ( 1977)]. They imply that extrema of derivatives at different scales are a complete representation of a signal. They are especially relevant for computational vision in the case of the Laplacian operator acting on image intensities, and they suggest rigorous foundations for the primal sketch."
            },
            "slug": "Fingerprints-theorems-for-zero-crossings-Yuille-Poggio",
            "title": {
                "fragments": [],
                "text": "Fingerprints theorems for zero crossings"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48614929"
                        ],
                        "name": "J. Babaud",
                        "slug": "J.-Babaud",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Babaud",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Babaud"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2700207"
                        ],
                        "name": "M. Baudin",
                        "slug": "M.-Baudin",
                        "structuredName": {
                            "firstName": "Michel",
                            "lastName": "Baudin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Baudin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35106875"
                        ],
                        "name": "R. Duda",
                        "slug": "R.-Duda",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Duda",
                            "middleNames": [
                                "O."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Duda"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 18295906,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fd9c54a47a6763ddf1a1d0fa7ba2323d3d871a6b",
            "isKey": false,
            "numCitedBy": 859,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Scale-space filtering constructs hierarchic symbolic signal descriptions by transforming the signal into a continuum of versions of the original signal convolved with a kernal containing a scale or bandwidth parameter. It is shown that the Gaussian probability density function is the only kernel in a broad class for which first-order maxima and minima, respectively, increase and decrease when the bandwidth of the filter is increased. The consequences of this result are explored when the signal¿or its image by a linear differential operator¿is analyzed in terms of zero-crossing contours of the transform in scale-space."
            },
            "slug": "Uniqueness-of-the-Gaussian-Kernel-for-Scale-Space-Babaud-Witkin",
            "title": {
                "fragments": [],
                "text": "Uniqueness of the Gaussian Kernel for Scale-Space Filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is shown that the Gaussian probability density function is the only kernel in a broad class for which first-order maxima and minima, respectively, increase and decrease when the bandwidth of the filter is increased."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729041"
                        ],
                        "name": "J. Canny",
                        "slug": "J.-Canny",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Canny",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Canny"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119706616,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9cbd5a66c1198d5a14f13e03483b69321024444b",
            "isKey": false,
            "numCitedBy": 1030,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The problem of detecting intensity changes in images is canonical in vision. Edge detection operators are typically designed to optimally estimate first or second derivative over some (usually small) support. Other criteria such as output signal to noise ratio or bandwidth have also been been argued for. This thesis is an attempt to formulate a set of edge detection criteria that capture as directly as possible the desirable properties of an edge operator. Variational techniques are used to find a solution over the space of all linear shift invariant operators. The first criterion is that the detector have low probability of error i.e. failing to mark edges or falsely marking non-edges. The second is that the marked points should b The third criterion is that there should be low probability of more than one response to a single edge. The technique is used to find optimal operators for step edges and for extended impulse profiles (ridges or valleys in two dimensions). The extension of the one dimensional operators to two dimensions is then discussed. The result is a set of operators of varying width, length and orientation. The problem of combining these outputs into a single description is discussed, and a set of heuristics for the integration are given. (Author)"
            },
            "slug": "Finding-Edges-and-Lines-in-Images-Canny",
            "title": {
                "fragments": [],
                "text": "Finding Edges and Lines in Images"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This thesis is an attempt to formulate a set of edge detection criteria that capture as directly as possible the desirable properties of an edge operator."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30550574,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4078e3f9526f7a0e9a6f4dada6bb4840af38db62",
            "isKey": false,
            "numCitedBy": 47,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "A hitherto unnoticed singularity of scale space occurs only at isolated points in scale space. Thus it does not generically occur for single images, but it can occur occasionally in members of time sequences (say). It occurs at those critical points of the image at which the Laplacean of the illuminance vanishes (a nongeneric condition). The structure of scale space in an infinitesimal neighborhood of such a singularity is explored. The effect of the singularity of mappings between copies of an image at different levels of resolution is evaluated and checked with a numerical calculation. >"
            },
            "slug": "A-Hitherto-Unnoticed-Singularity-of-Scale-Space-Koenderink",
            "title": {
                "fragments": [],
                "text": "A Hitherto Unnoticed Singularity of Scale-Space"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The structure of scale space in an infinitesimal neighborhood of such a singularity is explored and the effect of the singularity of mappings between copies of an image at different levels of resolution is evaluated and checked with a numerical calculation."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30489560"
                        ],
                        "name": "R. Hummel",
                        "slug": "R.-Hummel",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Hummel",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hummel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 43332911,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "306ce05948c564ccdbadb09f778a57556ea922b9",
            "isKey": false,
            "numCitedBy": 44,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Receptive fields in the retina indicate the first measurements taken over the (discrete) visual image. Why are they circular surround with an excitatory/inhibitory structure? We hypothesize that this provides a representation of the visual information in a form suitable for transmission over the optic nerve, a rather limited channel, that can then be extended into a variety of representations at the cortex. These cortical representations span a range of sizes and functionally separate positive and negative contrast data, precisely as is required for further processing. Our scheme is both physiologically and psychophysically plausible. In particular, we derive an explicit formula for constructing large receptive fields from small ones, and introduce the notion of de-blurring to derive interpolation filters for hyperacuity. A mathematical requirement of our scheme is a form of separation between positive and negative contrast data, a nonlinearity that we predict will agree with observations. Furthermore, the mathematics that we utilize are more naturally applicable to physiological models based on Gaussian than are (Fourier) spatial frequencies."
            },
            "slug": "Receptive-fields-and-the-representation-of-visual-Zucker-Hummel",
            "title": {
                "fragments": [],
                "text": "Receptive fields and the representation of visual information."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "An explicit formula for constructing large receptive fields from small ones is derived, and the notion of de-blurring to derive interpolation filters for hyperacuity is introduced."
            },
            "venue": {
                "fragments": [],
                "text": "Human neurobiology"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107584303"
                        ],
                        "name": "J. P. Jones",
                        "slug": "J.-P.-Jones",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Jones",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. P. Jones"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3459632"
                        ],
                        "name": "L. Palmer",
                        "slug": "L.-Palmer",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Palmer",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Palmer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16809045,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "0dbf797d5b34f40d16eeadfa7a5b4543c2af2c11",
            "isKey": false,
            "numCitedBy": 1709,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Using the two-dimensional (2D) spatial and spectral response profiles described in the previous two reports, we test Daugman's generalization of Marcelja's hypothesis that simple receptive fields belong to a class of linear spatial filters analogous to those described by Gabor and referred to here as 2D Gabor filters. 2. In the space domain, we found 2D Gabor filters that fit the 2D spatial response profile of each simple cell in the least-squared error sense (with a simplex algorithm), and we show that the residual error is devoid of spatial structure and statistically indistinguishable from random error. 3. Although a rigorous statistical approach was not possible with our spectral data, we also found a Gabor function that fit the 2D spectral response profile of each simple cell and observed that the residual errors are everywhere small and unstructured. 4. As an assay of spatial linearity in two dimensions, on which the applicability of Gabor theory is dependent, we compare the filter parameters estimated from the independent 2D spatial and spectral measurements described above. Estimates of most parameters from the two domains are highly correlated, indicating that assumptions about spatial linearity are valid. 5. Finally, we show that the functional form of the 2D Gabor filter provides a concise mathematical expression, which incorporates the important spatial characteristics of simple receptive fields demonstrated in the previous two reports. Prominent here are 1) Cartesian separable spatial response profiles, 2) spatial receptive fields with staggered subregion placement, 3) Cartesian separable spectral response profiles, 4) spectral response profiles with axes of symmetry not including the origin, and 5) the uniform distribution of spatial phase angles. 6. We conclude that the Gabor function provides a useful and reasonably accurate description of most spatial aspects of simple receptive fields. Thus it seems that an optimal strategy has evolved for sampling images simultaneously in the 2D spatial and spatial frequency domains."
            },
            "slug": "An-evaluation-of-the-two-dimensional-Gabor-filter-Jones-Palmer",
            "title": {
                "fragments": [],
                "text": "An evaluation of the two-dimensional Gabor filter model of simple receptive fields in cat striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It seems that an optimal strategy has evolved for sampling images simultaneously in the 2D spatial and spatial frequency domains and the Gabor function provides a useful and reasonably accurate description of most spatial aspects of simple receptive fields."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152931332"
                        ],
                        "name": "Kah-Chan Low",
                        "slug": "Kah-Chan-Low",
                        "structuredName": {
                            "firstName": "Kah-Chan",
                            "lastName": "Low",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kah-Chan Low"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40490648"
                        ],
                        "name": "J. Coggins",
                        "slug": "J.-Coggins",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Coggins",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Coggins"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122848094,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "0aef914a02e251112d7e9319afd97620e79a8362",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a uniform processing framework for low-level vision computing in which a bank of spatial filters maps the image intensity structure at each pixel into an abstract feature space. Some properties of the filters and the feature space will be described. Local orientation is measured by a vector sum in the feature space as follows: each filter's preferred orientation along with the strength of the filter's output determine the orientation and the length of a vector in the feature space; the vectors for all filters are summed to yield a resultant vector for a particular pixel and scale. The orientation of the resultant vector indicates the local orientation, and the magnitude of the vector indicates the strength of the local orientation preference. Limitations of the vector sum method will be discussed. Our investigations show that the processing framework provides a useful, redundant representation of image structure across orientation and scale."
            },
            "slug": "Multiscale-Vector-Fields-for-Image-Pattern-Low-Coggins",
            "title": {
                "fragments": [],
                "text": "Multiscale Vector Fields for Image Pattern Recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30489560"
                        ],
                        "name": "R. Hummel",
                        "slug": "R.-Hummel",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Hummel",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hummel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1715265"
                        ],
                        "name": "B. Kimia",
                        "slug": "B.-Kimia",
                        "structuredName": {
                            "firstName": "Benjamin",
                            "lastName": "Kimia",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Kimia"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 46205677,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "da1ef9eed001b2219b784f15836434aff463cff6",
            "isKey": false,
            "numCitedBy": 131,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Deblurring-Gaussian-blur-Hummel-Kimia",
            "title": {
                "fragments": [],
                "text": "Deblurring Gaussian blur"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7977369"
                        ],
                        "name": "A. Doorn",
                        "slug": "A.-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "Doorn",
                            "middleNames": [
                                "J.",
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Doorn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6681984,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f1dca22bcbd848b270054fa4af2e1e4e1c81acee",
            "isKey": false,
            "numCitedBy": 53,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "A model is proposed that permits the prediction of contrast detection thresholds for arbitrary spatial patterns. The influence of the inhomogeneous structure of the visual field and a form of spatial integration are incorporated in the model. A hypothetical density function for the spatial sampling units, which specifies the distribution of these units with respect to both size and location, is described. The density function is compared with anatomical and electrophysiological knowledge of the density of retinal and cortical receptive fields. This density function permits a particularly lucid interpretation in terms of pattern processing. It can be considered as a system that permits simultaneous global and focal views of the surroundings. The density function, together with a schematized adaptation behaviour of single units, and an incoherent summation rule permit us to calculate a measure of the mass response, and consequently the threshold function. Predictions of the model are compared with recently obtained psychophysical data. In particular an explanation is offered for certain invariance properties of spatial contrast detection that seems to possess promising generality."
            },
            "slug": "Visual-detection-of-spatial-contrast;-Influence-of-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "Visual detection of spatial contrast; Influence of location in the visual field, target extent and illuminance level"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "A model is proposed that permits the prediction of contrast detection thresholds for arbitrary spatial patterns and an explanation is offered for certain invariance properties of spatial contrast detection that seems to possess promising generality."
            },
            "venue": {
                "fragments": [],
                "text": "Biological Cybernetics"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "71335571"
                        ],
                        "name": "G. J. Burton",
                        "slug": "G.-J.-Burton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Burton",
                            "middleNames": [
                                "John"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. J. Burton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3435021"
                        ],
                        "name": "N. Haig",
                        "slug": "N.-Haig",
                        "structuredName": {
                            "firstName": "Nigel",
                            "lastName": "Haig",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Haig"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3432839"
                        ],
                        "name": "I. Moorhead",
                        "slug": "I.-Moorhead",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Moorhead",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Moorhead"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 22839546,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c64245c019ab3c1886c6fe40023f6e334e08d049",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "A new model is proposed that not only exhibits the major properties of primate spatial vision but also has a structure that can be implemented efficiently in a machine vision system. The model is based on a self-similar stack structure with a spatial resolution that varies with eccentricity. It correctly reproduces the visual cortical mapping function, yet it has the important attribute that it can produce invariant responses to local changes in the size and position of image features. By proposing a novel purpose for cortical “bar-detectors”, the model can also produce invariance to more general distortions. The structure of the model allows efficient hierarchical search to be made and it naturally embraces the concept of “attention area”. Exploitation of this model has already confirmed these properties and has also revealed its robust ability to control the focus and gain of machine vision systems."
            },
            "slug": "A-self-similar-stack-model-for-human-and-machine-Burton-Haig",
            "title": {
                "fragments": [],
                "text": "A self-similar stack model for human and machine vision"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A new model is proposed that not only exhibits the major properties of primate spatial vision but also has a structure that can be implemented efficiently in a machine vision system."
            },
            "venue": {
                "fragments": [],
                "text": "Biological Cybernetics"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107584303"
                        ],
                        "name": "J. P. Jones",
                        "slug": "J.-P.-Jones",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Jones",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. P. Jones"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "82179721"
                        ],
                        "name": "A. Stepnoski",
                        "slug": "A.-Stepnoski",
                        "structuredName": {
                            "firstName": "A",
                            "lastName": "Stepnoski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Stepnoski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3459632"
                        ],
                        "name": "L. Palmer",
                        "slug": "L.-Palmer",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Palmer",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Palmer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41153313,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "75a1bd03f96fe18c25b1c3b2e46ce0e5b0fa4aff",
            "isKey": false,
            "numCitedBy": 180,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "1. A quantitative, general purpose method was developed for measuring the responses of visual neurons to stimuli distributed with high resolution over the two-dimensional (2D) spatial frequency domain. The stimuli consisted of drifting sinusoidal gratings of nonsaturating contrasts whose spatial frequency and orientation were drawn in random order from a 16 X 16 array of coordinates covering each neuron's responsive area. This method was applied to a population of 36 simple cells in area 17 of cat. 2. The response of each simple cell to drifting sinusoidal gratings appeared as a rectified sinusoidal modulation of the spike frequency. The degree of rectification varied from cell to cell, but for each cell, the form of the response was constant irrespective of stimulus spatial frequency, orientation, or contrast. The amplitude of the average response at the stimulus temporal frequency was used as the response metric at all spectral coordinates. Variations in this amplitude over two spectral dimensions forms a surface that we call the 2D spectral response profile. 3. For each cell, the 2D spectral response profile was localized to a limited region of the complete 2D spatial frequency domain. In bidirectionally responsive cells, there were two lobes in the surface disposed with mirror symmetry about the origin. In all cells, each lobe exhibited a single maximum and the response decayed smoothly in every direction away from the maximum. Isoresponse amplitude contours were elliptical and often, but not always, elongated about an axis of symmetry passing through the origin. 4. We tested the hypothesis that orientation and spatial frequency tuning are independent by forming scaled radial and angular sections through 2D spectral response profiles. In virtually every case polar separability did not obtain, that is, orientation selectivity depended on spatial frequency and vice versa. 5. In contrast, more than half the cells had 2D spectral response profiles that were Cartesian separable. The 2D spectral response profiles of most of the remaining cells were neither polar nor Cartesian separable, because the response profiles were elongated about an axis of symmetry that did not pass through the origin. 6. These results are discussed in terms of the constraints they place on models of the contributions simple cells make toward the neural representation of images."
            },
            "slug": "The-two-dimensional-spectral-structure-of-simple-in-Jones-Stepnoski",
            "title": {
                "fragments": [],
                "text": "The two-dimensional spectral structure of simple receptive fields in cat striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "A quantitative, general purpose method was developed for measuring the responses of visual neurons to stimuli distributed with high resolution over the two-dimensional (2D) spatial frequency domain and the hypothesis that orientation and spatial frequency tuning are independent was tested by forming scaled radial and angular sections through 2D spectral response profiles."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1828659"
                        ],
                        "name": "A. Watson",
                        "slug": "A.-Watson",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Watson",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Watson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 39719867,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bfbc502970488202325b1bc01b6b23f70a3ace7f",
            "isKey": false,
            "numCitedBy": 249,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "Hypothetical schemes for neural representation of visual information can be expressed as explicit image codes. We may test whether a given code is sufficient, in the sense of retaining all the information that the human perceives, and necessary, in the sense of retaining only that information. The latter is a test of efficiency. Here, we explore a code modeled on the simple cells of the primate striate cortex. The Cortex transform maps a digital image into a set of subimages (layers) that are bandpass in spatial frequency and orientation. The layers are sampled so as to minimize the number of samples and still avoid aliasing. Samples are quantized in a manner that exploits the bandpass contrast-masking properties of human vision. The entropy of the samples is computed to provide a lower bound on the code size. Finally, the image is reconstructed from the code. We devise psychophysical methods for comparing the original and reconstructed images to evaluate the sufficiency of the code. When each resolution is coded at the threshold for detection artifacts, the image-code size is about 1 bit/pixel."
            },
            "slug": "Efficiency-of-a-model-human-image-code.-Watson",
            "title": {
                "fragments": [],
                "text": "Efficiency of a model human image code."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A code modeled on the simple cells of the primate striate cortex is explored, which maps a digital image into a set of subimages (layers) that are bandpass in spatial frequency and orientation and which is reconstructed from the code."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39288044"
                        ],
                        "name": "P. Bijl",
                        "slug": "P.-Bijl",
                        "structuredName": {
                            "firstName": "Piet",
                            "lastName": "Bijl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Bijl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117320485"
                        ],
                        "name": "A. Toet",
                        "slug": "A.-Toet",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Toet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Toet"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 20190719,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "154d8a19d29e5f40a51074e54e51f001545c8a2f",
            "isKey": false,
            "numCitedBy": 33,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Visibility-of-blobs-with-a-gaussian-luminance-Bijl-Koenderink",
            "title": {
                "fragments": [],
                "text": "Visibility of blobs with a gaussian luminance profile"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40490648"
                        ],
                        "name": "J. Coggins",
                        "slug": "J.-Coggins",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Coggins",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Coggins"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4742824"
                        ],
                        "name": "F. Fay",
                        "slug": "F.-Fay",
                        "structuredName": {
                            "firstName": "Fredric",
                            "lastName": "Fay",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Fay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3153590"
                        ],
                        "name": "K. Fogarty",
                        "slug": "K.-Fogarty",
                        "structuredName": {
                            "firstName": "Kevin",
                            "lastName": "Fogarty",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Fogarty"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 4554418,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b8863b857592698e81f0ebf3ca7374687fb2228d",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Development-and-application-of-a-three-dimensional-Coggins-Fay",
            "title": {
                "fragments": [],
                "text": "Development and application of a three-dimensional artificial visual system."
            },
            "venue": {
                "fragments": [],
                "text": "Computer methods and programs in biomedicine"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31913541"
                        ],
                        "name": "W. Richards",
                        "slug": "W.-Richards",
                        "structuredName": {
                            "firstName": "Whitman",
                            "lastName": "Richards",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Richards"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121357892,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "c55241646b748c186682e0665003e71f2d5eb5bc",
            "isKey": false,
            "numCitedBy": 145,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Most computer vision systems use one-dimensional operators to calculate the curvature of boundaries or image contours. However, the more sophisticated biological systems use two-dimensional operators. Here we analyze how curvature can be computed by using two-dimensional operators and show the relation of this approach to the one-dimensional methods currently in use."
            },
            "slug": "Two-dimensional-curvature-operators-Koenderink-Richards",
            "title": {
                "fragments": [],
                "text": "Two-dimensional curvature operators"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "This work analyzes how curvature can be computed by using two-dimensional operators and shows the relation of this approach to the one-dimensional methods currently in use."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40490648"
                        ],
                        "name": "J. Coggins",
                        "slug": "J.-Coggins",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Coggins",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Coggins"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145295484"
                        ],
                        "name": "Anil K. Jain",
                        "slug": "Anil-K.-Jain",
                        "structuredName": {
                            "firstName": "Anil",
                            "lastName": "Jain",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anil K. Jain"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 838965,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "828660c2ed3e50000b8bfdd4bee18ab8e8cf73b6",
            "isKey": false,
            "numCitedBy": 268,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-spatial-filtering-approach-to-texture-analysis-Coggins-Jain",
            "title": {
                "fragments": [],
                "text": "A spatial filtering approach to texture analysis"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit. Lett."
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153047795"
                        ],
                        "name": "J. L. Powell",
                        "slug": "J.-L.-Powell",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Powell",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. L. Powell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 125423245,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "df95d7a0d284ebefa54d6a3082630374b7ccdfb8",
            "isKey": false,
            "numCitedBy": 121,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Quantum-Mechanics-Powell",
            "title": {
                "fragments": [],
                "text": "Quantum Mechanics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 17,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Generic-Neighborhood-Operators-Koenderink-Doorn/050bb36fc18c3e93497850d3b664799959c91058?sort=total-citations"
}