{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2422882"
                        ],
                        "name": "M. Clark",
                        "slug": "M.-Clark",
                        "structuredName": {
                            "firstName": "Marianna",
                            "lastName": "Clark",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Clark"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1747569"
                        ],
                        "name": "A. Bovik",
                        "slug": "A.-Bovik",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Bovik",
                            "middleNames": [
                                "Conrad"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bovik"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2966196"
                        ],
                        "name": "W. Geisler",
                        "slug": "W.-Geisler",
                        "structuredName": {
                            "firstName": "Wilson",
                            "lastName": "Geisler",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Geisler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120019074,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "fcf1af9327a55e75138ef17e137acd0831e6f068",
            "isKey": false,
            "numCitedBy": 40,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "A class of 2D filters is proposed for segmenting visible images into regions of uniform texture. The filters used, known as Gabor filters, are optimal in several senses: they have tunable orientation bandwidths, they can be defined to operate over a range of spatial frequency channels, and they obey the uncertainty principle in two dimensions. The filters are interpreted as transforming the image into a modulated narrowband signal whose envelope coincides with the textured region to which the filter is tuned. Moreover, the receptive fields of neurons in the visual cortex are known to have shapes that approximate 2D Gabor filters, whose purpose has been uncertain. We suggest that they may play an important role in texture segmentation/surface perception. The technique is demonstrated using a variety of natural and synthetic textures."
            },
            "slug": "Texture-segmentation-using-a-class-of-narrowband-Clark-Bovik",
            "title": {
                "fragments": [],
                "text": "Texture segmentation using a class of narrowband filters"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is suggested that receptive fields of neurons in the visual cortex are known to have shapes that approximate 2D Gabor filters, whose purpose has been uncertain, and may play an important role in texture segmentation/surface perception."
            },
            "venue": {
                "fragments": [],
                "text": "ICASSP '87. IEEE International Conference on Acoustics, Speech, and Signal Processing"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727801"
                        ],
                        "name": "K. Laws",
                        "slug": "K.-Laws",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Laws",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Laws"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118779721,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "fbf8dfccd3bf1db32f9822e6b1cb5ec40488e8e5",
            "isKey": false,
            "numCitedBy": 869,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The problem of image texture analysis is introduced, and existing approaches are surveyed. An empirical evaluation method is applied to two texture measurement systems, co-occurrence statistics and augmented correlation statistics. A spatial-statistical class of texture measures is then defined and evaluated. It leads to a simple class of texture energy transforms, which perform better than any of the preceding methods. These transforms are very fast, and can be made invariant to changes in luminance, contrast, and rotation without histogram equalization or other preprocessing. Texture energy is measured by filtering with small masks, typically 5x5, then with a moving-window average of the absolute image values. This method, similar to human visual processing, is appropriate for textures with short coherence length or correlation distance. The filter masks are integer-valued and separable, and can be implemented with one-dimensional or 3x3 convolutions. The averaging operation is also very fast, with computing time independent of window size. Texture energy planes may be linearly combined to form a smaller number of discriminant planes. These principal component planes seem to represent natural texture dimensions, and to be more reliable texture measures than the texture energy planes. Texture segmentation or classification may be accomplished using either texture energy or principal component planes as input. This study classified 15x15 blocks of eight natural textures. Accuracies of 72% were achieved with co- occurrence statistics, 65% with augmented correlation statistics, and 94% with texture energy statistics."
            },
            "slug": "Textured-Image-Segmentation-Laws",
            "title": {
                "fragments": [],
                "text": "Textured Image Segmentation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781325"
                        ],
                        "name": "J. Daugman",
                        "slug": "J.-Daugman",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Daugman",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Daugman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40518532,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5faac4d01ce2c09eabb9b025d1b3b16130e6ae00",
            "isKey": false,
            "numCitedBy": 1343,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Two-dimensional-spectral-analysis-of-cortical-field-Daugman",
            "title": {
                "fragments": [],
                "text": "Two-dimensional spectral analysis of cortical receptive field profiles"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23388527,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a76fefea8a0ea13ace7dbaf8dcc8d1122529b204",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "In 1962, Julesz observed that texture pairs with identical second-order statistics but different third- and higher-order statistics were usually not discriminable without scrutiny. Since second-order (dipole) statistics determine the autocorrelation functions and hence the power spectra, this observation also meant that in preattentive perception of texture the phase (position) spectra were ignored. In the last two decades many new classes of texture pairs with identical power spectra have been invented that were not effortlessly discriminable; however, recently (Caelli & Julesz 1978; Caelli et al. 1978; Julesz et al. 1978) several counterexamples were found. In these texture pairs with identical power spectra some local structures of 'quasi-collinearity', 'corner', 'closure' and 'granularity' yielded strong discrimination. These features can be regarded as the fundamental building blocks of form, that is, the essential nonlinearities of the preattentive perceptual system. Here, it will be shown that these counter-examples are not independent of each other, but can be described by two elementary units; bars (line segments) and their terminators. Furthermore, the preattentive texture perception system can count the number of terminators but ignores their positions."
            },
            "slug": "Spatial-nonlinearities-in-the-instantaneous-of-with-Julesz",
            "title": {
                "fragments": [],
                "text": "Spatial nonlinearities in the instantaneous perception of textures with identical power spectra."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It will be shown that these counter-examples are not independent of each other, but can be described by two elementary units; bars (line segments) and their terminators, which means the preattentive texture perception system can count the number of terminators but ignores their positions."
            },
            "venue": {
                "fragments": [],
                "text": "Philosophical transactions of the Royal Society of London. Series B, Biological sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "22761851"
                        ],
                        "name": "H. Nothdurft",
                        "slug": "H.-Nothdurft",
                        "structuredName": {
                            "firstName": "H.",
                            "lastName": "Nothdurft",
                            "middleNames": [
                                "Christoph"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Nothdurft"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9217634,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "381fc29d77b41963e7836e0db2d760399fd967ad",
            "isKey": false,
            "numCitedBy": 122,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Orientation-sensitivity-and-texture-segmentation-in-Nothdurft",
            "title": {
                "fragments": [],
                "text": "Orientation sensitivity and texture segmentation in patterns with different line orientation"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31857045"
                        ],
                        "name": "E. Hildreth",
                        "slug": "E.-Hildreth",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Hildreth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hildreth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2150419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9009c9685754346deb93f316144a9da1f70ffcd8",
            "isKey": false,
            "numCitedBy": 7031,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "A theory of edge detection is presented. The analysis proceeds in two parts. (1) Intensity changes, which occur in a natural image over a wide range of scales, are detected separately at different scales. An appropriate filter for this purpose at a given scale is found to be the second derivative of a Gaussian, and it is shown that, provided some simple conditions are satisfied, these primary filters need not be orientation-dependent. Thus, intensity changes at a given scale are best detected by finding the zero values of ∇2G(x, y)* I(x, y) for image I, where G(x, y) is a two-dimensional Gaussian distribution and ∇2 is the Laplacian. The intensity changes thus discovered in each of the channels are then represented by oriented primitives called zero-crossing segments, and evidence is given that this representation is complete. (2) Intensity changes in images arise from surface discontinuities or from reflectance or illumination boundaries, and these all have the property that they are spatially localized. Because of this, the zero-crossing segments from the different channels are not independent, and rules are deduced for combining them into a description of the image. This description is called the raw primal sketch. The theory explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells (see Marr & Ullman 1979)."
            },
            "slug": "Theory-of-edge-detection-Marr-Hildreth",
            "title": {
                "fragments": [],
                "text": "Theory of edge detection"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The theory of edge detection explains several basic psychophysical findings, and the operation of forming oriented zero-crossing segments from the output of centre-surround ∇2G filters acting on the image forms the basis for a physiological model of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781325"
                        ],
                        "name": "J. Daugman",
                        "slug": "J.-Daugman",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Daugman",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Daugman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9271650,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "02f89cd1fd6f013a1a301a292936ff8fb06aff25",
            "isKey": false,
            "numCitedBy": 3420,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "Two-dimensional spatial linear filters are constrained by general uncertainty relations that limit their attainable information resolution for orientation, spatial frequency, and two-dimensional (2D) spatial position. The theoretical lower limit for the joint entropy, or uncertainty, of these variables is achieved by an optimal 2D filter family whose spatial weighting functions are generated by exponentiated bivariate second-order polynomials with complex coefficients, the elliptic generalization of the one-dimensional elementary functions proposed in Gabor's famous theory of communication [J. Inst. Electr. Eng. 93, 429 (1946)]. The set includes filters with various orientation bandwidths, spatial-frequency bandwidths, and spatial dimensions, favoring the extraction of various kinds of information from an image. Each such filter occupies an irreducible quantal volume (corresponding to an independent datum) in a four-dimensional information hyperspace whose axes are interpretable as 2D visual space, orientation, and spatial frequency, and thus such a filter set could subserve an optimally efficient sampling of these variables. Evidence is presented that the 2D receptive-field profiles of simple cells in mammalian visual cortex are well described by members of this optimal 2D filter family, and thus such visual neurons could be said to optimize the general uncertainty relations for joint 2D-spatial-2D-spectral information resolution. The variety of their receptive-field dimensions and orientation and spatial-frequency bandwidths, and the correlations among these, reveal several underlying constraints, particularly in width/length aspect ratio and principal axis organization, suggesting a polar division of labor in occupying the quantal volumes of information hyperspace.(ABSTRACT TRUNCATED AT 250 WORDS)"
            },
            "slug": "Uncertainty-relation-for-resolution-in-space,-and-Daugman",
            "title": {
                "fragments": [],
                "text": "Uncertainty relation for resolution in space, spatial frequency, and orientation optimized by two-dimensional visual cortical filters."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Evidence is presented that the 2D receptive-field profiles of simple cells in mammalian visual cortex are well described by members of this optimal 2D filter family, and thus such visual neurons could be said to optimize the general uncertainty relations for joint 2D-spatial-2D-spectral information resolution."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1925241"
                        ],
                        "name": "D. Pollen",
                        "slug": "D.-Pollen",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Pollen",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pollen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1992154"
                        ],
                        "name": "S. Ronner",
                        "slug": "S.-Ronner",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Ronner",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ronner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23970541,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5ec37637d34c792a3798e9724be81d041ca0ec32",
            "isKey": false,
            "numCitedBy": 376,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper relates to the receptive field properties of neurons in the primary visual cortex, i.e. the striate cortex, to current issues in spatial visual information processing. Particular attention is given to the fact that receptive field profiles of simple cells in the visual cortex often resemble even-symmetric or odd-symmetric Gabor filters; i.e. their receptive field profiles can be described by the product of a Gaussian and either a cosine or sine function. Their spatial frequency tuning is of medium bandwidth (~one octave) which is narrow enough for a cell to distinguish the third harmonic from the fundamental frequency for square-wave gratings of low spatial frequency. The responses of adjacent simple cells, tuned to the same spatial frequency, orientation, and direction, differ in their phase response to drifting sine-wave gratings by approximately either 90° or 180°. This latter result makes it possible to consider two adjacent simple cell pairs as operating like paired Gaussian-attenuated sine and cosine filters of Gabor filters for restricted regions of visual space. The entire set of simple cells provides a complete representation of the visual scene, yet each simple cell is unique in its response properties. At the complex cell stage, the cell's mean firing rate appears to represent the amplitude of a local Fourier coefficient, but phase information is seldom conveyed with much precision in the action potential code."
            },
            "slug": "Visual-cortical-neurons-as-localized-spatial-Pollen-Ronner",
            "title": {
                "fragments": [],
                "text": "Visual cortical neurons as localized spatial frequency filters"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "The receptive field properties of neurons in the primary visual cortex, i.e. the striate cortex, are related to current issues in spatial visual information processing to consider two adjacent simple cell pairs as operating like paired Gaussian-attenuated sine and cosine filters of Gabor filters for restricted regions of visual space."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Systems, Man, and Cybernetics"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2161863"
                        ],
                        "name": "M. Porat",
                        "slug": "M.-Porat",
                        "structuredName": {
                            "firstName": "Moshe",
                            "lastName": "Porat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Porat"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1804190"
                        ],
                        "name": "Y. Zeevi",
                        "slug": "Y.-Zeevi",
                        "structuredName": {
                            "firstName": "Yehoshua",
                            "lastName": "Zeevi",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Zeevi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 32699306,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d32b33fc471844452dc6ea8e04bdf16bae9ec335",
            "isKey": false,
            "numCitedBy": 494,
            "numCiting": 50,
            "paperAbstract": {
                "fragments": [],
                "text": "A scheme suitable for visual information representation in a combined frequency-position space is investigated through image decomposition into a finite set of two-dimensional Gabor elementary functions (GEF). The scheme is generalized to account for the position-dependent Gabor-sampling rate, oversampling, logarithmic frequency scaling and phase-quantization characteristic of the visual system. Comparison of reconstructed signal highlights the advantages of the generalized Gabor scheme in coding typical bandlimited images. It is shown that there exists a tradeoff between the number of frequency components used per position and the number of such clusters (sampling rate) utilized along the spatial coordinate. >"
            },
            "slug": "The-Generalized-Gabor-Scheme-of-Image-in-Biological-Porat-Zeevi",
            "title": {
                "fragments": [],
                "text": "The Generalized Gabor Scheme of Image Representation in Biological and Machine Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is shown that there exists a tradeoff between the number of frequency components used per position and thenumber of such clusters (sampling rate) utilized along the spatial coordinate."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143979395"
                        ],
                        "name": "H. Wechsler",
                        "slug": "H.-Wechsler",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Wechsler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wechsler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 57304800,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a2107ed31b8c7d21c28504fa5ad9e9e5b0cc184b",
            "isKey": false,
            "numCitedBy": 135,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Texture-analysis-—-a-survey-Wechsler",
            "title": {
                "fragments": [],
                "text": "Texture analysis — a survey"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1681236"
                        ],
                        "name": "L. Gool",
                        "slug": "L.-Gool",
                        "structuredName": {
                            "firstName": "Luc",
                            "lastName": "Gool",
                            "middleNames": [
                                "Van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Gool"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1927547"
                        ],
                        "name": "P. Dewaele",
                        "slug": "P.-Dewaele",
                        "structuredName": {
                            "firstName": "Piet",
                            "lastName": "Dewaele",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Dewaele"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1769671"
                        ],
                        "name": "A. Oosterlinck",
                        "slug": "A.-Oosterlinck",
                        "structuredName": {
                            "firstName": "André",
                            "lastName": "Oosterlinck",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Oosterlinck"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10053723,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e615a4bb4f61cc82710a1bf8f6debf5ef8bbd3c1",
            "isKey": false,
            "numCitedBy": 441,
            "numCiting": 84,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Texture-analysis-Anno-1983-Gool-Dewaele",
            "title": {
                "fragments": [],
                "text": "Texture analysis Anno 1983"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153160419"
                        ],
                        "name": "R. Wilson",
                        "slug": "R.-Wilson",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Wilson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38930247"
                        ],
                        "name": "M. Spann",
                        "slug": "M.-Spann",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Spann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Spann"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44575185,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8aebb6c89f379d05482d2f171bb37ab2f2c991d7",
            "isKey": false,
            "numCitedBy": 88,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "For pt.I see ibid., vol.9, no.6, p.787 (1987). The problem of uncertainty in image feature description is discussed, and it is shown how finite prolate spheroidal sequences can be used in the construction of feature descriptions that combine spatial and frequency-domain locality in an optimal way. Methods of constructing such optimal feature sets, which are suitable for graphical implementation, are described, and some generalizations of the quadtree concept are presented. These methods are illustrated by examples from image processing applications, including feature extraction and texture description. The problem of image segmentation is discussed, and the importance of scale invariance in overcoming the limitations imposed by uncertainty is demonstrated. A novel texture segmentation algorithm that is based on a combination of the new feature description and multiresolution techniques is described and shown to give accurate segmentations on a range of synthetic and natural textures. >"
            },
            "slug": "Finite-Prolate-Spheroidal-Sequences-and-their-II:-Wilson-Spann",
            "title": {
                "fragments": [],
                "text": "Finite Prolate Spheroidal Sequences and their Applications II: Image Feature Description and Segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A novel texture segmentation algorithm that is based on a combination of the new feature description and multiresolution techniques is described and shown to give accurate segmentations on a range of synthetic and natural textures."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729041"
                        ],
                        "name": "J. Canny",
                        "slug": "J.-Canny",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Canny",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Canny"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119706616,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9cbd5a66c1198d5a14f13e03483b69321024444b",
            "isKey": false,
            "numCitedBy": 1030,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The problem of detecting intensity changes in images is canonical in vision. Edge detection operators are typically designed to optimally estimate first or second derivative over some (usually small) support. Other criteria such as output signal to noise ratio or bandwidth have also been been argued for. This thesis is an attempt to formulate a set of edge detection criteria that capture as directly as possible the desirable properties of an edge operator. Variational techniques are used to find a solution over the space of all linear shift invariant operators. The first criterion is that the detector have low probability of error i.e. failing to mark edges or falsely marking non-edges. The second is that the marked points should b The third criterion is that there should be low probability of more than one response to a single edge. The technique is used to find optimal operators for step edges and for extended impulse profiles (ridges or valleys in two dimensions). The extension of the one dimensional operators to two dimensions is then discussed. The result is a set of operators of varying width, length and orientation. The problem of combining these outputs into a single description is discussed, and a set of heuristics for the integration are given. (Author)"
            },
            "slug": "Finding-Edges-and-Lines-in-Images-Canny",
            "title": {
                "fragments": [],
                "text": "Finding Edges and Lines in Images"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This thesis is an attempt to formulate a set of edge detection criteria that capture as directly as possible the desirable properties of an edge operator."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1828659"
                        ],
                        "name": "A. Watson",
                        "slug": "A.-Watson",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Watson",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Watson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2066156"
                        ],
                        "name": "A. Ahumada",
                        "slug": "A.-Ahumada",
                        "structuredName": {
                            "firstName": "Albert",
                            "lastName": "Ahumada",
                            "middleNames": [
                                "J."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Ahumada"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18497662,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "352ffa0c26bc0ada4729e0f47ce153d2e3130340",
            "isKey": false,
            "numCitedBy": 1252,
            "numCiting": 51,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a model of how humans sense the velocity of moving images. The model exploits constraints provided by human psychophysics, notably that motion-sensing elements appear tuned for two-dimensional spatial frequency, and by the frequency spectrum of a moving image, namely, that its support lies in the plane in which the temporal frequency equals the dot product of the spatial frequency and the image velocity. The first stage of the model is a set of spatial-frequency-tuned, direction-selective linear sensors. The temporal frequency of the response of each sensor is shown to encode the component of the image velocity in the sensor direction. At the second stage, these components are resolved in order to measure the velocity of image motion at each of a number of spatial locations and spatial frequencies. The model has been applied to several illustrative examples, including apparent motion, coherent gratings, and natural image sequences. The model agrees qualitatively with human perception."
            },
            "slug": "Model-of-human-visual-motion-sensing.-Watson-Ahumada",
            "title": {
                "fragments": [],
                "text": "Model of human visual-motion sensing."
            },
            "tldr": {
                "abstractSimilarityScore": 53,
                "text": "A model of how humans sense the velocity of moving images, using a set of spatial-frequency-tuned, direction-selective linear sensors, agrees qualitatively with human perception."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2137621"
                        ],
                        "name": "W. Lunscher",
                        "slug": "W.-Lunscher",
                        "structuredName": {
                            "firstName": "Wolfram",
                            "lastName": "Lunscher",
                            "middleNames": [
                                "H.",
                                "H.",
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Lunscher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1907701"
                        ],
                        "name": "M. Beddoes",
                        "slug": "M.-Beddoes",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Beddoes",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Beddoes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1026026,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c4fc9da5aec68d40dd9eb21efa840849987a742d",
            "isKey": false,
            "numCitedBy": 87,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper comments on the optimality of the Laplacian of a Gaussian edge detection filter which localizes edges through zero crossings in the filtered image. The arguments of both Marr and Hildreth, and Dickey and Shanmugam are reviewed to establish that the filter is optimal in the sense of maximizing output image energy near edge features. This filter's principal advantage over other edge detectors is that its response is user-adjustable through selection of a single parameter, the Gaussian standard deviation. However, no clear method for the selection of this parameter has been provided. The problem is addressed here by applying the filter to two ideal periodic edge models blurred by a Gaussian distribution point-spread function. The observed response to the edge spacing and blur standard deviation is then translated into a filter parameter design procedure. The problems of optimum filter performance in the presence of additive Gaussian noise are then addressed. The problem of selecting the sampled filter's coefficient word size is dealt with in a companion paper."
            },
            "slug": "Optimal-Edge-Detector-Design-I:-Parameter-Selection-Lunscher-Beddoes",
            "title": {
                "fragments": [],
                "text": "Optimal Edge Detector Design I: Parameter Selection and Noise Effects"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "This paper comments on the optimality of the Laplacian of a Gaussian edge detection filter which localizes edges through zero crossings in the filtered image by applying the filter to two ideal periodic edge models blurred by aGaussian distribution point-spread function."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1952600"
                        ],
                        "name": "M. Webster",
                        "slug": "M.-Webster",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Webster",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Webster"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113588000"
                        ],
                        "name": "R. L. de Valois",
                        "slug": "R.-L.-de-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "de Valois",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. de Valois"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12077774,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "58e6e56adf3dd3181324caf9ec0d8d30a8fc8768",
            "isKey": false,
            "numCitedBy": 222,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "If striate cells had the receptive-field (RF) shapes classically attributed to them, their preferred spatial frequencies would vary considerably with orientation. Other models of RF shape would predict a greater independence between orientation and spatial-frequency tuning. We have examined this by recording the responses of cat striate-cortex cells to a wide range of different spatial-frequency and orientation combinations. In almost all cells studied, peak orientation did not consistently vary with spatial frequency, but the majority of cells showed some change in peak spatial-frequency tuning with orientation. The amount of change in peak spatial frequency tended to be greater for cells that were narrowly tuned for orientation. However, cells narrowly (and also very broadly) tuned for spatial frequency tended to show considerable independence of spatial-frequency and orientation tuning, and in all but a few cells the degree of change was less than predicted by the classic RF model. Such cells were found to fire only to patterns whose local spatial spectra fell within a compact, restricted, roughly circular two-dimensional spatial-frequency region. We conclude that the two-dimensional RF shape of striate cells more closely approximates that predicted by a two-dimensional Gabor model or by a Gaussian-derivative model than it does the classic shape based on the output of geniculate cells with aligned RF's."
            },
            "slug": "Relationship-between-spatial-frequency-and-tuning-Webster-Valois",
            "title": {
                "fragments": [],
                "text": "Relationship between spatial-frequency and orientation tuning of striate-cortex cells."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The two-dimensional RF shape of striate cells more closely approximates that predicted by a two- dimensional Gabor model or by a Gaussian-derivative model than it does the classic shape based on the output of geniculate cells with aligned RF's."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781325"
                        ],
                        "name": "J. Daugman",
                        "slug": "J.-Daugman",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Daugman",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Daugman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1984348,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6513888c5ef473bdbb3167c7b52f0985be071f7a",
            "isKey": false,
            "numCitedBy": 1899,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "A three-layered neural network is described for transforming two-dimensional discrete signals into generalized nonorthogonal 2-D Gabor representations for image analysis, segmentation, and compression. These transforms are conjoint spatial/spectral representations, which provide a complete image description in terms of locally windowed 2-D spectral coordinates embedded within global 2-D spatial coordinates. In the present neural network approach, based on interlaminar interactions involving two layers with fixed weights and one layer with adjustable weights, the network finds coefficients for complete conjoint 2-D Gabor transforms without restrictive conditions. In wavelet expansions based on a biologically inspired log-polar ensemble of dilations, rotations, and translations of a single underlying 2-D Gabor wavelet template, image compression is illustrated with ratios up to 20:1. Also demonstrated is image segmentation based on the clustering of coefficients in the complete 2-D Gabor transform. >"
            },
            "slug": "Complete-discrete-2-D-Gabor-transforms-by-neural-Daugman",
            "title": {
                "fragments": [],
                "text": "Complete discrete 2-D Gabor transforms by neural networks for image analysis and compression"
            },
            "tldr": {
                "abstractSimilarityScore": 53,
                "text": "A three-layered neural network based on interlaminar interactions involving two layers with fixed weights and one layer with adjustable weights finds coefficients for complete conjoint 2-D Gabor transforms without restrictive conditions for image analysis, segmentation, and compression."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Acoust. Speech Signal Process."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784213"
                        ],
                        "name": "R. Bajcsy",
                        "slug": "R.-Bajcsy",
                        "structuredName": {
                            "firstName": "Ruzena",
                            "lastName": "Bajcsy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bajcsy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2921595"
                        ],
                        "name": "L. Lieberman",
                        "slug": "L.-Lieberman",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Lieberman",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Lieberman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61122821,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b1b1d7da789f84cb9edb58a65c76ba749a9aaa26",
            "isKey": false,
            "numCitedBy": 312,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Texture-gradient-as-a-depth-cue-Bajcsy-Lieberman",
            "title": {
                "fragments": [],
                "text": "Texture gradient as a depth cue"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784213"
                        ],
                        "name": "R. Bajcsy",
                        "slug": "R.-Bajcsy",
                        "structuredName": {
                            "firstName": "Ruzena",
                            "lastName": "Bajcsy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bajcsy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6771929,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5fe2197c211d5f8c52e0039e047be5fd249f7e3b",
            "isKey": false,
            "numCitedBy": 121,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "This work deals with computer analysis of textured surfaces. Descriptions of textures are formalized from natural language descriptions. Local texture descriptions are obtained from the directional and non-directional components of the Fourier transform power spectrum. Analytic expressions are derived for orientation, contrast, size, spacing, and in periodic cases, the locations of texture elements. The local descriptions are defined over windows of varying sizes."
            },
            "slug": "Computer-Description-of-Textured-Surfaces-Bajcsy",
            "title": {
                "fragments": [],
                "text": "Computer Description of Textured Surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 85,
                "text": "This work deals with computer analysis of textured surfaces with descriptions of textures formalized from natural language descriptions obtained from the directional and non-directional components of the Fourier transform power spectrum."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3144171"
                        ],
                        "name": "K. Shanmugam",
                        "slug": "K.-Shanmugam",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Shanmugam",
                            "middleNames": [
                                "Sam"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Shanmugam"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1686153"
                        ],
                        "name": "I. Dinstein",
                        "slug": "I.-Dinstein",
                        "structuredName": {
                            "firstName": "Its'hak",
                            "lastName": "Dinstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Dinstein"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 206786900,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1fdb62555eb650662dbe2a6f3985d390861597c2",
            "isKey": false,
            "numCitedBy": 19246,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Texture is one of the important characteristics used in identifying objects or regions of interest in an image, whether the image be a photomicrograph, an aerial photograph, or a satellite image. This paper describes some easily computable textural features based on gray-tone spatial dependancies, and illustrates their application in category-identification tasks of three different kinds of image data: photomicrographs of five kinds of sandstones, 1:20 000 panchromatic aerial photographs of eight land-use categories, and Earth Resources Technology Satellite (ERTS) multispecial imagery containing seven land-use categories. We use two kinds of decision rules: one for which the decision regions are convex polyhedra (a piecewise linear decision rule), and one for which the decision regions are rectangular parallelpipeds (a min-max decision rule). In each experiment the data set was divided into two parts, a training set and a test set. Test set identification accuracy is 89 percent for the photomicrographs, 82 percent for the aerial photographic imagery, and 83 percent for the satellite imagery. These results indicate that the easily computable textural features probably have a general applicability for a wide variety of image-classification applications."
            },
            "slug": "Textural-Features-for-Image-Classification-Haralick-Shanmugam",
            "title": {
                "fragments": [],
                "text": "Textural Features for Image Classification"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "These results indicate that the easily computable textural features based on gray-tone spatial dependancies probably have a general applicability for a wide variety of image-classification applications."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Syst. Man Cybern."
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1698824"
                        ],
                        "name": "S. Zucker",
                        "slug": "S.-Zucker",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Zucker",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zucker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119387966,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "772c92be1481419bf35cfd87e4820c71ca1d029b",
            "isKey": false,
            "numCitedBy": 254,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Finding-structure-in-Co-occurrence-matrices-for-Zucker-Terzopoulos",
            "title": {
                "fragments": [],
                "text": "Finding structure in Co-occurrence matrices for texture analysis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145730992"
                        ],
                        "name": "V. Torre",
                        "slug": "V.-Torre",
                        "structuredName": {
                            "firstName": "Vincent",
                            "lastName": "Torre",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Torre"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1065794,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a8059c598e4f9643eb040685af0d6e7055391048",
            "isKey": false,
            "numCitedBy": 1214,
            "numCiting": 59,
            "paperAbstract": {
                "fragments": [],
                "text": "Edge detection is the process that attempts to characterize the intensity changes in the image in terms of the physical processes that have originated them. A critical, intermediate goal of edge detection is the detection and characterization of significant intensity changes. This paper discusses this part of the edge detection problem. To characterize the types of intensity changes derivatives of different types, and possibly different scales, are needed. Thus, we consider this part of edge detection as a problem in numerical differentiation. We show that numerical differentiation of images is an ill-posed problem in the sense of Hadamard. Differentiation needs to be regularized by a regularizing filtering operation before differentiation. This shows that this part of edge detection consists of two steps, a filtering step and a differentiation step. Following this perspective, the paper discusses in detail the following theoretical aspects of edge detection. 1) The properties of different types of filters-with minimal uncertainty, with a bandpass spectrum, and with limited support-are derived. Minimal uncertainty filters optimize a tradeoff between computational efficiency and regularizing properties. 2) Relationships among several 2-D differential operators are established. In particular, we characterize the relation between the Laplacian and the second directional derivative along the gradient. Zero crossings of the Laplacian are not the only features computed in early vision. 3) Geometrical and topological properties of the zero crossings of differential operators are studied in terms of transversality and Morse theory."
            },
            "slug": "On-Edge-Detection-Torre-Poggio",
            "title": {
                "fragments": [],
                "text": "On Edge Detection"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that numerical differentiation of images is an ill-posed problem in the sense of Hadamard, and that this part of edge detection consists of two steps, a filtering step and a differentiation step."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 24148245,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "a113b95f9f92447cd5d51fbf3c4b5914f6d4b2b3",
            "isKey": false,
            "numCitedBy": 636,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "Recent research in texture discrimination has revealed the existence of a separate “preattentive visual system” that cannot process complex forms, yet can, almost instantaneously, without effort or scrutiny, detect differences in a few local conspicuous features, regardless of where they occur. These features, called “textons”, are elongated blobs (e.g., rectangles, ellipses, or line segments) with specific properties, including color, angular orientation, width, length, binocular and movement disparity, and flicker rate. The ends-of-lines (terminators) and crossings of line segments are also textons. Only differences in the textons or in their density (or number) can be preattentively detected while the positional relationship between neighboring textons passes unnoticed. This kind of positional information is the essence of form perception, and can be extracted only by a time-consuming and spatially restricted process that we call “focal attention”. The aperture of focal attention can be very narrow, even restricted to a minute portion of the fovea, and shifting its locus requires about 50 ms. Thus preattentive vision serves as an “early warning system” by pointing out those loci of texton differences that should be attended to. According to this theory, at any given instant the visual information intake is relatively modest."
            },
            "slug": "Human-factors-and-behavioral-science:-Textons,-the-Julesz-Bergen",
            "title": {
                "fragments": [],
                "text": "Human factors and behavioral science: Textons, the fundamental elements in preattentive vision and perception of textures"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Preattentive vision serves as an “early warning system” by pointing out those loci of texton differences that should be attended to, according to this theory, at any given instant the visual information intake is relatively modest."
            },
            "venue": {
                "fragments": [],
                "text": "The Bell System Technical Journal"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2966196"
                        ],
                        "name": "W. Geisler",
                        "slug": "W.-Geisler",
                        "structuredName": {
                            "firstName": "Wilson",
                            "lastName": "Geisler",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Geisler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2082557151"
                        ],
                        "name": "D. B. Hamilton",
                        "slug": "D.-B.-Hamilton",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hamilton",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. B. Hamilton"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 12078253,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "9a58e3caaafa8dc9749bef41257c7bae75abd67a",
            "isKey": false,
            "numCitedBy": 37,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "Spatial-vision research has been largely concerned with measuring and understanding the consequences of receptive-field properties measured by single-unit recording. However, in order to understand spatial-information processing in the visual system, it is equally essential to know the densities and the distribution patterns of the receptive fields. If the receptive fields are not arrayed properly across the visual field, spatial information will be lost. It has been argued, on the basis of the Whittaker-Shannon sampling theorem, that the receptors of the fovea sample the retinal image at a high enough rate to preserve essentially all the available spatial information. In this paper we show how two-dimensional sampling theory can be used to determine which combinations of receptive-field shapes and sampling patterns would preserve all spatial information from the receptors. This analysis will prove useful for determining, in conjunction with electrophysiological and anatomical evidence, what spatial information is or is not being transmitted by a given stage of the visual pathway. It may also prove useful for developing and testing theories of spatial vision."
            },
            "slug": "Sampling-theory-analysis-of-spatial-vision.-Geisler-Hamilton",
            "title": {
                "fragments": [],
                "text": "Sampling-theory analysis of spatial vision."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Two-dimensional sampling theory can be used to determine which combinations of receptive-field shapes and sampling patterns would preserve all spatial information from the receptors, which will prove useful for determining, in conjunction with electrophysiological and anatomical evidence, what spatial information is or is not being transmitted by a given stage of the visual pathway."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "96943691"
                        ],
                        "name": "Mj Martin Bastiaans",
                        "slug": "Mj-Martin-Bastiaans",
                        "structuredName": {
                            "firstName": "Mj",
                            "lastName": "Bastiaans",
                            "middleNames": [
                                "Martin"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mj Martin Bastiaans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121411206,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1669528da2d7d56bd8ae4c401c01ff48f44795b7",
            "isKey": false,
            "numCitedBy": 165,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The complex spectrogram of a signal is defined as the Fourier transform of the product of the signal and the shifted and complex conjugated version of a so-called window function; it is thus a function of time and frequency, simultaneously, from which the signal can be reconstructed uniquely. It is shown that the complex spectrogram is completely determined by its values on the points of a certain time-frequency lattice. This lattice is exactly the one suggested by Gabor in 1946; it arose in connection with Gabor's sugges-tion to expand a signal into a discrete set of Gaussian elementary signals. Such an expansion is a special case of the more general expansion of a signal into a discrete set of properly shifted and modulated window functions. It is shown that this expansion exists. Furthermore, a set of functions is constructed, which is bi-orthonormal to the set of shifted and modulated window functions. With the help of this bi-orthonormal set of functions, the expansion coefficients can be determined easily."
            },
            "slug": "A-Sampling-Theorem-For-The-Complex-Spectrogram,-And-Bastiaans",
            "title": {
                "fragments": [],
                "text": "A Sampling Theorem For The Complex Spectrogram, And Gabor's Expansion Of A Signal In Gaussian Elementary Signals"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5624877"
                        ],
                        "name": "S. Marčelja",
                        "slug": "S.-Marčelja",
                        "structuredName": {
                            "firstName": "Stjepan",
                            "lastName": "Marčelja",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Marčelja"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23364863,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "85af5a0b7102919e96eebe9143c082fe9e453e46",
            "isKey": false,
            "numCitedBy": 1317,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "On the basis of measured receptive field profiles and spatial frequency tuning characteristics of simple cortical cells, it can be concluded that the representation of an image in the visual cortex must involve both spatial and spatial frequency variables. In a scheme due to Gabor, an image is represented in terms of localized symmetrical and antisymmetrical elementary signals. Both measured receptive fields and measured spatial frequency tuning curves conform closely to the functional form of Gabor elementary signals. It is argued that the visual cortex representation corresponds closely to the Gabor scheme owing to its advantages in treating the subsequent problem of pattern recognition."
            },
            "slug": "Mathematical-description-of-the-responses-of-simple-Marčelja",
            "title": {
                "fragments": [],
                "text": "Mathematical description of the responses of simple cortical cells."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is argued that the visual cortex representation corresponds closely to the Gabor scheme owing to its advantages in treating the subsequent problem of pattern recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "96943691"
                        ],
                        "name": "Mj Martin Bastiaans",
                        "slug": "Mj-Martin-Bastiaans",
                        "structuredName": {
                            "firstName": "Mj",
                            "lastName": "Bastiaans",
                            "middleNames": [
                                "Martin"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mj Martin Bastiaans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122816424,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "9c9d9d6f4d81657c55e8c58f45de272539ff7633",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "Gabor's expansion of a signal into a discrete set of properly shifted and modulated versions of an elementary signal is introduced, and a way to determine the expansion coefficients is derived. The way in which the expansion coefficients are transformed when the signal propagates through a linear system, is described; in particular, the basic coherent-optical system consisting of a 4f-arrangement with rectangular apertures in the input and the Fourier plane, is considered. As a result, the well-known property that a signal which is roughly limited both in space and in spatial frequency has a number of complex degrees of freedom which is equal to the space-bandwidth product, is re-established."
            },
            "slug": "Gabor's-signal-expansion-and-degrees-of-freedom-of-Bastiaans",
            "title": {
                "fragments": [],
                "text": "Gabor's signal expansion and degrees of freedom of a signal"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707107"
                        ],
                        "name": "J. Movshon",
                        "slug": "J.-Movshon",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Movshon",
                            "middleNames": [
                                "Anthony"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Movshon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1935795"
                        ],
                        "name": "I. Thompson",
                        "slug": "I.-Thompson",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Thompson",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Thompson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34941108"
                        ],
                        "name": "D. Tolhurst",
                        "slug": "D.-Tolhurst",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Tolhurst",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tolhurst"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5659259,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d435143b4a7b2d7c56a696504e87db39157c3449",
            "isKey": false,
            "numCitedBy": 963,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "1. We have examined the responses of simple cells in the cat's atriate cortex to visual patterns that were designed to reveal the extent to which these cells may be considered to sum light‐evoked influences linearly across their receptive fields. We used one‐dimensional luminance‐modulated bars and grating as stimuli; their orientation was always the same as the preferred orientation of the neurone under study. The stimuli were presented on an oscilloscope screen by a digital computer, which also accumulated neuronal responses and controlled a randomized sequence of stimulus presentations. 2. The majority of simple cells respond to sinusoidal gratings that are moving or whose contrast is modulated in time in a manner consistent with the hypothesis that they have linear spatial summation. Their responses to moving gratings of all spatial frequencies are modulated in synchrony with the passage of the gratings' bars across their receptive fields, and they do not produce unmodulated responses even at the highest spatial frequencies. Many of these cells respond to temporally modulated stationary gratings simply by changing their response amplitude sinusoidally as the spatial phase of the grating the grating is varied. Nonetheless, their behavior appears to indicate linear spatial summation, since we show in an Appendix that the absence of a 'null' phase in a visual neurone need not indicate non‐linear spatial summation, and further that a linear neurone lacking a 'null' phase should give responses of the form that we have observed in this type of simple cell. 3. A minority of simple cells appears to have significant non‐linearities of spatial summation. These neurones respond to moving gratings of high spatial frequency with a partially or totally unmodulated elevation of firing rate. They have no 'null' phases when tested with stationary gratings, and reveal their non‐linearity by giving responses to gratings of some spatial phases that are composed partly or wholly of even harmonics of the stimulus frequency ('on‐off' responses). 4. We compared simple receptive fields with their sensitivity to sinusoidal gratings of different spatial frequencies. Qualitatively, the most sensitive subregions of simple cells' receptive fields are roughly the same width as the individual bars of the gratings to which they are most sensitive. Quantitatively, their receptive field profiles measured with thin stationary lines, agree well with predicted profiles derived by Fourier synthesis of their spatial frequency tuning curves."
            },
            "slug": "Spatial-summation-in-the-receptive-fields-of-simple-Movshon-Thompson",
            "title": {
                "fragments": [],
                "text": "Spatial summation in the receptive fields of simple cells in the cat's striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "The responses of simple cells in the cat's atriate cortex to visual patterns that were designed to reveal the extent to which these cells may be considered to sum light‐evoked influences linearly across their receptive fields are examined."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746955"
                        ],
                        "name": "M. Bastiaans",
                        "slug": "M.-Bastiaans",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Bastiaans",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Bastiaans"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123734237,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "996bc84d852e9adea2cc30886b14b4727d2f7e45",
            "isKey": false,
            "numCitedBy": 56,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The complex spectrogram of a signal φ(t) is defined by ∫φ(t)g*(t-to)exp[-iwot]dt ; it is, in fact, the Fourier transform of the product of the signal and the complex conjugated and shifted version of a so-called window function g(t). From the complex spectrogram the signal can be reconstructed uniquely. It is shown that the complex spectrogram is completely determined by its values on the points (to=mT, wo=nΩ), where ΩT= 2tt and m and n take all integer values. The lattice of points (mT,nΩ) is exactly the lattice suggested by Gabor as early as 1946; it arose in connection with Gabor's suggestion to expand a signal into a discrete set of Gaussian elementary signals. Such an expansion is a special case of the general expansion ∑∑mn amng(t-mT)exp[inΩt] of a signal into a discrete set of shifted and modulated window functions. It is shown that this expansion exists. Furthermore, a set of functions is constructed, which is bi-orthonormal to the set of shifted and modulated window functions. With the help of this bi-orthonormal set of functions, the expansion coefficients amn can be determined easily."
            },
            "slug": "Sampling-Theorem-For-The-Complex-Spectrogram,-And-A-Bastiaans",
            "title": {
                "fragments": [],
                "text": "Sampling Theorem For The Complex Spectrogram, And Gabor's Expansion Of A Signal In Gaussian Elementary Signals"
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40490648"
                        ],
                        "name": "J. Coggins",
                        "slug": "J.-Coggins",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Coggins",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Coggins"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145295484"
                        ],
                        "name": "Anil K. Jain",
                        "slug": "Anil-K.-Jain",
                        "structuredName": {
                            "firstName": "Anil",
                            "lastName": "Jain",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anil K. Jain"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 838965,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "828660c2ed3e50000b8bfdd4bee18ab8e8cf73b6",
            "isKey": false,
            "numCitedBy": 268,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-spatial-filtering-approach-to-texture-analysis-Coggins-Jain",
            "title": {
                "fragments": [],
                "text": "A spatial filtering approach to texture analysis"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit. Lett."
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5248006,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "33ce6c2f2d5128be710fb3ddd8f1117758b9b4a9",
            "isKey": false,
            "numCitedBy": 3532,
            "numCiting": 80,
            "paperAbstract": {
                "fragments": [],
                "text": "A motion sequence may be represented as a single pattern in x-y-t space; a velocity of motion corresponds to a three-dimensional orientation in this space. Motion sinformation can be extracted by a system that responds to the oriented spatiotemporal energy. We discuss a class of models for human motion mechanisms in which the first stage consists of linear filters that are oriented in space-time and tuned in spatial frequency. The outputs of quadrature pairs of such filters are squared and summed to give a measure of motion energy. These responses are then fed into an opponent stage. Energy models can be built from elements that are consistent with known physiology and psychophysics, and they permit a qualitative understanding of a variety of motion phenomena."
            },
            "slug": "Spatiotemporal-energy-models-for-the-perception-of-Adelson-Bergen",
            "title": {
                "fragments": [],
                "text": "Spatiotemporal energy models for the perception of motion."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A class of models for human motion mechanisms in which the first stage consists of linear filters that are oriented in space-time and tuned in spatial frequency that permit a qualitative understanding of a variety of motion phenomena."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145600913"
                        ],
                        "name": "C. H. Chen",
                        "slug": "C.-H.-Chen",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Chen",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. H. Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46330190"
                        ],
                        "name": "G. Young",
                        "slug": "G.-Young",
                        "structuredName": {
                            "firstName": "Gia-Kinh",
                            "lastName": "Young",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Young"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 116949879,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "621f40f25cf947b5dc0043f4b416755c9b282695",
            "isKey": false,
            "numCitedBy": 52,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Prior spectral feature study was not successful because of inaccuracy in 2-D spectral estimation. In this report, a generalization of Lim-Malik method is used to accurately estimate the ring and wedge spectral features for classification of textural images with a typical performance of over 80 percent correct classification for six texture classes. The results compare favorably with other texture features but require less computation using iterative algorithm. (Author)"
            },
            "slug": "A-Study-of-Texture-Classification-Using-Spectral-Chen-Young",
            "title": {
                "fragments": [],
                "text": "A Study of Texture Classification Using Spectral Features"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39409429"
                        ],
                        "name": "R. L. Valois",
                        "slug": "R.-L.-Valois",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "Valois",
                            "middleNames": [
                                "L.",
                                "de"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. Valois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2129244"
                        ],
                        "name": "D. G. Albrecht",
                        "slug": "D.-G.-Albrecht",
                        "structuredName": {
                            "firstName": "Duane",
                            "lastName": "Albrecht",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. G. Albrecht"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40471674"
                        ],
                        "name": "Lisa G. Thorell",
                        "slug": "Lisa-G.-Thorell",
                        "structuredName": {
                            "firstName": "Lisa",
                            "lastName": "Thorell",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lisa G. Thorell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118706047,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6dd77b9c70c3cbcc2a29992b82d5e4612249fc40",
            "isKey": false,
            "numCitedBy": 83,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Until the pioneering work of HUBEL and WIESEL (1, 2, 3), visual scientists could do little more than guess about the functions of cells in visual cortex and the manner in which complex patterns were analyzed. Their initial reports, however, established that cells in Area 17 of cat (and also monkey) were quite unresponsive to full-field illumination, requiring more specific patterns to elicit a response. Their receptive field (RF) maps of simple cells showed an elongated excitatory center and inhibitory flanks, or vice versa; or two adjacent excitatory and inhibitory areas. Initially HUBEL and WIESEL (2) reported that there was summation within the excitatory and inhibitory regions and an antagonism between them. As we shall see, such summation, if true, would have implications not at all foreseen at the time, and would lead one, in fact, to a quite different model of what such cells do from the one which they actually proposed."
            },
            "slug": "Cortical-cells-;-Bar-and-edge-detectors,-or-spatial-Valois-Albrecht",
            "title": {
                "fragments": [],
                "text": "Cortical cells ; Bar and edge detectors, or spatial frequency filters"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Initially HUBEL and WIESEL reported that there was summation within the excitatory and inhibitory regions and an antagonism between them, which would have implications not at all foreseen at the time, and would lead to a quite different model of what such cells do from the one which they actually proposed."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145680634"
                        ],
                        "name": "V. Berzins",
                        "slug": "V.-Berzins",
                        "structuredName": {
                            "firstName": "Valdis",
                            "lastName": "Berzins",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Berzins"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121976461,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f6b1b73aed54a52bd92990ea87ec9092c1aec8d8",
            "isKey": false,
            "numCitedBy": 194,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Accuracy-of-laplacian-edge-detectors-Berzins",
            "title": {
                "fragments": [],
                "text": "Accuracy of laplacian edge detectors"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 4327694,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "8999355e47248bc60f5768fc2168fd28295b5f27",
            "isKey": false,
            "numCitedBy": 1772,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "Research with texture pairs having identical second-order statistics has revealed that the pre-attentive texture discrimination system cannot globally process third- and higher-order statistics, and that discrimination is the result of a few local conspicuous features, called textons. It seems that only the first-order statistics of these textons have perceptual significance, and the relative phase between textons cannot be perceived without detailed scrutiny by focal attention."
            },
            "slug": "Textons,-the-elements-of-texture-perception,-and-Julesz",
            "title": {
                "fragments": [],
                "text": "Textons, the elements of texture perception, and their interactions"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Research with texture pairs having identical second-order statistics has revealed that the pre-attentive texture discrimination system cannot globally process third- and higher- order statistics, and that discrimination is the result of a few local conspicuous features, called textons."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66657145"
                        ],
                        "name": "M. Pietikainen",
                        "slug": "M.-Pietikainen",
                        "structuredName": {
                            "firstName": "Matti",
                            "lastName": "Pietikainen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Pietikainen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118986254,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0052c6909b177c0f117886777b933ad41b03471d",
            "isKey": false,
            "numCitedBy": 4,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Bandpass Laplacian-like operators derived by a hierarchical discrete correlation technique provide natural measures of texture coarseness. This performance of these measures on a standard set of geological terrain types is comparable to that of conventional texture features that do not use directional information. (Author)"
            },
            "slug": "On-the-Use-of-Hierarchically-Computed-'Mexican-Hat'-Pietikainen",
            "title": {
                "fragments": [],
                "text": "On the Use of Hierarchically Computed 'Mexican Hat' Features for Texture Discrimination."
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "Bandpass Laplacian-like operators derived by a hierarchical discrete correlation technique provide natural measures of texture coarseness that are comparable to that of conventional texture features that do not use directional information."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14801990,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6f20e254e3993538c79e0ff2b9b8f198d3359cb3",
            "isKey": false,
            "numCitedBy": 4215,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "In the central nervous system the visual pathway from retina to striate cortex provides an opportunity to observe and compare single unit responses at several distinct levels. Patterns of light stimuli most effective in influencing units at one level may no longer be the most effective at the next. From differences in responses at successive stages in the pathway one may hope to gain some understanding of the part each stage plays in visual perception. By shining small spots of light on the light-adapted cat retina Kuffler (1953) showed that ganglion cells have concentric receptive fields, with an 'on' centre and an 'off ' periphery, or vice versa. The 'on' and 'off' areas within a receptive field were found to be mutually antagonistic, and a spot restricted to the centre of the field was more effective than one covering the whole receptive field (Barlow, FitzHugh & Kuffler, 1957). In the freely moving lightadapted cat it was found that the great majority of cortical cells studied gave little or no response to light stimuli covering most of the animal's visual field, whereas small spots shone in a restricted retinal region often evoked brisk responses (Hubel, 1959). A moving spot of light often produced stronger responses than a stationary one, and sometimes a moving spot gave more activation for one direction than for the opposite. The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex. Receptive fields of the cells considered in this paper were divided into separate excitatory and inhibitory ('on' and 'off') areas. In this respect they resembled retinal ganglion-cell receptive fields. However, the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinal ganglion cells. An attempt was made to correlate responses to moving stimuli"
            },
            "slug": "Receptive-fields-of-single-neurones-in-the-cat's-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields of single neurones in the cat's striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex, which resembled retinal ganglion-cell receptive fields, but the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinalganglion cells."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 29648250,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "4754bfb45726057d98ad47499481e8c172233e20",
            "isKey": false,
            "numCitedBy": 895,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Visual discrimination experiments were conducted using unfamiliar displays generated by a digital computer. The displays contained two side-by-side fields with different statistical, topological or heuristic properties. Discrimination was defined as that spontaneous visual process which gives the immediate impression of two distinct fields. The condition for such discrimination was found to be based primarily on clusters or lines formed by proximate points of uniform brightness. A similar rule of connectivity with hue replacing brightness was obtained by using varicolored dots of equal subjective brightness. The limitations in discriminating complex line structures were also investigated."
            },
            "slug": "Visual-Pattern-Discrimination-Julesz",
            "title": {
                "fragments": [],
                "text": "Visual Pattern Discrimination"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The condition for discrimination was found to be based primarily on clusters or lines formed by proximate points of uniform brightness, and a similar rule of connectivity with hue replacing brightness was obtained by using varicolored dots of equal subjective brightness."
            },
            "venue": {
                "fragments": [],
                "text": "IRE Trans. Inf. Theory"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1925241"
                        ],
                        "name": "D. Pollen",
                        "slug": "D.-Pollen",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Pollen",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pollen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1992154"
                        ],
                        "name": "S. Ronner",
                        "slug": "S.-Ronner",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Ronner",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ronner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 11912279,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "818e8a5f1e8b3cc5d0cb72a60ecbef2ba4549b81",
            "isKey": false,
            "numCitedBy": 414,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Adjacent simple cells recorded and \"isolated\" simultaneously from the same microelectrode placement were usually tuned to the same orientation and spatial frequency. The responses of the members of these \"spatial frequency pairs\" to drifting sine-wave gratings were cross-correlates. Within the middle range of the spatial frequency selectivity curves, the responses of the paired cells differed in phase by approximately 90 percent. This phase relationship suggests that adjacent simple cells tuned to the same spatial frequency and orientation represent paired sine and cosine filters in terms of their processing of afferent spatial inputs and truncated sine and cosine filters in terms of the output of simple cells."
            },
            "slug": "Phase-relationships-between-adjacent-simple-cells-Pollen-Ronner",
            "title": {
                "fragments": [],
                "text": "Phase relationships between adjacent simple cells in the visual cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "This phase relationship suggests that adjacent simple cells tuned to the same spatial frequency and orientation represent paired sine and cosine filters in terms of their processing of afferent spatial inputs and truncated sines and cosines in Terms of the output of simple cells."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40407794"
                        ],
                        "name": "A. Pantle",
                        "slug": "A.-Pantle",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Pantle",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pantle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1810079"
                        ],
                        "name": "R. Sekuler",
                        "slug": "R.-Sekuler",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Sekuler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Sekuler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16228470,
            "fieldsOfStudy": [
                "Physics",
                "Biology"
            ],
            "id": "d87ceaa37e62a46f7eccc8b9735ed5d9ce8ada6e",
            "isKey": false,
            "numCitedBy": 115,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Contrast-response-of-human-visual-to-orientation-of-Pantle-Sekuler",
            "title": {
                "fragments": [],
                "text": "Contrast response of human visual mechanismsensitive to orientation and direction of motion."
            },
            "venue": {
                "fragments": [],
                "text": "Vision research"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12432,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1861262"
                        ],
                        "name": "T. Caelli",
                        "slug": "T.-Caelli",
                        "structuredName": {
                            "firstName": "Terry",
                            "lastName": "Caelli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Caelli"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6822529,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "28d49bc05afc9bbbfd04211fc357f2111bd2067c",
            "isKey": false,
            "numCitedBy": 85,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Recent discoveries of nonlinear perceptual analyzers in effortless texture discrimination cast serious doubt on the usefulness of Fourier image decompositions to describe suprathreshold visual-texture perception. We now explain the meaning of these results."
            },
            "slug": "On-the-Limits-of-Fourier-Decompositions-in-Visual-Julesz-Caelli",
            "title": {
                "fragments": [],
                "text": "On the Limits of Fourier Decompositions in Visual Texture Perception"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The meaning of the results of the analysis of Fourier image decompositions to describe suprathreshold visual-texture perception is explained."
            },
            "venue": {
                "fragments": [],
                "text": "Perception"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34138398"
                        ],
                        "name": "R. Bracewell",
                        "slug": "R.-Bracewell",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Bracewell",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bracewell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18010056,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "50f8aa267f38687ffda768ab0084d8434d7bda30",
            "isKey": false,
            "numCitedBy": 3673,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "1 Introduction 2 Groundwork 3 Convolution 4 Notation for Some Useful Functions 5 The Impulse Symbol 6 The Basic Theorems 7 Obtaining Transforms 8 The Two Domains 9 Waveforms, Spectra, Filters and Linearity 10 Sampling and Series 11 The Discrete Fourier Transform and the FFT 12 The Discrete Hartley Transform 13 Relatives of the Fourier Transform 14 The Laplace Transform 15 Antennas and Optics 16 Applications in Statistics 17 Random Waveforms and Noise 18 Heat Conduction and Diffusion 19 Dynamic Power Spectra 20 Tables of sinc x, sinc2x, and exp(-71x2) 21 Solutions to Selected Problems 22 Pictorial Dictionary of Fourier Transforms 23 The Life of Joseph Fourier"
            },
            "slug": "The-Fourier-Transform-and-Its-Applications-Bracewell",
            "title": {
                "fragments": [],
                "text": "The Fourier Transform and its Applications."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4800025"
                        ],
                        "name": "F. Campbell",
                        "slug": "F.-Campbell",
                        "structuredName": {
                            "firstName": "Fergus",
                            "lastName": "Campbell",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Campbell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36155815"
                        ],
                        "name": "J. Robson",
                        "slug": "J.-Robson",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Robson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Robson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 228358,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ddc2ea63fa69eca4aa44a4fd135543d67badcb23",
            "isKey": false,
            "numCitedBy": 3039,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies."
            },
            "slug": "Application-of-fourier-analysis-to-the-visibility-Campbell-Robson",
            "title": {
                "fragments": [],
                "text": "Application of fourier analysis to the visibility of gratings"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "The contrast thresholds of a variety of grating patterns have been measured over a wide range of spatial frequencies and the results show clear patterns of uniformity in the response to grating noise."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685292"
                        ],
                        "name": "T. Poggio",
                        "slug": "T.-Poggio",
                        "structuredName": {
                            "firstName": "Tomaso",
                            "lastName": "Poggio",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Poggio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9690772,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b2544c93606e804c710e3f90f40407bd18b5f473",
            "isKey": false,
            "numCitedBy": 238,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "How does an animal see? How might a computer do it? A study of stereo vision guides research on both these questions. Brain science suggests computer programs; the computer suggests what to look for in the brain. T he development of computers of increasing power and sophistication often stimulates comparisons between them and the human brain, and these comparisons are becoming more earnest as computers are applied more and more to tasks formerly associated with essentially human activities and capabilities. Indeed, it is widely expected that a coming generation of computers and robots will have sensory, motor and even \"intellec-tual\" skills closely resembling our own. How might such machines be designed? Can our rapidly growing knowledge of the human brain be a guide? And at the same time can our advances in \"artificial intelligence\" help us to understand the brain? At the level of their hardware (the brain's or a computer's) the differences are great. The neurons, or nerve cells, in a brain are small, delicate structures bound by a complex membrane and closely packed in a medium of supporting cells that control a complexand probably quite variable chemical environment. They are very unlike the wires and etched crystals of semiconducting materials on which computers are based. In the organization of the hardware the differences also are great. The connections between neurons are very numerous (anyone neuron may receive many thousands of inputs) and are distributed in three dimensions. In a computer the wires linking circuit components are limited by present-day solid-state technology to a relatively small number arranged more or less two-dimensionally. In the transmission of signals the differences again are great. The binary (on-off) electric pulses of the computer are mirrored to some extent in the all-or-nothing signal conducted along nerve fibers, but in addition the brain employs graded electrical signals, chemical messenger substances and the transport of ions. In temporal organization the differences are immense. Computers process infonna-tion serially (one step at a time) but at a very fast rate. The time course of their operation is governed by a computer-wide clock. What is known of the brain suggests that it functions much slower but that it analyzes information along millions of channels concurrently without need of clock-driven operation. How, then, are brains and computers alike? Clearly there must be a level at which any two mechanisms can be compared. One can compare the tasks they do. …"
            },
            "slug": "Vision-by-man-and-machine.-Poggio",
            "title": {
                "fragments": [],
                "text": "Vision by man and machine."
            },
            "venue": {
                "fragments": [],
                "text": "Scientific American"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409513867"
                        ],
                        "name": "M.",
                        "slug": "M.",
                        "structuredName": {
                            "firstName": "",
                            "lastName": "M.",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M."
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1990278,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f7625798c6e08daa9a603551c71bab68f9abe5dd",
            "isKey": false,
            "numCitedBy": 3670,
            "numCiting": 90,
            "paperAbstract": {
                "fragments": [],
                "text": "A b m t-I n this survey we review the impge processing literature on the various approaches and models investigators have uaed for texture."
            },
            "slug": "Statistical-and-Structural-Approaches-to-Texture-M.",
            "title": {
                "fragments": [],
                "text": "Statistical and Structural Approaches to Texture"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2448449"
                        ],
                        "name": "Y. J. Tejwani",
                        "slug": "Y.-J.-Tejwani",
                        "structuredName": {
                            "firstName": "Yogendra",
                            "lastName": "Tejwani",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. J. Tejwani"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 713769,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "3e5ad6a48fe0b8e97825e9ec1e831d18eeb5605a",
            "isKey": false,
            "numCitedBy": 2456,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "A scheme is developed for classifying the types of motion perceived by a humanlike robot. It is assumed that the robot receives visual images of the scene using a perspective system model. Equations, theorems, concepts, clues, etc., relating the objects, their positions, and their motion to their images on the focal plane are presented.<<ETX>>"
            },
            "slug": "Robot-vision-Tejwani",
            "title": {
                "fragments": [],
                "text": "Robot vision"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "A scheme is developed for classifying the types of motion perceived by a humanlike robot and equations, theorems, concepts, clues, etc., relating the objects, their positions, and their motion to their images on the focal plane are presented."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE International Symposium on Circuits and Systems,"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2422882"
                        ],
                        "name": "M. Clark",
                        "slug": "M.-Clark",
                        "structuredName": {
                            "firstName": "Marianna",
                            "lastName": "Clark",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Clark"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1747569"
                        ],
                        "name": "A. Bovik",
                        "slug": "A.-Bovik",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Bovik",
                            "middleNames": [
                                "Conrad"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bovik"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 126287265,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "23dd0bd7511aaf60cf185a1ae3c31e72ec298d9e",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "TEXTURE-DISCRIMINATION-USING-A-MODEL-OF-VISUAL-Clark-Bovik",
            "title": {
                "fragments": [],
                "text": "TEXTURE DISCRIMINATION USING A MODEL OF VISUAL CORTEX."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2360881"
                        ],
                        "name": "D. Heeger",
                        "slug": "D.-Heeger",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Heeger",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Heeger"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123753025,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "dbe95ed726a23a9d853544e693e3774407878809",
            "isKey": false,
            "numCitedBy": 128,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Optical-flow-from-spatialtemporal-filters-Heeger",
            "title": {
                "fragments": [],
                "text": "Optical flow from spatialtemporal filters"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1747569"
                        ],
                        "name": "A. Bovik",
                        "slug": "A.-Bovik",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Bovik",
                            "middleNames": [
                                "Conrad"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bovik"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2422882"
                        ],
                        "name": "M. Clark",
                        "slug": "M.-Clark",
                        "structuredName": {
                            "firstName": "Marianna",
                            "lastName": "Clark",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Clark"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2966196"
                        ],
                        "name": "W. Geisler",
                        "slug": "W.-Geisler",
                        "structuredName": {
                            "firstName": "Wilson",
                            "lastName": "Geisler",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Geisler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 67220866,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "91d93baa6379b3de2671b841081e8947d9500447",
            "isKey": false,
            "numCitedBy": 42,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "COMPUTATIONAL-TEXTURE-ANALYSIS-USING-LOCALIZED-Bovik-Clark",
            "title": {
                "fragments": [],
                "text": "COMPUTATIONAL TEXTURE ANALYSIS USING LOCALIZED SPATIAL FILTERING."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3117916"
                        ],
                        "name": "H. Knutsson",
                        "slug": "H.-Knutsson",
                        "structuredName": {
                            "firstName": "Hans",
                            "lastName": "Knutsson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Knutsson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2498129"
                        ],
                        "name": "G. Granlund",
                        "slug": "G.-Granlund",
                        "structuredName": {
                            "firstName": "Gösta",
                            "lastName": "Granlund",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Granlund"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60988990,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e75b9a649b22f06002e92ffce846d9faf3ab457e",
            "isKey": false,
            "numCitedBy": 179,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Texture-Analysis-Using-Two-Dimensional-Quadrature-Knutsson-Granlund",
            "title": {
                "fragments": [],
                "text": "Texture Analysis Using Two-Dimensional Quadrature Filters"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3326400"
                        ],
                        "name": "B. Julesz",
                        "slug": "B.-Julesz",
                        "structuredName": {
                            "firstName": "Béla",
                            "lastName": "Julesz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Julesz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 33862721,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "436234a4dc9b8a35f5c1407b66b306fc3b452c0e",
            "isKey": false,
            "numCitedBy": 645,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Experiments-in-the-visual-perception-of-texture.-Julesz",
            "title": {
                "fragments": [],
                "text": "Experiments in the visual perception of texture."
            },
            "venue": {
                "fragments": [],
                "text": "Scientific American"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Analysis of Gabor function descriptions of visual receptive fields"
            },
            "venue": {
                "fragments": [],
                "text": "Assoc. Res. Vision Opthal. Ann. Spring Meeting"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Texture analysis anno 1983 Computer description of textured surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "Proc"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "MULTICHANNEL TEXTURE ANALYSIS networks for image analysis and compression"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Acoust., Speech, Signal Processing"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Geisler is currently a member of the Visual Sciences B Study Section of the National Eye Institute of NIH"
            },
            "venue": {
                "fragments": [],
                "text": "Geisler is currently a member of the Visual Sciences B Study Section of the National Eye Institute of NIH"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Contrast response of human visual mechanisms sensitive to orientation and direction of motion mation in the receptive fields of simple cells in the cat's striate cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Res. J . Physiol. London"
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "S’80-M’84) was born in Kirkwood"
            },
            "venue": {
                "fragments": [],
                "text": "MO, on June"
            },
            "year": 1958
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Analysis of Gabor function descriptions of visual receptive fields"
            },
            "venue": {
                "fragments": [],
                "text": "Assoc . Res . Vision Opthal . Ann"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Optical flow from spatiotemporal filters"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. First Int. Con$ Comput. Vision"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Artif. Intell"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell"
            },
            "year": 1973
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Texture discrimination based on detailed measures for the power spectrum"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. 7th Int. Con$ Pattern Recog"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Orientation sensitivity and texture segmentation"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Res"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Model of human visualmotion sensing"
            },
            "venue": {
                "fragments": [],
                "text": "J . Opt. Soc. Amer. A"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Texture analysis and classification using a human visual model Textured image segmentation"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Int. Conf. Pattern Recogn"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Detecting textons and texture boundaries in natural images"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. First Inr. Con6 Comput. Vision"
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A directional filtering approach to texture discrimination"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. 7th Int. Con$ Pattern Recog"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Texture discrimination based on detailed measures for the power spectrum"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "NOV. 7-10"
            },
            "venue": {
                "fragments": [],
                "text": "NOV. 7-10"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A directional filtering approach to texture discrimination"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A texture analysis algorithm inspired by a theory of preattentive vision"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Int. Conf: Comput. Vision Parr. Recog"
            },
            "year": 1985
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 71,
        "totalPages": 8
    },
    "page_url": "https://www.semanticscholar.org/paper/Multichannel-Texture-Analysis-Using-Localized-Bovik-Clark/a5144a35f9b6fd5676e5fd6dab8aa113c8af25ff?sort=total-citations"
}