{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12432,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3133875"
                        ],
                        "name": "C. Blakemore",
                        "slug": "C.-Blakemore",
                        "structuredName": {
                            "firstName": "Colin",
                            "lastName": "Blakemore",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Blakemore"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40061390"
                        ],
                        "name": "D. Mitchell",
                        "slug": "D.-Mitchell",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Mitchell",
                            "middleNames": [
                                "E"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mitchell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 177,
                                "start": 149
                            }
                        ],
                        "text": "…recorded (from 0 to 15%, depending on the authors and the classification criteria); however, the distribution of ocular dominance seems unaffected (Blakemore and Mitchell, 1973; Imbert and Buisseret, 1975; Blakemore and Van Sluyters, 1975; Buisseret and Imbert, 1976; Leventhal and Hirsch, 1980;…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 4279294,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "db2c4a66d5f91ed9e902b3bbc2741047578c55ff",
            "isKey": false,
            "numCitedBy": 172,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "IN the primary visual cortex of a normal cat the neurones are almost all orientation detectors, which respond only if an edge or bar at the appropriate angle moves across the receptive field: all orientations are equally represented1. But early experience can grossly modify the visual cortex. Blakemore and Cooper2 reared two kittens in the dark except for a few hours each day spent in cylindrical chambers painted with black and white stripes at one orientation. These two animals, which experienced almost 300 h of exposure to stripes during their first 5 months of life, had no cortical neurones responding to the orientation perpendicular to the stripes that they saw when they were young. Almost all their cortical cells preferred orientations within 45 deg of the experienced angle. The phenomenon involves active modification of the receptive fields of the neurones, and not mere degeneration of unused cells, because there were no regions of silent cortex and no histological evidence of degeneration."
            },
            "slug": "Environmental-Modification-of-the-Visual-Cortex-and-Blakemore-Mitchell",
            "title": {
                "fragments": [],
                "text": "Environmental Modification of the Visual Cortex and the Neural Basis of Learning and Memory"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "These two kittens reared in the dark except for a few hours each day spent in cylindrical chambers painted with black and white stripes at one orientation had no cortical neurones responding to the orientation perpendicular to the stripes that they saw when they were young."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "21484174"
                        ],
                        "name": "A. Leventhal",
                        "slug": "A.-Leventhal",
                        "structuredName": {
                            "firstName": "Audie",
                            "lastName": "Leventhal",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Leventhal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2399836"
                        ],
                        "name": "H. Hirsch",
                        "slug": "H.-Hirsch",
                        "structuredName": {
                            "firstName": "Helmut",
                            "lastName": "Hirsch",
                            "middleNames": [
                                "V.",
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Hirsch"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 274,
                                "start": 248
                            }
                        ],
                        "text": "…the visually excitable cells are still orientation selective at 6 weeks (and even beyond 24 months of age) and the proportion of binocular cells is less than normal (Wiesel and Hubel, 1965; Blakemore and Van Sluyters, 1975; Kratz and Spear, 1976; Leventhal and Hirsch, 1977; Watkins et al., 1978 )."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 42967010,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "a8210d7330913713856cc726dfb7259325e2c4f0",
            "isKey": false,
            "numCitedBy": 94,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The class of neurons within the visual cortex of normal adult cats that has the smallest receptive fields (less than or equal to 2.25 degrees2) and that responds only to low rates of stimulus motion (less than or equal to 50 degrees / sec) responds preferentially to lines oriented about either the horizontal axis (+/-22.5 degrees) or the vertical axis (+/-22.5 degrees). In animals reared without exposure to patterned visual stimulation, many of these cells display orientation preferences but are activated monocularly. In contrast, in normal animals, neurons that have larger receptive fields or that respond to higher rates of stimulus motion do not exhibit a similar bias in the distribution of their orientation preferences. Cells of this type, studied in animals reared without exposure to patterned visual stimuli, are activated binocularly but do not display orientation preferences."
            },
            "slug": "Effects-of-early-experience-upon-orientation-and-of-Leventhal-Hirsch",
            "title": {
                "fragments": [],
                "text": "Effects of early experience upon orientation sensitivity and binocularity of neurons in visual cortex of cats."
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "The class of neurons within the visual cortex of normal adult cats that has the smallest receptive fields and that responds only to low rates of stimulus motion responds preferentially to lines oriented about either the horizontal axis or the vertical axis."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the National Academy of Sciences of the United States of America"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Further work has shown that the response characteristics of these cortical cells strongly depend on the visual environment experienced by the animal during a critical period extending roughly from the 3rd to the 15th week of postnatal life (see, for example,  Hubel and Wiesel, 1965;  Blakemore and Van Sluyters, 1975; Buis-The Journal of Neuroscience Theory for the Development of Neuron Selectivity"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "A disruption of binocularity that does not favor one of the eyes may be obtained, for example, by provoking an artificial strabismus ( Hubel and Wiesel, 1965 ) or by an alternating monocular occlusion, which gives both eyes an equal amount of visual stimulation (Blakemore, 1976)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 156,
                                "start": 134
                            }
                        ],
                        "text": "A disruption of binocularity that does not favor one of the eyes may be obtained, for example, by provoking an artificial strabismus (Hubel and Wiesel, 1965) or by an alternating monocular occlusion, which gives both eyes an equal amount of visual stimulation (Blakemore, 1976)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2627540,
            "fieldsOfStudy": [
                "Biology",
                "Medicine"
            ],
            "id": "77734bcbfe2e939b340d870bf676775a879f747a",
            "isKey": false,
            "numCitedBy": 1290,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "BEFORE A KITTEN OPENS ITS EYES, and long before the eyes are used in visual exploration, single cells of the primary visual cortex respond to natural stimulation with the same specificity as is found in the adult (5). This suggests that the anatomical connections between retina and striate cortex are for the most part innate. During the first 3 months of life the connections are highly susceptible to the effects of visual deprivation, to the extent that exclusion of all form and some light from one eye leads to a severe decline in the ability of that eye to influence cortical cells. Anatomical and physiological evidence suggests that the defect is chiefly, though not entirely, a cortical one (7-9). The object of the present study was to influence cortical connections by some means less drastic than covering one or both eyes. We wished if possible to alter the input in such a way that there would be no question of effects on the visual pathway below the level of the striate cortex. A method was suggested by the well-known clinical observation that a child with a squint (strabismus or nonparallel visual axes) may suffer a deterioration of vision in one eye (amblyopia ex anopsia). Since the visual pathways from the two eyes are for practical purposes separate up to the level of the striate cortex, it is unlikely that in these children the defect is in the retina or geniculate. An artificial squint therefore seemed to provide a possible means of obtaining a cortical defect while sparing the retina and lateral geniculate body. Accordingly , we produced a divergent strabismus by cutting one of the extraocular muscles in each of four newborn kittens, with the plan of testing vision and recording from single cortical cells after several months to a year. When at length each eye was tested in these kittens by observing the ani-mal's behavior with the other eye covered the results were disappointing: there was not the slightest suggestion of any defect in vision in either eye. This was not entirely unexpected, since with both eyes uncovered the animals had appeared to fix at times with one eye and at times with the other. At this stage there seemed to be little point in proceeding further, for there- ."
            },
            "slug": "Binocular-interaction-in-striate-cortex-of-kittens-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Binocular interaction in striate cortex of kittens reared with artificial squint."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The object of the present study was to influence cortical connections by some means less drastic than covering one or both eyes, and produced a divergent strabismus by cutting one of the extraocular muscles in each of four newborn kittens."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1714528"
                        ],
                        "name": "T. Sejnowski",
                        "slug": "T.-Sejnowski",
                        "structuredName": {
                            "firstName": "Terrence",
                            "lastName": "Sejnowski",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Sejnowski"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 13
                            }
                        ],
                        "text": "For example, Sejnowski (1977a) has suggested a form of modification in which the change of thejth synaptic strength involves the co-variance between thejth fiber and postsynaptic activities."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15727980,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "de13c62828f41c863cffb7444daaa37d928272d2",
            "isKey": false,
            "numCitedBy": 508,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "SummaryA time-dependent, nonlinear model of neuronal interaction which was probabilistically analyzed in a previous article is shown here to be a natural generalization of the Hartline-Ratliff model of the Limulus retina. Although the primary physical variables in the model are the membrane potentials of neurons, the equations which govern the means and covariances of the membrane potentials are coupled through the average firing rates; as a consequence, the average firing rates control the selective storage and retrieval of covariance information. Motor learning in the cerebellar cortex is treated as a problem of covariance storage, and a prediction is made for the underlying synaptic plasticity: the change in synaptic strength between a parallel fiber and a Purkinje cell should be proportional to the covariance between discharges in the parallel fiber and the climbing fiber. Unlike previous proposals for synaptic plasticity, this prediction requires both facilitation and depression to occur (under different conditions) at the same synapse."
            },
            "slug": "Storing-covariance-with-nonlinearly-interacting-Sejnowski",
            "title": {
                "fragments": [],
                "text": "Storing covariance with nonlinearly interacting neurons"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "A time-dependent, nonlinear model of neuronal interaction which was probabilistically analyzed in a previous article is shown here to be a natural generalization of the Hartline-Ratliff model of the Limulus retina."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of mathematical biology"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1856522"
                        ],
                        "name": "J. Rauschecker",
                        "slug": "J.-Rauschecker",
                        "structuredName": {
                            "firstName": "Josef",
                            "lastName": "Rauschecker",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Rauschecker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1712899"
                        ],
                        "name": "W. Singer",
                        "slug": "W.-Singer",
                        "structuredName": {
                            "firstName": "Wolf",
                            "lastName": "Singer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Singer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 66,
                                "start": 51
                            }
                        ],
                        "text": "This question, still a subject of controversy (see Pettigrew, 1978), must be settled experimentally."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8081756,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "425f89537aa56e5c7c7e2cce34faa65edd7f8652",
            "isKey": false,
            "numCitedBy": 227,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Kittens were dark‐reared until 4‐6 weeks old, and then for another 4‐7 weeks with various combinations of cylindrical lenses, monocular occlusion, and normal vision. 2. Single unit recordings from 816 neurones of the visual cortex (area 17) were obtained after the end of exposure. Clear‐cut effects on the distributions of the neurones' ocular dominance and orientation preference were found yielding close correlations with the rearing conditions. 3. It was confirmed that most cortical neurones prefer vertical stimulus orientations when experience is restricted to vertical contours in both eyes. It was further confirmed that, if the experienced orientations are different in the two eyes, each eye dominates over those neurones whose orientation preference corresponds to the orientation this eye has experienced. 4. When one eye is covered while the other sees only contours of one orientation, the ocular dominance distribution of cortical neurones shows a bias towards the open eye. Neurones dominated by this eye prefer orientations corresponding to the experienced range. Neurones preferring other orientations are shared between both eyes. 5. When vision is unimpaired in one eye and restricted to vertical contours in the other, binocularity is common among neurones preferring vertical orientations. Neurones with orientation preferences off the vertical are mainly monocular and dominated by the eye with unrestricted vision. 6. When normal monocular vision of one eye precedes restricted monocular vision of the other eye, only a few binocular units are encountered. Reversal of the initial effects of monocular experience is found only in neurones preferring the orientation that has been experienced by the newly opened eye. The other neurones remain dominated by the originally open eye. Thus, complementary distributions of orientation preferences are found for the two eyes. 7. A good correlation was found between the amount of orientational experience as determined by the number of orientations exposed and the number of normally tuned neurones. Conversely, the number of neurones responding to all orientations decreases with increasing amount of experience."
            },
            "slug": "The-effects-of-early-visual-experience-on-the-cat's-Rauschecker-Singer",
            "title": {
                "fragments": [],
                "text": "The effects of early visual experience on the cat's visual cortex and their possible explanation by Hebb synapses."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It was confirmed that most cortical neurones prefer vertical stimulus orientations when experience is restricted to vertical contours in both eyes, and that, if the experienced orientations are different in the two eyes, each eye dominates over those neurones whose orientation preference corresponds to the orientation this eye has experienced."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6110079"
                        ],
                        "name": "A. Sillito",
                        "slug": "A.-Sillito",
                        "structuredName": {
                            "firstName": "Adam",
                            "lastName": "Sillito",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Sillito"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 218,
                                "start": 205
                            }
                        ],
                        "text": "It is very likely that interactions between cortical neurons play an important role in overall cortical function as well, perhaps, as in selectivity of individual cortical cells (Creutzfeldt et al., 1974; Sillito, 1975)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 157,
                                "start": 144
                            }
                        ],
                        "text": "…selectivity by rendering all orientations effective in trigremains at present that rearing in such a visual environgering the cell's response (Sillito, 1975). ment results in a cortex in which all visually responsive Finally, it should be mentioned that the system dis-cells are tuned to the…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9260265,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "69ea1d530b8ee56488e30412ef4c994f8d89f937",
            "isKey": false,
            "numCitedBy": 737,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The iontophoretic application of the GABA antagonist bicuculline to simple and complex cells in the striate cortex of the cat produced extensive modifications of receptive field properties. These modifications appear to relate to a block or reduction of GABA‐mediated intracortical inhibitory influences acting on the cells examined. 2. For simple cells the effects of bicuculline on receptive field properties involved a loss of the subdivision of the receptive field into antagonistic \"on\" and \"off\" regions, a reduction in orientation specificity and a reduction or elimination of directional specificity. 3. The effect on the \"on\" and \"off\" subdivisions of the simple cell receptive field was such that all stationary flashing stimuli, whether covering the whole receptive field, or located within the receptive field over a previously determined \"on\" or \"off\" region, resulted in an \"on and off\" response. 4. The orientation specificity of complex cells was reduced during the application of bicuculline such that in many cases the original specificity of the cell was virtually lost with the response to the orientation at 90 degrees to the optimal being of similar magnitude to the optimal. The directional specificity of complex cells was generally less affected than that of simple cells. Often when large changes in orientation specificity were observed the directional specificity was relatively unaffected. 5. For some cells apparently showing to all visual stimuli only inhibitory responses, the application of bicuculline resulted in the appearance of excitatory responses. 6. In all cases receptive field properties reverted to the original state after termination of the bicuculline application. It was not generally possible to duplicate the effects of bicuculline by raising neuronal excitability with iontophoretically applied glutamate. 7. On the basis of these results it is suggested that the normal subdivision of the simple cell receptive field into separate \"on\" and \"off\" regions and its directional specificity are dependent on intracortical inhibitory processes that are blocked by bicuculline. The orientational tuning of simple cells conversely appears to be largely determined by the excitatory input but normally enhanced by lateral type inhibitory processes acting in the orientation domain. 8. It also appears that the excitatory input to some complex cells is not orientation specific. This suggests that for these cells it is extremely unlikely that they receive an orientation specific excitatory input from simple cells."
            },
            "slug": "The-contribution-of-inhibitory-mechanisms-to-the-of-Sillito",
            "title": {
                "fragments": [],
                "text": "The contribution of inhibitory mechanisms to the receptive field properties of neurones in the striate cortex of the cat."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is suggested that the normal subdivision of the simple cell receptive field into separate \"on\" and \"off\" regions and its directional specificity are dependent on intracortical inhibitory processes that are blocked by bicuculline."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1969872"
                        ],
                        "name": "Y. Frégnac",
                        "slug": "Y.-Frégnac",
                        "structuredName": {
                            "firstName": "Yves",
                            "lastName": "Frégnac",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Frégnac"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145357648"
                        ],
                        "name": "M. Imbert",
                        "slug": "M.-Imbert",
                        "structuredName": {
                            "firstName": "Michel",
                            "lastName": "Imbert",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Imbert"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6947514,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "4f43df9ddbd864c41493772cf96e98dbbf4ab80c",
            "isKey": false,
            "numCitedBy": 259,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "1. 535 units were recorded in the primary visual cortex in twelve normally reared and fifteen dark‐reared kittens aged between 8 and 50 days. These results were pooled with a previous study of 582 units recorded from thirty‐five kittens reared in similar conditions. 2. These 1117 cells were classified into four functional classes of neurones: (a) visually unresponsive cells, (b) non‐specific cells which were sensitive to spots or slits of light moving in any direction, (c) immature cells which were preferentially activated by a rectilinear stimulus but unselective regarding its precise orientation and (d) specific cells that appeared to be as selective for orientation as the simple or complex cells in the adult cat. 3. The results confirm that cells having the same orientation‐specific response properties as adult cortical visual neurones are present in the earliest stages of post‐natal development, independently of visual experience. However, to maintain and develop these specific cells after the third week of post‐natal life, visual experience is necessary. 4. The ocular dominance of visual cells is not constant from the earliest stages of development. A significant increase in binocularly driven neurones occurs with age. 5. Before 3 weeks of age, whatever the rearing conditions, there are more specific cells coding horizontal and vertical orientations than those coding oblique orientations. These 'horizontal and vertical detectors' are preferentially driven by the contralateral eye. 5. After 4 weeks of age, specific neurones are found at all orientations in normally reared kittens. At this stage of development the ocular dominance is independent of orientation preference, of the functional class of neurones considered and of the rearing conditions. The proportion of binocularly driven cells is slightly below adult standard. 7. A hypothesis of differential plasticity is proposed: contralateral, monocular 'horizontal and vertical detectors' are supposed to be stable; they would remain so until they become binocular. Binocular cells, for which competition between two inputs occurs, are the labile units which can be despecified or specified under the control of visual experience."
            },
            "slug": "Early-development-of-visual-cortical-cells-in-and-Frégnac-Imbert",
            "title": {
                "fragments": [],
                "text": "Early development of visual cortical cells in normal and dark‐reared kittens: relationship between orientation selectivity and ocular dominance."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The results confirm that cells having the same orientation‐specific response properties as adult cortical visual neurones are present in the earliest stages of post‐natal development, independently of visual experience, however, to maintain and develop these specific cells after the third week of post-natal life, visual experience is necessary."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2321909"
                        ],
                        "name": "M. Stryker",
                        "slug": "M.-Stryker",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Stryker",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Stryker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37560392"
                        ],
                        "name": "H. Sherk",
                        "slug": "H.-Sherk",
                        "structuredName": {
                            "firstName": "Helen",
                            "lastName": "Sherk",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Sherk"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "21484174"
                        ],
                        "name": "A. Leventhal",
                        "slug": "A.-Leventhal",
                        "structuredName": {
                            "firstName": "Audie",
                            "lastName": "Leventhal",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Leventhal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2399836"
                        ],
                        "name": "H. Hirsch",
                        "slug": "H.-Hirsch",
                        "structuredName": {
                            "firstName": "Helmut",
                            "lastName": "Hirsch",
                            "middleNames": [
                                "V.",
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Hirsch"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 56,
                                "start": 36
                            }
                        ],
                        "text": "The system then 1970,197l; see also Stryker et al., 1978 )."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17406151,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5267a2049b9c11d0deca2eb4a670e6f4aaa58dce",
            "isKey": false,
            "numCitedBy": 148,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The early visual experience of nine cats was restricted to viewing horizontal or vertical lines inside opaque goggles. 2. When the kittens were 3-4 mo old, extracellular recordings were made in the primary visual cortex. To obtain a representative sample of cortical cells, units were studied at regularly spaced intervals along the course of electrode penetrations traveling oblique to the cortical surface. An automated assessment of preferred orientation using a computer-driven optical display was employed, and during the recording session the experimenters did not know which orientation(s) each animal had viewed in early life. 3. In the cats that viewed horizontal lines with one eye and vertical lines with the other during rearing, two major findings of previous workers (14) were confirmed. First, a majority of units were not selective for orientation. Second, units with preferred orientations near vertical tended to be activated exclusively by the eye that had viewed vertical, and likewise for horizontal. 4. In cats that viewed lines of the same orientation with both eyes during rearing, a substantially smaller proportion of units were selective for orientation; the preferred orientations of these units also tended to match the orientation to which the cats had been exposed. 5. Portions of some electrode penetrations showed an orderly arrangement of cells according to preferred orientation similar to that seen in normal cats, but with regions over which only nonselective cells were found. Many penetrations appeared less orderly. 6. The results are consistent with a role for early visual experience in maintaining the responsiveness and innate selectivity of cortical neurons, although they cannot entirely rule out the possibility that experience may alter or determine the preferred orientation of some cells."
            },
            "slug": "Physiological-consequences-for-the-cat's-visual-of-Stryker-Sherk",
            "title": {
                "fragments": [],
                "text": "Physiological consequences for the cat's visual cortex of effectively restricting early visual experience with oriented contours."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The results are consistent with a role for early visual experience in maintaining the responsiveness and innate selectivity of cortical neurons, although they cannot entirely rule out the possibility that experience may alter or determine the preferred orientation of some cells."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3734276"
                        ],
                        "name": "G. Stent",
                        "slug": "G.-Stent",
                        "structuredName": {
                            "firstName": "Gunther",
                            "lastName": "Stent",
                            "middleNames": [
                                "Siegmund"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Stent"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "A competition mechanism of this kind provides a qualitative explanation of some experimental results on cortical development (e.g., monocularly deprived animals ( Stent, 1973 )) as well as some aspects of certain more complex deprivation paradigms such as those recently reported by Rauschecker and Singer (1981)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Consider, for example, one that was proposed by  Stent (1973) : “when the presynaptic axon of cell A repeatedly and persistently fails to excite the postsynaptic cell B while cell B is firing under the influence of other presynaptic axons, metabolic changes take place in one or both cells such that A’s efficiency, as one of the cells firing B, is decreased.” According to Stent’s principle, the increase of the strength of certain synapses ..."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 48
                            }
                        ],
                        "text": "Consider, for example, one that was proposed by Stent (1973): \" when the presynaptic axon of cell A repeatedly and persistently fails to excite the postsynaptic cell B while cell B is firing under the influence of other presynaptic axons, metabolic changes take place in one or both cells such that…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 160,
                                "start": 149
                            }
                        ],
                        "text": "…mechanism of this kind provides a qualitative explanation of some experimental results on cortical development (e.g., monocularly deprived animals (Stent, 1973)) as well as some aspects of certain more complex deprivation paradigms such as those recently reported by Rauschecker and Singer (1981)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 37447871,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "4b277f7462d3e0ecfe90352b430e23d1528d5463",
            "isKey": true,
            "numCitedBy": 652,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "Hebb's postulate of learning envisages that activation or inactivation of extant synaptic contacts in plastic neural networks depends on the synchronous impulse activity of pre- and postsynaptic nerve cells. The physiological mechanism proposed here for this process posits that at synapses acting according to Hebb's postulate, the receptors for the neurotransmitter are eliminated from the postsynaptic membrane by the transient reversals of the sign of membrane polarization that occur during action potential impulses in the postsynaptic cell. But, since the release of neurotransmitter drives the membrane potential of the synaptic zone towards a level about half-way between the negative-inside resting potential and the positive-inside action potential, it would follow that the membrane patches surrounding the receptors of a synapse whose activity has contributed to setting off the postsynaptic impulse would be spared the full extent of the noxious polarity reversal. This mechanism can account for a neurophysiologically documented example of the operation of Hebb's postulate, namely the plasticity of the connections between fourth- and fifth-order neurons in the visual cortex of cats."
            },
            "slug": "A-physiological-mechanism-for-Hebb's-postulate-of-Stent",
            "title": {
                "fragments": [],
                "text": "A physiological mechanism for Hebb's postulate of learning."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The physiological mechanism proposed here for this process posits that at synapses acting according to Hebb's postulate, the receptors for the neurotransmitter are eliminated from the post Synaptic membrane by the transient reversals of the sign of membrane polarization that occur during action potential impulses in the postsynaptic cell."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the National Academy of Sciences of the United States of America"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48739303"
                        ],
                        "name": "D. W. Watkins",
                        "slug": "D.-W.-Watkins",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Watkins",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. W. Watkins"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49961555"
                        ],
                        "name": "J. Wilson",
                        "slug": "J.-Wilson",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Wilson",
                            "middleNames": [
                                "Roger"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143980134"
                        ],
                        "name": "S. Sherman",
                        "slug": "S.-Sherman",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Sherman",
                            "middleNames": [
                                "Murray"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sherman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 461,
                                "start": 330
                            }
                        ],
                        "text": "In animals whose eyelids have been sutured at birth and which are thus binocularly deprived of pattern vision (BD), a somewhat higher proportion (from 12 to 50%) of the visually excitable cells are still orientation selective at 6 weeks (and even beyond 24 months of age) and the proportion of binocular cells is less than normal (Wiesel and Hubel, 1965; Blakemore and Van Sluyters, 1975; Kratz and Spear, 1976; Leventhal and Hirsch, 1977; Watkins et al., 1978)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 296,
                                "start": 276
                            }
                        ],
                        "text": "…the visually excitable cells are still orientation selective at 6 weeks (and even beyond 24 months of age) and the proportion of binocular cells is less than normal (Wiesel and Hubel, 1965; Blakemore and Van Sluyters, 1975; Kratz and Spear, 1976; Leventhal and Hirsch, 1977; Watkins et al., 1978 )."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5370224,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "1670500ccab76031a60ab4d5f5c24b0d26417e35",
            "isKey": false,
            "numCitedBy": 59,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "1. We studied the receptive fields of 171 striate cortical neurons from 17 cats raised with binocular lid suture. Of these, 102 fields were within 10 degrees of the area centralis and the remaining 69 were at least 38 degrees from the vertical meridian. 2. Based on their different response properties, cells were divided into three broad groups: the mappable cells (49%) had clearly defined receptive fields, the unmappable cells (31%) were activated by visual stimuli but had diffuse fields which could not be hand plotted, and the visually inexcitable cells (20%) could not be activated by visual stimuli. Very few (less than or equal to 12% of the total sample) normal simple or complex cells could be found. 3. Orientation selectivity was assessed in these cells. Only 12% displayed orientation selectivity within normal bounds, and these were all mappable cells. None of the unmappable cells had discernible orientation selectivity. 4. Ocular dominance was assessed for 62 of the centrally located receptive fields. Among mappable cells, there was an abnormally low proportion of binocular fields, while no such abnormality was seen for unmappable cells. 5. For 47 of the neurons, average response histograms were compiled for moving stimuli of various parameters in an effort to evoke the maximum discharge or peak response. This peak response was normal for mappable cells but reduced for unmappable cells. 6. We devised a technique for studying potential inhibitory receptive-field zones in these neurons, validated the method in normal striate cortex, and used it to test 20 mappable cells in the lid-sutured cats. None showed the pattern of strong inhibitory side bands seen in normal simple cells, although six showed weak or abnormal inhibitory zones. Interestingly, six of the seven visually inexcitable cells tested by this method had purely inhibitory receptive fields. 7. The effects of binocular suture were essentially identical for the binocular and monocular segments since the cell types and their response properties did not differ between these two areas of cortex. Furthermore, the cortical monocular segments of these cats seemed qualitatively different from the deprived cortical monocular segment after monocular suture. This extends an analogous difference for these cats reported for the monocular segments of the lateral geniculate nucleus. We thus conclude that monocularly and binocularly sutured cats develop by qualitatively different mechanisms. For the former, competition between central synapses related to each eye is a prominent feature of geniculocortical development, whereas, for the latter, such specific forms of geniculocortical development may not obtain."
            },
            "slug": "Receptive-field-properties-of-neurons-in-binocular-Watkins-Wilson",
            "title": {
                "fragments": [],
                "text": "Receptive-field properties of neurons in binocular and monocular segments of striate cortex in cats raised with binocular lid suture."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is concluded that monocularly and binocularly sutured cats develop by qualitatively different mechanisms, with the former facing competition between central synapses related to each eye is a prominent feature of geniculocortical development, whereas, for the latter, such specific forms of genimedial development may not obtain."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3441692"
                        ],
                        "name": "P. Buisseret",
                        "slug": "P.-Buisseret",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Buisseret",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Buisseret"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145357648"
                        ],
                        "name": "M. Imbert",
                        "slug": "M.-Imbert",
                        "structuredName": {
                            "firstName": "Michel",
                            "lastName": "Imbert",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Imbert"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 44442826,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "4783903c3c34e6eccfadf380c3effe0c0aacd1eb",
            "isKey": false,
            "numCitedBy": 206,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "582 units were recorded in area 17 in twenty‐one normally reared kittens, and fourteen dark reared ones, aged between 8 and 42 days. 2. Four classes of neurones were defined: (a) non‐activable cells that cannot be excited by any peripheral stimulation; (b) non‐specific cells that are sensitive to a visual stimulus moving in any direction; (c) immature cells that are preferentially excited by a rectilinear stimulus but are unselective for its precise orientation; (d) specific cells that appear to be as selective for orientation as the simple or complex cells of the adult cat. 3. 23% of the cells presenting adult characteristics of specificity in terms of directionality and orientation are present in both the normally reared and in the dark reared kittens as soon as the first visual response (12 days) appears. 4. In normally reared kittens the proportion of specific cells increases with age, while that of the non‐specific cells decreases. 5. Up to 3 weeks of age there is no significant difference in the proportion of the different types of cells in the dark reared from the normal kittens. But thereafter in the dark reared kittens the specific cells tend to disappear while the non‐specific cells increase in number. 6. This confirms the view that cells with some highly specific response properties of the adult visual cortical neurones, especially in relation to orientation specificity, are present in the earliest stages in the absence of all visual experience. However, visual experience is necessary to maintain and develop these specific cells after the third week of post‐natal life."
            },
            "slug": "Visual-cortical-cells:-their-developmental-in-and-Buisseret-Imbert",
            "title": {
                "fragments": [],
                "text": "Visual cortical cells: their developmental properties in normal and dark reared kittens."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is confirmed that cells with some highly specific response properties of the adult visual cortical neurones, especially in relation to orientation specificity, are present in the earliest stages in the absence of all visual experience, however, visual experience is necessary to maintain and develop these specific cells after the third week of post‐natal life."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117454631"
                        ],
                        "name": "T. Sejnowski",
                        "slug": "T.-Sejnowski",
                        "structuredName": {
                            "firstName": "Terry",
                            "lastName": "Sejnowski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Sejnowski"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 13
                            }
                        ],
                        "text": "For example, Sejnowski (1977a) has suggested a form of modification in which the change of thejth synaptic strength involves the co-variance between thejth fiber and postsynaptic activities."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 32481732,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "06750975439e79fcd852cbcdc38bf1ef084af89a",
            "isKey": false,
            "numCitedBy": 174,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Statistical-constraints-on-synaptic-plasticity.-Sejnowski",
            "title": {
                "fragments": [],
                "text": "Statistical constraints on synaptic plasticity."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of theoretical biology"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 165,
                                "start": 148
                            }
                        ],
                        "text": "…a \" critical \" period (ranging from about 3 to about 12 weeks), results in a rapid loss of binocularity, to the profit of the open eye (Wiesel and Hubel, 1963, 1965); then, opening the closed eye and closing the experienced one may result in a complete reversal of ocular dominance (Blakemore and…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 10511297,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "34f989681ef0ed85c9f809e96118e1a360702527",
            "isKey": false,
            "numCitedBy": 1083,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "IN A SERIES OF STUDIES on the cat over the past 5 years we have recorded from single cells in the striate cortex and mapped receptive fields using patterned retinal stimulation. The results suggest that connections between geniculate and striate cortex, and between cortical cells, must be highly specific (5). Indeed, cells in the striate cortex respond in such a characteristic way that departures from the normal adult physiology should be easily recognizable. In the present study we have made similar experiments in kittens ranging in age from l-3 weeks. Our purpose was to learn the age at which cortical cells have normal, adult-type receptive fields, and to find out whether such fields exist even in animals that have had no patterned visual stimulation."
            },
            "slug": "RECEPTIVE-FIELDS-OF-CELLS-IN-STRIATE-CORTEX-OF-VERY-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "RECEPTIVE FIELDS OF CELLS IN STRIATE CORTEX OF VERY YOUNG, VISUALLY INEXPERIENCED KITTENS."
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "The purpose was to learn the age at which cortical cells have normal, adult-type receptive fields, and to find out whether such fields exist even in animals that have had no patterned visual stimulation."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2251584"
                        ],
                        "name": "K. Kratz",
                        "slug": "K.-Kratz",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Kratz",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Kratz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3542110"
                        ],
                        "name": "P. D. Spear",
                        "slug": "P.-D.-Spear",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Spear",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. D. Spear"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "In animals whose eyelids have been sutured at birth and which are thus binocularly deprived of pattern vision (BD), a somewhat higher proportion (from 12 to 50%) of the visually excitable cells are still orientation selective at 6 weeks (and even beyond 24 months of age) and the proportion of binocular cells is less than normal (Wiesel and Hubel, 1965; Blakemore and Van Sluyters, 1975;  Kratz and Spear, 1976;  Leventhal and Hirsch, 1977; ..."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 33286701,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "a7faa813ba166d37035aff48d71b607a4e6bd61a",
            "isKey": false,
            "numCitedBy": 86,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "Electrophysiological recordings were made from single neurons in striate cortex of normally reared kittens (group N), kittens raised with binocular lid‐suture (group BD), and kittens raised with one eye lid‐sutured and the other eye removed (group MD‐E). The MD‐E group represents a condition in which inputs from the deprived eye have been placed at a competitive advantage over those from the other eye."
            },
            "slug": "Effects-of-visual-deprivation-and-alterations-in-on-Kratz-Spear",
            "title": {
                "fragments": [],
                "text": "Effects of visual deprivation and alterations in binocular competition on responses of striate cortex neurons in the cat"
            },
            "tldr": {
                "abstractSimilarityScore": 88,
                "text": "Electrophysiological recordings were made from single neurons in striate cortex of normally reared kittens, kitten raised with binocular lid‐suture, and kittens raised with one eye lid-sutured and the other eye removed to represent a condition in which inputs from the deprived eye have been placed at a competitive advantage over those from the otherEye."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5853144"
                        ],
                        "name": "A. M. Uttley",
                        "slug": "A.-M.-Uttley",
                        "structuredName": {
                            "firstName": "Albert",
                            "lastName": "Uttley",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. M. Uttley"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 103
                            }
                        ],
                        "text": "Exponential kernels K(t) = exp(-t/T) often are used in this context (see, e.g., Nass and Cooper, 1975; Uttley, 1976)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 46553709,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bd00186bd3d555163b2b30d519edd335e78abdb8",
            "isKey": false,
            "numCitedBy": 30,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-two-pathway-informon-theory-of-conditioning-and-Uttley",
            "title": {
                "fragments": [],
                "text": "A two-pathway informon theory of conditioning and adaptive pattern recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Brain Research"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145707107"
                        ],
                        "name": "J. Movshon",
                        "slug": "J.-Movshon",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Movshon",
                            "middleNames": [
                                "Anthony"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Movshon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 38,
                                "start": 25
                            }
                        ],
                        "text": "This Van Sluyters, 1974; Movshon, 1976). length is thought to correspond to the intensity of light UR (Fig."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 7703311,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "eeba2d15d5f4e78eec7d19d63e3e7910bda69cf9",
            "isKey": false,
            "numCitedBy": 175,
            "numCiting": 64,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Twenty‐three kittens were monocularly deprived of vision until the age of 4, 5, 6 or 7 weeks. Their deprived eyes were then opened, and their experienced eyes shut for a further 3‐63 days. After this time physiological recordings were made in the visual cortex, area 17. Three control kittens, monocularly deprived for various periods, showed that at the time of reverse‐suturing, few neurones could be influenced at all from the deprived eye. 2. Following reverse‐suturing, the initially deprived eye regained control of cortical neurones. This switch of cortical ocular dominance was most rapid following reverse‐suturing at the age of 4 weeks. Delaying the age of reverse‐suturing reduced the rate and then the extent of the cortical ocular dominance changes. 3. The cortex of reverse‐sutured kittens is divided into regions of cells dominated by one eye or the other. The relative sizes of these ocular dominance columns changed during reversed deprivation. The columns devoted to the initially deprived eye were very small in animals reverse‐sutured for brief periods, but in animals that underwent longer periods of reversed deprivation, the columns driven by that eye were larger, while those devoted to the initially open eye were smaller. 4. Clear progressions of orientation columns across the cortex were apparent in many of the kittens, but, in contrast to the situation in normal or strabismic kittens, these sequences were disrupted at the borders of eye dominance columns: the cortical representations of orientation and ocular dominance were not independent. 5. Binocular units in these kittens were rather rare, but those that could be found often had dissimilar receptive field properties in the two eyes. Commonly, a cell would have a normal orientation selective receptive field in one eye, and an immature, unselective receptive field in the other. Cells that had orientation selective receptive fields in both eyes often had greatly differing orientation preferences in the two eyes, occasionally by nearly 90 degrees. 6. During the reversal of deprivation effects, the proportion of receptive fields exhibiting mature properties declined in the initially experienced eye, while the proportion increased in the initially deprived eye. Similarly, the average band width of orientation tuning of receptive fields in the initially deprived eye decreased, while that of receptive fields in the initially experienced eye increased. 7. One kitten was reverse‐sutured twice, to demonstrate that cortical ocular dominance may be reversed a second time, even after one reversal of ocular dominance. 8. It is suggested that the sensitive period for cortical binocular development consists of two phases. In the first phase, all cortical neurones may be modified by experience, but the rate at which they may be modified decreases with age. In the second phase, an increasing number of cortical neurones becomes fixed in their properties, while those that remain modifiable are as modifiable as they were at the end of the first phase. 9..."
            },
            "slug": "Reversal-of-the-physiological-effects-of-monocular-Movshon",
            "title": {
                "fragments": [],
                "text": "Reversal of the physiological effects of monocular deprivation in the kitten's visual cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It is suggested that the sensitive period for cortical binocular development consists of two phases, in which an increasing number of cortical neurones becomes fixed in their properties, while those that remain modifiable are as modifiable as they were at the end of the first phase."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50533883"
                        ],
                        "name": "T. Kasamatsu",
                        "slug": "T.-Kasamatsu",
                        "structuredName": {
                            "firstName": "Takuji",
                            "lastName": "Kasamatsu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kasamatsu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1967464"
                        ],
                        "name": "J. Pettigrew",
                        "slug": "J.-Pettigrew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Pettigrew",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pettigrew"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 148,
                                "start": 112
                            }
                        ],
                        "text": "Evidence for the existence of global factors that affect development may be found, for instance, in the work of Kasamatsu and Pettigrew (1976, 1979), Singer (1979) (1980), and Buisseret et al. (1978)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 29425427,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "ac2044745c7f3eeded176f32fa1c18266e6569f2",
            "isKey": false,
            "numCitedBy": 310,
            "numCiting": 55,
            "paperAbstract": {
                "fragments": [],
                "text": "The results of single unit recordings from Area 17 of monocularly deprived kittens were compared with similar ones from littermates who had been monocularly lid‐sutured for the same period of time, but who had in addition been given intraventricular injections of 6‐hydroxydopamine (6‐OHDA) to deplete brain catecholamines. The visual cortices of all catecholamine‐depleted kittens showed high proportions of binocular neurons, in contrast to the control group, a majority of whose visual cortical neurons were driven exclusively by the non‐deprived eye. Preservation of binocularity in 6‐OHDA‐treated kittens was dose‐related. Even after a 1 to 2‐week period of lidsuture which reduced binocularity to 20% in controls, normal proportions of binocular neurons (>75%) were preserved if the cumulative dose had been 10 mg 6‐OHDA or more. The density of single neurons sampled from electrode tracks through the cortex of drug‐treated kittens was high and did not differ significantly from controls. Neurons were isolated every 100 μm on the average. There was some indication that the drug's effect in preventing an ocular dominance shift disappears by six weeks following cessation of 6‐OHDA treatment. This reversal of the physiological effects in cortex is preceded by recovery from the behavioral manifestations of 6‐OHDA treatments. Binocularity was only slightly increased in a kitten who received large doses of 6‐OHDA after a period of monocular deprivation. This observation, together with control recordings from normal kittens and adults treated with 6‐OHDA, indicates that the direct effects of 6‐OHDA on cortical neurons' response properties play a minor role in comparison to its effects in reducing the sensitivity of the cortex to monocular deprivation. The overwhelming majority of cortical neurons in 6‐OHDA‐treated kittens remained normal in receptive field properties after a period of monocular deprivation. These data support the hypothesis that catecholamines are required for the maintenance of visual cortical plasticity during the critical period."
            },
            "slug": "Preservation-of-binocularity-after-monocular-in-the-Kasamatsu-Pettigrew",
            "title": {
                "fragments": [],
                "text": "Preservation of binocularity after monocular deprivation in the striate cortex of kittens treated with 6‐Hydroxydopamine"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The hypothesis that catecholamines are required for the maintenance of visual cortical plasticity during the critical period is supported, as the overwhelming majority of cortical neurons in 6‐OHDA‐treated kittens remained normal in receptive field properties after a period of monocular deprivation."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3133875"
                        ],
                        "name": "C. Blakemore",
                        "slug": "C.-Blakemore",
                        "structuredName": {
                            "firstName": "Colin",
                            "lastName": "Blakemore",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Blakemore"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "118303839"
                        ],
                        "name": "R. C. Van Sluyters",
                        "slug": "R.-C.-Van-Sluyters",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Van Sluyters",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. C. Van Sluyters"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 2573778,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "5b9bea5c796b6576d75845c8837fd20545278933",
            "isKey": false,
            "numCitedBy": 421,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "1. It was confirmed that suturing the lids of one eye (monocular deprivation), until only 5 weeks of age, leaves virtually every neurone in the kitten's visual cortex entirely dominated by the other eye. On the other hand, deprivation of both eyes causes no change in the normal ocular dominance of cortical neurones, most cells being clearly binocularly driven."
            },
            "slug": "Reversal-of-the-physiological-effects-of-monocular-Blakemore-Sluyters",
            "title": {
                "fragments": [],
                "text": "Reversal of the physiological effects of monocular deprivation in kittens: further evidence for a sensitive period"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "It was confirmed that suturing the lids of one eye (monocular deprivation), until only 5 weeks of age, leaves virtually every neurone in the kitten's visual cortex entirely dominated by the other eye."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153281777"
                        ],
                        "name": "D. Marr",
                        "slug": "D.-Marr",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Marr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Marr"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "It is known that various algorithms related to Hebb’s principle of synaptic modification (Hebb, 1949) can account for the formation of associative and distributed memories (see, for example,  Marr, 1969;  Brindley, 1969; Anderson, 1970, 1972; Cooper, 1973; Kohonen, 1977)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 19906341,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "3c6f34131ad83fda26a3d8ca9892a6705fd40d11",
            "isKey": false,
            "numCitedBy": 3072,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "1. A detailed theory of cerebellar cortex is proposed whose consequence is that the cerebellum learns to perform motor skills. Two forms of input—output relation are described, both consistent with the cortical theory. One is suitable for learning movements (actions), and the other for learning to maintain posture and balance (maintenance reflexes)."
            },
            "slug": "A-theory-of-cerebellar-cortex-Marr",
            "title": {
                "fragments": [],
                "text": "A theory of cerebellar cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "A detailed theory of cerebellar cortex is proposed whose consequence is that the cerebellum learns to perform motor skills and two forms of input—output relation are described, both consistent with the cortical theory."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50533883"
                        ],
                        "name": "T. Kasamatsu",
                        "slug": "T.-Kasamatsu",
                        "structuredName": {
                            "firstName": "Takuji",
                            "lastName": "Kasamatsu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kasamatsu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1967464"
                        ],
                        "name": "J. Pettigrew",
                        "slug": "J.-Pettigrew",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Pettigrew",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Pettigrew"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Evidence for the existence of global factors that affect development may be found, for instance, in the work of  Kasamatsu and Pettigrew (1976, 1979) , Singer (1979, 1980), and Buisseret et al. (1978)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 148,
                                "start": 112
                            }
                        ],
                        "text": "Evidence for the existence of global factors that affect development may be found, for instance, in the work of Kasamatsu and Pettigrew (1976, 1979), Singer (1979) (1980), and Buisseret et al. (1978)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9368264,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "8553cfe07f6d1be93a185f9355a44c8b89257110",
            "isKey": false,
            "numCitedBy": 428,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "Monocularly deprived kittens were compared with littermates that had had their eyelids sutured for the same time but that had, in addition, been treated with 6-hydroxydopamine to deplete their forebrains of catecholamines. The visual cortices of all the catecholamine-depleted kittens showed high proportions of binocular neurons, in contrast to the control group, most of whose visual cortical neurons were driven exclusively by the nondeprived eye. Catecholamines may play an important role in the maintenance of cortical plasticity during the critical period."
            },
            "slug": "Depletion-of-brain-catecholamines:-failure-of-shift-Kasamatsu-Pettigrew",
            "title": {
                "fragments": [],
                "text": "Depletion of brain catecholamines: failure of ocular dominance shift after monocular occlusion in kittens."
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "The visual cortices of all the catecholamine-depleted kittens showed high proportions of binocular neurons, in contrast to the control group, most of whose visual cortical neurons were driven exclusively by the nondeprived eye."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688681"
                        ],
                        "name": "T. Kohonen",
                        "slug": "T.-Kohonen",
                        "structuredName": {
                            "firstName": "Teuvo",
                            "lastName": "Kohonen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kohonen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 269,
                                "start": 172
                            }
                        ],
                        "text": "It is known that various algorithms related to Hebb’s principle of synaptic modification (Hebb, 1949) can account for the formation of associative and distributed memories (see, for example, Marr, 1969; Brindley, 1969; Anderson, 1970, 1972; Cooper, 1973; Kohonen, 1977)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 141,
                                "start": 126
                            }
                        ],
                        "text": "selectivity as defined here and the optimal associative mappings of synaptic modification as a specific correlation modifica- Kohonen (1977)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 250,
                                "start": 236
                            }
                        ],
                        "text": "In a broader context, we may regard our form of \" Notice, for instance, the analogy between states of maximum selectivity as defined here and the optimal associative mappings of synaptic modification as a specific correlation modifica- Kohonen (1977)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 60862320,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f3a217c11175f2cf904b2f7f6378b7ade176f2d0",
            "isKey": true,
            "numCitedBy": 593,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Why should wait for some days to get or receive the associative memory a system theoretical approach book that you order? Why should you take it if you can get the faster one? You can find the same book that you order right here. This is it the book that you can receive directly after purchasing. This associative memory a system theoretical approach is well known book in the world, of course many people will try to own it. Why don't you become the first? Still confused with the way?"
            },
            "slug": "Associative-memory.-A-system-theoretical-approach-Kohonen",
            "title": {
                "fragments": [],
                "text": "Associative memory. A system-theoretical approach"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "This associative memory a system theoretical approach is well known book in the world, of course many people will try to own it and this is it the book that you can receive directly after purchasing."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 189,
                                "start": 167
                            }
                        ],
                        "text": "…the visually excitable cells are still orientation selective at 6 weeks (and even beyond 24 months of age) and the proportion of binocular cells is less than normal (Wiesel and Hubel, 1965; Blakemore and Van Sluyters, 1975; Kratz and Spear, 1976; Leventhal and Hirsch, 1977; Watkins et al., 1978 )."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 172,
                                "start": 144
                            }
                        ],
                        "text": "…during a \" critical \" period (ranging from about 3 to about 12 weeks), results in a rapid loss of binocularity, to the profit of the open eye (Wiesel and Hubel, 1963, 1965); then, opening the closed eye and closing the experienced one may result in a complete reversal of ocular dominance…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Of all visual deprivation paradigms, putting one eye in a competitive advantage over the other has probably the most striking consequences: monocular lid suture (MD), if it is performed during a “critical” period (ranging from about 3 to about 12 weeks), results in a rapid loss of binocularity, to the profit of the open eye ( Wiesel and Hubel, 1963, 1965 ); then, opening the closed eye and closing the experienced one may result in a complete ..."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "In animals whose eyelids have been sutured at birth and which are thus binocularly deprived of pattern vision (BD), a somewhat higher proportion (from 12 to 50%) of the visually excitable cells are still orientation selective at 6 weeks (and even beyond 24 months of age) and the proportion of binocular cells is less than normal ( Wiesel and Hubel, 1965;  Blakemore and Van Sluyters, 1975; Kratz and Spear, 1976; Leventhal and Hirsch, 1977; ..."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6734555,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "3041e2f5116cab83b024d5a66dc85779ab082995",
            "isKey": true,
            "numCitedBy": 656,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Seven kittens were used, and the various procedures of deprivation and subsequent studies are summarized in Table 1. In six animals the Iids of one eye were closed for the first 3 months of life. In the recovery period two of these kittens had the deprived eye opened. The other four had the deprived eye opened and the other (previously open) eye was closed. The seventh animal had both eyes closed for 3 months; the right eye was then opened. Recovery periods"
            },
            "slug": "Extent-of-recovery-from-the-effects-of-visual-in-Wiesel-Hubel",
            "title": {
                "fragments": [],
                "text": "Extent of recovery from the effects of visual deprivation in kittens."
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Seven kittens were used, and the various procedures of deprivation and subsequent studies are summarized in Table 1."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1965
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 104,
                                "start": 85
                            }
                        ],
                        "text": "notion of selectivity with respect to a random variable “In Figure 1B of Fregnac and Bienenstock (1981), which shows that might be applied in many different situations (in the averaged orientation tuning curves of a cell recorded in an 86-day-old domain of development of sensory systems, for example, DR cat, the selectivity is 0."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 77,
                                "start": 59
                            }
                        ],
                        "text": "For exact statements and proofs, the reader is referred to Bienenstock (1980)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 78,
                                "start": 59
                            }
                        ],
                        "text": "For exact statements and proofs, the reader is referred to Bienenstock (1980). We first study the simple case where d takes on values on only two possible input vectors, d’ and d2, that occur with the same probability:"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 293,
                                "start": 275
                            }
                        ],
                        "text": "It is worth mentioning that, when co.@', d2)   0, the situation is much more complicated: trap regions do not necessarily exist and periodic asymptotic behavior (i.e., limit cycles) may occur, bifurcating from the stable fixed points when cos(d', d2) becomes too negative (see Bienenstock , 1980)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 19,
                                "start": 0
                            }
                        ],
                        "text": "Bienenstock (1981) Specific functional stands in a selective state with respect to the environmodifications of individual cortical neurons, triggered by"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 208,
                                "start": 191
                            }
                        ],
                        "text": "The precise form of the integrative power is not essential: our results remain unchanged if, for instance, c(t) = S(m( t) . d( t)), with S being a positive-valued sigmoidshaped function (see Bienenstock, 1980)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 154
                            }
                        ],
                        "text": "Intermediate cases (i.e., environments consisting of the sum of a noise process and of a circular process) also have been investigated (see, for example, Bienenstock, 1980)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A theory of development of neuronal"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 30
                            }
                        ],
                        "text": "The resulting “ideal synapse” (Nass and Cooper, 1975) thus may be of either sign, depending on whether the net effect is excitatory or inhibitory; it also may change sign during development."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 33
                            }
                        ],
                        "text": "The resulting \" ideal synapse \" (Nass and Cooper, 1975) thus may be of either sign, depending on whether the net effect is excitatory or inhibitory; it also may change sign during devel- opment."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 135,
                                "start": 114
                            }
                        ],
                        "text": "In addition, interaction between neurons (such as lateral inhibition) can increase selectivity (see, for example, Nass and Cooper, 1975 and \" Appendii D \" )."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 101,
                                "start": 80
                            }
                        ],
                        "text": "Exponential kernels K(t) = exp(-t/T) often are used in this context (see, e.g., Nass and Cooper, 1975; Uttley, 1976)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "monocular deprivation in the kitten’s visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol. (Lond.)"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 68,
                                "start": 54
                            }
                        ],
                        "text": "It is worth mentioning observation of Rauschecker and Singer (1981) that an"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 181,
                                "start": 167
                            }
                        ],
                        "text": ", monocularly deprived animals (Stent, 1973)) as well as some aspects of certain more complex deprivation paradigms such as those recently reported by Rauschecker and Singer (1981). In the present work, we present a mechanism of synaptic modification that results in a temporal competition between input patterns rather than a spatial competition between different synapses."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 19
                            }
                        ],
                        "text": "by Rauschecker and Singer (1981), this dichotomy is obscured, or does"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Central gating of developmental plasticity in the cat striate cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Verh. Dtsch. Zool. Ges. 268-274"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143886582"
                        ],
                        "name": "R. Pérez",
                        "slug": "R.-Pérez",
                        "structuredName": {
                            "firstName": "Rafael",
                            "lastName": "Pérez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Pérez"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145548576"
                        ],
                        "name": "L. Glass",
                        "slug": "L.-Glass",
                        "structuredName": {
                            "firstName": "Leon",
                            "lastName": "Glass",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Glass"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9640800"
                        ],
                        "name": "R. Shlaer",
                        "slug": "R.-Shlaer",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Shlaer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Shlaer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 179,
                                "start": 161
                            }
                        ],
                        "text": "This is a reasonable assumption which is obviously satisfied if all components of the inputs are positive, as is assumed in some models (von der Malsburg, 1973; Perez et al., 1975)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 38522356,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "93ded91ec8dbb7a15aeb6b65d12346bfddf11507",
            "isKey": false,
            "numCitedBy": 61,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Development-of-Specificity-in-the-Cat-Visual-Cortex-Pérez-Glass",
            "title": {
                "fragments": [],
                "text": "Development of Specificity in the Cat Visual Cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Journal of mathematical biology"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "21484174"
                        ],
                        "name": "A. Leventhal",
                        "slug": "A.-Leventhal",
                        "structuredName": {
                            "firstName": "Audie",
                            "lastName": "Leventhal",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Leventhal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2399836"
                        ],
                        "name": "H. Hirsch",
                        "slug": "H.-Hirsch",
                        "structuredName": {
                            "firstName": "Helmut",
                            "lastName": "Hirsch",
                            "middleNames": [
                                "V.",
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Hirsch"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 270,
                                "start": 244
                            }
                        ],
                        "text": "…depending on the authors and the classification criteria); however, the distribution of ocular dominance seems unaffected (Blakemore and Mitchell, 1973; Imbert and Buisseret, 1975; Blakemore and Van Sluyters, 1975; Buisseret and Imbert, 1976; Leventhal and Hirsch, 1980; Fregnac and Imbert, 1978)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "However, if the animal is reared in total darkness from birth to the age of 6 weeks (DR), then none or few orientation-selective cells are recorded (from 0 to 15%, depending on the authors and the classification criteria); however, the distribution of ocular dominance seems unaffected (Blakemore and Mitchell, 1973; Imbert and Buisseret, 1975; Blakemore and Van Sluyters, 1975; Buisseret and Imbert, 1976;  Leventhal and Hirsch, 1980;  Fregnac ..."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 38350847,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "fdf1ab726b1b90b0f13ae287d8305db20fd56fa8",
            "isKey": false,
            "numCitedBy": 117,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Receptive-field-properties-of-different-classes-of-Leventhal-Hirsch",
            "title": {
                "fragments": [],
                "text": "Receptive-field properties of different classes of neurons in visual cortex of normal and dark-reared cats."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Of all visual deprivation paradigms, putting one eye in a competitive advantage over the other has probably the most striking consequences: monocular lid suture (MD), if it is performed during a “critical” period (ranging from about 3 to about 12 weeks), results in a rapid loss of binocularity, to the profit of the open eye ( Wiesel and Hubel, 1963, 1965 ); then, opening the closed eye and closing the experienced one may result in a complete ..."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14337861,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "cc099151146866673e340e3a23b3c0b5011c8cac",
            "isKey": false,
            "numCitedBy": 2428,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "SINGLE-CELL-RESPONSES-IN-STRIATE-CORTEX-OF-KITTENS-Wiesel-Hubel",
            "title": {
                "fragments": [],
                "text": "SINGLE-CELL RESPONSES IN STRIATE CORTEX OF KITTENS DEPRIVED OF VISION IN ONE EYE."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1963
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Development of the neurons in the cat striate cortex"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Nerve net models of plausible size that Ir X X perform many simple learning tasks"
            },
            "venue": {
                "fragments": [],
                "text": "Proc . R . Sot . Lond . O 8 X NX ( Biol . )"
            },
            "year": 1969
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Visual experience interactive memory"
            },
            "venue": {
                "fragments": [],
                "text": "Math . Biosci ."
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Development of the neurons in the cat striate cortex 574- brain depends on the visual environment"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol. (Lond.) Nature"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Innate and environmental factors in the development of the kitten ’ s s al K X visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "J . Physiol . ( Lond . )"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A theory of development of neuronal receptive fields in cats"
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A two pathway theory of conditioning and adaptive pattern recognition"
            },
            "venue": {
                "fragments": [],
                "text": "Brain Res ."
            },
            "year": 1976
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 72,
                                "start": 51
                            }
                        ],
                        "text": "Thus, we may conclude that and Mitchell (1980) and Trotter et al. (1981) that, after orientation selectivity as observed in the NR case (both a brief period of monocular exposure, oriented cells are more monocular than non-oriented ones as well as the experimental and theoretical) cannot be…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Gating control of developmental plasticity by extraocular proprioception in kitten area 17"
            },
            "venue": {
                "fragments": [],
                "text": "Fourth European Conference on Visual Perception"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Two models for memory organization Hebb, D. 0. (1949) Organization of Behavior, John Wiley and using interacting traces"
            },
            "venue": {
                "fragments": [],
                "text": "Math. Biosci"
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A simple neural network generating"
            },
            "venue": {
                "fragments": [],
                "text": "Visual experience interactive memory. Math. Biosci"
            },
            "year": 1972
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A theory for the coordinate . acquisition and loss of neuron specificity in visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Biol . Cybern ."
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "J. Neurophysiol"
            },
            "venue": {
                "fragments": [],
                "text": "J. Neurophysiol"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A theory of cerebelhu cortex"
            },
            "venue": {
                "fragments": [],
                "text": "J . Physiol . ( Lond . )"
            },
            "year": 1969
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The conditions required for the maintevisual exposure during development"
            },
            "venue": {
                "fragments": [],
                "text": "Exp . Brain Res . J . Physiol ."
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Two models for memory organization"
            },
            "venue": {
                "fragments": [],
                "text": "Hebb, D"
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Receptive fields of single Blakemore"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol. (Lond.) 148: 574brain depends on the visual environment"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 189,
                                "start": 178
                            }
                        ],
                        "text": "…the visually excitable cells are still orientation selective at 6 weeks (and even beyond 24 months of age) and the proportion of binocular cells is less than normal (Wiesel and Hubel, 1965; Blakemore and Van Sluyters, 1975; Kratz and Spear, 1976; Leventhal and Hirsch, 1977; Watkins et al., 1978 )."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 165,
                                "start": 148
                            }
                        ],
                        "text": "…a \" critical \" period (ranging from about 3 to about 12 weeks), results in a rapid loss of binocularity, to the profit of the open eye (Wiesel and Hubel, 1963, 1965); then, opening the closed eye and closing the experienced one may result in a complete reversal of ocular dominance (Blakemore and…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 156,
                                "start": 134
                            }
                        ],
                        "text": "A disruption of binocularity that does not favor one of the eyes may be obtained, for example, by provoking an artificial strabismus (Hubel and Wiesel, 1965) or by an alternating monocular occlusion, which gives both eyes an equal amount of visual stimulation (Blakemore, 1976)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Binocular interaction in striate cortex of kittens with artificial squint"
            },
            "venue": {
                "fragments": [],
                "text": "J . Neurophysiol ."
            },
            "year": 1965
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 199,
                                "start": 112
                            }
                        ],
                        "text": "Evidence for the existence of global factors that affect development may be found, for instance, in the work of Kasamatsu and Pettigrew (1976, 1979), Singer (1979, 1980), and Buisseret et al. (1978). On the other hand, local information available at each modifiable synapse can influence each junction in a different manner."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 543,
                                "start": 112
                            }
                        ],
                        "text": "Evidence for the existence of global factors that affect development may be found, for instance, in the work of Kasamatsu and Pettigrew (1976, 1979), Singer (1979, 1980), and Buisseret et al. (1978). On the other hand, local information available at each modifiable synapse can influence each junction in a different manner. In this paper, we are interested primarily in the effect of local information on the development of selectivity. An early proposal as to how local information could affect synaptic modification was made by Hebb (1949). His, now classical, principle was suggested as a possible neurophysiological basis for operant conditioning: “when an axon of cell A is near enough to excite a cell B and repeatedly or persistently takes part in firing it, some growth process or metabolic change takes place in one or both cells such that A’s efficiency, as one of the cells firing B, is increased."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 148,
                                "start": 112
                            }
                        ],
                        "text": "Evidence for the existence of global factors that affect development may be found, for instance, in the work of Kasamatsu and Pettigrew (1976, 1979), Singer (1979) (1980), and Buisseret et al. (1978)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "ocular occlusion in kittens"
            },
            "venue": {
                "fragments": [],
                "text": "J. Comp. Neurol"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "ular interaction and functional architecture in the cat’s visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol. (Lond.)"
            },
            "year": 1963
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Modification of the RI. distribution of receptive field orientation in cats by selective Blakemore, C. (1976) The conditions required for the maintevisual exposure during development"
            },
            "venue": {
                "fragments": [],
                "text": "Exp. Brain Res"
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Organization of Behavior , John Wiley and using interacting traces"
            },
            "venue": {
                "fragments": [],
                "text": "Math . Biosci ."
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A theory and interconnected according to a fixed shortrangeexcitationof the epigenesis of neuronal networks by selective stabilization of synapses"
            },
            "venue": {
                "fragments": [],
                "text": "Proc . Natl . Acad . Sci . U . S . A ."
            },
            "year": 1973
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 163,
                                "start": 150
                            }
                        ],
                        "text": "Evidence for the existence of global factors that affect development may be found, for instance, in the work of Kasamatsu and Pettigrew (1976, 1979), Singer (1979) (1980), and Buisseret et al. (1978)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Central - core control of visual functions"
            },
            "venue": {
                "fragments": [],
                "text": "Neuroscience Fourth Study Program"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binoc- Bienenstock et al Jan. 1982 ular interaction and functional architecture in the cat's visual cortex"
            },
            "venue": {
                "fragments": [],
                "text": "J. Physiol. (Lond.)"
            },
            "year": 1962
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The paradox of the critical period for striate cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Neuronal Plasticity"
            },
            "year": 1978
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 28,
            "methodology": 2
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 54,
        "totalPages": 6
    },
    "page_url": "https://www.semanticscholar.org/paper/Theory-for-the-development-of-neuron-selectivity:-Bienenstock-Cooper/9f22cf81654dd50b95e65b86b1125cfe6803a67b?sort=total-citations"
}