{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14801990,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6f20e254e3993538c79e0ff2b9b8f198d3359cb3",
            "isKey": false,
            "numCitedBy": 4215,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "In the central nervous system the visual pathway from retina to striate cortex provides an opportunity to observe and compare single unit responses at several distinct levels. Patterns of light stimuli most effective in influencing units at one level may no longer be the most effective at the next. From differences in responses at successive stages in the pathway one may hope to gain some understanding of the part each stage plays in visual perception. By shining small spots of light on the light-adapted cat retina Kuffler (1953) showed that ganglion cells have concentric receptive fields, with an 'on' centre and an 'off ' periphery, or vice versa. The 'on' and 'off' areas within a receptive field were found to be mutually antagonistic, and a spot restricted to the centre of the field was more effective than one covering the whole receptive field (Barlow, FitzHugh & Kuffler, 1957). In the freely moving lightadapted cat it was found that the great majority of cortical cells studied gave little or no response to light stimuli covering most of the animal's visual field, whereas small spots shone in a restricted retinal region often evoked brisk responses (Hubel, 1959). A moving spot of light often produced stronger responses than a stationary one, and sometimes a moving spot gave more activation for one direction than for the opposite. The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex. Receptive fields of the cells considered in this paper were divided into separate excitatory and inhibitory ('on' and 'off') areas. In this respect they resembled retinal ganglion-cell receptive fields. However, the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinal ganglion cells. An attempt was made to correlate responses to moving stimuli"
            },
            "slug": "Receptive-fields-of-single-neurones-in-the-cat's-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields of single neurones in the cat's striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The present investigation, made in acute preparations, includes a study of receptive fields of cells in the cat's striate cortex, which resembled retinal ganglion-cell receptive fields, but the shape and arrangement of excitatory and inhibitory areas differed strikingly from the concentric pattern found in retinalganglion cells."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12432,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 3063181,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "34898b2e1cb9f7872d2d66fdfcf3a9644948463b",
            "isKey": false,
            "numCitedBy": 773,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Cells were recorded with tungsten electrodes in the dorsal lateral geniculate body of the cat. Receptive fields of these units were mapped out, in the light-adapted state, with small sports of light. In their general arrangement geniculate receptive fields resembled those of retinal ganglion cells, having an excitatory ('on') centre and inhibitory ('off') preriphery, or reverse. The two portions of a receptive field were mutually antagonistic; the decrease in centre responses cauded by inclusion of peripheral portions of receptive fields was termed peripheral suppression. Cells recorded in layers A and B of the lateral geniculate body were driven from the contralateral eye; cells in layer A1 from the ipsilateral eye. In penetrations normal to the layers receptive fields of cells in a single layer were close together or superimposed, and from one layer to the next occupied exactly homologous positions in the two retinas. Binocular interaction was not observed in any of the cells studied. All three layers of the lateral geniculate contained both 'on'-centre and 'off'-centre units. Cells in layers A and A1 were similar both in their firing patterns and in average receptive field size. Cells in layer B were more sluggish in their responses to light stimuli, and tended to have larger receptive field centres. Cells with receptive fields within or near the area centralis tended to have smaller field centres and stronger suppression by the receptive field periphery than cells with their fields situated in more peripheral regions of the retina."
            },
            "slug": "Integrative-action-in-the-cat's-lateral-geniculate-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Integrative action in the cat's lateral geniculate body"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Receptive fields of geniculate receptive fields resembled those of retinal ganglion cells, having an excitatory ('on') centre and inhibitory preriphery, or reverse, and cells with receptive fields within or near the area centralis tended to have smaller field centres and stronger suppression by the receptive field periphery than cells with their fields situated in more peripheral regions of the retina."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 33565783,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b0b13465c36789ebd0751178c5403efd4dd390b9",
            "isKey": false,
            "numCitedBy": 357,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Receptive fields of retinal ganglion cells were studied in the light-adapted spider monkey. All fields mapped with white light had a concentric arrangement sililar to that of the cat retinal ganglion cells, with a sharply demarcated 'on' centre surrounded by an antagonistic 'off' periphery, or the reverse. The smallest receptive field centres were found near the fovea, and the size of centres tended to increase with increasing distance from the fovea. The smallest centre had a diameter of 4 minutes of arc (corresponding to about 20 microns on the retina) and was located 4 degrees from the fovea; the largest centre had a diameter of 2 degrees. Three ganglion cells out of about 100 responded in a specific way to coloured stimuli. In these cells light of short wave-length produced an 'on' response and light of long wave-length evoked inhibition followed by an 'off' response. Transition between the two types of response occurred at about 500 millimicrons, light of this wave-length evoked only feebel 'off' responses. Very weak responses were obtained to white light, presumably owing to the antagonism between light of short and long wavelengths. (Author)"
            },
            "slug": "Receptive-fields-of-optic-nerve-fibres-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields of optic nerve fibres in the spider monkey"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "Receptive fields of retinal ganglion cells were studied in the light-adapted spider monkey with very weak responses to white light, presumably owing to the antagonism between light of short and long wavelengths."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3809364"
                        ],
                        "name": "V. Mountcastle",
                        "slug": "V.-Mountcastle",
                        "structuredName": {
                            "firstName": "Vernon",
                            "lastName": "Mountcastle",
                            "middleNames": [
                                "B."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Mountcastle"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6822072,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6ded76b03bd0612974d86a826ce70d2a2b143fb2",
            "isKey": false,
            "numCitedBy": 2208,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "THE PRESENT PAPER describes some observations upon the modality and topographical attributes of single neurons of the first somatic sensory area of the cat’s cerebral cortex, the analogue of the cortex of the postcentral gyrus in the primate brain. These data, together with others upon the response latencies of the cells of different layers of the cortex to peripheral stimuli, support an hypothesis of the functional organization of this cortical area. This is that the neurons which lie in narrow vertical columns, or cylinders, extending from layer II through layer VI make up an elementary unit of organization, for they are activated by stimulation of the same single class of peripheral receptors, from almost identical peripheral receptive fields, at latencies ers. It is early These which are not significantly different for the cells of the various layemphasized that this pattern of organization obtains only for the repetitiv neurons ‘e responses may be rela of ted cortical in quite neurons different to brief peripheral stimuli. organization patterns when analyzed in terms of later discharges. A report of these experiments was made to the American Physiological Society in September, 1955 (10, 17)."
            },
            "slug": "Modality-and-topographic-properties-of-single-of-Mountcastle",
            "title": {
                "fragments": [],
                "text": "Modality and topographic properties of single neurons of cat's somatic sensory cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "Observations upon the modality and topographical attributes of single neurons of the first somatic sensory area of the cat’s cerebral cortex, the analogue of the cortex of the postcentral gyrus in the primate brain, support an hypothesis of the functional organization of this cortical area."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15771537,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5a0c4a618425328ba0bbb9737b02e2ac18f94646",
            "isKey": false,
            "numCitedBy": 413,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "A beginning has recently been made in recording single neurone activity from animals with chronically implanted electrodes (Hubel, 1957a; Gusel'nikov, 1957; Ricci, Doane & Jasper, 1957; Strumwasser, 1958). These methods eliminate anaesthetics, paralysing drugs, brain-stem lesions, and other acute experimental procedures. They make it possible to record electrical events in the higher central nervous system with the animal in a normal state, and to correlate these electrical events with such variables as waking state, attention, learning, and motor activity. The present paper describes a method for unit recording from the cortex of unanaesthetized, unrestrained cats, and presents some observations from the striate cortex. The objectives have been (1) to observe maintained unit activity under various conditions such as sleep and wakefulness, and (2) to find for each unit the natural stimuli which most effectively influence firing. Of 400 units observed, some 200 are presented here because of their common characteristics. Since there is reason to believe that the remainiing 200 units were afferent fibres from the lateral geniculate nucleus, these will be described in a separate paper. A preliminary account of some of this work has been given elsewhere (Hubel, 1958)."
            },
            "slug": "Single-unit-activity-in-striate-cortex-of-cats-Hubel",
            "title": {
                "fragments": [],
                "text": "Single unit activity in striate cortex of unrestrained cats"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "A method for unit recording from the cortex of unanaesthetized, unrestrained cats is described, some observations from the striate cortex are presented, and the objectives have been to observe maintained unit activity under various conditions such as sleep and wakefulness."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26895691,
            "fieldsOfStudy": [
                "Materials Science",
                "Medicine"
            ],
            "id": "663eb5b9acf0e9cc404728d98669012fbfcaa9c2",
            "isKey": false,
            "numCitedBy": 765,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Tungsten-Microelectrode-for-Recording-from-Single-Hubel",
            "title": {
                "fragments": [],
                "text": "Tungsten Microelectrode for Recording from Single Units."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143858852"
                        ],
                        "name": "P. W. Davies",
                        "slug": "P.-W.-Davies",
                        "structuredName": {
                            "firstName": "Philip",
                            "lastName": "Davies",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. W. Davies"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 156
                            }
                        ],
                        "text": "In order to see the surface of the cortex and to vary the point of entry of the electrode we have used a closed-chamber system similar to that described by Davies (1956)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 42678673,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "345e94cf3db0022721f649d9eb75a443a39c31ba",
            "isKey": false,
            "numCitedBy": 66,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Chamber-for-microelectrode-studies-in-the-cerebral-Davies",
            "title": {
                "fragments": [],
                "text": "Chamber for microelectrode studies in the cerebral cortex."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144416252"
                        ],
                        "name": "T. Powell",
                        "slug": "T.-Powell",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Powell",
                            "middleNames": [
                                "Philip",
                                "Stroud"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Powell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3809364"
                        ],
                        "name": "V. Mountcastle",
                        "slug": "V.-Mountcastle",
                        "structuredName": {
                            "firstName": "Vernon",
                            "lastName": "Mountcastle",
                            "middleNames": [
                                "B."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Mountcastle"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 31370931,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "8548884d224f0c2534667b77a86650437125b1e3",
            "isKey": false,
            "numCitedBy": 538,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Some-aspects-of-the-functional-organization-of-the-Powell-Mountcastle",
            "title": {
                "fragments": [],
                "text": "Some aspects of the functional organization of the cortex of the postcentral gyrus of the monkey: a correlation of findings obtained in a single unit analysis with cytoarchitecture."
            },
            "venue": {
                "fragments": [],
                "text": "Bulletin of the Johns Hopkins Hospital"
            },
            "year": 1959
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Photograph of cortical surface showing region mapped in Text-fig. 3; scale, 1 mm. Inset shows area of brain photographed"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Photograph of cortical surface showing region mapped in Text-fig. 4; scale 1 mm. Inset shows area of brain photographed"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Photograph of cortical surface showing region mapped in Text-fig. 4; scale 1 mm. Inset shows area of brain photographed; scale of inset, 1 cm"
            },
            "venue": {
                "fragments": [],
                "text": "Photograph of cortical surface showing region mapped in Text-fig. 4; scale 1 mm. Inset shows area of brain photographed; scale of inset, 1 cm"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 296,
                                "start": 258
                            }
                        ],
                        "text": "…procedures for preparing the animal, including anaesthesia, immobilization of the eyes, correction of refractive errors, and mapping of area centralis and optic disks on the projection\n560 D. H. HUBEL AND T. N. WIESEL screen, have been described elsewhere (Hubel & Wiesel, 1959, 1960, 1961, 1962)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Receptive fields of optic nerve"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Photograph of cortical surface showing region mapped in Text-fig. 3; scale, 1 mm. Inset shows area of brain photographed; scale of inset, 1 cm"
            },
            "venue": {
                "fragments": [],
                "text": "Photograph of cortical surface showing region mapped in Text-fig. 3; scale, 1 mm. Inset shows area of brain photographed; scale of inset, 1 cm"
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "methodology": 2
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 14,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Shape-and-arrangement-of-columns-in-cat's-striate-Hubel-Wiesel/d7fb932bca642615fcbcf3f5d26b2c26666603d3?sort=total-citations"
}