{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2992833"
                        ],
                        "name": "Shuohang Wang",
                        "slug": "Shuohang-Wang",
                        "structuredName": {
                            "firstName": "Shuohang",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Shuohang Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144924150"
                        ],
                        "name": "Jing Jiang",
                        "slug": "Jing-Jiang",
                        "structuredName": {
                            "firstName": "Jing",
                            "lastName": "Jiang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jing Jiang"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 34,
                                "start": 13
                            }
                        ],
                        "text": "For example, Wang and Jiang (2016) obtained 70.3% F1 on SQuAD v1."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 227,
                                "start": 207
                            }
                        ],
                        "text": "Since the release of our dataset, we have already seen considerable interest in building models on this dataset, and the gap between our logistic regression model and human performance has more than halved (Wang and Jiang, 2016)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "0."
                    },
                    "intents": []
                }
            ],
            "corpusId": 5592690,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ff1861b71eaedba46cb679bbe2c585dbe18f9b19",
            "isKey": true,
            "numCitedBy": 541,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "Machine comprehension of text is an important problem in natural language processing. A recently released dataset, the Stanford Question Answering Dataset (SQuAD), offers a large number of real questions and their answers created by humans through crowdsourcing. SQuAD provides a challenging testbed for evaluating machine comprehension algorithms, partly because compared with previous datasets, in SQuAD the answers do not come from a small set of candidate answers and they have variable lengths. We propose an end-to-end neural architecture for the task. The architecture is based on match-LSTM, a model we proposed previously for textual entailment, and Pointer Net, a sequence-to-sequence model proposed by Vinyals et al.(2015) to constrain the output tokens to be from the input sequences. We propose two ways of using Pointer Net for our task. Our experiments show that both of our two models substantially outperform the best results obtained by Rajpurkar et al.(2016) using logistic regression and manually crafted features."
            },
            "slug": "Machine-Comprehension-Using-Match-LSTM-and-Answer-Wang-Jiang",
            "title": {
                "fragments": [],
                "text": "Machine Comprehension Using Match-LSTM and Answer Pointer"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "This work proposes an end-to-end neural architecture for the Stanford Question Answering Dataset (SQuAD), based on match-LSTM, a model previously proposed previously for textual entailment, and Pointer Net, a sequence- to-sequence model proposed by Vinyals et al.(2015) to constrain the output tokens to be from the input sequences."
            },
            "venue": {
                "fragments": [],
                "text": "ICLR"
            },
            "year": 2017
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2790926"
                        ],
                        "name": "Mrinmaya Sachan",
                        "slug": "Mrinmaya-Sachan",
                        "structuredName": {
                            "firstName": "Mrinmaya",
                            "lastName": "Sachan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mrinmaya Sachan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "89890133"
                        ],
                        "name": "Kumar Avinava Dubey",
                        "slug": "Kumar-Avinava-Dubey",
                        "structuredName": {
                            "firstName": "Kumar",
                            "lastName": "Dubey",
                            "middleNames": [
                                "Avinava"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kumar Avinava Dubey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143977260"
                        ],
                        "name": "E. Xing",
                        "slug": "E.-Xing",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Xing",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Xing"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144422314"
                        ],
                        "name": "Matthew Richardson",
                        "slug": "Matthew-Richardson",
                        "structuredName": {
                            "firstName": "Matthew",
                            "lastName": "Richardson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Matthew Richardson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 233,
                                "start": 214
                            }
                        ],
                        "text": "Because many of the questions require commonsense reasoning and reasoning across multiple sentences, the dataset remains quite challenging, though there has been noticeable progress (Narasimhan and Barzilay, 2015; Sachan et al., 2015; Wang et al., 2015)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14071482,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f26e088bc4659a9b7fce28b6604d26de779bcf93",
            "isKey": false,
            "numCitedBy": 57,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "Understanding open-domain text is one of the primary challenges in NLP. Machine comprehension evaluates the system’s ability to understand text through a series of question-answering tasks on short pieces of text such that the correct answer can be found only in the given text. For this task, we posit that there is a hidden (latent) structure that explains the relation between the question, correct answer, and text. We call this the answer-entailing structure; given the structure, the correctness of the answer is evident. Since the structure is latent, it must be inferred. We present a unified max-margin framework that learns to find these hidden structures (given a corpus of question-answer pairs), and uses what it learns to answer machine comprehension questions on novel texts. We extend this framework to incorporate multi-task learning on the different subtasks that are required to perform machine comprehension. Evaluation on a publicly available dataset shows that our framework outperforms various IR and neuralnetwork baselines, achieving an overall accuracy of 67.8% (vs. 59.9%, the best previously-published result.)"
            },
            "slug": "Learning-Answer-Entailing-Structures-for-Machine-Sachan-Dubey",
            "title": {
                "fragments": [],
                "text": "Learning Answer-Entailing Structures for Machine Comprehension"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A unified max-margin framework is presented that learns to find hidden structures that explain the relation between the question, correct answer, and text, and is extended to incorporate multi-task learning on the different subtasks that are required to perform machine comprehension."
            },
            "venue": {
                "fragments": [],
                "text": "ACL"
            },
            "year": 2015
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144422314"
                        ],
                        "name": "Matthew Richardson",
                        "slug": "Matthew-Richardson",
                        "structuredName": {
                            "firstName": "Matthew",
                            "lastName": "Richardson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Matthew Richardson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2676309"
                        ],
                        "name": "C. Burges",
                        "slug": "C.-Burges",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Burges",
                            "middleNames": [
                                "J.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Burges"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1859813"
                        ],
                        "name": "Erin Renshaw",
                        "slug": "Erin-Renshaw",
                        "structuredName": {
                            "firstName": "Erin",
                            "lastName": "Renshaw",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Erin Renshaw"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 99
                            }
                        ],
                        "text": "In addition to the basic sliding window approach, we also implemented the distance-based extension (Richardson et al., 2013)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 7
                            }
                        ],
                        "text": "MCTest (Richardson et al., 2013) crowdsourced RC, multiple choice 2640"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 190,
                                "start": 165
                            }
                        ],
                        "text": "SQuAD contains 107,785 question-answer pairs on 536 articles, and is almost two orders of magnitude larger than previous manually labeled RC datasets such as MCTest (Richardson et al., 2013)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 136,
                                "start": 90
                            }
                        ],
                        "text": "Existing datasets for RC have one of two shortcomings: (i) those that are high in quality (Richardson et al., 2013; Berant et al., 2014) are too small for training modern data-intensive models, while (ii) those that are large (Hermann et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 48
                            }
                        ],
                        "text": "More recently, Richardson et al. (2013) curated MCTest, which contains 660 stories created by crowdworkers, with 4 questions per story and 4 answer choices per question."
                    },
                    "intents": []
                }
            ],
            "corpusId": 2100831,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "564257469fa44cdb57e4272f85253efb9acfd69d",
            "isKey": true,
            "numCitedBy": 594,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "We present MCTest, a freely available set of stories and associated questions intended for research on the machine comprehension of text. Previous work on machine comprehension (e.g., semantic modeling) has made great strides, but primarily focuses either on limited-domain datasets, or on solving a more restricted goal (e.g., open-domain relation extraction). In contrast, MCTest requires machines to answer multiple-choice reading comprehension questions about fictional stories, directly tackling the high-level goal of open-domain machine comprehension. Reading comprehension can test advanced abilities such as causal reasoning and understanding the world, yet, by being multiple-choice, still provide a clear metric. By being fictional, the answer typically can be found only in the story itself. The stories and questions are also carefully limited to those a young child would understand, reducing the world knowledge that is required for the task. We present the scalable crowd-sourcing methods that allow us to cheaply construct a dataset of 500 stories and 2000 questions. By screening workers (with grammar tests) and stories (with grading), we have ensured that the data is the same quality as another set that we manually edited, but at one tenth the editing cost. By being open-domain, yet carefully restricted, we hope MCTest will serve to encourage research and provide a clear metric for advancement on the machine comprehension of text. 1 Reading Comprehension A major goal for NLP is for machines to be able to understand text as well as people. Several research disciplines are focused on this problem: for example, information extraction, relation extraction, semantic role labeling, and recognizing textual entailment. Yet these techniques are necessarily evaluated individually, rather than by how much they advance us towards the end goal. On the other hand, the goal of semantic parsing is the machine comprehension of text (MCT), yet its evaluation requires adherence to a specific knowledge representation, and it is currently unclear what the best representation is, for open-domain text. We believe that it is useful to directly tackle the top-level task of MCT. For this, we need a way to measure progress. One common method for evaluating someone’s understanding of text is by giving them a multiple-choice reading comprehension test. This has the advantage that it is objectively gradable (vs. essays) yet may test a range of abilities such as causal or counterfactual reasoning, inference among relations, or just basic understanding of the world in which the passage is set. Therefore, we propose a multiple-choice reading comprehension task as a way to evaluate progress on MCT. We have built a reading comprehension dataset containing 500 fictional stories, with 4 multiple choice questions per story. It was built using methods which can easily scale to at least 5000 stories, since the stories were created, and the curation was done, using crowd sourcing almost entirely, at a total of $4.00 per story. We plan to periodically update the dataset to ensure that methods are not overfitting to the existing data. The dataset is open-domain, yet restricted to concepts and words that a 7 year old is expected to understand. This task is still beyond the capability of today’s computers and algorithms."
            },
            "slug": "MCTest:-A-Challenge-Dataset-for-the-Open-Domain-of-Richardson-Burges",
            "title": {
                "fragments": [],
                "text": "MCTest: A Challenge Dataset for the Open-Domain Machine Comprehension of Text"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "MCTest is presented, a freely available set of stories and associated questions intended for research on the machine comprehension of text that requires machines to answer multiple-choice reading comprehension questions about fictional stories, directly tackling the high-level goal of open-domain machine comprehension."
            },
            "venue": {
                "fragments": [],
                "text": "EMNLP"
            },
            "year": 2013
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2143684464"
                        ],
                        "name": "Yi Yang",
                        "slug": "Yi-Yang",
                        "structuredName": {
                            "firstName": "Yi",
                            "lastName": "Yang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yi Yang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144105277"
                        ],
                        "name": "Wen-tau Yih",
                        "slug": "Wen-tau-Yih",
                        "structuredName": {
                            "firstName": "Wen-tau",
                            "lastName": "Yih",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Wen-tau Yih"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50004012"
                        ],
                        "name": "Christopher Meek",
                        "slug": "Christopher-Meek",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Meek",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher Meek"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 7
                            }
                        ],
                        "text": "WikiQA (Yang et al., 2015) query logs IR, sentence selection 3047"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 10
                            }
                        ],
                        "text": "Recently, Yang et al. (2015) created the WikiQA dataset, which, like SQuAD, use Wikipedia passages as a source of answers, but their task is sentence selection, while ours requires selecting a specific span in the sentence."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1373518,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f53e2ae46470b89cd1ce6e3bf1d60d9c59722ce1",
            "isKey": false,
            "numCitedBy": 622,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe the WIKIQA dataset, a new publicly available set of question and sentence pairs, collected and annotated for research on open-domain question answering. Most previous work on answer sentence selection focuses on a dataset created using the TREC-QA data, which includes editor-generated questions and candidate answer sentences selected by matching content words in the question. WIKIQA is constructed using a more natural process and is more than an order of magnitude larger than the previous dataset. In addition, the WIKIQA dataset also includes questions for which there are no correct sentences, enabling researchers to work on answer triggering, a critical component in any QA system. We compare several systems on the task of answer sentence selection on both datasets and also describe the performance of a system on the problem of answer triggering using the WIKIQA dataset."
            },
            "slug": "WikiQA:-A-Challenge-Dataset-for-Open-Domain-Yang-Yih",
            "title": {
                "fragments": [],
                "text": "WikiQA: A Challenge Dataset for Open-Domain Question Answering"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "The WIKIQA dataset is described, a new publicly available set of question and sentence pairs, collected and annotated for research on open-domain question answering, which is more than an order of magnitude larger than the previous dataset."
            },
            "venue": {
                "fragments": [],
                "text": "EMNLP"
            },
            "year": 2015
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145183709"
                        ],
                        "name": "J. Weston",
                        "slug": "J.-Weston",
                        "structuredName": {
                            "firstName": "Jason",
                            "lastName": "Weston",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Weston"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713934"
                        ],
                        "name": "Antoine Bordes",
                        "slug": "Antoine-Bordes",
                        "structuredName": {
                            "firstName": "Antoine",
                            "lastName": "Bordes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Antoine Bordes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3295092"
                        ],
                        "name": "S. Chopra",
                        "slug": "S.-Chopra",
                        "structuredName": {
                            "firstName": "Sumit",
                            "lastName": "Chopra",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Chopra"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2047446108"
                        ],
                        "name": "Tomas Mikolov",
                        "slug": "Tomas-Mikolov",
                        "structuredName": {
                            "firstName": "Tomas",
                            "lastName": "Mikolov",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tomas Mikolov"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 6
                            }
                        ],
                        "text": "BAbI (Weston et al., 2015), a fully synthetic RC dataset, is stratified by different types of reasoning required to solve each task."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 3178759,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "abb33d75dc297993fcc3fb75e0f4498f413eb4f6",
            "isKey": false,
            "numCitedBy": 911,
            "numCiting": 50,
            "paperAbstract": {
                "fragments": [],
                "text": "One long-term goal of machine learning research is to produce methods that are applicable to reasoning and natural language, in particular building an intelligent dialogue agent. To measure progress towards that goal, we argue for the usefulness of a set of proxy tasks that evaluate reading comprehension via question answering. Our tasks measure understanding in several ways: whether a system is able to answer questions via chaining facts, simple induction, deduction and many more. The tasks are designed to be prerequisites for any system that aims to be capable of conversing with a human. We believe many existing learning systems can currently not solve them, and hence our aim is to classify these tasks into skill sets, so that researchers can identify (and then rectify) the failings of their systems. We also extend and improve the recently introduced Memory Networks model, and show it is able to solve some, but not all, of the tasks."
            },
            "slug": "Towards-AI-Complete-Question-Answering:-A-Set-of-Weston-Bordes",
            "title": {
                "fragments": [],
                "text": "Towards AI-Complete Question Answering: A Set of Prerequisite Toy Tasks"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This work argues for the usefulness of a set of proxy tasks that evaluate reading comprehension via question answering, and classify these tasks into skill sets so that researchers can identify (and then rectify) the failings of their systems."
            },
            "venue": {
                "fragments": [],
                "text": "ICLR"
            },
            "year": 2016
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50536468"
                        ],
                        "name": "Danqi Chen",
                        "slug": "Danqi-Chen",
                        "structuredName": {
                            "firstName": "Danqi",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Danqi Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40756403"
                        ],
                        "name": "Jason Bolton",
                        "slug": "Jason-Bolton",
                        "structuredName": {
                            "firstName": "Jason",
                            "lastName": "Bolton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jason Bolton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144783904"
                        ],
                        "name": "Christopher D. Manning",
                        "slug": "Christopher-D.-Manning",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Manning",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher D. Manning"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 64,
                                "start": 46
                            }
                        ],
                        "text": "While the size of this dataset is impressive, Chen et al. (2016) showed that the dataset requires less reasoning than previously thought, and\nconcluded that performance is almost saturated."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 55,
                                "start": 37
                            }
                        ],
                        "text": "Comparing our analysis to the one in Chen et al. (2016), we note that the dependency tree path features play a much bigger role in our dataset."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 6360322,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b1e20420982a4f923c08652941666b189b11b7fe",
            "isKey": false,
            "numCitedBy": 493,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Enabling a computer to understand a document so that it can answer comprehension questions is a central, yet unsolved goal of NLP. A key factor impeding its solution by machine learned systems is the limited availability of human-annotated data. Hermann et al. (2015) seek to solve this problem by creating over a million training examples by pairing CNN and Daily Mail news articles with their summarized bullet points, and show that a neural network can then be trained to give good performance on this task. In this paper, we conduct a thorough examination of this new reading comprehension task. Our primary aim is to understand what depth of language understanding is required to do well on this task. We approach this from one side by doing a careful hand-analysis of a small subset of the problems and from the other by showing that simple, carefully designed systems can obtain accuracies of 73.6% and 76.6% on these two datasets, exceeding current state-of-the-art results by 7-10% and approaching what we believe is the ceiling for performance on this task."
            },
            "slug": "A-Thorough-Examination-of-the-CNN/Daily-Mail-Task-Chen-Bolton",
            "title": {
                "fragments": [],
                "text": "A Thorough Examination of the CNN/Daily Mail Reading Comprehension Task"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A thorough examination of this new reading comprehension task by creating over a million training examples by pairing CNN and Daily Mail news articles with their summarized bullet points, and showing that a neural network can be trained to give good performance on this task."
            },
            "venue": {
                "fragments": [],
                "text": "ACL"
            },
            "year": 2016
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750652"
                        ],
                        "name": "Jonathan Berant",
                        "slug": "Jonathan-Berant",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Berant",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jonathan Berant"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3052879"
                        ],
                        "name": "Vivek Srikumar",
                        "slug": "Vivek-Srikumar",
                        "structuredName": {
                            "firstName": "Vivek",
                            "lastName": "Srikumar",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Vivek Srikumar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2158502941"
                        ],
                        "name": "Pei-Chun Chen",
                        "slug": "Pei-Chun-Chen",
                        "structuredName": {
                            "firstName": "Pei-Chun",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Pei-Chun Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1824195"
                        ],
                        "name": "A. V. Linden",
                        "slug": "A.-V.-Linden",
                        "structuredName": {
                            "firstName": "Abby",
                            "lastName": "Linden",
                            "middleNames": [
                                "Vander"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. V. Linden"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144521450"
                        ],
                        "name": "Brittany Harding",
                        "slug": "Brittany-Harding",
                        "structuredName": {
                            "firstName": "Brittany",
                            "lastName": "Harding",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Brittany Harding"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110381942"
                        ],
                        "name": "Brad Huang",
                        "slug": "Brad-Huang",
                        "structuredName": {
                            "firstName": "Brad",
                            "lastName": "Huang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Brad Huang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48323507"
                        ],
                        "name": "Peter Clark",
                        "slug": "Peter-Clark",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Clark",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Peter Clark"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144783904"
                        ],
                        "name": "Christopher D. Manning",
                        "slug": "Christopher-D.-Manning",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Manning",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher D. Manning"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8471750,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6396ab37641d36be4c26420e58adeb8665914c3b",
            "isKey": false,
            "numCitedBy": 170,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "Machine reading calls for programs that read and understand text, but most current work only attempts to extract facts from redundant web-scale corpora. In this paper, we focus on a new reading comprehension task that requires complex reasoning over a single document. The input is a paragraph describing a biological process, and the goal is to answer questions that require an understanding of the relations between entities and events in the process. To answer the questions, we first predict a rich structure representing the process in the paragraph. Then, we map the question to a formal query, which is executed against the predicted structure. We demonstrate that answering questions via predicted structures substantially improves accuracy over baselines that use shallower representations."
            },
            "slug": "Modeling-Biological-Processes-for-Reading-Berant-Srikumar",
            "title": {
                "fragments": [],
                "text": "Modeling Biological Processes for Reading Comprehension"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper focuses on a new reading comprehension task that requires complex reasoning over a single document, and demonstrates that answering questions via predicted structures substantially improves accuracy over baselines that use shallower representations."
            },
            "venue": {
                "fragments": [],
                "text": "EMNLP"
            },
            "year": 2014
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145148360"
                        ],
                        "name": "L. Hirschman",
                        "slug": "L.-Hirschman",
                        "structuredName": {
                            "firstName": "Lynette",
                            "lastName": "Hirschman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Hirschman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144267118"
                        ],
                        "name": "Marc Light",
                        "slug": "Marc-Light",
                        "structuredName": {
                            "firstName": "Marc",
                            "lastName": "Light",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Marc Light"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1798895"
                        ],
                        "name": "Eric Breck",
                        "slug": "Eric-Breck",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Breck",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eric Breck"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5416402"
                        ],
                        "name": "J. Burger",
                        "slug": "J.-Burger",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Burger",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Burger"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15197674,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "5ddde06f993d633a5f9750bc1c3301eb7f13e82f",
            "isKey": false,
            "numCitedBy": 229,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes initial work on Deep Read, an automated reading comprehension system that accepts arbitrary text input (a story) and answers questions about it. We have acquired a corpus of 60 development and 60 test stories of 3rd to 6th grade material; each story is followed by short-answer questions (an answer key was also provided). We used these to construct and evaluate a baseline system that uses pattern matching (bag-of-words) techniques augmented with additional automated linguistic processing (stemming, name identification, semantic class identification, and pronoun resolution). This simple system retrieves the sentence containing the answer 30--40% of the time."
            },
            "slug": "Deep-Read:-A-Reading-Comprehension-System-Hirschman-Light",
            "title": {
                "fragments": [],
                "text": "Deep Read: A Reading Comprehension System"
            },
            "tldr": {
                "abstractSimilarityScore": 72,
                "text": "Initial work on Deep Read, an automated reading comprehension system that accepts arbitrary text input (a story) and answers questions about it is described, with a baseline system that retrieves the sentence containing the answer 30--40% of the time."
            },
            "venue": {
                "fragments": [],
                "text": "ACL"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2064774858"
                        ],
                        "name": "Deepak Ravichandran",
                        "slug": "Deepak-Ravichandran",
                        "structuredName": {
                            "firstName": "Deepak",
                            "lastName": "Ravichandran",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Deepak Ravichandran"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144547315"
                        ],
                        "name": "E. Hovy",
                        "slug": "E.-Hovy",
                        "structuredName": {
                            "firstName": "Eduard",
                            "lastName": "Hovy",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hovy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 217,
                                "start": 188
                            }
                        ],
                        "text": "Selecting the span of text that answers a question is similar to answer extraction, the final step in the open-domain QA pipeline, methods for which include bootstrapping surface patterns (Ravichandran and Hovy, 2002), using dependency trees (Shen and Klakow, 2006), and using a factor graph over multiple sentences (Sun et al."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 226541,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fbd0e0ad4e06902b10b6a157b9db92df577720f1",
            "isKey": false,
            "numCitedBy": 933,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we explore the power of surface text patterns for open-domain question answering systems. In order to obtain an optimal set of patterns, we have developed a method for learning such patterns automatically. A tagged corpus is built from the Internet in a bootstrapping process by providing a few hand-crafted examples of each question type to Altavista. Patterns are then automatically extracted from the returned documents and standardized. We calculate the precision of each pattern, and the average precision for each question type. These patterns are then applied to find answers to new questions. Using the TREC-10 question set, we report results for two cases: answers determined from the TREC-10 corpus and from the web."
            },
            "slug": "Learning-surface-text-patterns-for-a-Question-Ravichandran-Hovy",
            "title": {
                "fragments": [],
                "text": "Learning surface text patterns for a Question Answering System"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "This paper has developed a method for learning an optimal set of surface text patterns automatically from a tagged corpus, and calculates the precision of each pattern, and the average precision for each question type."
            },
            "venue": {
                "fragments": [],
                "text": "ACL"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34789794"
                        ],
                        "name": "H. Ng",
                        "slug": "H.-Ng",
                        "structuredName": {
                            "firstName": "Hwee",
                            "lastName": "Ng",
                            "middleNames": [
                                "Tou"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Ng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38963764"
                        ],
                        "name": "Leonghwee Teo",
                        "slug": "Leonghwee-Teo",
                        "structuredName": {
                            "firstName": "Leonghwee",
                            "lastName": "Teo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Leonghwee Teo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2136756"
                        ],
                        "name": "J. Kwan",
                        "slug": "J.-Kwan",
                        "structuredName": {
                            "firstName": "Jennifer",
                            "lastName": "Kwan",
                            "middleNames": [
                                "Lai-Pheng"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kwan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1199934,
            "fieldsOfStudy": [
                "Computer Science",
                "Education"
            ],
            "id": "27ab2cbb3b26a431d5ede5be34e9ee9a464d144c",
            "isKey": false,
            "numCitedBy": 55,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we report results on answering questions for the reading comprehension task, using a machine learning approach. We evaluated our approach on the Remedia data set, a common data set used in several recent papers on the reading comprehension task. Our learning approach achieves accuracy competitive to previous approaches that rely on hand-crafted, deterministic rules and algorithms. To the best of our knowledge, this is the first work that reports that the use of a machine learning approach achieves competitive results on answering questions for reading comprehension tests."
            },
            "slug": "A-Machine-Learning-Approach-to-Answering-Questions-Ng-Teo",
            "title": {
                "fragments": [],
                "text": "A Machine Learning Approach to Answering Questions for Reading Comprehension Tests"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "To the best of the knowledge, this is the first work that reports that the use of a machine learning approach achieves competitive results on answering questions for reading comprehension tests."
            },
            "venue": {
                "fragments": [],
                "text": "EMNLP"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2910877"
                        ],
                        "name": "K. Hermann",
                        "slug": "K.-Hermann",
                        "structuredName": {
                            "firstName": "Karl",
                            "lastName": "Hermann",
                            "middleNames": [
                                "Moritz"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Hermann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2367821"
                        ],
                        "name": "Tomás Kociský",
                        "slug": "Tomás-Kociský",
                        "structuredName": {
                            "firstName": "Tomás",
                            "lastName": "Kociský",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tomás Kociský"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1864353"
                        ],
                        "name": "Edward Grefenstette",
                        "slug": "Edward-Grefenstette",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Grefenstette",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Edward Grefenstette"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2311318"
                        ],
                        "name": "Lasse Espeholt",
                        "slug": "Lasse-Espeholt",
                        "structuredName": {
                            "firstName": "Lasse",
                            "lastName": "Espeholt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lasse Espeholt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2062879616"
                        ],
                        "name": "Will Kay",
                        "slug": "Will-Kay",
                        "structuredName": {
                            "firstName": "Will",
                            "lastName": "Kay",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Will Kay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2573615"
                        ],
                        "name": "Mustafa Suleyman",
                        "slug": "Mustafa-Suleyman",
                        "structuredName": {
                            "firstName": "Mustafa",
                            "lastName": "Suleyman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mustafa Suleyman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685771"
                        ],
                        "name": "P. Blunsom",
                        "slug": "P.-Blunsom",
                        "structuredName": {
                            "firstName": "Phil",
                            "lastName": "Blunsom",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Blunsom"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 138,
                                "start": 97
                            }
                        ],
                        "text": ", 2014) are too small for training modern data-intensive models, while (ii) those that are large (Hermann et al., 2015; Hill et al., 2015) are semi-synthetic and do not share the same characteristics as explicit reading comprehension questions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 15
                            }
                        ],
                        "text": "CNN/Daily Mail (Hermann et al., 2015) summary + cloze RC, fill in single entity 1."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6203757,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d1505c6123c102e53eb19dff312cb25cea840b72",
            "isKey": false,
            "numCitedBy": 2432,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "Teaching machines to read natural language documents remains an elusive challenge. Machine reading systems can be tested on their ability to answer questions posed on the contents of documents that they have seen, but until now large scale training and test datasets have been missing for this type of evaluation. In this work we define a new methodology that resolves this bottleneck and provides large scale supervised reading comprehension data. This allows us to develop a class of attention based deep neural networks that learn to read real documents and answer complex questions with minimal prior knowledge of language structure."
            },
            "slug": "Teaching-Machines-to-Read-and-Comprehend-Hermann-Kociský",
            "title": {
                "fragments": [],
                "text": "Teaching Machines to Read and Comprehend"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A new methodology is defined that resolves this bottleneck and provides large scale supervised reading comprehension data that allows a class of attention based deep neural networks that learn to read real documents and answer complex questions with minimal prior knowledge of language structure to be developed."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 2015
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113221447"
                        ],
                        "name": "Hai Wang",
                        "slug": "Hai-Wang",
                        "structuredName": {
                            "firstName": "Hai",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hai Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143977268"
                        ],
                        "name": "Mohit Bansal",
                        "slug": "Mohit-Bansal",
                        "structuredName": {
                            "firstName": "Mohit",
                            "lastName": "Bansal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mohit Bansal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1700980"
                        ],
                        "name": "Kevin Gimpel",
                        "slug": "Kevin-Gimpel",
                        "structuredName": {
                            "firstName": "Kevin",
                            "lastName": "Gimpel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kevin Gimpel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145689002"
                        ],
                        "name": "David A. McAllester",
                        "slug": "David-A.-McAllester",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "McAllester",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David A. McAllester"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 252,
                                "start": 235
                            }
                        ],
                        "text": "Because many of the questions require commonsense reasoning and reasoning across multiple sentences, the dataset remains quite challenging, though there has been noticeable progress (Narasimhan and Barzilay, 2015; Sachan et al., 2015; Wang et al., 2015)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8764466,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "999f0acfac28215db2e4c69ff42711fd4f56511d",
            "isKey": false,
            "numCitedBy": 95,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "We demonstrate significant improvement on the MCTest question answering task (Richardson et al., 2013) by augmenting baseline features with features based on syntax, frame semantics, coreference, and word embeddings, and combining them in a max-margin learning framework. We achieve the best results we are aware of on this dataset, outperforming concurrentlypublished results. These results demonstrate a significant performance gradient for the use of linguistic structure in machine comprehension."
            },
            "slug": "Machine-Comprehension-with-Syntax,-Frames,-and-Wang-Bansal",
            "title": {
                "fragments": [],
                "text": "Machine Comprehension with Syntax, Frames, and Semantics"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "This work demonstrates significant improvement on the MCTest question answering task (Richardson et al., 2013) by augmenting baseline features with features based on syntax, frame semantics, coreference, and word embeddings, and combining them in a max-margin learning framework."
            },
            "venue": {
                "fragments": [],
                "text": "ACL"
            },
            "year": 2015
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145022783"
                        ],
                        "name": "E. Brill",
                        "slug": "E.-Brill",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Brill",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Brill"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728602"
                        ],
                        "name": "S. Dumais",
                        "slug": "S.-Dumais",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Dumais",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Dumais"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2339397"
                        ],
                        "name": "Michele Banko",
                        "slug": "Michele-Banko",
                        "structuredName": {
                            "firstName": "Michele",
                            "lastName": "Banko",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michele Banko"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 182,
                                "start": 164
                            }
                        ],
                        "text": "One key difference between our RC setting and answer extraction is that answer extraction typically exploits the fact that the answer occurs in multiple documents (Brill et al., 2002), which is more lenient than in our setting, where a system only has access to a single reading passage."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5541486,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9c99620d7511c83a402ff3b4b3a2348a669e61e3",
            "isKey": false,
            "numCitedBy": 348,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe the architecture of the AskMSR question answering system and systematically evaluate contributions of different system components to accuracy. The system differs from most question answering systems in its dependency on data redundancy rather than sophisticated linguistic analyses of either questions or candidate answers. Because a wrong answer is often worse than no answer, we also explore strategies for predicting when the question answering system is likely to give an incorrect answer."
            },
            "slug": "An-Analysis-of-the-AskMSR-Question-Answering-System-Brill-Dumais",
            "title": {
                "fragments": [],
                "text": "An Analysis of the AskMSR Question-Answering System"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "The architecture of the AskMSR question answering system is described and contributions of different system components to accuracy are evaluated and strategies for predicting when the question Answer system is likely to give an incorrect answer are explored."
            },
            "venue": {
                "fragments": [],
                "text": "EMNLP"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746656"
                        ],
                        "name": "E. Voorhees",
                        "slug": "E.-Voorhees",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Voorhees",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Voorhees"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2575691"
                        ],
                        "name": "Dawn M. Tice",
                        "slug": "Dawn-M.-Tice",
                        "structuredName": {
                            "firstName": "Dawn",
                            "lastName": "Tice",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dawn M. Tice"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 88,
                                "start": 63
                            }
                        ],
                        "text": "The annual evaluations at the Text REtreival Conference (TREC) (Voorhees and Tice, 2000) led to many advances in open-domain QA, many of which were used in IBM Watson for Jeopardy! (Ferrucci et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 8
                            }
                        ],
                        "text": "TREC-QA (Voorhees and Tice, 2000) query logs + human editor IR, free form 1479"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 57
                            }
                        ],
                        "text": "The annual evaluations at the Text REtreival Conference (TREC) (Voorhees and Tice, 2000) led to many advances in open-domain QA, many of which were used in IBM Watson for Jeopardy!"
                    },
                    "intents": []
                }
            ],
            "corpusId": 11465263,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d2161251488dbba08616a9cdd4223a0ac1190cef",
            "isKey": false,
            "numCitedBy": 377,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "The TREC-8 Question Answering (QA) Track was the first large-scale evaluation of domain-independent question answering systems. In addition to fostering research on the QA task, the track was used to investigate whether the evaluation methodology used for document retrieval is appropriate for a different natural language processing task. As with document relevance judging, assessors had legitimate differences of opinions as to whether a response actually answers a question, but comparative evaluation of QA systems was stable despite these differences. Creating a reusable QA test collection is fundamentally more difficult than creating a document retrieval test collection since the QA task has no equivalent to document identifiers."
            },
            "slug": "Building-a-question-answering-test-collection-Voorhees-Tice",
            "title": {
                "fragments": [],
                "text": "Building a question answering test collection"
            },
            "tldr": {
                "abstractSimilarityScore": 81,
                "text": "The TREC-8 Question Answering (QA) Track was the first large-scale evaluation of domain-independent question answering systems and was used to investigate whether the evaluation methodology used for document retrieval is appropriate for a different natural language processing task."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR '00"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144958935"
                        ],
                        "name": "Karthik Narasimhan",
                        "slug": "Karthik-Narasimhan",
                        "structuredName": {
                            "firstName": "Karthik",
                            "lastName": "Narasimhan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Karthik Narasimhan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1741283"
                        ],
                        "name": "R. Barzilay",
                        "slug": "R.-Barzilay",
                        "structuredName": {
                            "firstName": "Regina",
                            "lastName": "Barzilay",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Barzilay"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15425307,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "86c2a7dc48445d75ec9bc71f7d9fdec622687e90",
            "isKey": false,
            "numCitedBy": 56,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper proposes a novel approach for incorporating discourse information into machine comprehension applications. Traditionally, such information is computed using off-the-shelf discourse analyzers. This design provides limited opportunities for guiding the discourse parser based on the requirements of the target task. In contrast, our model induces relations between sentences while optimizing a task-specific objective. This approach enables the model to benefit from discourse information without relying on explicit annotations of discourse structure during training. The model jointly identifies relevant sentences, establishes relations between them and predicts an answer. We implement this idea in a discriminative framework with hidden variables that capture relevant sentences and relations unobserved during training. Our experiments demonstrate that the discourse aware model outperforms state-of-the-art machine comprehension systems.1"
            },
            "slug": "Machine-Comprehension-with-Discourse-Relations-Narasimhan-Barzilay",
            "title": {
                "fragments": [],
                "text": "Machine Comprehension with Discourse Relations"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "This approach enables the model to benefit from discourse information without relying on explicit annotations of discourse structure during training, and demonstrates that the discourse aware model outperforms state-of-the-art machine comprehension systems."
            },
            "venue": {
                "fragments": [],
                "text": "ACL"
            },
            "year": 2015
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2152993594"
                        ],
                        "name": "Hong Sun",
                        "slug": "Hong-Sun",
                        "structuredName": {
                            "firstName": "Hong",
                            "lastName": "Sun",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hong Sun"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46429989"
                        ],
                        "name": "Nan Duan",
                        "slug": "Nan-Duan",
                        "structuredName": {
                            "firstName": "Nan",
                            "lastName": "Duan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nan Duan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2111768092"
                        ],
                        "name": "Yajuan Duan",
                        "slug": "Yajuan-Duan",
                        "structuredName": {
                            "firstName": "Yajuan",
                            "lastName": "Duan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yajuan Duan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143849609"
                        ],
                        "name": "M. Zhou",
                        "slug": "M.-Zhou",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Zhou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Zhou"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 294,
                                "start": 278
                            }
                        ],
                        "text": "…a question is similar to answer extraction, the final step in the open-domain QA pipeline, methods for which include bootstrapping surface patterns (Ravichandran and Hovy, 2002), using dependency trees (Shen and Klakow, 2006), and using a factor graph over multiple sentences (Sun et al., 2013)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 334,
                                "start": 316
                            }
                        ],
                        "text": "Selecting the span of text that answers a question is similar to answer extraction, the final step in the open-domain QA pipeline, methods for which include bootstrapping surface patterns (Ravichandran and Hovy, 2002), using dependency trees (Shen and Klakow, 2006), and using a factor graph over multiple sentences (Sun et al., 2013)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 5695289,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1b07873241c8f655085015408b94bc51932317f0",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "In question answering, answer extraction aims to pin-point the exact answer from passages. However, most previous methods perform such extraction on each passage separately, without considering clues provided in other passages. This paper presents a novel approach to extract answers by fully leveraging connections among different passages. Specially, extraction is performed on a Passage Graph which is built by adding links upon multiple passages. Different passages are connected by linking words with the same stem. We use the factor graph as our model for answer extraction. Experimental results on multiple QA data sets demonstrate that our method significantly improves the performance of answer extraction."
            },
            "slug": "Answer-Extraction-from-Passage-Graph-for-Question-Sun-Duan",
            "title": {
                "fragments": [],
                "text": "Answer Extraction from Passage Graph for Question Answering"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "This paper presents a novel approach to extract answers by fully leveraging connections among different passages by performing extraction on a Passage Graph which is built by adding links upon multiple passages."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 2013
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1684887"
                        ],
                        "name": "Nate Kushman",
                        "slug": "Nate-Kushman",
                        "structuredName": {
                            "firstName": "Nate",
                            "lastName": "Kushman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nate Kushman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1982950"
                        ],
                        "name": "Luke Zettlemoyer",
                        "slug": "Luke-Zettlemoyer",
                        "structuredName": {
                            "firstName": "Luke",
                            "lastName": "Zettlemoyer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Luke Zettlemoyer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1741283"
                        ],
                        "name": "R. Barzilay",
                        "slug": "R.-Barzilay",
                        "structuredName": {
                            "firstName": "Regina",
                            "lastName": "Barzilay",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Barzilay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3167681"
                        ],
                        "name": "Yoav Artzi",
                        "slug": "Yoav-Artzi",
                        "structuredName": {
                            "firstName": "Yoav",
                            "lastName": "Artzi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yoav Artzi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 173,
                                "start": 153
                            }
                        ],
                        "text": "Algebra word problems require understanding a story well enough to turn it into a system of equa-\ntions, which can be easily solved to produce the answer (Kushman et al., 2014; Hosseini et al., 2014)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 101,
                                "start": 56
                            }
                        ],
                        "text": "tions, which can be easily solved to produce the answer (Kushman et al., 2014; Hosseini et al., 2014)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 8
                            }
                        ],
                        "text": "Algebra (Kushman et al., 2014) standardized tests computation 514"
                    },
                    "intents": []
                }
            ],
            "corpusId": 12451537,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3a395daf6c97c084cf9c3827384c53caf6502921",
            "isKey": true,
            "numCitedBy": 245,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "We present an approach for automatically learning to solve algebra word problems. Our algorithm reasons across sentence boundaries to construct and solve a system of linear equations, while simultaneously recovering an alignment of the variables and numbers in these equations to the problem text. The learning algorithm uses varied supervision, including either full equations or just the final answers. We evaluate performance on a newly gathered corpus of algebra word problems, demonstrating that the system can correctly answer almost 70% of the questions in the dataset. This is, to our knowledge, the first learning result for this task."
            },
            "slug": "Learning-to-Automatically-Solve-Algebra-Word-Kushman-Zettlemoyer",
            "title": {
                "fragments": [],
                "text": "Learning to Automatically Solve Algebra Word Problems"
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "An approach for automatically learning to solve algebra word problems by reasons across sentence boundaries to construct and solve a system of linear equations, while simultaneously recovering an alignment of the variables and numbers to the problem text."
            },
            "venue": {
                "fragments": [],
                "text": "ACL"
            },
            "year": 2014
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691993"
                        ],
                        "name": "E. Riloff",
                        "slug": "E.-Riloff",
                        "structuredName": {
                            "firstName": "Ellen",
                            "lastName": "Riloff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Riloff"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49928277"
                        ],
                        "name": "Michael Thelen",
                        "slug": "Michael-Thelen",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Thelen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael Thelen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 105,
                                "start": 82
                            }
                        ],
                        "text": "Their pattern matching baseline was subsequently improved by a rule-based system (Riloff and Thelen, 2000) and a logistic regression model (Ng et al., 2000)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 9846946,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "445406b0d88ae965fa587cf5c167374ff1bbc09a",
            "isKey": false,
            "numCitedBy": 135,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "We have developed a rule-based system, Quarc, that can read a short story and find the sentence in the story that best answers a given question. Quarc uses heuristic rules that look for lexical and semantic clues in the question and the story. We have tested Quarc on reading comprehension tests typically given to children in grades 3--6. Overall, Quarc found the correct sentence 40% of the time, which is encouraging given the simplicity of its rules."
            },
            "slug": "A-Rule-based-Question-Answering-System-for-Reading-Riloff-Thelen",
            "title": {
                "fragments": [],
                "text": "A Rule-based Question Answering System for Reading Comprehension Tests"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "A rule-based system that can read a short story and find the sentence in the story that best answers a given question, Quarc, uses heuristic rules that look for lexical and semantic clues in the question and the story."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145783676"
                        ],
                        "name": "Felix Hill",
                        "slug": "Felix-Hill",
                        "structuredName": {
                            "firstName": "Felix",
                            "lastName": "Hill",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Felix Hill"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713934"
                        ],
                        "name": "Antoine Bordes",
                        "slug": "Antoine-Bordes",
                        "structuredName": {
                            "firstName": "Antoine",
                            "lastName": "Bordes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Antoine Bordes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3295092"
                        ],
                        "name": "S. Chopra",
                        "slug": "S.-Chopra",
                        "structuredName": {
                            "firstName": "Sumit",
                            "lastName": "Chopra",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Chopra"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145183709"
                        ],
                        "name": "J. Weston",
                        "slug": "J.-Weston",
                        "structuredName": {
                            "firstName": "Jason",
                            "lastName": "Weston",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Weston"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 48,
                                "start": 31
                            }
                        ],
                        "text": "The Children’s Book Test (CBT) (Hill et al., 2015), for example, involves predicting a blanked-out word of a sentence given the 20 previous sentences."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 138,
                                "start": 97
                            }
                        ],
                        "text": ", 2014) are too small for training modern data-intensive models, while (ii) those that are large (Hermann et al., 2015; Hill et al., 2015) are semi-synthetic and do not share the same characteristics as explicit reading comprehension questions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 193,
                                "start": 176
                            }
                        ],
                        "text": "…high in quality (Richardson et al., 2013; Berant et al., 2014) are too small for training modern data-intensive models, while (ii) those that are large (Hermann et al., 2015; Hill et al., 2015) are semi-synthetic and do not share the same characteristics as explicit reading comprehension questions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 23,
                                "start": 4
                            }
                        ],
                        "text": "CBT (Hill et al., 2015) cloze RC, fill in single word 688K"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14915449,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "35b91b365ceb016fb3e022577cec96fb9b445dc5",
            "isKey": true,
            "numCitedBy": 530,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "We introduce a new test of how well language models capture meaning in children's books. Unlike standard language modelling benchmarks, it distinguishes the task of predicting syntactic function words from that of predicting lower-frequency words, which carry greater semantic content. We compare a range of state-of-the-art models, each with a different way of encoding what has been previously read. We show that models which store explicit representations of long-term contexts outperform state-of-the-art neural language models at predicting semantic content words, although this advantage is not observed for syntactic function words. Interestingly, we find that the amount of text encoded in a single memory representation is highly influential to the performance: there is a sweet-spot, not too big and not too small, between single words and full sentences that allows the most meaningful information in a text to be effectively retained and recalled. Further, the attention over such window-based memories can be trained effectively through self-supervision. We then assess the generality of this principle by applying it to the CNN QA benchmark, which involves identifying named entities in paraphrased summaries of news articles, and achieve state-of-the-art performance."
            },
            "slug": "The-Goldilocks-Principle:-Reading-Children's-Books-Hill-Bordes",
            "title": {
                "fragments": [],
                "text": "The Goldilocks Principle: Reading Children's Books with Explicit Memory Representations"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "There is a sweet-spot, not too big and not too small, between single words and full sentences that allows the most meaningful information in a text to be effectively retained and recalled, and models which store explicit representations of long-term contexts outperform state-of-the-art neural language models at predicting semantic content words."
            },
            "venue": {
                "fragments": [],
                "text": "ICLR"
            },
            "year": 2016
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "81007822"
                        ],
                        "name": "Mohammad Javad Hosseini",
                        "slug": "Mohammad-Javad-Hosseini",
                        "structuredName": {
                            "firstName": "Mohammad Javad",
                            "lastName": "Hosseini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mohammad Javad Hosseini"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2548384"
                        ],
                        "name": "Hannaneh Hajishirzi",
                        "slug": "Hannaneh-Hajishirzi",
                        "structuredName": {
                            "firstName": "Hannaneh",
                            "lastName": "Hajishirzi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hannaneh Hajishirzi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1741101"
                        ],
                        "name": "Oren Etzioni",
                        "slug": "Oren-Etzioni",
                        "structuredName": {
                            "firstName": "Oren",
                            "lastName": "Etzioni",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Oren Etzioni"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1684887"
                        ],
                        "name": "Nate Kushman",
                        "slug": "Nate-Kushman",
                        "structuredName": {
                            "firstName": "Nate",
                            "lastName": "Kushman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nate Kushman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 197,
                                "start": 152
                            }
                        ],
                        "text": "Algebra word problems require understanding a story well enough to turn it into a system of equations, which can be easily solved to produce the answer (Kushman et al., 2014; Hosseini et al., 2014)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 428579,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a7862e14b4c20cefd6dc4f611f8aa866fabf130b",
            "isKey": false,
            "numCitedBy": 172,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a novel approach to learning to solve simple arithmetic word problems. Our system, ARIS, analyzes each of the sentences in the problem statement to identify the relevant variables and their values. ARIS then maps this information into an equation that represents the problem, and enables its (trivial) solution as shown in Figure 1. The paper analyzes the arithmetic-word problems “genre”, identifying seven categories of verbs used in such problems. ARIS learns to categorize verbs with 81.2% accuracy, and is able to solve 77.7% of the problems in a corpus of standard primary school test questions. We report the first learning results on this task without reliance on predefined templates and make our data publicly available. 1"
            },
            "slug": "Learning-to-Solve-Arithmetic-Word-Problems-with-Hosseini-Hajishirzi",
            "title": {
                "fragments": [],
                "text": "Learning to Solve Arithmetic Word Problems with Verb Categorization"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "The paper analyzes the arithmetic-word problems “genre”, identifying seven categories of verbs used in such problems, and reports the first learning results on this task without reliance on predefined templates and makes the data publicly available."
            },
            "venue": {
                "fragments": [],
                "text": "EMNLP"
            },
            "year": 2014
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1734174"
                        ],
                        "name": "M. Marcus",
                        "slug": "M.-Marcus",
                        "structuredName": {
                            "firstName": "Mitchell",
                            "lastName": "Marcus",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Marcus"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2424234"
                        ],
                        "name": "Beatrice Santorini",
                        "slug": "Beatrice-Santorini",
                        "structuredName": {
                            "firstName": "Beatrice",
                            "lastName": "Santorini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Beatrice Santorini"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2063206"
                        ],
                        "name": "Mary Ann Marcinkiewicz",
                        "slug": "Mary-Ann-Marcinkiewicz",
                        "structuredName": {
                            "firstName": "Mary",
                            "lastName": "Marcinkiewicz",
                            "middleNames": [
                                "Ann"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mary Ann Marcinkiewicz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 234,
                                "start": 215
                            }
                        ],
                        "text": "Historically, large, realistic datasets have played\na critical role for driving fields forward—famous examples include ImageNet for object recognition (Deng et al., 2009) and the Penn Treebank for syntactic parsing (Marcus et al., 1993)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 52
                            }
                        ],
                        "text": ", 2009) and the Penn Treebank for syntactic parsing (Marcus et al., 1993)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 252796,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0b44fcbeea9415d400c5f5789d6b892b6f98daff",
            "isKey": false,
            "numCitedBy": 8175,
            "numCiting": 75,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : As a result of this grant, the researchers have now published oil CDROM a corpus of over 4 million words of running text annotated with part-of- speech (POS) tags, with over 3 million words of that material assigned skeletal grammatical structure. This material now includes a fully hand-parsed version of the classic Brown corpus. About one half of the papers at the ACL Workshop on Using Large Text Corpora this past summer were based on the materials generated by this grant."
            },
            "slug": "Building-a-Large-Annotated-Corpus-of-English:-The-Marcus-Santorini",
            "title": {
                "fragments": [],
                "text": "Building a Large Annotated Corpus of English: The Penn Treebank"
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "As a result of this grant, the researchers have now published on CDROM a corpus of over 4 million words of running text annotated with part-of- speech (POS) tags, which includes a fully hand-parsed version of the classic Brown corpus."
            },
            "venue": {
                "fragments": [],
                "text": "CL"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2065248807"
                        ],
                        "name": "Dan Shen",
                        "slug": "Dan-Shen",
                        "structuredName": {
                            "firstName": "Dan",
                            "lastName": "Shen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dan Shen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2561225"
                        ],
                        "name": "D. Klakow",
                        "slug": "D.-Klakow",
                        "structuredName": {
                            "firstName": "Dietrich",
                            "lastName": "Klakow",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Klakow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 265,
                                "start": 242
                            }
                        ],
                        "text": "Selecting the span of text that answers a question is similar to answer extraction, the final step in the open-domain QA pipeline, methods for which include bootstrapping surface patterns (Ravichandran and Hovy, 2002), using dependency trees (Shen and Klakow, 2006), and using a factor graph over multiple sentences (Sun et al."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2337034,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "47ec5048d937ee55a69595a21bb26ed8c8c27811",
            "isKey": false,
            "numCitedBy": 58,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we explore correlation of dependency relation paths to rank candidate answers in answer extraction. Using the correlation measure, we compare dependency relations of a candidate answer and mapped question phrases in sentence with the corresponding relations in question. Different from previous studies, we propose an approximate phrase mapping algorithm and incorporate the mapping score into the correlation measure. The correlations are further incorporated into a Maximum Entropy-based ranking model which estimates path weights from training. Experimental results show that our method significantly outperforms state-of-the-art syntactic relation-based methods by up to 20% in MRR."
            },
            "slug": "Exploring-Correlation-of-Dependency-Relation-Paths-Shen-Klakow",
            "title": {
                "fragments": [],
                "text": "Exploring Correlation of Dependency Relation Paths for Answer Extraction"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "An approximate phrase mapping algorithm is proposed and incorporated into a Maximum Entropy-based ranking model which estimates path weights from training and significantly outperforms state-of-the-art syntactic relation-based methods in MRR."
            },
            "venue": {
                "fragments": [],
                "text": "ACL"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48323507"
                        ],
                        "name": "Peter Clark",
                        "slug": "Peter-Clark",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Clark",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Peter Clark"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1741101"
                        ],
                        "name": "Oren Etzioni",
                        "slug": "Oren-Etzioni",
                        "structuredName": {
                            "firstName": "Oren",
                            "lastName": "Etzioni",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Oren Etzioni"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16968840,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "390808617b277987999b6e8e0aa5742aab54a6a0",
            "isKey": false,
            "numCitedBy": 73,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "Given the well-known limitations of the Turing Test, there is a need for objective tests to both focus attention on, and measure progress towards, the goals of AI. In this paper we argue that machine performance on standardized tests should be a key component of any new measure of AI, because attaining a high level of performance requires solving significant AI problems involving language understanding and world modeling - critical skills for any machine that lays claim to intelligence. In addition, standardized tests have all the basic requirements of a practical test: they are accessible, easily comprehensible, clearly measurable, and offer a graduated progression from simple tasks to those requiring deep understanding of the world. Here we propose this task as a challenge problem for the community, summarize our state-of-the-art results on math and science tests, and provide supporting datasets"
            },
            "slug": "My-Computer-Is-an-Honor-Student-but-How-Intelligent-Clark-Etzioni",
            "title": {
                "fragments": [],
                "text": "My Computer Is an Honor Student - but How Intelligent Is It? Standardized Tests as a Measure of AI"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "It is argued that machine performance on standardized tests should be a key component of any new measure of AI, because attaining a high level of performance requires solving significant AI problems involving language understanding and world modeling - critical skills for any machine that lays claim to intelligence."
            },
            "venue": {
                "fragments": [],
                "text": "AI Mag."
            },
            "year": 2016
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2295799"
                        ],
                        "name": "D. Ferrucci",
                        "slug": "D.-Ferrucci",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Ferrucci",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ferrucci"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1793454"
                        ],
                        "name": "E. Brown",
                        "slug": "E.-Brown",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Brown",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Brown"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1684353"
                        ],
                        "name": "Jennifer Chu-Carroll",
                        "slug": "Jennifer-Chu-Carroll",
                        "structuredName": {
                            "firstName": "Jennifer",
                            "lastName": "Chu-Carroll",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jennifer Chu-Carroll"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48203512"
                        ],
                        "name": "James Fan",
                        "slug": "James-Fan",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Fan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "James Fan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2771137"
                        ],
                        "name": "David Gondek",
                        "slug": "David-Gondek",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Gondek",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David Gondek"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1973186"
                        ],
                        "name": "Aditya Kalyanpur",
                        "slug": "Aditya-Kalyanpur",
                        "structuredName": {
                            "firstName": "Aditya",
                            "lastName": "Kalyanpur",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Aditya Kalyanpur"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144071952"
                        ],
                        "name": "Adam Lally",
                        "slug": "Adam-Lally",
                        "structuredName": {
                            "firstName": "Adam",
                            "lastName": "Lally",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Adam Lally"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145412011"
                        ],
                        "name": "J. William Murdock",
                        "slug": "J.-William-Murdock",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Murdock",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. William Murdock"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144287919"
                        ],
                        "name": "Eric Nyberg",
                        "slug": "Eric-Nyberg",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Nyberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eric Nyberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30210546"
                        ],
                        "name": "J. Prager",
                        "slug": "J.-Prager",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Prager",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Prager"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2807334"
                        ],
                        "name": "Nico Schlaefer",
                        "slug": "Nico-Schlaefer",
                        "structuredName": {
                            "firstName": "Nico",
                            "lastName": "Schlaefer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nico Schlaefer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143778120"
                        ],
                        "name": "Chris Welty",
                        "slug": "Chris-Welty",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Welty",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chris Welty"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 204,
                                "start": 181
                            }
                        ],
                        "text": "The annual evaluations at the Text REtreival Conference (TREC) (Voorhees and Tice, 2000) led to many advances in open-domain QA, many of which were used in IBM Watson for Jeopardy! (Ferrucci et al., 2013)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 22,
                                "start": 1
                            }
                        ],
                        "text": "(Ferrucci et al., 2013)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 180,
                                "start": 171
                            }
                        ],
                        "text": "The annual evaluations at the Text REtreival Conference (TREC) (Voorhees and Tice, 2000) led to many advances in open-domain QA, many of which were used in IBM Watson for Jeopardy!"
                    },
                    "intents": []
                }
            ],
            "corpusId": 1831060,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3ff2862a8121cc823a8eb72f3e0a97bbf25c82ec",
            "isKey": false,
            "numCitedBy": 1400,
            "numCiting": 50,
            "paperAbstract": {
                "fragments": [],
                "text": "IBM Research undertook a challenge to build a computer system that could compete at the human champion level in real time on the American TV Quiz show, Jeopardy! The extent of the challenge includes fielding a real-time automatic contestant on the show, not merely a laboratory exercise. The Jeopardy! Challenge helped us address requirements that led to the design of the DeepQA architecture and the implementation of Watson. After 3 years of intense research and development by a core team of about 20 researches, Watson is performing at human expert-levels in terms of precision, confidence and speed at the Jeopardy! Quiz show. Our results strongly suggest that DeepQA is an effective and extensible architecture that may be used as a foundation for combining, deploying, evaluating and advancing a wide range of algorithmic techniques to rapidly advance the field of QA."
            },
            "slug": "Building-Watson:-An-Overview-of-the-DeepQA-Project-Ferrucci-Brown",
            "title": {
                "fragments": [],
                "text": "Building Watson: An Overview of the DeepQA Project"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "The results strongly suggest that DeepQA is an effective and extensible architecture that may be used as a foundation for combining, deploying, evaluating and advancing a wide range of algorithmic techniques to rapidly advance the field of QA."
            },
            "venue": {
                "fragments": [],
                "text": "AI Mag."
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153302678"
                        ],
                        "name": "Jia Deng",
                        "slug": "Jia-Deng",
                        "structuredName": {
                            "firstName": "Jia",
                            "lastName": "Deng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jia Deng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144847596"
                        ],
                        "name": "Wei Dong",
                        "slug": "Wei-Dong",
                        "structuredName": {
                            "firstName": "Wei",
                            "lastName": "Dong",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Wei Dong"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2166511"
                        ],
                        "name": "R. Socher",
                        "slug": "R.-Socher",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Socher",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Socher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2040091191"
                        ],
                        "name": "Li-Jia Li",
                        "slug": "Li-Jia-Li",
                        "structuredName": {
                            "firstName": "Li-Jia",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Li-Jia Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94451829"
                        ],
                        "name": "K. Li",
                        "slug": "K.-Li",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48004138"
                        ],
                        "name": "Li Fei-Fei",
                        "slug": "Li-Fei-Fei",
                        "structuredName": {
                            "firstName": "Li",
                            "lastName": "Fei-Fei",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Li Fei-Fei"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 168,
                                "start": 151
                            }
                        ],
                        "text": "Historically, large, realistic datasets have played\na critical role for driving fields forward—famous examples include ImageNet for object recognition (Deng et al., 2009) and the Penn Treebank for syntactic parsing (Marcus et al., 1993)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 118,
                                "start": 99
                            }
                        ],
                        "text": "a critical role for driving fields forward—famous examples include ImageNet for object recognition (Deng et al., 2009) and the Penn Treebank for syntactic parsing (Marcus et al."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 57246310,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1b47265245e8db53a553049dcb27ed3e495fd625",
            "isKey": false,
            "numCitedBy": 27403,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "The explosion of image data on the Internet has the potential to foster more sophisticated and robust models and algorithms to index, retrieve, organize and interact with images and multimedia data. But exactly how such data can be harnessed and organized remains a critical problem. We introduce here a new database called “ImageNet”, a large-scale ontology of images built upon the backbone of the WordNet structure. ImageNet aims to populate the majority of the 80,000 synsets of WordNet with an average of 500-1000 clean and full resolution images. This will result in tens of millions of annotated images organized by the semantic hierarchy of WordNet. This paper offers a detailed analysis of ImageNet in its current state: 12 subtrees with 5247 synsets and 3.2 million images in total. We show that ImageNet is much larger in scale and diversity and much more accurate than the current image datasets. Constructing such a large-scale database is a challenging task. We describe the data collection scheme with Amazon Mechanical Turk. Lastly, we illustrate the usefulness of ImageNet through three simple applications in object recognition, image classification and automatic object clustering. We hope that the scale, accuracy, diversity and hierarchical structure of ImageNet can offer unparalleled opportunities to researchers in the computer vision community and beyond."
            },
            "slug": "ImageNet:-A-large-scale-hierarchical-image-database-Deng-Dong",
            "title": {
                "fragments": [],
                "text": "ImageNet: A large-scale hierarchical image database"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A new database called “ImageNet” is introduced, a large-scale ontology of images built upon the backbone of the WordNet structure, much larger in scale and diversity and much more accurate than the current image datasets."
            },
            "venue": {
                "fragments": [],
                "text": "CVPR"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2657265"
                        ],
                        "name": "Masumi Shirakawa",
                        "slug": "Masumi-Shirakawa",
                        "structuredName": {
                            "firstName": "Masumi",
                            "lastName": "Shirakawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Masumi Shirakawa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153151854"
                        ],
                        "name": "Takahiro Hara",
                        "slug": "Takahiro-Hara",
                        "structuredName": {
                            "firstName": "Takahiro",
                            "lastName": "Hara",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Takahiro Hara"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34957142"
                        ],
                        "name": "S. Nishio",
                        "slug": "S.-Nishio",
                        "structuredName": {
                            "firstName": "Shojiro",
                            "lastName": "Nishio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Nishio"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3347834,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b53162dffd265f3c3181371f2800d09e068ebf90",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 54,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper first reveals the relationship between Inverse Document Frequency (IDF), a global term weighting scheme, and information distance, a universal metric defined by Kolmogorov complexity. We concretely give a theoretical explanation that the IDF of a term is equal to the distance between the term and the empty string in the space of information distance in which the Kolmogorov complexity is approximated using Web documents and the Shannon-Fano coding. Based on our findings, we propose N-gram IDF, a theoretical extension of IDF for handling words and phrases of any length. By comparing weights among N-grams of any N, N-gram IDF enables us to determine dominant N-grams among overlapping ones and extract key terms of any length from texts without using any NLP techniques. To efficiently compute the weight for all possible N-grams, we adopt two string processing techniques, i.e., maximal substring extraction using enhanced suffix array and document listing using wavelet tree. We conducted experiments on key term extraction and Web search query segmentation, and found that N-gram IDF was competitive with state-of-the-art methods that were designed for each application using additional resources and efforts. The results exemplified the potential of N-gram IDF."
            },
            "slug": "N-gram-IDF:-A-Global-Term-Weighting-Scheme-Based-on-Shirakawa-Hara",
            "title": {
                "fragments": [],
                "text": "N-gram IDF: A Global Term Weighting Scheme Based on Information Distance"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "N-gram IDF is proposed, a theoretical extension of IDF that enables to determine dominant N-grams among overlapping ones and extract key terms of any length from texts without using any NLP techniques, and was competitive with state-of-the-art methods that were designed for each application using additional resources and efforts."
            },
            "venue": {
                "fragments": [],
                "text": "WWW"
            },
            "year": 2015
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36517276"
                        ],
                        "name": "Snehalkumar `Neil' Gaikwad",
                        "slug": "Snehalkumar-`Neil'-Gaikwad",
                        "structuredName": {
                            "firstName": "Snehalkumar `Neil'",
                            "lastName": "Gaikwad",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Snehalkumar `Neil' Gaikwad"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3312398"
                        ],
                        "name": "Durim Morina",
                        "slug": "Durim-Morina",
                        "structuredName": {
                            "firstName": "Durim",
                            "lastName": "Morina",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Durim Morina"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409288776"
                        ],
                        "name": "Rohit Nistala",
                        "slug": "Rohit-Nistala",
                        "structuredName": {
                            "firstName": "Rohit",
                            "lastName": "Nistala",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rohit Nistala"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46920486"
                        ],
                        "name": "Megha Agarwal",
                        "slug": "Megha-Agarwal",
                        "structuredName": {
                            "firstName": "Megha",
                            "lastName": "Agarwal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Megha Agarwal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46942132"
                        ],
                        "name": "A. Cossette",
                        "slug": "A.-Cossette",
                        "structuredName": {
                            "firstName": "Alison",
                            "lastName": "Cossette",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Cossette"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2065785016"
                        ],
                        "name": "R. Bhanu",
                        "slug": "R.-Bhanu",
                        "structuredName": {
                            "firstName": "Radhika",
                            "lastName": "Bhanu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bhanu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1983163"
                        ],
                        "name": "Saiph Savage",
                        "slug": "Saiph-Savage",
                        "structuredName": {
                            "firstName": "Saiph",
                            "lastName": "Savage",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Saiph Savage"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2383244"
                        ],
                        "name": "Vishwajeet Narwal",
                        "slug": "Vishwajeet-Narwal",
                        "structuredName": {
                            "firstName": "Vishwajeet",
                            "lastName": "Narwal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Vishwajeet Narwal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2065727490"
                        ],
                        "name": "Karan Rajpal",
                        "slug": "Karan-Rajpal",
                        "structuredName": {
                            "firstName": "Karan",
                            "lastName": "Rajpal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Karan Rajpal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2483230"
                        ],
                        "name": "Jeff Regino",
                        "slug": "Jeff-Regino",
                        "structuredName": {
                            "firstName": "Jeff",
                            "lastName": "Regino",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jeff Regino"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3051137"
                        ],
                        "name": "Aditi Mithal",
                        "slug": "Aditi-Mithal",
                        "structuredName": {
                            "firstName": "Aditi",
                            "lastName": "Mithal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Aditi Mithal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2785736"
                        ],
                        "name": "Adam Ginzberg",
                        "slug": "Adam-Ginzberg",
                        "structuredName": {
                            "firstName": "Adam",
                            "lastName": "Ginzberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Adam Ginzberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "67053778"
                        ],
                        "name": "Aditi Nath",
                        "slug": "Aditi-Nath",
                        "structuredName": {
                            "firstName": "Aditi",
                            "lastName": "Nath",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Aditi Nath"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2741088"
                        ],
                        "name": "Karolina R. Ziulkoski",
                        "slug": "Karolina-R.-Ziulkoski",
                        "structuredName": {
                            "firstName": "Karolina",
                            "lastName": "Ziulkoski",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Karolina R. Ziulkoski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409288730"
                        ],
                        "name": "Trygve Cossette",
                        "slug": "Trygve-Cossette",
                        "structuredName": {
                            "firstName": "Trygve",
                            "lastName": "Cossette",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Trygve Cossette"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2046734"
                        ],
                        "name": "D. Gamage",
                        "slug": "D.-Gamage",
                        "structuredName": {
                            "firstName": "Dilrukshi",
                            "lastName": "Gamage",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gamage"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409288700"
                        ],
                        "name": "Angela Richmond-Fuller",
                        "slug": "Angela-Richmond-Fuller",
                        "structuredName": {
                            "firstName": "Angela",
                            "lastName": "Richmond-Fuller",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Angela Richmond-Fuller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2052495416"
                        ],
                        "name": "R. Suzuki",
                        "slug": "R.-Suzuki",
                        "structuredName": {
                            "firstName": "Ryo",
                            "lastName": "Suzuki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Suzuki"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409288721"
                        ],
                        "name": "J. Herrejón",
                        "slug": "J.-Herrejón",
                        "structuredName": {
                            "firstName": "Jeerel",
                            "lastName": "Herrejón",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Herrejón"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2140624221"
                        ],
                        "name": "Kevin Le",
                        "slug": "Kevin-Le",
                        "structuredName": {
                            "firstName": "Kevin",
                            "lastName": "Le",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kevin Le"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1403428134"
                        ],
                        "name": "Claudia Flores-Saviaga",
                        "slug": "Claudia-Flores-Saviaga",
                        "structuredName": {
                            "firstName": "Claudia",
                            "lastName": "Flores-Saviaga",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Claudia Flores-Saviaga"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144424277"
                        ],
                        "name": "Haritha Thilakarathne",
                        "slug": "Haritha-Thilakarathne",
                        "structuredName": {
                            "firstName": "Haritha",
                            "lastName": "Thilakarathne",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Haritha Thilakarathne"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2066789595"
                        ],
                        "name": "Kajal Gupta",
                        "slug": "Kajal-Gupta",
                        "structuredName": {
                            "firstName": "Kajal",
                            "lastName": "Gupta",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kajal Gupta"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2054962686"
                        ],
                        "name": "William Dai",
                        "slug": "William-Dai",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Dai",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "William Dai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38272727"
                        ],
                        "name": "Ankita Sastry",
                        "slug": "Ankita-Sastry",
                        "structuredName": {
                            "firstName": "Ankita",
                            "lastName": "Sastry",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ankita Sastry"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2733639"
                        ],
                        "name": "Shirish Goyal",
                        "slug": "Shirish-Goyal",
                        "structuredName": {
                            "firstName": "Shirish",
                            "lastName": "Goyal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Shirish Goyal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1918200"
                        ],
                        "name": "Thejan Rajapakshe",
                        "slug": "Thejan-Rajapakshe",
                        "structuredName": {
                            "firstName": "Thejan",
                            "lastName": "Rajapakshe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Thejan Rajapakshe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3283816"
                        ],
                        "name": "N. Abolhassani",
                        "slug": "N.-Abolhassani",
                        "structuredName": {
                            "firstName": "Niki",
                            "lastName": "Abolhassani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Abolhassani"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50676280"
                        ],
                        "name": "Angela Xie",
                        "slug": "Angela-Xie",
                        "structuredName": {
                            "firstName": "Angela",
                            "lastName": "Xie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Angela Xie"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2061266297"
                        ],
                        "name": "Abigail Reyes",
                        "slug": "Abigail-Reyes",
                        "structuredName": {
                            "firstName": "Abigail",
                            "lastName": "Reyes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Abigail Reyes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "78563961"
                        ],
                        "name": "S. Ingle",
                        "slug": "S.-Ingle",
                        "structuredName": {
                            "firstName": "Surabhi",
                            "lastName": "Ingle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ingle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2036926625"
                        ],
                        "name": "Verónica Jaramillo",
                        "slug": "Verónica-Jaramillo",
                        "structuredName": {
                            "firstName": "Verónica",
                            "lastName": "Jaramillo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Verónica Jaramillo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113335241"
                        ],
                        "name": "Martin Godínez",
                        "slug": "Martin-Godínez",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Godínez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Martin Godínez"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2066245477"
                        ],
                        "name": "W. Ángel",
                        "slug": "W.-Ángel",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Ángel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Ángel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2602469"
                        ],
                        "name": "C. Toxtli",
                        "slug": "C.-Toxtli",
                        "structuredName": {
                            "firstName": "Carlos",
                            "lastName": "Toxtli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Toxtli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144975554"
                        ],
                        "name": "J. Flores",
                        "slug": "J.-Flores",
                        "structuredName": {
                            "firstName": "Juan",
                            "lastName": "Flores",
                            "middleNames": [
                                "Pablo"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Flores"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110031900"
                        ],
                        "name": "Asmita Gupta",
                        "slug": "Asmita-Gupta",
                        "structuredName": {
                            "firstName": "Asmita",
                            "lastName": "Gupta",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Asmita Gupta"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409288764"
                        ],
                        "name": "Vineet Sethia",
                        "slug": "Vineet-Sethia",
                        "structuredName": {
                            "firstName": "Vineet",
                            "lastName": "Sethia",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Vineet Sethia"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2064188956"
                        ],
                        "name": "D. Padilla",
                        "slug": "D.-Padilla",
                        "structuredName": {
                            "firstName": "Diana",
                            "lastName": "Padilla",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Padilla"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1844994"
                        ],
                        "name": "Kristy Milland",
                        "slug": "Kristy-Milland",
                        "structuredName": {
                            "firstName": "Kristy",
                            "lastName": "Milland",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kristy Milland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409288763"
                        ],
                        "name": "Kristiono Setyadi",
                        "slug": "Kristiono-Setyadi",
                        "structuredName": {
                            "firstName": "Kristiono",
                            "lastName": "Setyadi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kristiono Setyadi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3235009"
                        ],
                        "name": "Nuwan Wajirasena",
                        "slug": "Nuwan-Wajirasena",
                        "structuredName": {
                            "firstName": "Nuwan",
                            "lastName": "Wajirasena",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nuwan Wajirasena"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409288772"
                        ],
                        "name": "M. Batagoda",
                        "slug": "M.-Batagoda",
                        "structuredName": {
                            "firstName": "Muthitha",
                            "lastName": "Batagoda",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Batagoda"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2059778354"
                        ],
                        "name": "Rolando Cruz",
                        "slug": "Rolando-Cruz",
                        "structuredName": {
                            "firstName": "Rolando",
                            "lastName": "Cruz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rolando Cruz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144894718"
                        ],
                        "name": "J. Damon",
                        "slug": "J.-Damon",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Damon",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Damon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409288781"
                        ],
                        "name": "Divya Nekkanti",
                        "slug": "Divya-Nekkanti",
                        "structuredName": {
                            "firstName": "Divya",
                            "lastName": "Nekkanti",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Divya Nekkanti"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409288962"
                        ],
                        "name": "T. Sarma",
                        "slug": "T.-Sarma",
                        "structuredName": {
                            "firstName": "Tejas",
                            "lastName": "Sarma",
                            "middleNames": [
                                "Seshadri"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Sarma"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "120967822"
                        ],
                        "name": "M. Saleh",
                        "slug": "M.-Saleh",
                        "structuredName": {
                            "firstName": "Mohamed",
                            "lastName": "Saleh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Saleh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409288786"
                        ],
                        "name": "Gabriela Gongora-Svartzman",
                        "slug": "Gabriela-Gongora-Svartzman",
                        "structuredName": {
                            "firstName": "Gabriela",
                            "lastName": "Gongora-Svartzman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gabriela Gongora-Svartzman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3112609"
                        ],
                        "name": "S. Bateni",
                        "slug": "S.-Bateni",
                        "structuredName": {
                            "firstName": "Soroosh",
                            "lastName": "Bateni",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Bateni"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2035593398"
                        ],
                        "name": "G. Barrera",
                        "slug": "G.-Barrera",
                        "structuredName": {
                            "firstName": "Gema",
                            "lastName": "Barrera",
                            "middleNames": [
                                "Toledo"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Barrera"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2052946862"
                        ],
                        "name": "Alex Peña",
                        "slug": "Alex-Peña",
                        "structuredName": {
                            "firstName": "Alex",
                            "lastName": "Peña",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alex Peña"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145438184"
                        ],
                        "name": "Ryan Compton",
                        "slug": "Ryan-Compton",
                        "structuredName": {
                            "firstName": "Ryan",
                            "lastName": "Compton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ryan Compton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409288791"
                        ],
                        "name": "Deen Aariff",
                        "slug": "Deen-Aariff",
                        "structuredName": {
                            "firstName": "Deen",
                            "lastName": "Aariff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Deen Aariff"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2065270685"
                        ],
                        "name": "Luis Palacios",
                        "slug": "Luis-Palacios",
                        "structuredName": {
                            "firstName": "Luis",
                            "lastName": "Palacios",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Luis Palacios"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409160627"
                        ],
                        "name": "Manuela Paula Ritter",
                        "slug": "Manuela-Paula-Ritter",
                        "structuredName": {
                            "firstName": "Manuela",
                            "lastName": "Ritter",
                            "middleNames": [
                                "Paula"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Manuela Paula Ritter"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113670697"
                        ],
                        "name": "K. NishaK.",
                        "slug": "K.-NishaK.",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "NishaK.",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. NishaK."
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2054059200"
                        ],
                        "name": "A. Kay",
                        "slug": "A.-Kay",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Kay",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Kay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2164373"
                        ],
                        "name": "Jana Uhrmeister",
                        "slug": "Jana-Uhrmeister",
                        "structuredName": {
                            "firstName": "Jana",
                            "lastName": "Uhrmeister",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jana Uhrmeister"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409288813"
                        ],
                        "name": "Srivalli Nistala",
                        "slug": "Srivalli-Nistala",
                        "structuredName": {
                            "firstName": "Srivalli",
                            "lastName": "Nistala",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Srivalli Nistala"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1576660799"
                        ],
                        "name": "Milad Esfahani",
                        "slug": "Milad-Esfahani",
                        "structuredName": {
                            "firstName": "Milad",
                            "lastName": "Esfahani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Milad Esfahani"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3260009"
                        ],
                        "name": "Elsa Bakiu",
                        "slug": "Elsa-Bakiu",
                        "structuredName": {
                            "firstName": "Elsa",
                            "lastName": "Bakiu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Elsa Bakiu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409288805"
                        ],
                        "name": "Christopher Diemert",
                        "slug": "Christopher-Diemert",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Diemert",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher Diemert"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2065805159"
                        ],
                        "name": "Luca Matsumoto",
                        "slug": "Luca-Matsumoto",
                        "structuredName": {
                            "firstName": "Luca",
                            "lastName": "Matsumoto",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Luca Matsumoto"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110678198"
                        ],
                        "name": "Manik Singh",
                        "slug": "Manik-Singh",
                        "structuredName": {
                            "firstName": "Manik",
                            "lastName": "Singh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Manik Singh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113272263"
                        ],
                        "name": "K. Patel",
                        "slug": "K.-Patel",
                        "structuredName": {
                            "firstName": "Krupa",
                            "lastName": "Patel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Patel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145237361"
                        ],
                        "name": "Ranjay Krishna",
                        "slug": "Ranjay-Krishna",
                        "structuredName": {
                            "firstName": "Ranjay",
                            "lastName": "Krishna",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ranjay Krishna"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2064565683"
                        ],
                        "name": "G. Kovács",
                        "slug": "G.-Kovács",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Kovács",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Kovács"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1927646"
                        ],
                        "name": "Rajan Vaish",
                        "slug": "Rajan-Vaish",
                        "structuredName": {
                            "firstName": "Rajan",
                            "lastName": "Vaish",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rajan Vaish"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145879842"
                        ],
                        "name": "Michael S. Bernstein",
                        "slug": "Michael-S.-Bernstein",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Bernstein",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael S. Bernstein"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 49,
                                "start": 27
                            }
                        ],
                        "text": "We used the Daemo platform (Gaikwad et al., 2015), with Amazon Mechanical Turk at its backend."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 16799915,
            "fieldsOfStudy": [
                "Computer Science",
                "Business"
            ],
            "id": "723b30edce2a7a46626a38c8f8cac929131b9ed4",
            "isKey": false,
            "numCitedBy": 45,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "Crowdsourcing marketplaces provide opportunities for autonomous and collaborative professional work as well as social engagement. However, in these marketplaces, workers feel disrespected due to unreasonable rejections and low payments, whereas requesters do not trust the results they receive. The lack of trust and uneven distribution of power among workers and requesters have raised serious concerns about sustainability of these marketplaces. To address the challenges of trust and power, this paper introduces Daemo, a self-governed crowdsourcing marketplace. We propose a prototype task to improve the work quality and open-governance model to achieve equitable representation. We envisage Daemo will enable workers to build sustainable careers and provide requesters with timely, quality labor for their businesses."
            },
            "slug": "Daemo:-A-Self-Governed-Crowdsourcing-Marketplace-Gaikwad-Morina",
            "title": {
                "fragments": [],
                "text": "Daemo: A Self-Governed Crowdsourcing Marketplace"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This paper proposes a prototype task to improve the work quality and open-governance model to achieve equitable representation and envisage Daemo will enable workers to build sustainable careers and provide requesters with timely, quality labor for their businesses."
            },
            "venue": {
                "fragments": [],
                "text": "UIST"
            },
            "year": 2015
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Schlaefer, and C. Welty. 2013. Building Watson: An overview of the DeepQA project. AI Magazine"
            },
            "venue": {
                "fragments": [],
                "text": "Schlaefer, and C. Welty. 2013. Building Watson: An overview of the DeepQA project. AI Magazine"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Machine comprehension with discourse relations. In Association for Computational Linguistics (ACL)"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2015
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "In ACM Special Interest Group on Information Retreival (SIGIR)"
            },
            "venue": {
                "fragments": [],
                "text": "In ACM Special Interest Group on Information Retreival (SIGIR)"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 155,
                                "start": 140
                            }
                        ],
                        "text": "Their pattern matching baseline was subsequently improved by a rule-based system (Riloff and Thelen, 2000) and a logistic regression model (Ng et al., 2000)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A machine learning approach to answering questions for reading comprehension tests. In Joint SIGDAT conference on empirical methods in natural language processing and very large corpora - Volume"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 15,
            "methodology": 8,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 31,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/SQuAD:-100,000+-Questions-for-Machine-Comprehension-Rajpurkar-Zhang/05dd7254b632376973f3a1b4d39485da17814df5?sort=total-citations"
}