{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153072125"
                        ],
                        "name": "C. Harris",
                        "slug": "C.-Harris",
                        "structuredName": {
                            "firstName": "Catherine",
                            "lastName": "Harris",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Harris"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 0
                            }
                        ],
                        "text": "Harris (1991) has shown that similar results hold for the parity function (of which XOR is a reduced case)."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 146,
                                "start": 134
                            }
                        ],
                        "text": "It is known, for instance, that there are problems which can best be learned when the entire data set is made available to a network (Harris, 1991)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 61664764,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0ac8973f2d4e40509605cd2541e69d0c6d77e401",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Parallel distributed processing (PDP) is an approach to modeling cognitive abilities, and a hypothesis about the mechanisms mediating learning and representation. This dissertation focuses on one type of PDP model, networks of simple processing units trained by the back propagation algorithm to learn input-output relationships. Two areas of inquiry are investigated: cognitive development, and representation of linguistic regularities, associations, such as those governing constraints on word-combinations. \nIn Part I, artificial training corpora are constructed to explore how constraints on the order of acquisition of different types of information may be a function of the learning algorithm and superpositional storage of input-output pairs. The principles that constrain network performance are compared to three complimentary approaches to development: maturational, constructivist, and correlational. The exploratory models show that PDP mechanisms are relevant to all three approaches. Networks can be used to illustrate the notions of logical prerequisite and critical period, and can recover from initial incorrect encodings of a training corpus, such as those that derive from imperfect correlations between aspects of the input and output. These findings are argued to be relevant to the question of what computational mechanisms and representations may facilitate inductive learning. \nPart II of the dissertation focuses on the potential of PDP models to capture linguistic regularities. To investigate an analogy between network and human representations of word meaning and word-combination rules, the polysemic structure of six prepositions were analyzed. Two PDP models meeting some of these representational challenges were constructed. The training sets for both models consist of distributions of form-meaning pairs that reflect important aspects of English spatial expressions. Under pressure to encode these distributional regularities with limited resources, the models self-organize to encode the abstract properties of the input vectors and \"rules\" for their combination. Key to the models' successful integration of words in different contexts is their recoding of input vectors into a format in which co-occurrence relationships among words are explicit. Given that speakers must solve the same problem solved by the networks, human mental representations of word meanings may also conflate attributes of individual words and the contexts in which they occur."
            },
            "slug": "Parallel-distributed-processing-models-and-for-and-Harris",
            "title": {
                "fragments": [],
                "text": "Parallel distributed processing models and metaphors for language and development"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This dissertation focuses on one type of PDP model, networks of simple processing units trained by the back propagation algorithm to learn input-output relationships, and the potential of P DP models to capture linguistic regularities."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1820015"
                        ],
                        "name": "E. Newport",
                        "slug": "E.-Newport",
                        "structuredName": {
                            "firstName": "Elissa",
                            "lastName": "Newport",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Newport"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 145018757,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "2c9cd63b2236bc289f8d931befc9aec976643119",
            "isKey": false,
            "numCitedBy": 255,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Constraints-on-learning-and-their-role-in-language-Newport",
            "title": {
                "fragments": [],
                "text": "Constraints on learning and their role in language acquisition: Studies of the acquisition of American sign language"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701656"
                        ],
                        "name": "James L. McClelland",
                        "slug": "James-L.-McClelland",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "McClelland",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "James L. McClelland"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6144184,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "06f73a9eb8154224ab5bf8ad0a68f6a8beeb0aa0",
            "isKey": false,
            "numCitedBy": 206,
            "numCiting": 62,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : This paper provides a brief overview of the connectionist or parallel distributed processing framework for modeling cognitive processes, and considers the application of the connectionist framework to problems of cognitive development. Several aspects of cognitive development might result from the process of learning as it occurs in multi-layer networks. This learning process has the characteristic that it reduces the discrepancy between expected and observed events. As it does this, representations develop on hidden units which dramatically change both the way in which the network represents the environment from which it learns and the expectations that the network generates about environmental events. The learning process exhibits relatively abrupt transitions corresponding to stage shifts in cognitive development. These points are illustrated using a network that learns to anticipate which side of a balance beam will go down, based on the number of weights on each side of the fulcrum and their distance from the fulcrum on each side of the beam. The network is trained in an environment in which weight more frequently governs which side will go down. It recapitulates the states of development seen in children, as well as the stage transitions, as it learns to represent weight and distance information. Keywords: Parallel processing; Data processing."
            },
            "slug": "Parallel-Distributed-Processing:-Implications-for-McClelland",
            "title": {
                "fragments": [],
                "text": "Parallel Distributed Processing: Implications for Cognition and Development"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The application of the connectionist framework to problems of cognitive development is considered, and a network that learns to anticipate which side of a balance beam will go down is illustrated, based on the number of weights on each side of the fulcrum and their distance from the Fulcrum."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2884373"
                        ],
                        "name": "J. Elman",
                        "slug": "J.-Elman",
                        "structuredName": {
                            "firstName": "Jeffrey",
                            "lastName": "Elman",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Elman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2763403,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "668087f0ae7ce1de6e0bd0965dbb480c08103260",
            "isKey": false,
            "numCitedBy": 9863,
            "numCiting": 111,
            "paperAbstract": {
                "fragments": [],
                "text": "Time underlies many interesting human behaviors. Thus, the question of how to represent time in connectionist models is very important. One approach is to represent time implicitly by its effects on processing rather than explicitly (as in a spatial representation). The current report develops a proposal along these lines first described by Jordan (1986) which involves the use of recurrent links in order to provide networks with a dynamic memory. In this approach, hidden unit patterns are fed back to themselves; the internal representations which develop thus reflect task demands in the context of prior internal states. A set of simulations is reported which range from relatively simple problems (temporal version of XOR) to discovering syntactic/semantic features for words. The networks are able to learn interesting internal representations which incorporate task demands with memory demands; indeed, in this approach the notion of memory is inextricably bound up with task processing. These representations reveal a rich structure, which allows them to be highly context-dependent while also expressing generalizations across classes of items. These representations suggest a method for representing lexical categories and the type/token distinction."
            },
            "slug": "Finding-Structure-in-Time-Elman",
            "title": {
                "fragments": [],
                "text": "Finding Structure in Time"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A proposal along these lines first described by Jordan (1986) which involves the use of recurrent links in order to provide networks with a dynamic memory and suggests a method for representing lexical categories and the type/token distinction is developed."
            },
            "venue": {
                "fragments": [],
                "text": "Cogn. Sci."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1403615640"
                        ],
                        "name": "D. Servan-Schreiber",
                        "slug": "D.-Servan-Schreiber",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Servan-Schreiber",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Servan-Schreiber"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "29942829"
                        ],
                        "name": "A. Cleeremans",
                        "slug": "A.-Cleeremans",
                        "structuredName": {
                            "firstName": "Axel",
                            "lastName": "Cleeremans",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Cleeremans"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701656"
                        ],
                        "name": "James L. McClelland",
                        "slug": "James-L.-McClelland",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "McClelland",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "James L. McClelland"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18569620,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d0d7f8b5d54e3d68fd45a70d4a0d13f42e8d71ff",
            "isKey": false,
            "numCitedBy": 177,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "We explore a network architecture introduced by Elman (1988) for predicting successive elements of a sequence. The network uses the pattern of activation over a set of hidden units from time-step t-1, together with element t, to predict element t+1. When the network is trained with strings from a particular finite-state grammar, it can learn to be a perfect finite-state recognizer for the grammar. Cluster analyses of the hidden-layer patterns of activation showed that they encode prediction-relevant information about the entire path traversed through the network. We illustrate the phases of learning with cluster analyses performed at different points during training."
            },
            "slug": "Learning-Subsequential-Structure-in-Simple-Networks-Servan-Schreiber-Cleeremans",
            "title": {
                "fragments": [],
                "text": "Learning Subsequential Structure in Simple Recurrent Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "A network architecture introduced by Elman (1988) for predicting successive elements of a sequence using the pattern of activation over a set of hidden units to be illustrated with cluster analyses performed at different points during training."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6610865"
                        ],
                        "name": "G. Turkewitz",
                        "slug": "G.-Turkewitz",
                        "structuredName": {
                            "firstName": "Gerald",
                            "lastName": "Turkewitz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Turkewitz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2065822746"
                        ],
                        "name": "P. Kenny",
                        "slug": "P.-Kenny",
                        "structuredName": {
                            "firstName": "P",
                            "lastName": "Kenny",
                            "middleNames": [
                                "A"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Kenny"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 0
                            }
                        ],
                        "text": "Turkewitz and Kenny (1982) have also argued that developmental limitations may not only be adaptive for an individual’s current state (e.g., the immature motor system of a newborn animal prevents it from wandering away from its mother), but may also assist in neurogenesis and provide a basis for…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Turkewitz and Kenny (1982)  have also argued that developmental limitations may not only be adaptive for an individual’s current state ( e.g., the immature motor system of a newborn animal prevents it from wandering away from its mother), but may also assist in neurogenesis and provide a basis for later perceptual development."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 25809131,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "631bd89fd63b8facd759958b8f60ee23bb3c397e",
            "isKey": false,
            "numCitedBy": 257,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose an alternative to the conventional view that limitations on infant functioning are handicaps to be overcome. According to our view, limitations, particularly of the sensory systems, produce adaptive advantages for infants by facilitating perceptual organization. During embryogenesis, developmental rates of sensory systems are unequal so that onset of functioning is sequential. We argue that such differential onset results in relative independence among emerging systems, thereby reducing competition which helps regulate subsequent neurogenesis and functioning. In addition to prenatal effects, neonatal sensory limitations are discussed as a major source of perceptual organization. Limitations reduce the amount of information with which the infant must contend and promote temporal contiguity between multimodal attributes of a stimulus. Although we focus on human perceptual development, our view is a broadly based comparative one. Thus, other organisms have evolved means of restricting sensory input, and evidence is cited suggesting the importance of this reduced input in regulating normal perceptual development."
            },
            "slug": "Limitations-on-input-as-a-basis-for-neural-and-a-Turkewitz-Kenny",
            "title": {
                "fragments": [],
                "text": "Limitations on input as a basis for neural organization and perceptual development: a preliminary theoretical statement."
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "According to this view, limitations, particularly of the sensory systems, produce adaptive advantages for infants by facilitating perceptual organization and result in relative independence among emerging systems, thereby reducing competition which helps regulate subsequent neurogenesis and functioning."
            },
            "venue": {
                "fragments": [],
                "text": "Developmental psychobiology"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38254647"
                        ],
                        "name": "R. Morris",
                        "slug": "R.-Morris",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Morris",
                            "middleNames": [
                                "G.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Morris"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 142110261,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "4ef5006a511497dd480b625eb7b2f0b946e1afae",
            "isKey": false,
            "numCitedBy": 276,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Network models of the mind, H.C.Longuet-Higgins parallel distributed processing - implications for cognition and development, Jay L.McClelland learning distributed representations of concepts, Geoffrey E.Hinton parallel distributed processing and psychology, Glyn W.Humphreys selective attention, variable processing and distributed representation of stimuli - applications to perceptual learning and latent inhibition, Ian P.McLaren et al connections and disconnections - acquired dyslexia in a computational model of reading processes rules and connections in human language, Steven Pinker and Alan Prince computational neuroscience - modelling the brain, Richard G.M.Morris a biologically realistic neural network model for higher-order features of classical conditioning, Robert D.Hawkins does synaptic plasticity play a role in information storage in the vertebrate brain?, Richard G.M.Morris parallel distributed processing in the brain - implications of the functional architecture of neuronal networks in the hippocampus, Edmund T.Rolls rapid incremental learning of hierarchically organized stimuli by layer II sensory (olfactory) cortex."
            },
            "slug": "Parallel-Distributed-Processing:-Implications-for-Morris",
            "title": {
                "fragments": [],
                "text": "Parallel Distributed Processing: Implications for Psychology and Neurobiology"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A biologically realistic neural network model for higher-order features of classical conditioning and implications of the functional architecture of neuronal networks in the hippocampus are studied."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "67066544"
                        ],
                        "name": "K. Wexler",
                        "slug": "K.-Wexler",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Wexler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Wexler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2034844"
                        ],
                        "name": "P. Culicover",
                        "slug": "P.-Culicover",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Culicover",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Culicover"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This problem of the apparent insufficiency of the data has been discussed in many contexts (e.g., Baker, 1979; Bowerman, 1987; Pinker, 1989;  Wexler & Cullicover; 1980 ) but one of the simplest demonstrations comes from Gold’s (1967) work."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 62530906,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "79b1ed1b8170ba85989779e29b38642478b903bb",
            "isKey": false,
            "numCitedBy": 1183,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The question of language learnability is central to modern linguistics. Yet, despite its importance, research into the problems of language learnability has rarely gone beyond the informal, commonsense intuitions that currently prevail among linguists and psychologists.By focusing their inquiry on formal language learnability theory--the interface of formal mathematical linguistics, linguistic theory and cognitive psychology--the authors of this book have developed a rigorous and unified theory that opens the study of language learnability to discoveries about the mechanisms of language acquisition in human beings. Their research has important implications for linguistic theory, child language research, and the philosophy of language.\"Formal Principles of Language Acquisition\" develops rigorous mathematical methods for demonstrating the learnability of classes of grammars. It adapts the well-developed theories of transformational grammar to establish psychological motivation for a set of formal constraints on grammars sufficient for learnability. In addition, the research deals with such matters as the complex interaction between the mechanism of language learning and the learning environment, the empirical adequacy of the learnability constraints, feasibility and attainability of classes of grammars, the role of semantics in language learnability, and the adequacy of transformational grammars as models of human linguistic competence.This first serious and extended development of a formal and precise theory of language learnability will interest researchers in psychology and linguistics, and is recommended for use in graduate courses in language acquisition, linguistic theory, psycholinguistics, and mathematical linguistics, as well as interdisciplinary courses that deal with language learning, use, and philosophy.Contents: Methodological Considerations; Foundations of a Theory of Learnability; A Learnability Result for Transformational Grammar; Degree-2 Learnability; Linguistic Evidence for the Learnability Constraints; Function, Performance and Explanations; Further Issues: Linguistic Interaction, Invariance Principle, Open Problems; Notes, Bibliography, Index."
            },
            "slug": "Formal-Principles-of-Language-Acquisition-Wexler-Culicover",
            "title": {
                "fragments": [],
                "text": "Formal Principles of Language Acquisition"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The authors of this book have developed a rigorous and unified theory that opens the study of language learnability to discoveries about the mechanisms of language acquisition in human beings and has important implications for linguistic theory, child language research, and the philosophy of language."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2327332"
                        ],
                        "name": "J. Hawkins",
                        "slug": "J.-Hawkins",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Hawkins",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hawkins"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144669503,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "d7035304f4361776c7e0442d8e651967bbb6f970",
            "isKey": false,
            "numCitedBy": 274,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Part 1 Introduction: explaining language universals, John A.Hawkins. Part 2 Innateness and Learnability: the innateness hypothesis, Teun Hoekstra and Jan G.Kooij language acquisitions - schemas replace universal grammar, Michael A.Arbib and Jane C.Hill the \"no negative evidence\" problem - how do children avoid constructing an overly general grammar?, Melissa Bowerman. Max-Planck Institut fur Psycholinguistik, Nijmegen). Part 3 Semantic and Pragmatic Explanations: on semantics and the binding theory, Edward L.Keenan concessive connecitves and concessive sentences - cross-linguistic regularities and pragmatic principles, Ekkehard Konig a discourse approach to the cross-linguistic category \"adjective\", Sandra A.Thompson coreference and conjunction reduction in grammar and discourse, Bernard Comrie. Part 4 Cognitive, Perceptual and processing explanations: language, perception and the world, Michael Lee parameterizing the language processing system - left-vs. right-branching within and across languages, Lyn Frazier and Keith Rayner psycholinguistic factors in morphological asymmetry, John A.Hawkins, and Anne Cutler. Part 5 the diachronic dimension: integrating diachronic and processing principles in explaining the suffixing preference, Christopher J.Hall the diachronic dimension in explanation, Joan L.Bybee."
            },
            "slug": "Explaining-Language-Universals-Hawkins",
            "title": {
                "fragments": [],
                "text": "Explaining Language Universals"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144280579"
                        ],
                        "name": "K. Dunbar",
                        "slug": "K.-Dunbar",
                        "structuredName": {
                            "firstName": "Kevin",
                            "lastName": "Dunbar",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Dunbar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2118154"
                        ],
                        "name": "D. Klahr",
                        "slug": "D.-Klahr",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Klahr",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Klahr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 34
                            }
                        ],
                        "text": "In many models of learning (e.g., Dunbar & Klahr, 1989; Lea & Simon, 1979; Osherson, Stob, & Weinstein, 1986) it seems to be assumed that the data accumulate and are available in a more or less veridical form for as long as they may be needed."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 60664355,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "376e7b2436f18cfff352f30c151d2687126058f4",
            "isKey": false,
            "numCitedBy": 98,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The purpose of the three studies reported here was to formulate a framework for understanding the development of scientific reasoning processes. Subjects were placed in a simulated scientific discovery context by first teaching them how to use an electronic device and then asking them to discover how a hitherto unencountered function worked. To do this task, subjects had to formulate hypotheses based on their prior knowledge, conduct experiments, and evaluate the results of their experiments. These studies provided support for the view that scientific reasoning is a search in two problem spaces. By extending Simon and Lea's (1974) Generalized Rule Inducer, we present a general model of Scientific Discovery as Dual Search (SDDS) that shows how search in two problem spaces (an hypothesis space and an experimental space) shapes hypothesis generation, experimental design, and the evaluation of hypotheses. The model also shows how these processes interact with each other and suggests what their developmental course might be. Scientific reasoning; Discovery processes; Problem space search; Cognitive development; Developmental psychology; Learning; Generalized rule inducer; SDDS."
            },
            "slug": "Developmental-Differences-in-Scientific-Discovery-Dunbar-Klahr",
            "title": {
                "fragments": [],
                "text": "Developmental Differences in Scientific Discovery Processes"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "A general model of Scientific Discovery as Dual Search (SDDS) is presented that shows how search in two problem spaces shapes hypothesis generation, experimental design, and the evaluation of hypotheses."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "51966268"
                        ],
                        "name": "W. Estes",
                        "slug": "W.-Estes",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Estes",
                            "middleNames": [
                                "Kaye"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Estes"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 231,
                                "start": 220
                            }
                        ],
                        "text": "The approach differs markedly with other models of learning, in which - at least in principle, given deterministic inputs - “a 100% success rate can . . . be achieved on the basis of information available to the learner” (Estes, 1986)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 72,
                                "start": 61
                            }
                        ],
                        "text": "Exemplar-based models make this assumption quite explicitly (Estes, 1986; Medin & Schaffer, 1978; Nosofsky, in press) and claim that experiences are stored as individually retrievable exemplars."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 66
                            }
                        ],
                        "text": "be achieved on the basis of information available to the learner” (Estes, 1986)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 10573104,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "b46e949d0ddaa7b8df545fa8ccc68cbcd9f73032",
            "isKey": false,
            "numCitedBy": 344,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Array-models-for-category-learning-Estes",
            "title": {
                "fragments": [],
                "text": "Array models for category learning"
            },
            "venue": {
                "fragments": [],
                "text": "Cognitive Psychology"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1758714"
                        ],
                        "name": "S. Fahlman",
                        "slug": "S.-Fahlman",
                        "structuredName": {
                            "firstName": "Scott",
                            "lastName": "Fahlman",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Fahlman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749342"
                        ],
                        "name": "C. Lebiere",
                        "slug": "C.-Lebiere",
                        "structuredName": {
                            "firstName": "Christian",
                            "lastName": "Lebiere",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Lebiere"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 30443043,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "995a3b11cc8a4751d8e167abc4aa937abc934df0",
            "isKey": false,
            "numCitedBy": 2938,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "Cascade-Correlation is a new architecture and supervised learning algorithm for artificial neural networks. Instead of just adjusting the weights in a network of fixed topology. Cascade-Correlation begins with a minimal network, then automatically trains and adds new hidden units one by one, creating a multi-layer structure. Once a new hidden unit has been added to the network, its input-side weights are frozen. This unit then becomes a permanent feature-detector in the network, available for producing outputs or for creating other, more complex feature detectors. The Cascade-Correlation architecture has several advantages over existing algorithms: it learns very quickly, the network determines its own size and topology, it retains the structures it has built even if the training set changes, and it requires no back-propagation of error signals through the connections of the network."
            },
            "slug": "The-Cascade-Correlation-Learning-Architecture-Fahlman-Lebiere",
            "title": {
                "fragments": [],
                "text": "The Cascade-Correlation Learning Architecture"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "The Cascade-Correlation architecture has several advantages over existing algorithms: it learns very quickly, the network determines its own size and topology, it retains the structures it has built even if the training set changes, and it requires no back-propagation of error signals through the connections of the network."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2312012"
                        ],
                        "name": "D. Osherson",
                        "slug": "D.-Osherson",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Osherson",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Osherson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2642989"
                        ],
                        "name": "M. Stob",
                        "slug": "M.-Stob",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Stob",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Stob"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145092158"
                        ],
                        "name": "S. Weinstein",
                        "slug": "S.-Weinstein",
                        "structuredName": {
                            "firstName": "Scott",
                            "lastName": "Weinstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Weinstein"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 56583371,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "20a0accf6325347e30144dc5b061ea04af5fea19",
            "isKey": false,
            "numCitedBy": 566,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Systems That Learn presents a mathematical framework for the study of learning in a variety of domains. It provides the basic concepts and techniques of learning theory as well as a comprehensive account of what is currently known about a variety of learning paradigms.Daniel N. Osherson and Scott Weinstein are at MIT, and Michael Stob at Calvin College."
            },
            "slug": "Systems-That-Learn:-An-Introduction-to-Learning-for-Osherson-Stob",
            "title": {
                "fragments": [],
                "text": "Systems That Learn: An Introduction to Learning Theory for Cognitive and Computer Scientists"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "Systems That Learn presents a mathematical framework for the study of learning in a variety of domains that provides the basic concepts and techniques of learning theory as well as a comprehensive account of what is currently known about a range of learning paradigms."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3023259"
                        ],
                        "name": "D. Medin",
                        "slug": "D.-Medin",
                        "structuredName": {
                            "firstName": "Douglas",
                            "lastName": "Medin",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Medin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145866022"
                        ],
                        "name": "M. M. Schaffer",
                        "slug": "M.-M.-Schaffer",
                        "structuredName": {
                            "firstName": "Marguerite",
                            "lastName": "Schaffer",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. M. Schaffer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 74
                            }
                        ],
                        "text": "Exemplar-based models make this assumption quite explicitly (Estes, 1986; Medin & Schaffer, 1978; Nosofsky, in press) and claim that experiences are stored as individually retrievable exemplars."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Exemplar-based models make this assumption quite explicitly (Estes, 1986;  Medin & Schaffer, 1978;  Nosofsky, in press) and claim that experiences are stored as individually retrievable exemplars."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 27148249,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "2cd7154ef2e19d4733bfac30f04ed708f01b42d1",
            "isKey": false,
            "numCitedBy": 2807,
            "numCiting": 58,
            "paperAbstract": {
                "fragments": [],
                "text": "Most theories dealing with ill-defined concepts assume that performance is based on category level information or a mixture of category level and specific item information. A context theory of classificatio n is described in which judgments are assumed to derive exclusively from stored exemplar information. The main idea is that a probe item acts as a retrieval cue to access information associated with stimuli similar to the probe. The predictions of the context theory are contrasted with those of a class of theories (including prototype theory) that assume that the information entering into judgments can be derived from an additive combination of information from component cue dimensions. Across four experiments using both geometric forms and schematic faces as stimuli, the context theory consistently gave a better account of the data. The relation of the context theory to other theories and phenomena associated with ill-defined concepts is discussed in detail. One of the major components of cognitive behavior concerns abstracting rules and forming concepts. Our entire system of naming objects and events, talking about them, and interacting with them presupposes the ability to group experiences into appropriate classes. Young children learn to tell the difference between dogs and cats, between clocks and fans, and between stars and street lights. Since few concepts are formally taught, the evolution of concepts from experience with exemplars must be a fundamental learning phenomenon. The focus of the present article is to explore how such conceptual achievements emerge from individual instances."
            },
            "slug": "Context-theory-of-classification-learning.-Medin-Schaffer",
            "title": {
                "fragments": [],
                "text": "Context theory of classification learning."
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "A context theory of classificatio n is described in which judgments are assumed to derive exclusively from stored exemplar information, and the main idea is that a probe item acts as a retrieval cue to access information associated with stimuli similar to the probe."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "122959051"
                        ],
                        "name": "T. Ash",
                        "slug": "T.-Ash",
                        "structuredName": {
                            "firstName": "Timur",
                            "lastName": "Ash",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Ash"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 121,
                                "start": 112
                            }
                        ],
                        "text": "Allowing networks to reconfigure dynamically or acquire additional nodes has been shown to facilitate learning (Ash, 1989; Fahlman & Lebiere, 1990; Shultz & Schmidt, 1991)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 40941575,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "212a4ab68c4489eca22984ecd297e986693e5200",
            "isKey": false,
            "numCitedBy": 205,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Summary form only given. A novel method called dynamic node creation (DNC) that attacks issues of training large networks and of testing networks with different numbers of hidden layer units is presented. DNC sequentially adds nodes one at a time to the hidden layer(s) of the network until the desired approximation accuracy is achieved. Simulation results for parity, symmetry, binary addition, and the encoder problem are presented. The procedure was capable of finding known minimal topologies in many cases, and was always within three nodes of the minimum. Computational expense for finding the solutions was comparable to training normal backpropagation (BP) networks with the same final topologies. Starting out with fewer nodes than needed to solve the problem actually seems to help find a solution. The method yielded a solution for every problem tried. BP applied to the same large networks with randomized initial weights was unable, after repeated attempts, to replicate some minimum solutions found by DNC.<<ETX>>"
            },
            "slug": "Dynamic-node-creation-in-backpropagation-networks-Ash",
            "title": {
                "fragments": [],
                "text": "Dynamic node creation in backpropagation networks"
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "A novel method called dynamic node creation (DNC) that attacks issues of training large networks and of testing networks with different numbers of hidden layer units is presented, which yielded a solution for every problem tried."
            },
            "venue": {
                "fragments": [],
                "text": "International 1989 Joint Conference on Neural Networks"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144342820"
                        ],
                        "name": "E. M. Gold",
                        "slug": "E.-M.-Gold",
                        "structuredName": {
                            "firstName": "E.",
                            "lastName": "Gold",
                            "middleNames": [
                                "Mark"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. M. Gold"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 12438987,
            "fieldsOfStudy": [
                "Linguistics",
                "Computer Science"
            ],
            "id": "20cc59e8879305cbe18409c77464eff272e1cf55",
            "isKey": false,
            "numCitedBy": 3487,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Language-Identification-in-the-Limit-Gold",
            "title": {
                "fragments": [],
                "text": "Language Identification in the Limit"
            },
            "venue": {
                "fragments": [],
                "text": "Inf. Control."
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2681887"
                        ],
                        "name": "D. Rumelhart",
                        "slug": "D.-Rumelhart",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Rumelhart",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Rumelhart"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701656"
                        ],
                        "name": "James L. McClelland",
                        "slug": "James-L.-McClelland",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "McClelland",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "James L. McClelland"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15291527,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ff2c2e3e83d1e8828695484728393c76ee07a101",
            "isKey": false,
            "numCitedBy": 15710,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The fundamental principles, basic mechanisms, and formal analyses involved in the development of parallel distributed processing (PDP) systems are presented in individual chapters contributed by leading experts. Topics examined include distributed representations, PDP models and general issues in cognitive science, feature discovery by competitive learning, the foundations of harmony theory, learning and relearning in Boltzmann machines, and learning internal representations by error propagation. Consideration is given to linear algebra in PDP, the logic of additive functions, resource requirements of standard and programmable nets, and the P3 parallel-network simulating system."
            },
            "slug": "Parallel-distributed-processing:-explorations-in-of-Rumelhart-McClelland",
            "title": {
                "fragments": [],
                "text": "Parallel distributed processing: explorations in the microstructure of cognition, vol. 1: foundations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35323872"
                        ],
                        "name": "B. McKenzie",
                        "slug": "B.-McKenzie",
                        "structuredName": {
                            "firstName": "Beryl",
                            "lastName": "McKenzie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. McKenzie"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116850947"
                        ],
                        "name": "H. Tootell",
                        "slug": "H.-Tootell",
                        "structuredName": {
                            "firstName": "Holly",
                            "lastName": "Tootell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Tootell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6597093"
                        ],
                        "name": "R. Day",
                        "slug": "R.-Day",
                        "structuredName": {
                            "firstName": "Ross",
                            "lastName": "Day",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Day"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7773312,
            "fieldsOfStudy": [
                "Psychology",
                "Medicine"
            ],
            "id": "3bd600c798e5154d7164374b14ed6874fafda6aa",
            "isKey": false,
            "numCitedBy": 44,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "Visual size constancy for distances up to 70 cm was studied in three experiments with 4-, 6-, and 8-month-old infants and up to 200 cm with 6-month-old infants in a fourth. A habituation-test procedure was used throughout. At each age subjects were repeatedly shown a three-dimensional model of a human head until a criterion of habituation of looking was reached. Relative to the habituation condition, the standard test condition was either the same (control) or different in distance, size, or both size and distance. Appropriate comparisons between the recovery scores for the test conditions showed that at 6 and 8 months, size constancy occurred for the head model up to a distance of 70 cm. This was not so for 100 cm and 200 cm. At 4 months size constancy measured in the same way as for older subjects was not apparent in the range 30-60 cm, but there was a suggestion that it is present at this age among those infants with lower variance of responding."
            },
            "slug": "Development-of-visual-size-constancy-during-the-1st-McKenzie-Tootell",
            "title": {
                "fragments": [],
                "text": "Development of visual size constancy during the 1st year of human infancy."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Comparisons between the recovery scores for the test conditions showed that at 6 and 8 months, size constancy occurred for the head model up to a distance of 70 cm, but this was not so for 100 cm and 200 cm."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2114422629"
                        ],
                        "name": "G. A. Miller",
                        "slug": "G.-A.-Miller",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Miller",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. A. Miller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "114531657"
                        ],
                        "name": "Noam Chomsky",
                        "slug": "Noam-Chomsky",
                        "structuredName": {
                            "firstName": "Noam",
                            "lastName": "Chomsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Noam Chomsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 118165987,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4f3695d5dd36bb0abd91c02d2725463fca556f46",
            "isKey": false,
            "numCitedBy": 886,
            "numCiting": 63,
            "paperAbstract": {
                "fragments": [],
                "text": "been proposed to describe talkers and listeners to describe the users of language rather than the language itself. As m was pointed out at the beginning of Chapter 12, our language is not merely the collection of our linguistic responses, habits, or dispositions, just as our knowledge of arithmetic is not merely the collection of our arithmetic responses, habits, or dispositions. We must respect this distinction between the person's knowledge and his actual or even potential behavior; a formal characterization of some language is not simultaneously a model of the users of that"
            },
            "slug": "Finitary-models-of-language-users-Miller-Chomsky",
            "title": {
                "fragments": [],
                "text": "Finitary models of language users"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "It is proposed to describe talkers and listeners to describe the users of language rather than the language itself, just as the authors' knowledge of arithmetic is not merely the collection of their arithmetic responses, habits, or dispositions."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94059053"
                        ],
                        "name": "H. Simon",
                        "slug": "H.-Simon",
                        "structuredName": {
                            "firstName": "Herbert",
                            "lastName": "Simon",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Simon"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 62
                            }
                        ],
                        "text": "In many models of learning (e.g., Dunbar & Klahr, 1989; Lea & Simon, 1979; Osherson, Stob, & Weinstein, 1986) it seems to be assumed that the data accumulate and are available in a more or less veridical form for as long as they may be needed."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 143250530,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "740e5eee8b09d50913fa876e8c154dd3ce4b96f6",
            "isKey": false,
            "numCitedBy": 932,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Nobel Laureate Herbert A. Simon has in the past quarter century been in the front line of the information-processing revolution; in fact, to a remarkable extent his and his colleagues' contributions have written the history of that revolution in cognitive psychology. This book brings together papers dating from the start of Simon's career to the present. Its focus is on modeling the chief components of human cognition and on testing these models experimentally."
            },
            "slug": "Models-of-Thought-Simon",
            "title": {
                "fragments": [],
                "text": "Models of Thought"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107687341"
                        ],
                        "name": "S. Wilson",
                        "slug": "S.-Wilson",
                        "structuredName": {
                            "firstName": "S",
                            "lastName": "Wilson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Wilson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 22915102,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "0020757e7043619603bdd6f4ef6f96ee2410daba",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "This study describes infant socialization in captive parent-young units of the caviomorph rodent Octodon degus. Types of parent-young contact (huddling or squatting) and social interaction (body nosing and accompanying behaviors) are described and their ontogenetic trends examined between postnatal Days 1 and 46. Fathers spent less time than mothers in contact with the young. Mother-young contact decreased postnatally, whereas the amounts of mother-young and father-young social interaction, measured in terms of body-nosing exchanges, showed a continuous increase postnatally; sibling interactions also showed a continuous increase. Father-young interactions tended to be dominated by the father. Young reared with the father cohabiting huddled less with their mother, and engaged in less body-nosing, than young reared in the father's absence. Observations suggested that paternal control of the young may curb juvenile interactions. Young observed without their parents in an unfamiliar enclosure did not groom or \"play\" as in their home cage with parents present, but engaged in relatively more vocalizing, neck-nosing and forepaw-clasping."
            },
            "slug": "Contact-promoting-behavior,-social-development,-and-Wilson",
            "title": {
                "fragments": [],
                "text": "Contact-promoting behavior, social development, and relationship with parents in sibling juvenile degus (Octodon degus)."
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "Observations suggested that paternal control of the young may curb juvenile interactions in captive parent-young units of the caviomorph rodent Octodon degus."
            },
            "venue": {
                "fragments": [],
                "text": "Developmental psychobiology"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2681887"
                        ],
                        "name": "D. Rumelhart",
                        "slug": "D.-Rumelhart",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Rumelhart",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Rumelhart"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695689"
                        ],
                        "name": "Geoffrey E. Hinton",
                        "slug": "Geoffrey-E.-Hinton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Hinton",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Geoffrey E. Hinton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116648700"
                        ],
                        "name": "Ronald J. Williams",
                        "slug": "Ronald-J.-Williams",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Williams",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ronald J. Williams"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 62245742,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "111fd833a4ae576cfdbb27d87d2f8fc0640af355",
            "isKey": false,
            "numCitedBy": 19355,
            "numCiting": 66,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Learning-internal-representations-by-error-Rumelhart-Hinton",
            "title": {
                "fragments": [],
                "text": "Learning internal representations by error propagation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 118,
                                "start": 105
                            }
                        ],
                        "text": "The rub is that, on the one hand, natural languages appear to belong to a more powerful class that this (Chomsky, 1957); and on the other, there is no good evidence that children receive or use negative data during learning (Brown & Hanlon, 1970; see also Pinker, 1989, for discussion of competing…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 24
                            }
                        ],
                        "text": "This subordination has grammatical consequences."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 264,
                                "start": 251
                            }
                        ],
                        "text": "…are identical the function maps to false (or 0); when the inputs are different, the function maps to true (or 1):\nInput output 10 1 01 1 00 0 11 0\nThis function cannot be learned by two-layer networks with sigmoidal activation functions, but requires at least one additional intermediate layer."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 193,
                                "start": 180
                            }
                        ],
                        "text": "…facts (and specifically, the recursive nature of embedded relative\nclauses) have led many linguists to conclude that natural language cannot be\nmodeled by a finite state grammar (Chomsky, 1957), and that statistical inference\nis not a viable mechanism for learning language (Miller & Chomsky, 1963)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Syntactic structures. The Hague: Mouton"
            },
            "venue": {
                "fragments": [],
                "text": "Syntactic structures. The Hague: Mouton"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69422244"
                        ],
                        "name": "M. R. Manzini",
                        "slug": "M.-R.-Manzini",
                        "structuredName": {
                            "firstName": "Maria",
                            "lastName": "Manzini",
                            "middleNames": [
                                "Rita"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. R. Manzini"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This problem of the apparent insufficiency of the data has been discussed in many contexts (e.g., Baker, 1979; Bowerman, 1987; Pinker, 1989; Wexler & Cullicover; 1980) but one of the simplest demonstrations comes from Gold’s (1967) work."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 80,
                                "start": 68
                            }
                        ],
                        "text": "Just how far this sort of evidence can be used has been challenged (Pinker, 1989)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 127
                            }
                        ],
                        "text": "This problem of the apparent insufficiency of the data has been discussed in many contexts (e.g., Baker, 1979; Bowerman, 1987; Pinker, 1989; Wexler & Cullicover, 1980) but one of the simplest demonstrations comes from Gold’s (1967) work."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 261,
                                "start": 249
                            }
                        ],
                        "text": "…is that, on the one hand, natural languages appear to belong to a more powerful class that this (Chomsky, 1957); and on the other, there is no good evidence that children receive or use negative data during learning (Brown & Hanlon, 1970; see also Pinker, 1989, for discussion of competing claims)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 144740316,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "dfd08585d799c7d3cc61f59f19a1fbeffc9c770c",
            "isKey": true,
            "numCitedBy": 481,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Learnability-and-Cognition-Manzini",
            "title": {
                "fragments": [],
                "text": "Learnability and Cognition"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2151306382"
                        ],
                        "name": "J. Hayes",
                        "slug": "J.-Hayes",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Hayes",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hayes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 238,
                                "start": 218
                            }
                        ],
                        "text": "…is that, on the one hand, natural languages appear to belong to a more powerful class that this (Chomsky, 1957); and on the other, there is no good evidence that children receive or use negative data during learning (Brown & Hanlon, 1970; see also Pinker, 1989, for discussion of competing claims)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 143570129,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "d4f5ea61c1c13aa29a87afb072336113f513df5e",
            "isKey": false,
            "numCitedBy": 1046,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Cognition-and-the-development-of-language-Hayes",
            "title": {
                "fragments": [],
                "text": "Cognition and the development of language"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "15448108"
                        ],
                        "name": "M. Bowerman",
                        "slug": "M.-Bowerman",
                        "structuredName": {
                            "firstName": "Melissa",
                            "lastName": "Bowerman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Bowerman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 111
                            }
                        ],
                        "text": "This work was originally motivated by an interest in studying ways in which connectionist networks might use distributed representations to encode complex, hierarchically organized information."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 125,
                                "start": 111
                            }
                        ],
                        "text": "This problem of the apparent insufficiency of the data has been discussed in many contexts (e.g., Baker, 1979; Bowerman, 1987; Pinker, 1989; Wexler & Cullicover, 1980) but one of the simplest demonstrations comes from Gold’s (1967) work."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 142969853,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "148d8aab465f45178ae1838b150c79fbb004c403",
            "isKey": false,
            "numCitedBy": 265,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-'no-negative-evidence'-problem:-How-do-children-Bowerman",
            "title": {
                "fragments": [],
                "text": "The 'no negative evidence' problem: How do children avoid constructing an overly general grammar?"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2974669"
                        ],
                        "name": "R. Nosofsky",
                        "slug": "R.-Nosofsky",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Nosofsky",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Nosofsky"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123945923,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "cb4e0f373781b4ee95d6768fc4b8e561f749361b",
            "isKey": false,
            "numCitedBy": 201,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Exemplars,-prototypes,-and-similarity-rules.-Nosofsky",
            "title": {
                "fragments": [],
                "text": "Exemplars, prototypes, and similarity rules."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3263707"
                        ],
                        "name": "J. Oberlander",
                        "slug": "J.-Oberlander",
                        "structuredName": {
                            "firstName": "Jon",
                            "lastName": "Oberlander",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Oberlander"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144301565"
                        ],
                        "name": "R. Dale",
                        "slug": "R.-Dale",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Dale",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Dale"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 63331707,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "46ed6453d067543c4a9967ecbc29fb2e9a78b129",
            "isKey": false,
            "numCitedBy": 158,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Proceedings-of-the-Thirteenth-Annual-Conference-of-Oberlander-Dale",
            "title": {
                "fragments": [],
                "text": "Proceedings of the Thirteenth Annual Conference of the Cognitive Science Society"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "104060925"
                        ],
                        "name": "R. Luce",
                        "slug": "R.-Luce",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Luce",
                            "middleNames": [
                                "Duncan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Luce"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39828682"
                        ],
                        "name": "R. R. Bush",
                        "slug": "R.-R.-Bush",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Bush",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. R. Bush"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49617962"
                        ],
                        "name": "E. Galanter",
                        "slug": "E.-Galanter",
                        "structuredName": {
                            "firstName": "Eugene",
                            "lastName": "Galanter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Galanter"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61011181,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f367bbfc016dd7162d9fb1c79fb44ef11b5c4069",
            "isKey": false,
            "numCitedBy": 2039,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Handbook-of-mathematical-psychology:-I.-Luce-Bush",
            "title": {
                "fragments": [],
                "text": "Handbook of mathematical psychology: I."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52306049"
                        ],
                        "name": "Peter M. Duppenthaler",
                        "slug": "Peter-M.-Duppenthaler",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Duppenthaler",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Peter M. Duppenthaler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 67,
                                "start": 48
                            }
                        ],
                        "text": "Newport calls this the “less is more” hypothesis (Newport, 1988, 1990)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Newport calls this the “less is more” hypothesis ( Newport, 1988, 1990 )."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 60837217,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "7917738e468a577971141664eb74fc9561206889",
            "isKey": false,
            "numCitedBy": 591,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Maturational-Constraints-on-Language-Learning-Duppenthaler",
            "title": {
                "fragments": [],
                "text": "Maturational Constraints on Language Learning"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "17023495"
                        ],
                        "name": "N. Petrilowitsch",
                        "slug": "N.-Petrilowitsch",
                        "structuredName": {
                            "firstName": "N.",
                            "lastName": "Petrilowitsch",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Petrilowitsch"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34002993,
            "fieldsOfStudy": [
                "Computer Science",
                "Medicine"
            ],
            "id": "e4a66a454bba18a56c71e303527cc26907e12290",
            "isKey": false,
            "numCitedBy": 287,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "[The-development-of-memory].-Petrilowitsch",
            "title": {
                "fragments": [],
                "text": "[The development of memory]."
            },
            "venue": {
                "fragments": [],
                "text": "Archiv fur Psychiatrie und Nervenkrankheiten, vereinigt mit Zeitschrift fur die gesamte Neurologie und Psychiatrie"
            },
            "year": 1956
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 109,
                                "start": 98
                            }
                        ],
                        "text": "This work was originally motivated by an interest in studying ways in which connectionist networks might use distributed representations to encode complex, hierarchically organized information."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 109,
                                "start": 98
                            }
                        ],
                        "text": "This problem of the apparent insufficiency of the data has been discussed in many contexts (e.g., Baker, 1979; Bowerman, 1987; Pinker, 1989; Wexler & Cullicover, 1980) but one of the simplest demonstrations comes from Gold’s (1967) work."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Syntactic theory and the projection problem"
            },
            "venue": {
                "fragments": [],
                "text": "Linguistic Inquiry"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Kotovsky (Eds.), The 21st Carnegie-Mellon symposium on cognition: Complex information processing: The impact of Herbert A"
            },
            "venue": {
                "fragments": [],
                "text": "Simon. Hillsdale, NJ: Erlbaum. Elman, J.L"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Development of visual size constancy during Elman Learning and development in neural networks -22- the first year of human infancy"
            },
            "venue": {
                "fragments": [],
                "text": "Developmental Psychology"
            },
            "year": 1980
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 62
                            }
                        ],
                        "text": "In many models of learning (e.g., Dunbar & Klahr, 1989; Lea & Simon, 1979; Osherson, Stob, & Weinstein, 1986) it seems to be assumed that the data accumulate and are available in a more or less veridical form for as long as they may be needed."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Problem solving and rule induction"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 56
                            }
                        ],
                        "text": "In many models of learning (e.g., Dunbar & Klahr, 1989; Lea & Simon, 1979; Osherson, Stob, & Weinstein, 1986) it seems to be assumed that the data accumulate and are available in a more or less veridical form for as long as they may be needed."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Problem solving and rule induction Models of Thought"
            },
            "venue": {
                "fragments": [],
                "text": "Problem solving and rule induction Models of Thought"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 0
                            }
                        ],
                        "text": "Plunkett and Marchman (1990) have shown that while the basic influences of type/token frequency and phonological predictability are similar to the condition of non-incremental learning, better overall learning is achieved when the training corpus for a connectionist model is allowed slowly to grow…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "From rote learning to system building. Center for Research in Language, TR 9020"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 0
                            }
                        ],
                        "text": "Plunkett and Marchman (1990) have shown that while the basic influences of type/token frequency and phonological predictability are similar to the condition of non-incremental learning, better overall learning is achieved when the training corpus for a connectionist model is allowed slowly to grow…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "From rote learning to system building. Center for Research"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 56
                            }
                        ],
                        "text": "In many models of learning (e.g., Dunbar & Klahr, 1989; Lea & Simon, 1979; Osherson, Stob, & Weinstein, 1986) it seems to be assumed that the data accumulate and are available in a more or less veridical form for as long as they may be needed."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Problem solving and rule induction"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 238,
                                "start": 226
                            }
                        ],
                        "text": "…is that, on the one hand, natural languages appear to belong to a more powerful class that this (Chomsky, 1957); and on the other, there is no good evidence that children receive or use negative data during learning (Brown & Hanlon, 1970; see also Pinker, 1989, for discussion of competing claims)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Derivational complexity and order of acquisition in child"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On two types of models of the internalization of grammars"
            },
            "venue": {
                "fragments": [],
                "text": "In D.I. Slobin"
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "From rote learning to system building. Center for Research in Language, TR 9020"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Learning internal representations by error"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The 21st Carnegie-Mellon symposium on cognition: Complex information processing: The impact of Herbert A"
            },
            "venue": {
                "fragments": [],
                "text": "The 21st Carnegie-Mellon symposium on cognition: Complex information processing: The impact of Herbert A"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 28,
                                "start": 0
                            }
                        ],
                        "text": "Plunkett and Marchman (1990) have shown that while the basic influences of type/token frequency and phonological predictability are similar to the condition of non-incremental learning, better overall learning is achieved when the training corpus for a connectionist model is allowed slowly to grow…"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "From rote learning to system building. Center for Research in Language"
            },
            "venue": {
                "fragments": [],
                "text": "From rote learning to system building. Center for Research in Language"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Encoding sequential structure"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Derivational complexity and order of acquisition in child speech Cognition and the development of language Syntactic structures. The Hague: Mouton"
            },
            "venue": {
                "fragments": [],
                "text": "Derivational complexity and order of acquisition in child speech Cognition and the development of language Syntactic structures. The Hague: Mouton"
            },
            "year": 1957
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On two types of models of the internalization of grammars. In D.I. Slobin (Ed.), The ontogenesis of grammar: A theoretical perspective"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Language acquisition via strange automata"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Twelffh Annual Conference of the Cognitive Science Society"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 48,
                                "start": 23
                            }
                        ],
                        "text": "In a well-known paper, Miller and Chomsky (1963) argued that certain properties of natural language make statistically based learning infeasible."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 298,
                                "start": 276
                            }
                        ],
                        "text": "…facts (and specifically, the recursive nature of embedded relative\nclauses) have led many linguists to conclude that natural language cannot be\nmodeled by a finite state grammar (Chomsky, 1957), and that statistical inference\nis not a viable mechanism for learning language (Miller & Chomsky, 1963)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 86,
                                "start": 64
                            }
                        ],
                        "text": "And although picked is a transitive verb\nwhich often takes a direct object following it, no noun appears after the verb because the direct object (the girls) has already been mentioned."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Finitary models of language users Handbook of mathematical psychology (Vol. II) Constraints on learning and their role in language acquisition: Studies of the acquisition of American Sign Language"
            },
            "venue": {
                "fragments": [],
                "text": "Language Sciences"
            },
            "year": 1963
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 238,
                                "start": 218
                            }
                        ],
                        "text": "…is that, on the one hand, natural languages appear to belong to a more powerful class that this (Chomsky, 1957); and on the other, there is no good evidence that children receive or use negative data during learning (Brown & Hanlon, 1970; see also Pinker, 1989, for discussion of competing claims)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Derivational complexity and order of acquisition in child speech"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 109,
                                "start": 98
                            }
                        ],
                        "text": "This problem of the apparent insufficiency of the data has been discussed in many contexts (e.g., Baker, 1979; Bowerman, 1987; Pinker, 1989; Wexler & Cullicover, 1980) but one of the simplest demonstrations comes from Gold’s (1967) work."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Syntactic theory and the projection probiem"
            },
            "venue": {
                "fragments": [],
                "text": "Linguistic Inquiry,"
            },
            "year": 1979
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Encoding sequential structure in simple recurrent networks"
            },
            "venue": {
                "fragments": [],
                "text": "Encoding sequential structure in simple recurrent networks"
            },
            "year": 1986
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On two types of models of the internalization of grammars The ontogenesis of grammar: A theoretical perspective"
            },
            "venue": {
                "fragments": [],
                "text": "On two types of models of the internalization of grammars The ontogenesis of grammar: A theoretical perspective"
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "On two types of models of the internalization of grammars. In D.I. Slobin (Ed.), The ontogenesis of grammar: A theoretical perspective"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 146,
                                "start": 133
                            }
                        ],
                        "text": "Allowing networks to reconfigure dynamically or acquire additional nodes has been shown to facilitate learning (Ash, 1989; Fahlman & Lebiere, 1990; Shultz & Schmidt, 1991)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The cascadecorrelation learning architecture"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 25,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 56,
        "totalPages": 6
    },
    "page_url": "https://www.semanticscholar.org/paper/Learning-and-development-in-neural-networks:-the-of-Elman/d5ddb30bf421bdfdf728b636993dc48b1e879176?sort=total-citations"
}