{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31066136"
                        ],
                        "name": "L. Tilling",
                        "slug": "L.-Tilling",
                        "structuredName": {
                            "firstName": "Laura",
                            "lastName": "Tilling",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Tilling"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121970951,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "80dcf45446bfd0bcd80a0500452063bcef753895",
            "isKey": false,
            "numCitedBy": 107,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "The graphical presentation of experimental data in the physical sciences has several advantages which today are too familiar to require very detailed enumeration. Its greatest strength lies in the clarity and succinctness with which it displays the information contained in tabulated results: for the experimenter a graph provides a rough and immediate check on the accuracy and suitability of the methods he is using, and for the reader of a scientific report it may convey in a few seconds information that could only be gleaned from a table of measurements by hours of close study. There are occasions where only the analysis of experimental graphs will provide the information we require, but usually the actual analysis of results is carried out nowadays by computational methods. The use of graphs is therefore not so much a necessary part of scientific procedure as an extremely useful one, and one that is often taken very much for granted."
            },
            "slug": "Early-Experimental-Graphs-Tilling",
            "title": {
                "fragments": [],
                "text": "Early Experimental Graphs"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The use of graphs is not so much a necessary part of scientific procedure as an extremely useful one, and one that is often taken very much for granted."
            },
            "venue": {
                "fragments": [],
                "text": "The British Journal for the History of Science"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35157864"
                        ],
                        "name": "W. Cleveland",
                        "slug": "W.-Cleveland",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Cleveland",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Cleveland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145775069"
                        ],
                        "name": "R. McGill",
                        "slug": "R.-McGill",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "McGill",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. McGill"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 119693509,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fa459de6552f5cd0cbe28539c0c7c65bc112a164",
            "isKey": false,
            "numCitedBy": 1534,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract The subject of graphical methods for data analysis and for data presentation needs a scientific foundation. In this article we take a few steps in the direction of establishing such a foundation. Our approach is based on graphical perception—the visual decoding of information encoded on graphs—and it includes both theory and experimentation to test the theory. The theory deals with a small but important piece of the whole process of graphical perception. The first part is an identification of a set of elementary perceptual tasks that are carried out when people extract quantitative information from graphs. The second part is an ordering of the tasks on the basis of how accurately people perform them. Elements of the theory are tested by experimentation in which subjects record their judgments of the quantitative information on graphs. The experiments validate these elements but also suggest that the set of elementary tasks should be expanded. The theory provides a guideline for graph construction..."
            },
            "slug": "Graphical-Perception:-Theory,-Experimentation,-and-Cleveland-McGill",
            "title": {
                "fragments": [],
                "text": "Graphical Perception: Theory, Experimentation, and Application to the Development of Graphical Methods"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The approach is based on graphical perception—the visual decoding of information encoded on graphs—and it includes both theory and experimentation to test the theory, providing a guideline for graph construction."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47856259"
                        ],
                        "name": "M. Wilk",
                        "slug": "M.-Wilk",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Wilk",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wilk"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "10721457"
                        ],
                        "name": "R. Gnanadesikan",
                        "slug": "R.-Gnanadesikan",
                        "structuredName": {
                            "firstName": "Ramanathan",
                            "lastName": "Gnanadesikan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gnanadesikan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1949931,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "753e4dc68b5e0ae9031dccd30a1760d42282c848",
            "isKey": false,
            "numCitedBy": 1214,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "SUMMARY This paper describes and discusses graphical techniques, based on the primitive empirical cumulative distribution function and on quantile (Q-Q) plots, percent (P-P) plots and hybrids of these, which are useful in assessing a one-dimensional sample, either from original data or resulting from analysis. Areas of application include: the comparison of samples; the comparison of distributions; the presentation of results on sensitivities of statistical methods; the analysis of collections of contrasts and of collections of sample variances; the assessment of multivariate contrasts;_ and the structuring of analysis of variance mean squares. Many of the objectives and techniques are illustrated by examples. This paper reviews a variety of old and new statistical techniques based on the cumulative distribution function and its ramifications. Included in the coverage are applications, for various situations and purposes, of quantile probability plots (Q-Q plots), percentage probability plots (P-P plots) and extensions and hybrids of these. The general viewpoint is that of analysis of data by statistical methods that are suggestive and constructive rather than formal procedures to be applied in the light of a tightly specified mathematical model. The technological background is taken to be current capacities in data collection and highspeed computing systems, including graphical display facilities. It is very often useful in statistical data analysis to examine and to present a body of data as though it may have originated as a one-dimensional sample, i.e. data which one wishes to treat for purposes of analysis, as an unstructured array. Sometimes this is applicable to ' original' data; even more often such a viewpoint is useful with 'derived' data, e.g. residuals from a model fitted to the data. The empirical cumulative distribution function and probability plotting methods have a key role in the statistical treatment of one-dimensional samples, being of relevance for summarization and palatable description as well as for exposure and inference."
            },
            "slug": "Probability-plotting-methods-for-the-analysis-of-Wilk-Gnanadesikan",
            "title": {
                "fragments": [],
                "text": "Probability plotting methods for the analysis of data."
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "This paper describes and discusses graphical techniques, based on the primitive empirical cumulative distribution function and on quantile (Q-Q) plots, percent (P-P) plots and hybrids of these, which are useful in assessing a one-dimensional sample, either from original data or resulting from analysis."
            },
            "venue": {
                "fragments": [],
                "text": "Biometrika"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35157864"
                        ],
                        "name": "W. Cleveland",
                        "slug": "W.-Cleveland",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Cleveland",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Cleveland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145775069"
                        ],
                        "name": "R. McGill",
                        "slug": "R.-McGill",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "McGill",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. McGill"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16342041,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "565d843c2c0e60915709268ac4224894469d82d5",
            "isKey": false,
            "numCitedBy": 553,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "Graphical perception is the visual decoding of the quantitative and qualitative information encoded on graphs. Recent investigations have uncovered basic principles of human graphical perception that have important implications for the display of data. The computer graphics revolution has stimulated the invention of many graphical methods for analyzing and presenting scientific data, such as box plots, two-tiered error bars, scatterplot smoothing, dot charts, and graphing on a log base 2 scale."
            },
            "slug": "Graphical-Perception-and-Graphical-Methods-for-Data-Cleveland-McGill",
            "title": {
                "fragments": [],
                "text": "Graphical Perception and Graphical Methods for Analyzing Scientific Data"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The computer graphics revolution has stimulated the invention of many graphical methods for analyzing and presenting scientific data, such as box plots, two-tiered error bars, scatterplot smoothing, dot charts, and graphing on a log base 2 scale."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2914641"
                        ],
                        "name": "S. Kosslyn",
                        "slug": "S.-Kosslyn",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Kosslyn",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Kosslyn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123231901,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "47329eeab7c9a3394ec3a1fb0cf1329fa9f50729",
            "isKey": false,
            "numCitedBy": 122,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract Five books on charts and graphs are reviewed from the standpoint of cognitive psychology. The review focuses on properties of the human visual information-processing system, and it considers how well the recommendations offered by each book work within the strengths and weaknesses of that system. The books reviewed are Semiology of Graphs, by J. Bertin (translated by W. J. Berg) (1983); Graphical Methods for Data Analysis, by J. M. Chambers, W. S. Cleveland, B. Kleiner, and P. A. Tukey (1983); Mapping Information, by H. T. Fisher (1982); Statistical Graphics, by C. F. Schmid (1983); and The Visual Display of Quantitative Information, by E. R. Tufte (1983)."
            },
            "slug": "Graphics-and-Human-Information-Processing:-A-Review-Kosslyn",
            "title": {
                "fragments": [],
                "text": "Graphics and Human Information Processing: A Review of Five Books"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "Five books on charts and graphs are reviewed from the standpoint of cognitive psychology, and how well the recommendations offered by each book work within the strengths and weaknesses of the human visual information-processing system is considered."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144233486"
                        ],
                        "name": "P. Bobko",
                        "slug": "P.-Bobko",
                        "structuredName": {
                            "firstName": "Philip",
                            "lastName": "Bobko",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Bobko"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "103319308"
                        ],
                        "name": "Ronald J. Karren",
                        "slug": "Ronald-J.-Karren",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Karren",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ronald J. Karren"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121161611,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "b35bd2ba05ba36e6c54ff615827f4935c5fd4cb3",
            "isKey": false,
            "numCitedBy": 40,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Perceptions about the Pearson product moment correlation, r, from bivariate scatterplots were investigated through the use of a questionnaire. It was found that subjects who are relatively sophisticated in psychometric techniques tend to underestimate the magnitude of r, with most pronounced disparity in the range .2 < |r| < .6. Additionally, estimates of r from specially designed scatterplots indicated that subjects (1) correctly estimated the effects of range restriction, (2) underestimated the effects of attenuating outliers, (3) incorrectly reduced estimates of r when the regression slope was relatively high or low, and (4) often failed to consider the effects of removing the middle third of the data. Several implications of these generally conservative estimations are discussed."
            },
            "slug": "THE-PERCEPTION-OF-PEARSON-PRODUCT-MOMENT-FROM-Bobko-Karren",
            "title": {
                "fragments": [],
                "text": "THE PERCEPTION OF PEARSON PRODUCT MOMENT CORRELATIONS FROM BIVARIATE SCATTERPLOTS"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2914641"
                        ],
                        "name": "S. Kosslyn",
                        "slug": "S.-Kosslyn",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Kosslyn",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Kosslyn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143157470,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "79aa6ec58d0c7e424258dc125aaefbd48645d6d3",
            "isKey": false,
            "numCitedBy": 468,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : Many charts and graphs do not convey information effectively. This paper develops a way of analyzing the information in charts and graphs that reveals the design flaws in the display. The analytic scheme requires isolating four types of constituents in a display, and specifying their structure and interrelations at a syntactic, semantic, and pragmatic level of analysis. As the description is constructed, one checks for violations of acceptability principles, which are derived from facts about human visual information processing and from an analysis of the nature of symbols. Violations of these principles reveal the source of potential difficulties in using a display."
            },
            "slug": "Understanding-charts-and-graphs-Kosslyn",
            "title": {
                "fragments": [],
                "text": "Understanding charts and graphs"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "A way of analyzing the information in charts and graphs that reveals the design flaws in the display that is derived from facts about human visual information processing and from an analysis of the nature of symbols."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48262167"
                        ],
                        "name": "R. Strahan",
                        "slug": "R.-Strahan",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Strahan",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Strahan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143981263"
                        ],
                        "name": "C. J. Hansen",
                        "slug": "C.-J.-Hansen",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Hansen",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. J. Hansen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 144618021,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "327f73c6c9c9c365f6c41f85a550c3a5efe063a5",
            "isKey": false,
            "numCitedBy": 32,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Eighty subjects estimated the correlation coeffi cient, r, for each of 13 computer-printed scatter plots. Making judgments were 46 students in a graduate-level statistics course and 34 faculty and graduate students in a department of psychology. The actual correlation values ranged from .010 to .995, with 200 observations in each scatterplot and with the order of scatterplot presentation ran domized. As predicted, subjects underestimated the degree of actual correlation. Also as predicted, but with substantial moderation by a method-of-presen tation factor, this underestimation was most pro nounced in the middle of the correlational range—between the 0 and 1 extremes. Though per ception of correlation was shown not to be veridical (i.e., in terms of r), little support was given one al ternative view—its being in terms of r 2."
            },
            "slug": "Underestimating-Correlation-from-Scatterplots-Strahan-Hansen",
            "title": {
                "fragments": [],
                "text": "Underestimating Correlation from Scatterplots"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40603630"
                        ],
                        "name": "David K. Simkin",
                        "slug": "David-K.-Simkin",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Simkin",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David K. Simkin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2199658"
                        ],
                        "name": "R. Hastie",
                        "slug": "R.-Hastie",
                        "structuredName": {
                            "firstName": "Reid",
                            "lastName": "Hastie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hastie"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 51783220,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "05c5960461a28f6b149c21127ebd849b32035bc3",
            "isKey": false,
            "numCitedBy": 308,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract Recent work on graph perception has focused on the nature of the processes that operate when people decode the information represented in graphs. We began our investigations by gathering evidence that people have generic expectations about what types of information will be the major messages in various types of graphs. These graph schemata suggested how graph type and judgment type would interact to determine the speed and accuracy of quantitative information extraction. These predictions were confirmed by the finding that a comparison judgment was most accurate when the judgment required assessing position along a common scale (simple bar chart), had intermediate accuracy on length judgments (divided bar chart), and was least accurate when assessing angles (pie chart). In contrast, when the judgment was an estimate of the proportion of the whole, angle assessments (pie chart) were as accurate as position (simple bar chart) and more accurate than length (divided bar chart). Proposals for elementa..."
            },
            "slug": "An-Information-Processing-Analysis-of-Graph-Simkin-Hastie",
            "title": {
                "fragments": [],
                "text": "An Information-Processing Analysis of Graph Perception"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49090682"
                        ],
                        "name": "E. Anderson",
                        "slug": "E.-Anderson",
                        "structuredName": {
                            "firstName": "Edgar",
                            "lastName": "Anderson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Anderson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 120052484,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "e7f78d62c11d9c929a0cb57b72d31506c861b614",
            "isKey": false,
            "numCitedBy": 111,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "Recognizing associations between large numbers of variables is a problem encountered in all the sciences. For this reason the Editor felt that the following article by Dr. Edgar E. Anderson, which appeared in the Proceedings of the National Academy of Sciences. Vol. 13, pp. 923–27, 1957, would be of interest to the readers of Technometrics. The article is republished with the kind permission of Dr. Anderson and of Dr. Wendell M. Stanley, the Editor of the Proceedings of the National Academy of Sciences."
            },
            "slug": "A-Semigraphical-Method-for-the-Analysis-of-Complex-Anderson",
            "title": {
                "fragments": [],
                "text": "A Semigraphical Method for the Analysis of Complex Problems"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The Editor felt that the following article by Dr. Edgar E. Anderson, which appeared in the Proceedings of the National Academy of Sciences, would be of interest to the readers of Technometrics."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1960
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35157864"
                        ],
                        "name": "W. Cleveland",
                        "slug": "W.-Cleveland",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Cleveland",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Cleveland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145775069"
                        ],
                        "name": "R. McGill",
                        "slug": "R.-McGill",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "McGill",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. McGill"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122291149,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "19599e167b4b1c853b51c7edca842cee460763e5",
            "isKey": false,
            "numCitedBy": 227,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract The scatterplot is one of our most powerful tools for data analysis. Still, we can add graphical information to scatterplots to make them considerably more powerful. These graphical additions, faces of sorts, can enhance capabilities that scatterplots already have or can add whole new capabilities that faceless scatterplots do not have at all. The additions we discuss here—some new and some old—are (a) sunflowers, (b) category codes, (c) point cloud sizings, (d) smoothings for the dependence of y on x (middle smoothings, spread smoothings, and upper and lower smoothings), and (e) smoothings for the bivariate distribution of x and y (pairs of middle smoothings, sum-difference smoothings, scale-ratio smoothings, and polar smoothings). The development of these additions is based in part on a number of graphical principles that can be applied to the development of statistical graphics in general."
            },
            "slug": "The-Many-Faces-of-a-Scatterplot-Cleveland-McGill",
            "title": {
                "fragments": [],
                "text": "The Many Faces of a Scatterplot"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The additions the authors discuss here—some new and some old—are sunflowers, category codes, point cloud sizings, and smoothings for the dependence of y on x, which are based in part on a number of graphical principles that can be applied to the development of statistical graphics in general."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35157864"
                        ],
                        "name": "W. Cleveland",
                        "slug": "W.-Cleveland",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Cleveland",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Cleveland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52552927"
                        ],
                        "name": "B. Kleiner",
                        "slug": "B.-Kleiner",
                        "structuredName": {
                            "firstName": "Beat",
                            "lastName": "Kleiner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Kleiner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122646165,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "708786351e9e512f2c710d4cba922d69ed6f1198",
            "isKey": false,
            "numCitedBy": 37,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "A graphical technique is presented which enhances the information on scatterplots by plotting three smooth cluves of movie statistics which slunmarize the change in the distribution of Y given X. The three curves involve the tue of the midmean ithe average of all observations betweell the qluxtiles), and two new statistics: the lower semi-midmean (the midmenn of all observations below the median), and the upper semi-midmean (the midmean of all observations above the mediate). The technique is used in the analysis of air pollutiou data to show that emissions of primary pollrltnnts in the Camden-Philadelphia urban complex are partly responsible for high ozone concentratiotls 37 km tO the southeast in Ancora, New Jersey, a nonluban area, where concentrations of primary pollutants are low, but where ozone daily maxima freqltently exceed the Federal Standard."
            },
            "slug": "A-Graphical-Technique-for-Enhancing-Scatterplots-Cleveland-Kleiner",
            "title": {
                "fragments": [],
                "text": "A Graphical Technique for Enhancing Scatterplots with Moving Statistics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35157864"
                        ],
                        "name": "W. Cleveland",
                        "slug": "W.-Cleveland",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Cleveland",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Cleveland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145775069"
                        ],
                        "name": "R. McGill",
                        "slug": "R.-McGill",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "McGill",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. McGill"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9328634,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "f47865ceb5432022d9c372dd9211eff6c80e13d6",
            "isKey": false,
            "numCitedBy": 146,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-Experiment-in-Graphical-Perception-Cleveland-McGill",
            "title": {
                "fragments": [],
                "text": "An Experiment in Graphical Perception"
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Man Mach. Stud."
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31432693"
                        ],
                        "name": "H. Schutz",
                        "slug": "H.-Schutz",
                        "structuredName": {
                            "firstName": "Howard",
                            "lastName": "Schutz",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Schutz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 56882964,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "cd773fa0f2ed4feb59a13af8a69a828796169d85",
            "isKey": false,
            "numCitedBy": 57,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The primary objective of this study was to determine the effect of multiple-line versus multiple-graph presentation of trend-type displays on operator performance. Four types of lines having low confusability were determined experimentally from a sample of twenty-five lines. The primary variable was single-graph, multiple-line presentation versus multiple-graph single-line presentation. Other variables included in this study were: number of lines, degree of confusion among lines, coding of lines, and two operator tasks: point-reading and comparing. It was found that for the point-reading task, either type of display is acceptable, but for the comparing task, the multiple-line display is much superior to the multiple-graph display. Moreover, the use of color coding for the graph lines tended to improve performance slightly."
            },
            "slug": "An-Evaluation-of-Methods-for-Presentation-of-III1-Schutz",
            "title": {
                "fragments": [],
                "text": "An Evaluation of Methods for Presentation of Graphic Multiple Trends—Experiment III1"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It was found that for the point-reading task, either type of display is acceptable, but for the comparing task, themultiple-line display is much superior to the multiple-graph display."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144381490"
                        ],
                        "name": "D. F. Andrews",
                        "slug": "D.-F.-Andrews",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Andrews",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. F. Andrews"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121417974,
            "fieldsOfStudy": [
                "Materials Science"
            ],
            "id": "2668b17c1c972811c5edb0b142896bbfe7d1d25a",
            "isKey": false,
            "numCitedBy": 714,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "SUMMARY A method of plotting data of more than two dimensions is proposed. Each data point, x = (xi, * , xk), is mapped into a function of the form fx(t) = xl/ v/2 + x2 sin t + x3 cos t + X4 sin 2t + x5 cos 2t + , and the function is plotted on the range - 7r < t < 7r. Some statistical properties of the method are explored. The application of the method is illustrated with an example from anthropology."
            },
            "slug": "PLOTS-OF-HIGH-DIMENSIONAL-DATA-Andrews",
            "title": {
                "fragments": [],
                "text": "PLOTS OF HIGH-DIMENSIONAL DATA"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50615402"
                        ],
                        "name": "H. Hoff",
                        "slug": "H.-Hoff",
                        "structuredName": {
                            "firstName": "Hebbel",
                            "lastName": "Hoff",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Hoff"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3260613"
                        ],
                        "name": "L. Geddes",
                        "slug": "L.-Geddes",
                        "structuredName": {
                            "firstName": "Leslie",
                            "lastName": "Geddes",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Geddes"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62185722,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "fb4145708152806cc6f59d0b172169b0f2682f5b",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "M y[AREY, the great French exponent of the graphic method wrote in his Methode Graphique,1 that \" in the field of rigorous experimentation all the sciences give a hand to each other. Whatever is the object of his studies, he who measures a force, a movement, an electrical state or a temperature, whether he is a physicist, chemist, or physiologist, must have recourse to the same method and employs the same instruments.\" The art of graphic recording does indeed owe much to mechanics, medicine and natural philosophy. Closely associated in this development, giving and taking freely from each other, all have found need for that ingenious combination of sensitive element and graphic reproducer by which a phenomenon, so to speak, writes out by itself the changes that it undergoes as time passes, in this way to lay open for study and quantitative analysis along an expanded or contracted time scale the manifold operations in man, machine and nature. Monitoring thus the complex functions in organism, enviroment and mechanism, the recording instrument provides the \" afferent limb\" of the servo-systems that make possible the automation of machine and missile and promise the instrumental homeostasis of man in the incompatible environments of the future. It has been natural to seek the sources of graphic recording where sciences have overlapped, and among those men whom we recognize for the versatility of their interest and the adaptability of their methodology. There we have found what we have outlined in this paper as the beginnings of the art; it would by no means be surprising if earlier examples were found. The development of graphic recording comprises three sections sequential in time and probably in origins: (1) the revival by Renaissance engineers not the least of whom was Leonardo da Vinci of a heritage of Greco-Roman mechanics, the hodometer of Ctesibus and Hero of Alexandria and its adaptation to graphic recording by craftsmen in the Electorate of Saxony; (2) the development of the \"weather-clock \" by Christopher Wren and Robert Hooke, and (3) the ingenious self-recording contrivances of Jacob Leupold. If to these be added the self-recording meteorological instrument of Ons-en-"
            },
            "slug": "The-Beginnings-of-Graphic-Recording-Hoff-Geddes",
            "title": {
                "fragments": [],
                "text": "The Beginnings of Graphic Recording"
            },
            "venue": {
                "fragments": [],
                "text": "Isis"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2573193"
                        ],
                        "name": "S. Lewandowsky",
                        "slug": "S.-Lewandowsky",
                        "structuredName": {
                            "firstName": "Stephan",
                            "lastName": "Lewandowsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Lewandowsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3034755"
                        ],
                        "name": "I. Spence",
                        "slug": "I.-Spence",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Spence",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Spence"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119687933,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "38c5bec7828db92e2ef403b6ba63ed74d7ee11c5",
            "isKey": false,
            "numCitedBy": 81,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract When multiple groups are shown in a scatterplot each stratum is represented by a different symbol; for example, three strata might be coded using red, green, and yellow circles. Various symbol types were compared by behavioral experiment: Subjects were fastest when strata were coded using different colors and slowest when strata were coded with confusable letters—but there were no differences in accuracy. Accuracy differed only when processing time was restricted, again with different colors and confusable letters representing the two extremes. We conclude that color is the optimal symbol type and show that measuring response latency in addition to accuracy is essential in research on graphical perception."
            },
            "slug": "Discriminating-strata-in-scatterplots-Lewandowsky-Spence",
            "title": {
                "fragments": [],
                "text": "Discriminating strata in scatterplots"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50446575"
                        ],
                        "name": "H. N. Russell",
                        "slug": "H.-N.-Russell",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Russell",
                            "middleNames": [
                                "Norris."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. N. Russell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 3984406,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "ac014b9b7f1e78744f3c5895505edb1708b208af",
            "isKey": false,
            "numCitedBy": 16,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "I. Historical INVESTIGATIONS into the nature of the stars must necessarily be very largely based upon the average characteristics of groups of stars selected in various ways—as by brightness, proper motion, and the like. The publication within the last few years of a great wealth of accumulated observational material makes the compilation of such data an easy process; but some methods of grouping appear to bring out much more definite and interesting relations than others, and, of all the principles of division, that which separates the stars according to their spectral types has revealed the most remarkable differences, and those which most stimulate attempts at a theoretical explanation."
            },
            "slug": "Relations-Between-the-Spectra-and-other-of-the-Russell",
            "title": {
                "fragments": [],
                "text": "Relations Between the Spectra and other Characteristics of the Stars"
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1914
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31432693"
                        ],
                        "name": "H. Schutz",
                        "slug": "H.-Schutz",
                        "structuredName": {
                            "firstName": "Howard",
                            "lastName": "Schutz",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Schutz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60667412,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "09f510be982ba3814a62db252c0ab8dfb63bef09",
            "isKey": false,
            "numCitedBy": 81,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "This study was designed to determine which of three types of trend formats results in superior performance for a task requiring the subject to make complex decisions. Three commonly used formats were included in the study: line type, vertical-bar type, and horizontal-bar type. Two secondary independent variables were: number of time points and amount of missing data. Results of the study indicate that preference should be given to line-type graphs, followed closely by the vertical-bar type. A secondary finding was that irrelevant points and missing data on graphic trend displays represent important factors in the degradation of operator performance."
            },
            "slug": "An-Evaluation-of-Formats-for-Graphic-Trend-II1-Schutz",
            "title": {
                "fragments": [],
                "text": "An Evaluation of Formats for Graphic Trend Displays—Experiment II1"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Results of the study indicate that preference should be given to line-type graphs, followed closely by the vertical-bar type, while irrelevant points and missing data on graphic trend displays represent important factors in the degradation of operator performance."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "10185768"
                        ],
                        "name": "H. Wainer",
                        "slug": "H.-Wainer",
                        "structuredName": {
                            "firstName": "Howard",
                            "lastName": "Wainer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wainer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31838989"
                        ],
                        "name": "D. Thissen",
                        "slug": "D.-Thissen",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Thissen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Thissen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 121159359,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "2f5664f34ead074a6a6468c0bd61ceebd6b6df51",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "A class of naive estimators of correlation was tested for robustness, accuracy, and efficiency against Pearson's r, Tukey's rt , and Spearman's ro . It was found that this class of estimators seems in some respects to be superior being less affected by outliers, reasonably efficient, and frequently more easily calculated. The definition and details of the use of these naive estimators are the subject of this paper."
            },
            "slug": "On-the-Robustness-of-a-Class-of-Naive-Estimators-Wainer-Thissen",
            "title": {
                "fragments": [],
                "text": "On the Robustness of a Class of Naive Estimators"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102278867"
                        ],
                        "name": "B. Flury",
                        "slug": "B.-Flury",
                        "structuredName": {
                            "firstName": "Bernhard",
                            "lastName": "Flury",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Flury"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "13206729"
                        ],
                        "name": "H. Riedwyl",
                        "slug": "H.-Riedwyl",
                        "structuredName": {
                            "firstName": "Hansjörg",
                            "lastName": "Riedwyl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Riedwyl"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122053279,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dec1aca00f4daec77b11dc4c39ed74f5742983b3",
            "isKey": false,
            "numCitedBy": 108,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract Proceeding from the idea of Chernoff (1971, 1973) of representing multivariate data by faces, a new face is proposed in which the face parameters of the left and the right side can be varied separately. The new face can be applied in the same way as the usual Chernoff face (with 36 instead of 18 representable variables). Special applications of the new face are the representation of multivariate paired comparison and the visual search for outliers. Several examples illustrate these applications. Compared with Chernoff's face, the new construction is more realistic, degenerates less, and avoids as much as possible mutual influences of the different face parameters."
            },
            "slug": "Graphical-Representation-of-Multivariate-Data-by-of-Flury-Riedwyl",
            "title": {
                "fragments": [],
                "text": "Graphical Representation of Multivariate Data by Means of Asymmetrical Faces"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "A new face is proposed in which the face parameters of the left and the right side can be varied separately, which is more realistic, degenerates less, and avoids as much as possible mutual influences of the different face parameters."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3790347"
                        ],
                        "name": "R. Milroy",
                        "slug": "R.-Milroy",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Milroy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Milroy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3628979"
                        ],
                        "name": "E. Poulton",
                        "slug": "E.-Poulton",
                        "structuredName": {
                            "firstName": "E.",
                            "lastName": "Poulton",
                            "middleNames": [
                                "Christopher"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Poulton"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120519298,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1de1fab8fb56a714afa60d8c8ec42a114ff16c7e",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract Three methods of labelling graphs were compared: 1. direct labelling on the functions 2. a key inserted on the graph field below the functions 3. a key inserted below the figure in the position of the figure caption. In both a separate-groups comparison and in a subsequent within-subjects comparison, direct labelling gave reliably the quickest readings (p < 0·01) without loss of accuracy. Reading the labels directly appeared to involve fewer steps and depend less upon short-term memory."
            },
            "slug": "Labelling-Graphs-for-Improved-Reading-Speed-Milroy-Poulton",
            "title": {
                "fragments": [],
                "text": "Labelling Graphs for Improved Reading Speed"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "In both a separate-groups comparison and in a subsequent within-subjects comparison, direct labelling gave reliably the quickest readings (p < 0·01) without loss of accuracy."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5875328"
                        ],
                        "name": "I. Rock",
                        "slug": "I.-Rock",
                        "structuredName": {
                            "firstName": "Irvin",
                            "lastName": "Rock",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Rock"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "21400678"
                        ],
                        "name": "F. Halper",
                        "slug": "F.-Halper",
                        "structuredName": {
                            "firstName": "Fred",
                            "lastName": "Halper",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Halper"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "117089182"
                        ],
                        "name": "Terrence Clayton",
                        "slug": "Terrence-Clayton",
                        "structuredName": {
                            "firstName": "Terrence",
                            "lastName": "Clayton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Terrence Clayton"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143357841,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "3fe7bdb883ca1b5e9882bd78ace28fe172e81883",
            "isKey": false,
            "numCitedBy": 76,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-perception-and-recognition-of-complex-figures-Rock-Halper",
            "title": {
                "fragments": [],
                "text": "The perception and recognition of complex figures"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52552927"
                        ],
                        "name": "B. Kleiner",
                        "slug": "B.-Kleiner",
                        "structuredName": {
                            "firstName": "Beat",
                            "lastName": "Kleiner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Kleiner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144959271"
                        ],
                        "name": "J. Hartigan",
                        "slug": "J.-Hartigan",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Hartigan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hartigan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120113953,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7a23ad19ae1f551d6725fdf2283c643a727f4e33",
            "isKey": false,
            "numCitedBy": 154,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract A number of points in k dimensions are displayed by associating with each point a symbol: a drawing of a tree or a castle. All symbols have the same structure derived from a hierarchical clustering algorithm applied to the k variables (dimensions) over all points, but their parts are coded according to the coordinates of each individual point. Trees and castles show general size effects, the change of whole clusters of variables from point to point, trends, and outliers. They are especially appropriate for evaluating the clustering of variables and for observing clusters of points. Their major advantage over earlier attempts to represent multivariate observations (such as profiles, stars, faces, boxes, and Andrews's curves) lies in their matching of relationships between variables to relationships between features of the representing symbol. Several examples are given, including one with 48 variables."
            },
            "slug": "Representing-Points-in-Many-Dimensions-by-Trees-and-Kleiner-Hartigan",
            "title": {
                "fragments": [],
                "text": "Representing Points in Many Dimensions by Trees and Castles"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Trees and castles show general size effects, the change of whole clusters of variables from point to point, trends, and outliers, and are especially appropriate for evaluating the clustering of variables and for observing clusters of points."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723792"
                        ],
                        "name": "R. Jacob",
                        "slug": "R.-Jacob",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Jacob",
                            "middleNames": [
                                "J.",
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Jacob"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1714701"
                        ],
                        "name": "H. Egeth",
                        "slug": "H.-Egeth",
                        "structuredName": {
                            "firstName": "Howard",
                            "lastName": "Egeth",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Egeth"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61567616,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "1e49e945548cb36f082f7d43a28b189361851bfe",
            "isKey": false,
            "numCitedBy": 80,
            "numCiting": 24,
            "paperAbstract": {
                "fragments": [],
                "text": "Computer-generated schematic faces have been proposed as a potentially useful medium for communicating complex data. Two experiments were performed to examine faces in this regard. In the first experiment, subjects performed a clustering task in a nine-dimensional Euclidean space. Subjects performed significantly and substantially better when the points in the nine-space were represented by faces than when they were represented in either of two alternate ways. In the second experiment, subjects performed a paired-associate learning task with faces and with a variety of other stimuli of three different dimensionalities. While faces were found to result in generally superior performance, a number of other interesting effects were also observed."
            },
            "slug": "The-Face-as-a-Data-Display-Jacob-Egeth",
            "title": {
                "fragments": [],
                "text": "The Face as a Data Display"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "Computer-generated schematic faces have been proposed as a potentially useful medium for communicating complex data and found to result in generally superior performance."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "80097861"
                        ],
                        "name": "L. Standing",
                        "slug": "L.-Standing",
                        "structuredName": {
                            "firstName": "Lionel",
                            "lastName": "Standing",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Standing"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116261674"
                        ],
                        "name": "Jerry Conezio",
                        "slug": "Jerry-Conezio",
                        "structuredName": {
                            "firstName": "Jerry",
                            "lastName": "Conezio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jerry Conezio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1856724"
                        ],
                        "name": "R. Haber",
                        "slug": "R.-Haber",
                        "structuredName": {
                            "firstName": "Ralph",
                            "lastName": "Haber",
                            "middleNames": [
                                "Norman"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haber"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 144123794,
            "fieldsOfStudy": [
                "Psychology",
                "Biology"
            ],
            "id": "671a8dda6e02e37882dac90b222951a9bdb932db",
            "isKey": false,
            "numCitedBy": 662,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Ss were shown 2,560 photographic Stimuli for 10 sec each; their recognition memory was then tested, using a two-alternative forced-choice task. Performance exceeded 90%, indicating retention of over 2,000 items, even when up to 3 days elapsed between learning and testing. Variants of the experiment showed that the presentation time could be reduced to 1 sec per picture without seriously affecting performance; also, that the stimuli could be reversed in orientation in the test situation without impairing recognition performance appreciably. The orientation of the stimuli could also be learned, although not as well as the identity of the pictures. These results indicate the vast memory for pictures possessed by human beings and emphasize the need to determine mechanisms by which this is accomplished."
            },
            "slug": "Perception-and-memory-for-pictures:-Single-trial-of-Standing-Conezio",
            "title": {
                "fragments": [],
                "text": "Perception and memory for pictures: Single-trial learning of 2500 visual stimuli"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "The results of the experiment indicate the vast memory for pictures possessed by human beings and emphasize the need to determine mechanisms by which this is accomplished."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "71610551"
                        ],
                        "name": "J. N. Washburne",
                        "slug": "J.-N.-Washburne",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Washburne",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. N. Washburne"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 144604954,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "966896e49d58b3726f0cb536f7e979df4aa2885d",
            "isKey": false,
            "numCitedBy": 121,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Further consideration of the various graphic, tabular, and textual methods of presenting material introduced in the previous issue of this journal (see 02:258) is given. Matters such as the relation between the simplicity of the visual pattern and the specificity of the impression upon the observer,"
            },
            "slug": "An-experimental-study-of-various-graphic,-tabular,-Washburne",
            "title": {
                "fragments": [],
                "text": "An experimental study of various graphic, tabular, and textual methods of presenting quantitative material"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1927
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2706323"
                        ],
                        "name": "H. Chernoff",
                        "slug": "H.-Chernoff",
                        "structuredName": {
                            "firstName": "Herman",
                            "lastName": "Chernoff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Chernoff"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 121905989,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6d4ad944f76e5eb48ddb4fb87c26ad18e99800d3",
            "isKey": false,
            "numCitedBy": 1399,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract A novel method of representing multivariate data is presented. Each point in k-dimensional space, k≤18, is represented by a cartoon of a face whose features, such as length of nose and curvature of mouth, correspond to components of the point. Thus every multivariate observation is visualized as a computer-drawn face. This presentation makes it easy for the human mind to grasp many of the essential regularities and irregularities present in the data. Other graphical representations are described briefly."
            },
            "slug": "The-Use-of-Faces-to-Represent-Points-in-k-Space-Chernoff",
            "title": {
                "fragments": [],
                "text": "The Use of Faces to Represent Points in k- Dimensional Space Graphically"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Every multivariate observation is visualized as a computer-drawn face that makes it easy for the human mind to grasp many of the essential regularities and irregularities present in the data."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2137198"
                        ],
                        "name": "R. Shepard",
                        "slug": "R.-Shepard",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Shepard",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Shepard"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143654248,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "324ccd3eacd4680acac33024015c647ce131b78d",
            "isKey": false,
            "numCitedBy": 1550,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Recognition-memory-for-words,-sentences,-and-Shepard",
            "title": {
                "fragments": [],
                "text": "Recognition memory for words, sentences, and pictures"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35157864"
                        ],
                        "name": "W. Cleveland",
                        "slug": "W.-Cleveland",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Cleveland",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Cleveland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2796350"
                        ],
                        "name": "P. Diaconis",
                        "slug": "P.-Diaconis",
                        "structuredName": {
                            "firstName": "Persi",
                            "lastName": "Diaconis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Diaconis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145775069"
                        ],
                        "name": "R. McGill",
                        "slug": "R.-McGill",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "McGill",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. McGill"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 443483,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "ffb9ad67fc6a13a744baf27e3248e3829934c2b5",
            "isKey": false,
            "numCitedBy": 144,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Judged association between two variables represented on scatterplots increased when the scales on the horizontal and vertical axes were simultaneously increased so that the size of the point cloud within the frame of the plot decreased. Judged association was very different from the correlation coefficient, r, which is the most widely used measure of association."
            },
            "slug": "Variables-on-Scatterplots-Look-More-Highly-When-the-Cleveland-Diaconis",
            "title": {
                "fragments": [],
                "text": "Variables on Scatterplots Look More Highly Correlated When the Scales Are Increased"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Judged association between two variables represented on scatterplots increased when the scales on the horizontal and vertical axes were simultaneously increased so that the size of the point cloud within the frame of the plot decreased."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8498970"
                        ],
                        "name": "W. Bevan",
                        "slug": "W.-Bevan",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Bevan",
                            "middleNames": [
                                "Latham"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Bevan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1697794"
                        ],
                        "name": "J. Steger",
                        "slug": "J.-Steger",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Steger",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Steger"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46510616,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "d13812d11c0f3eb878549b7e4563f75d8182167b",
            "isKey": false,
            "numCitedBy": 39,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The relation of abstractness of stimuli to efficiency of free recall was studied in college and fourth-grade students. Groups were shown a sequence of objects, pictures, and object names and were asked to recall what they had seen. Recall tests were conducted either immediately after presentation of the stimulus-sequence, after 24 hours, or after 1 week. Objects were recalled more frequently than pictures, and pictures more frequently than words. Adults performed better than children, except in the case of objects."
            },
            "slug": "Free-Recall-and-Abstractness-of-Stimuli-Bevan-Steger",
            "title": {
                "fragments": [],
                "text": "Free Recall and Abstractness of Stimuli"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "The relation of abstractness of stimuli to efficiency of free recall was studied in college and fourth-grade students, and adults performed better than children, except in the case of objects."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "10675153"
                        ],
                        "name": "K. A. Wollen",
                        "slug": "K.-A.-Wollen",
                        "structuredName": {
                            "firstName": "Keith",
                            "lastName": "Wollen",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. A. Wollen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2068133867"
                        ],
                        "name": "A. Weber",
                        "slug": "A.-Weber",
                        "structuredName": {
                            "firstName": "A",
                            "lastName": "Weber",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Weber"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "115507459"
                        ],
                        "name": "D. H. Lowry",
                        "slug": "D.-H.-Lowry",
                        "structuredName": {
                            "firstName": "Douglas",
                            "lastName": "Lowry",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. H. Lowry"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 146737422,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "4f86b3a0481c3cb65eb742d7099c419734a94256",
            "isKey": false,
            "numCitedBy": 157,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Bizarreness-versus-interaction-of-mental-images-as-Wollen-Weber",
            "title": {
                "fragments": [],
                "text": "Bizarreness versus interaction of mental images as determinants of learning"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1972
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50502605"
                        ],
                        "name": "A. Ehrenberg",
                        "slug": "A.-Ehrenberg",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Ehrenberg",
                            "middleNames": [
                                "S.",
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Ehrenberg"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 61304590,
            "fieldsOfStudy": [
                "Materials Science"
            ],
            "id": "85f46e94546c1d3d9b1b1bbe43989d686bec3763",
            "isKey": false,
            "numCitedBy": 141,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "SUMMARY Many tables of data are badly presented. It is as if their producers either did not know what the data were saying or were not letting on. Some precepts for improved data presentation are discussed."
            },
            "slug": "Rudiments-of-Numeracy-Ehrenberg",
            "title": {
                "fragments": [],
                "text": "Rudiments of Numeracy"
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "Many tables of data are badly presented, as if their producers either did not know what the data were saying or were not letting on."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2473524"
                        ],
                        "name": "A. Paivio",
                        "slug": "A.-Paivio",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Paivio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Paivio"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143960204,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "2166266c633fd59e5e0bfb605a2c138ae9f1e985",
            "isKey": false,
            "numCitedBy": 60,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Spacing-of-repetitions-in-the-incidental-and-free-Paivio",
            "title": {
                "fragments": [],
                "text": "Spacing of repetitions in the incidental and intentional free recall of pictures and words"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48897539"
                        ],
                        "name": "P. J. Huber",
                        "slug": "P.-J.-Huber",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Huber",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. J. Huber"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121974419,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "bd6bbec15859dadf5c87379295191e04becb62e8",
            "isKey": false,
            "numCitedBy": 49,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract This article is a brief, subjective account of my experiences with various implementations and uses of three-dimensional scatterplots."
            },
            "slug": "Experiences-with-Three-Dimensional-Scatterplots-Huber",
            "title": {
                "fragments": [],
                "text": "Experiences with Three-Dimensional Scatterplots"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "This article is a brief, subjective account of my experiences with various implementations and uses of three-dimensional scatterplots."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "90825947"
                        ],
                        "name": "R. J. Pike",
                        "slug": "R.-J.-Pike",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Pike",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. J. Pike"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 128535184,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "7fdebcc3701cffb9eebc7e464257949a9b9d9350",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Craters-on-Earth,-Moon,-and-Mars:-Multivariate-and-Pike",
            "title": {
                "fragments": [],
                "text": "Craters on Earth, Moon, and Mars: Multivariate classification and mode of origin"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50446575"
                        ],
                        "name": "H. N. Russell",
                        "slug": "H.-N.-Russell",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Russell",
                            "middleNames": [
                                "Norris."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. N. Russell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 209937486,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "227c3902819913ada8a14099bd0ddc106c6cb749",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "\"Giant\"-and-\"dwarf\"-stars-Russell",
            "title": {
                "fragments": [],
                "text": "\"Giant\" and \"dwarf\" stars"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1913
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "corpusId": 146277830,
            "fieldsOfStudy": [],
            "id": "1f22f965c0fdf42fc5979f95ac08027131a391cd",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Graphical Data Analysis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52347950"
                        ],
                        "name": "F. E. Croxton",
                        "slug": "F.-E.-Croxton",
                        "structuredName": {
                            "firstName": "Frederick",
                            "lastName": "Croxton",
                            "middleNames": [
                                "Emory"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. E. Croxton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "103366838"
                        ],
                        "name": "R. E. Stryker",
                        "slug": "R.-E.-Stryker",
                        "structuredName": {
                            "firstName": "Roy",
                            "lastName": "Stryker",
                            "middleNames": [
                                "Emerson"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. E. Stryker"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 124161540,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "29c1c58a63fc08139f5c01d97f9518f8bad007d3",
            "isKey": false,
            "numCitedBy": 68,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Bar-Charts-versus-Circle-Diagrams-Croxton-Stryker",
            "title": {
                "fragments": [],
                "text": "Bar Charts versus Circle Diagrams"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1927
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72024354"
                        ],
                        "name": "W. C. Eells",
                        "slug": "W.-C.-Eells",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Eells",
                            "middleNames": [
                                "Crosby"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. C. Eells"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121803350,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ede67e199f7d580dd341fc61da567fd80e5a524c",
            "isKey": false,
            "numCitedBy": 89,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Relative-Merits-of-Circles-and-Bars-for-Parts-Eells",
            "title": {
                "fragments": [],
                "text": "The Relative Merits of Circles and Bars for Representing Component Parts"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1926
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49203131"
                        ],
                        "name": "W. Baade",
                        "slug": "W.-Baade",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Baade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Baade"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122215430,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "cf31578c6e5871c5bca1245d09f449535334e4dc",
            "isKey": false,
            "numCitedBy": 245,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Resolution-of-Messier-32,-NGC-205,-and-the-of-Baade",
            "title": {
                "fragments": [],
                "text": "The Resolution of Messier 32, NGC 205, and the Central Region of the Andromeda Nebula"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1944
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72486601"
                        ],
                        "name": "M. Shields",
                        "slug": "M.-Shields",
                        "structuredName": {
                            "firstName": "Margaret",
                            "lastName": "Shields",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Shields"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120017136,
            "fieldsOfStudy": [
                "History"
            ],
            "id": "345f101499af450fbac7b0759a9934507dca8817",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Early-History-of-Graphs-in-Physical-Literature-Shields",
            "title": {
                "fragments": [],
                "text": "The Early History of Graphs in Physical Literature"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1937
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52347950"
                        ],
                        "name": "F. E. Croxton",
                        "slug": "F.-E.-Croxton",
                        "structuredName": {
                            "firstName": "Frederick",
                            "lastName": "Croxton",
                            "middleNames": [
                                "Emory"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. E. Croxton"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119767267,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "b1d5effe91f73c94d45425fe70deb7bf9b84d90d",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "II-Some-Additional-Data-Croxton",
            "title": {
                "fragments": [],
                "text": "II Some Additional Data"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1927
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2473524"
                        ],
                        "name": "A. Paivio",
                        "slug": "A.-Paivio",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Paivio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Paivio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2407957"
                        ],
                        "name": "J. Yuille",
                        "slug": "J.-Yuille",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Yuille",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Yuille"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145979818"
                        ],
                        "name": "S. Madigan",
                        "slug": "S.-Madigan",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Madigan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Madigan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38612502,
            "fieldsOfStudy": [
                "Psychology",
                "Medicine"
            ],
            "id": "3591fbd05e9f8fc8cbdbcf9d67eaf1e3f1ee4bfb",
            "isKey": false,
            "numCitedBy": 2717,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Concreteness,-imagery,-and-meaningfulness-values-Paivio-Yuille",
            "title": {
                "fragments": [],
                "text": "Concreteness, imagery, and meaningfulness values for 925 nouns."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of experimental psychology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1792758"
                        ],
                        "name": "J. Siegel",
                        "slug": "J.-Siegel",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Siegel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Siegel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "67143390"
                        ],
                        "name": "R. Goldwyn",
                        "slug": "R.-Goldwyn",
                        "structuredName": {
                            "firstName": "Roger",
                            "lastName": "Goldwyn",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Goldwyn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50046248"
                        ],
                        "name": "H. P. Friedman",
                        "slug": "H.-P.-Friedman",
                        "structuredName": {
                            "firstName": "Herman",
                            "lastName": "Friedman",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. P. Friedman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28283867,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "354e5e493e77fc4735625f3f1f3eb0108c2367a7",
            "isKey": false,
            "numCitedBy": 81,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Pattern-and-process-in-the-evolution-of-human-Siegel-Goldwyn",
            "title": {
                "fragments": [],
                "text": "Pattern and process in the evolution of human septic shock."
            },
            "venue": {
                "fragments": [],
                "text": "Surgery"
            },
            "year": 1971
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 45,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/The-Perception-of-Statistical-Graphs-Lewandowsky-Spence/5789805c6885deea09ee917214d9273c9d8fb93e?sort=total-citations"
}