{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34679741"
                        ],
                        "name": "S. Li",
                        "slug": "S.-Li",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Li"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 141,
                                "start": 137
                            }
                        ],
                        "text": "In this work we used the pseudolikelihood formulation due to its simplicity and consistency of the estimates for the large lattice limit [15]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 78,
                                "start": 74
                            }
                        ],
                        "text": "Other discontinuity models have also been proposed for adaptive smoothing [15], but all of them are independent of the observed data."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 160,
                                "start": 156
                            }
                        ],
                        "text": "For the isotropic, homogeneous Ising model, the interaction potential is given as I = βxixj , which penalizes every dissimilar pair of labels by the cost β [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 220,
                                "start": 216
                            }
                        ],
                        "text": "However, in the MRF framework, the parameters of the class generative models, p(yi|xi) and the parameters of the prior random field on labels, P (x) are generally assumed to be independent and are learned separately [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 203,
                                "start": 199
                            }
                        ],
                        "text": "Markov Random Field (MRF) models have been used extensively for various segmentation and labeling applications in vision, which allow one to incorporate contextual constraints in a principled manner [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 62,
                                "start": 58
                            }
                        ],
                        "text": "mean-field or pseudolikelihood to estimate the parameters [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 43
                            }
                        ],
                        "text": "Now, using the Hammersley Clifford theorem [15] and assuming only up to pairwise clique potentials to be nonzero, the joint distribution over the labels x given the observations y can be written as,"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 12779752,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b9701ad65e256bd8841c4f80ced09b4ca1d5e331",
            "isKey": true,
            "numCitedBy": 1422,
            "numCiting": 417,
            "paperAbstract": {
                "fragments": [],
                "text": "Markov random field (MRF) theory provides a basis for modeling contextual constraints in visual processing and interpretation. It enables systematic development of optimal vision algorithms when used with optimization principles. This detailed and thoroughly enhanced third edition presents a comprehensive study / reference to theories, methodologies and recent developments in solving computer vision problems based on MRFs, statistics and optimisation. It treats various problems in low- and high-level computational vision in a systematic and unified way within the MAP-MRF framework. Among the main issues covered are: how to use MRFs to encode contextual constraints that are indispensable to image understanding; how to derive the objective function for the optimal solution to a problem; and how to design computational algorithms for finding an optimal solution. Easy-to-follow and coherent, the revised edition is accessible, includes the most recent advances, and has new and expanded sections on such topics as: Discriminative Random Fields (DRF) Strong Random Fields (SRF) Spatial-Temporal Models Total Variation Models Learning MRF for Classification (motivation + DRF) Relation to Graphic Models Graph Cuts Belief Propagation Features: Focuses on the application of Markov random fields to computer vision problems, such as image restoration and edge detection in the low-level domain, and object matching and recognition in the high-level domain Presents various vision models in a unified framework, including image restoration and reconstruction, edge and region segmentation, texture, stereo and motion, object matching and recognition, and pose estimation Uses a variety of examples to illustrate how to convert a specific vision problem involving uncertainties and constraints into essentially an optimization problem under the MRF setting Introduces readers to the basic concepts, important models and various special classes of MRFs on the regular image lattice and MRFs on relational graphs derived from images Examines the problems of parameter estimation and function optimization Includes an extensive list of references This broad-ranging and comprehensive volume is an excellent reference for researchers working in computer vision, image processing, statistical pattern recognition and applications of MRFs. It has been class-tested and is suitable as a textbook for advanced courses relating to these areas."
            },
            "slug": "Markov-Random-Field-Modeling-in-Image-Analysis-Li",
            "title": {
                "fragments": [],
                "text": "Markov Random Field Modeling in Image Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This detailed and thoroughly enhanced third edition presents a comprehensive study / reference to theories, methodologies and recent developments in solving computer vision problems based on MRFs, statistics and optimisation."
            },
            "venue": {
                "fragments": [],
                "text": "Computer Science Workbench"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691559"
                        ],
                        "name": "W. Pieczynski",
                        "slug": "W.-Pieczynski",
                        "structuredName": {
                            "firstName": "Wojciech",
                            "lastName": "Pieczynski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Pieczynski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2079639749"
                        ],
                        "name": "A. Tebbache",
                        "slug": "A.-Tebbache",
                        "structuredName": {
                            "firstName": "Abdel-Nasser",
                            "lastName": "Tebbache",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Tebbache"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 52,
                                "start": 48
                            }
                        ],
                        "text": "However, as noted by several researchers [2][13][18][20], this assumption is too restrictive for several applications in vision."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 43
                            }
                        ],
                        "text": "A novel pairwise MRF model is suggested in [18] to avoid the problem of explicit modeling of the likelihood, p(y|x)."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 15360746,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "883cf20ed61f442a09b0c61651f38fd2b1486597",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "The use of random fields, which allows one to take into account the spatial interaction among random variables in complex systems, is a frequent tool in numerous problems of statistical image processing, like segmentation or edge detection. In statistical image segmentation, the model is generally defined by the probability distribution of the class field, which is assumed to be a Markov field, and the probability distributions of the observations field conditional to the class field. In such models the segmentation of textured images is difficult to perform and one has to resort to some model approximations. The originality of our contribution is to consider the Markovianity of the pair (class field observations field). We obtain a different model; in particular, the class field is not necessarily a Markov field. The model proposed makes possible the use of Bayesian methods like MPM or MAP to segment textured images with no model approximations. In addition, the textured images can be corrupted with correlated noise. Some first simulations to validate the model proposed are also presented."
            },
            "slug": "Pairwise-Markov-random-fields-and-its-application-Pieczynski-Tebbache",
            "title": {
                "fragments": [],
                "text": "Pairwise Markov random fields and its application in textured images segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A different model is obtained that makes possible the use of Bayesian methods like MPM or MAP to segment textured images with no model approximations, and the class field is not necessarily a Markov field."
            },
            "venue": {
                "fragments": [],
                "text": "4th IEEE Southwest Symposium on Image Analysis and Interpretation"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2073512573"
                        ],
                        "name": "Y. D. Rubinstein",
                        "slug": "Y.-D.-Rubinstein",
                        "structuredName": {
                            "firstName": "Y.",
                            "lastName": "Rubinstein",
                            "middleNames": [
                                "Dan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. D. Rubinstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784682"
                        ],
                        "name": "T. Hastie",
                        "slug": "T.-Hastie",
                        "structuredName": {
                            "firstName": "Trevor",
                            "lastName": "Hastie",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Hastie"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 105,
                                "start": 101
                            }
                        ],
                        "text": "Moreover, learning the class density models may become even harder when the training data is limited [19]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 790100,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "54b6f287c1dc7018d6acef5a8df3bcf719112426",
            "isKey": false,
            "numCitedBy": 220,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "The goal of pattern classification can be approached from two points of view: informative - where the classifier learns the class densities, or discriminative - where the focus is on learning the class boundaries without regard to the underlying class densities. We review and synthesize the tradeoffs between these two approaches for simple classifiers, and extend the results to modern techniques such as Naive Bayes and Generalized Additive Models. Data mining applications often operate in the domain of high dimensional features where the tradeoffs between informative and discriminative classifiers are especially relevant. Experimental results are provided for simulated and real data."
            },
            "slug": "Discriminative-vs-Informative-Learning-Rubinstein-Hastie",
            "title": {
                "fragments": [],
                "text": "Discriminative vs Informative Learning"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The tradeoffs between informative and discriminative classifiers for simple classifiers are reviewed and synthesized, and the results are extended to modern techniques such as Naive Bayes and Generalized Additive Models."
            },
            "venue": {
                "fragments": [],
                "text": "KDD"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1739581"
                        ],
                        "name": "J. Lafferty",
                        "slug": "J.-Lafferty",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Lafferty",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lafferty"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143753639"
                        ],
                        "name": "A. McCallum",
                        "slug": "A.-McCallum",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "McCallum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. McCallum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113414328"
                        ],
                        "name": "Fernando Pereira",
                        "slug": "Fernando-Pereira",
                        "structuredName": {
                            "firstName": "Fernando",
                            "lastName": "Pereira",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fernando Pereira"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 108,
                                "start": 104
                            }
                        ],
                        "text": "CRFs have been shown to outperform the traditional Hidden Markov Model based labeling of text sequences [14]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[14] modeled the association and the interaction potentials as linear combinations of a predefined set of features from text sequences."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[14] in the context of segmentation and labeling of the 1-D text sequences."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 219683473,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f4ba954b0412773d047dc41231c733de0c1f4926",
            "isKey": true,
            "numCitedBy": 13406,
            "numCiting": 75,
            "paperAbstract": {
                "fragments": [],
                "text": "We present conditional random fields , a framework for building probabilistic models to segment and label sequence data. Conditional random fields offer several advantages over hidden Markov models and stochastic grammars for such tasks, including the ability to relax strong independence assumptions made in those models. Conditional random fields also avoid a fundamental limitation of maximum entropy Markov models (MEMMs) and other discriminative Markov models based on directed graphical models, which can be biased towards states with few successor states. We present iterative parameter estimation algorithms for conditional random fields and compare the performance of the resulting models to HMMs and MEMMs on synthetic and natural-language data."
            },
            "slug": "Conditional-Random-Fields:-Probabilistic-Models-for-Lafferty-McCallum",
            "title": {
                "fragments": [],
                "text": "Conditional Random Fields: Probabilistic Models for Segmenting and Labeling Sequence Data"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This work presents iterative parameter estimation algorithms for conditional random fields and compares the performance of the resulting models to HMMs and MEMMs on synthetic and natural-language data."
            },
            "venue": {
                "fragments": [],
                "text": "ICML"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1812337"
                        ],
                        "name": "X. Feng",
                        "slug": "X.-Feng",
                        "structuredName": {
                            "firstName": "Xiaojuan",
                            "lastName": "Feng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Feng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145715698"
                        ],
                        "name": "Christopher K. I. Williams",
                        "slug": "Christopher-K.-I.-Williams",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Williams",
                            "middleNames": [
                                "K.",
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christopher K. I. Williams"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2410998"
                        ],
                        "name": "Stephen N. Felderhof",
                        "slug": "Stephen-N.-Felderhof",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Felderhof",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Stephen N. Felderhof"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 15,
                                "start": 12
                            }
                        ],
                        "text": "As noted in [4], a potential advantage of using the discriminative approach is that the true underlying generative model may be quite complex even though the class posterior is simple."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 29,
                                "start": 26
                            }
                        ],
                        "text": "p(y|x) = ∏i∈S p(yi|xi) [1][4][15][22]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[4] used the scaled likelihoods to approximate the actual likelihoods at each site required by the generative formulation."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 29630905,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "05caa78856d6723b2b3ad3f1213bd2caad0c870a",
            "isKey": false,
            "numCitedBy": 106,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "We are concerned with the problem of image segmentation, in which each pixel is assigned to one of a predefined finite number of labels. In Bayesian image analysis, this requires fusing together local predictions for the class labels with a prior model of label images. Following the work of Bouman and Shapiro (1994), we consider the use of tree-structured belief networks (TSBNs) as prior models. The parameters in the TSBN are trained using a maximum-likelihood objective function with the EM algorithm and the resulting model is evaluated by calculating how efficiently it codes label images. A number of authors have used Gaussian mixture models to connect the label field to the image data. We compare this approach to the scaled-likelihood method of Smyth (1994) and Morgan and Bourlard (1995), where local predictions of pixel classification from neural networks are fused with the TSBN prior. Our results show a higher performance is obtained with the neural networks. We evaluate the classification results obtained and emphasize not only the maximum a posteriori segmentation, but also the uncertainty, as evidenced e.g., by the pixelwise posterior marginal entropies. We also investigate the use of conditional maximum-likelihood training for the TSBN and find that this gives rise to improved classification performance over the ML-trained TSBN."
            },
            "slug": "Combining-Belief-Networks-and-Neural-Networks-for-Feng-Williams",
            "title": {
                "fragments": [],
                "text": "Combining Belief Networks and Neural Networks for Scene Segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "The use of conditional maximum-likelihood training for the TSBN is investigated and it is found that this gives rise to improved classification performance over the ML-trained TSBN."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1706549"
                        ],
                        "name": "C. Won",
                        "slug": "C.-Won",
                        "structuredName": {
                            "firstName": "Chee",
                            "lastName": "Won",
                            "middleNames": [
                                "Sun"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Won"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699809"
                        ],
                        "name": "H. Derin",
                        "slug": "H.-Derin",
                        "structuredName": {
                            "firstName": "Haluk",
                            "lastName": "Derin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Derin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 71,
                                "start": 67
                            }
                        ],
                        "text": "In the context of hierarchical texture segmentation, Won and Derin [21] model the local joint distribution of the data contained in the neighborhood of a site assuming all the neighbors from the same class."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 41307336,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dc67a48a9bb2ca8037f47245667a67601d2c5366",
            "isKey": false,
            "numCitedBy": 179,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Unsupervised-segmentation-of-noisy-and-textured-Won-Derin",
            "title": {
                "fragments": [],
                "text": "Unsupervised segmentation of noisy and textured images using Markov random fields"
            },
            "venue": {
                "fragments": [],
                "text": "CVGIP Graph. Model. Image Process."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "146876323"
                        ],
                        "name": "Hui Cheng",
                        "slug": "Hui-Cheng",
                        "structuredName": {
                            "firstName": "Hui",
                            "lastName": "Cheng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hui Cheng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745655"
                        ],
                        "name": "C. Bouman",
                        "slug": "C.-Bouman",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Bouman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Bouman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 63,
                                "start": 60
                            }
                        ],
                        "text": "In the context of multiscale random field, Cheng and Bouman [2] make a more general assumption."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 44,
                                "start": 41
                            }
                        ],
                        "text": "However, as noted by several researchers [2][13][18][20], this assumption is too restrictive for several applications in vision."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2692144,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "04cc7a031324ebbc77b9c07774be43c0b4b757fe",
            "isKey": false,
            "numCitedBy": 147,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "Multiscale Bayesian approaches have attracted increasing attention for use in image segmentation. Generally, these methods tend to offer improved segmentation accuracy with reduced computational burden. Existing Bayesian segmentation methods use simple models of context designed to encourage large uniformly classified regions. Consequently, these context models have a limited ability to capture the complex contextual dependencies that are important in applications such as document segmentation. We propose a multiscale Bayesian segmentation algorithm which can effectively model complex aspects of both local and global contextual behavior. The model uses a Markov chain in scale to model the class labels that form the segmentation, but augments this Markov chain structure by incorporating tree based classifiers to model the transition probabilities between adjacent scales. The tree based classifier models complex transition rules with only a moderate number of parameters. One advantage to our segmentation algorithm is that it can be trained for specific segmentation applications by simply providing examples of images with their corresponding accurate segmentations. This makes the method flexible by allowing both the context and the image models to be adapted without modification of the basic algorithm. We illustrate the value of our approach with examples from document segmentation in which test, picture and background classes must be separated."
            },
            "slug": "Multiscale-Bayesian-segmentation-using-a-trainable-Cheng-Bouman",
            "title": {
                "fragments": [],
                "text": "Multiscale Bayesian segmentation using a trainable context model"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A multiscale Bayesian segmentation algorithm which can effectively model complex aspects of both local and global contextual behavior is proposed which makes the method flexible by allowing both the context and the image models to be adapted without modification of the basic algorithm."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2145349582"
                        ],
                        "name": "Sanjiv Kumar",
                        "slug": "Sanjiv-Kumar",
                        "structuredName": {
                            "firstName": "Sanjiv",
                            "lastName": "Kumar",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sanjiv Kumar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145670946"
                        ],
                        "name": "M. Hebert",
                        "slug": "M.-Hebert",
                        "structuredName": {
                            "firstName": "Martial",
                            "lastName": "Hebert",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Hebert"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 21
                            }
                        ],
                        "text": "In our previous work [13], we modeled the data dependencies using a pseudolikelihood approximation of a conditional MRF for computational tractability."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 48,
                                "start": 44
                            }
                        ],
                        "text": "However, as noted by several researchers [2][13][18][20], this assumption is too restrictive for several applications in vision."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 102,
                                "start": 98
                            }
                        ],
                        "text": "The detailed explanation of the features used for the structure detection application is given in [13]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 3189198,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "746aacd99a2d9650f4fb03df5d71655b351b6680",
            "isKey": false,
            "numCitedBy": 146,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a generative model based approach to man-made structure detection in 2D (two-dimensional) natural images. The proposed approach uses a causal multiscale random field suggested by Bouman and Shapiro (1994) as a prior model on the class labels on the image sites. However, instead of assuming the conditional independence of the observed data, we propose to capture the local dependencies in the data using a multiscale feature vector. The distribution of the multiscale feature vectors is modeled as mixture of Gaussians. A set of robust multi-scale features is presented that captures the general statistical properties of man-made structures at multiple scales without relying on explicit edge detection. The proposed approach was validated on real-world images from the Corel data set, and a performance comparison with other techniques is presented."
            },
            "slug": "Man-made-structure-detection-in-natural-images-a-Kumar-Hebert",
            "title": {
                "fragments": [],
                "text": "Man-made structure detection in natural images using a causal multiscale random field"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "A generative model based approach to man-made structure detection in 2D (two-dimensional) natural images by using a causal multiscale random field as a prior model on the class labels on the image sites to capture the local dependencies in the data using a multiscales feature vector."
            },
            "venue": {
                "fragments": [],
                "text": "2003 IEEE Computer Society Conference on Computer Vision and Pattern Recognition, 2003. Proceedings."
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34659351"
                        ],
                        "name": "Mário A. T. Figueiredo",
                        "slug": "Mário-A.-T.-Figueiredo",
                        "structuredName": {
                            "firstName": "Mário",
                            "lastName": "Figueiredo",
                            "middleNames": [
                                "A.",
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mário A. T. Figueiredo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145295484"
                        ],
                        "name": "Anil K. Jain",
                        "slug": "Anil-K.-Jain",
                        "structuredName": {
                            "firstName": "Anil",
                            "lastName": "Jain",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anil K. Jain"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 186,
                                "start": 183
                            }
                        ],
                        "text": "However, since the number of parameters for a general kernel mapping is of the order of the number of data points, one will need some method to induce sparseness to avoid overfitting [5]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 217,
                                "start": 214
                            }
                        ],
                        "text": "In this work we used the quadratic transforms such that the functions φk(f i(y)) include all the l components of the feature vector f i(y), their squares and all the pairwise products yielding l+ l(l+1)/2 features [5]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1539863,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "82aa8450f26084353b47cda4a640cb15bae66db6",
            "isKey": false,
            "numCitedBy": 76,
            "numCiting": 50,
            "paperAbstract": {
                "fragments": [],
                "text": "Bayesian approaches to supervised learning use priors on the classifier parameters. However, few priors aim at achieving \"sparse\" classifiers, where irrelevant/redundant parameters are automatically set to zero. Two well-known ways of obtaining sparse classifiers are: use a zero-mean Laplacian prior on the parameters, and the \"support vector machine\" (SVM). Whether one uses a Laplacian prior or an SVM, one still needs to specify/estimate the parameters that control the degree of sparseness of the resulting classifiers. We propose a Bayesian approach to learning sparse classifiers which does not involve any parameters controlling the degree of sparseness. This is achieved by a hierarchical-Bayes interpretation of the Laplacian prior, followed by the adoption of a Jeffreys' non-informative hyper-prior Implementation is carried out by an EM algorithm. Experimental evaluation of the proposed method shows that it performs competitively with (often better than) the best classification techniques available."
            },
            "slug": "Bayesian-learning-of-sparse-classifiers-Figueiredo-Jain",
            "title": {
                "fragments": [],
                "text": "Bayesian learning of sparse classifiers"
            },
            "tldr": {
                "abstractSimilarityScore": 50,
                "text": "A Bayesian approach to learning sparse classifiers which does not involve any parameters controlling the degree of sparseness is proposed, achieved by a hierarchical-Bayes interpretation of the Laplacian prior, followed by the adoption of a Jeffreys' non-informative hyper-prior."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 2001 IEEE Computer Society Conference on Computer Vision and Pattern Recognition. CVPR 2001"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3194361"
                        ],
                        "name": "S. Geman",
                        "slug": "S.-Geman",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Geman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1707642"
                        ],
                        "name": "D. Geman",
                        "slug": "D.-Geman",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Geman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Geman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Note that even though the model seems to have some resemblance to the line process suggested in [ 7 ], K in Eq. (6) is a global weighting parameter unlike the line process where a discrete parameter is introduced for each pair of sites to facilitate discontinuities in smoothing."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Geman and Geman [ 7 ] have proposed a line-process model which allows discontinuities in the labels to provide piecewise continuous smoothing."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5837272,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "459b30a9a960080f3b313e41886b1aa0e51e882c",
            "isKey": false,
            "numCitedBy": 18705,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "We make an analogy between images and statistical mechanics systems. Pixel gray levels and the presence and orientation of edges are viewed as states of atoms or molecules in a lattice-like physical system. The assignment of an energy function in the physical system determines its Gibbs distribution. Because of the Gibbs distribution, Markov random field (MRF) equivalence, this assignment also determines an MRF image model. The energy function is a more convenient and natural mechanism for embodying picture attributes than are the local characteristics of the MRF. For a range of degradation mechanisms, including blurring, nonlinear deformations, and multiplicative or additive noise, the posterior distribution is an MRF with a structure akin to the image model. By the analogy, the posterior distribution defines another (imaginary) physical system. Gradual temperature reduction in the physical system isolates low energy states (``annealing''), or what is the same thing, the most probable states under the Gibbs distribution. The analogous operation under the posterior distribution yields the maximum a posteriori (MAP) estimate of the image given the degraded observations. The result is a highly parallel ``relaxation'' algorithm for MAP estimation. We establish convergence properties of the algorithm and we experiment with some simple pictures, for which good restorations are obtained at low signal-to-noise ratios."
            },
            "slug": "Stochastic-Relaxation,-Gibbs-Distributions,-and-the-Geman-Geman",
            "title": {
                "fragments": [],
                "text": "Stochastic Relaxation, Gibbs Distributions, and the Bayesian Restoration of Images"
            },
            "tldr": {
                "abstractSimilarityScore": 52,
                "text": "The analogy between images and statistical mechanics systems is made and the analogous operation under the posterior distribution yields the maximum a posteriori (MAP) estimate of the image given the degraded observations, creating a highly parallel ``relaxation'' algorithm for MAP estimation."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3072213"
                        ],
                        "name": "J. Besag",
                        "slug": "J.-Besag",
                        "structuredName": {
                            "firstName": "Julian",
                            "lastName": "Besag",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Besag"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 94
                            }
                        ],
                        "text": "In this work we chose a simple algorithm, Iterated Conditional Modes (ICM), proposed by Besag [1]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 285,
                                "start": 280
                            }
                        ],
                        "text": "In contrast, ICM is more resilient to the errors in parameter estimation and performs well even\nProceedings of the Ninth IEEE International Conference on Computer Vision (ICCV’03) 0-7695-1950-4/03 $ 17.00 © 2003 IEEE\nfor large β, which is consistent with the results of [9], [6], and Besag [1]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 76,
                                "start": 73
                            }
                        ],
                        "text": "for large β, which is consistent with the results of [9], [6], and Besag [1]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 23
                            }
                        ],
                        "text": "p(y|x) = ∏i∈S p(yi|xi) [1][4][15][22]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 122,
                                "start": 119
                            }
                        ],
                        "text": "In our ICM implementation, the image sites were divided into coding sets to speed up the sequential updating procedure [1]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 15128952,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "47865b56fee61d9c9ff477f7c79f090cc6663d3a",
            "isKey": true,
            "numCitedBy": 4634,
            "numCiting": 79,
            "paperAbstract": {
                "fragments": [],
                "text": "may 7th, 1986, Professor A. F. M. Smith in the Chair] SUMMARY A continuous two-dimensional region is partitioned into a fine rectangular array of sites or \"pixels\", each pixel having a particular \"colour\" belonging to a prescribed finite set. The true colouring of the region is unknown but, associated with each pixel, there is a possibly multivariate record which conveys imperfect information about its colour according to a known statistical model. The aim is to reconstruct the true scene, with the additional knowledge that pixels close together tend to have the same or similar colours. In this paper, it is assumed that the local characteristics of the true scene can be represented by a nondegenerate Markov random field. Such information can be combined with the records by Bayes' theorem and the true scene can be estimated according to standard criteria. However, the computational burden is enormous and the reconstruction may reflect undesirable largescale properties of the random field. Thus, a simple, iterative method of reconstruction is proposed, which does not depend on these large-scale characteristics. The method is illustrated by computer simulations in which the original scene is not directly related to the assumed random field. Some complications, including parameter estimation, are discussed. Potential applications are mentioned briefly."
            },
            "slug": "On-the-Statistical-Analysis-of-Dirty-Pictures-Besag",
            "title": {
                "fragments": [],
                "text": "On the Statistical Analysis of Dirty Pictures"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2109032502"
                        ],
                        "name": "Roland Wilson",
                        "slug": "Roland-Wilson",
                        "structuredName": {
                            "firstName": "Roland",
                            "lastName": "Wilson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Roland Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48161337"
                        ],
                        "name": "Chang-Tsun Li",
                        "slug": "Chang-Tsun-Li",
                        "structuredName": {
                            "firstName": "Chang-Tsun",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chang-Tsun Li"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 56,
                                "start": 52
                            }
                        ],
                        "text": "However, as noted by several researchers [2][13][18][20], this assumption is too restrictive for several applications in vision."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 18,
                                "start": 14
                            }
                        ],
                        "text": "Wilson and Li [20] assume the difference between observations from the neighboring sites to be conditionally independent"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15590248,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "c48b1a91fb5c5f24d05a31f7095e1731985be8b2",
            "isKey": false,
            "numCitedBy": 89,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, a class of Random Field model, defined on a multiresolution array is used in the segmentation of gray level and textured images. The novel feature of one form of the model is that it is able to segment images containing unknown numbers of regions, where there may be significant variation of properties within each region. The estimation algorithms used are stochastic, but because of the multiresolution representation, are fast computationally, requiring only a few iterations per pixel to converge to accurate results, with error rates of 1-2 percent across a range of image structures and textures. The addition of a simple boundary process gives accurate results even at low resolutions, and consequently at very low computational cost."
            },
            "slug": "A-Class-of-Discrete-Multiresolution-Random-Fields-Wilson-Li",
            "title": {
                "fragments": [],
                "text": "A Class of Discrete Multiresolution Random Fields and Its Application to Image Segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "A class of Random Field model, defined on a multiresolution array is used in the segmentation of gray level and textured images, using a simple boundary process to give accurate results even at low resolutions, and consequently at very low computational cost."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145801638"
                        ],
                        "name": "J. Kittler",
                        "slug": "J.-Kittler",
                        "structuredName": {
                            "firstName": "Josef",
                            "lastName": "Kittler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kittler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1679753"
                        ],
                        "name": "E. Hancock",
                        "slug": "E.-Hancock",
                        "structuredName": {
                            "firstName": "Edwin",
                            "lastName": "Hancock",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Hancock"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30170284,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "03509804227654a73a606720938b48775d200233",
            "isKey": false,
            "numCitedBy": 151,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a specification of the problem of combining evidence that arises in the approach to consistent object-labelling known as probabilistic relaxation. This specification differs from others in several important respects. Firstly, we ensure internal consistency by distinguishing between directly and indirectly interacting objects. Secondly, we avoid certain problems of interpretation and meaning by regarding the iterative updating of probabilities as a filtering process on the measurements for objects. Finally, we overcome the problem of the exponential complexity of the resulting evidence combining formula by deriving practical support functions of at most polynomial complexity. The computational realisation of the advocated approach to combining evidence is demonstrated for the application of edge labelling. This application includes details of how both the measurement generation process and the world-model may be expressed probabilistically and what the advantages are to be gained from using different forms of support-function."
            },
            "slug": "Combining-Evidence-in-Probabilistic-Relaxation-Kittler-Hancock",
            "title": {
                "fragments": [],
                "text": "Combining Evidence in Probabilistic Relaxation"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The computational realisation of the advocated approach to combining evidence is demonstrated for the application of edge labelling and details of how both the measurement generation process and the world-model may be expressed probabilistically and what the advantages are to be gained from using different forms of support-function are included."
            },
            "venue": {
                "fragments": [],
                "text": "Int. J. Pattern Recognit. Artif. Intell."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1942955"
                        ],
                        "name": "W. Christmas",
                        "slug": "W.-Christmas",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Christmas",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Christmas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145801638"
                        ],
                        "name": "J. Kittler",
                        "slug": "J.-Kittler",
                        "structuredName": {
                            "firstName": "Josef",
                            "lastName": "Kittler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kittler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144877016"
                        ],
                        "name": "M. Petrou",
                        "slug": "M.-Petrou",
                        "structuredName": {
                            "firstName": "Maria",
                            "lastName": "Petrou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Petrou"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 144,
                                "start": 141
                            }
                        ],
                        "text": "In probabilistic relaxation labeling, either the labels are assumed to be independent given the relational measurements at two or more sites [3] or conditionally independent in local neighborhood of a site given its label [10]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 517673,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b4835d963c44bd9c29ba52303b78875232b607f8",
            "isKey": false,
            "numCitedBy": 556,
            "numCiting": 68,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we develop the theory of probabilistic relaxation for matching features extracted from 2D images, derive as limiting cases the various heuristic formulae used by researchers in matching problems, and state the conditions under which they apply, We successfully apply our theory to the problem of matching and recognizing aerial road network images based on road network models and to the problem of edge matching in a stereo pair. For this purpose, each line network is represented by an attributed relational graph where each node is a straight line segment characterized by certain attributes and related with every other node via a set of binary relations. >"
            },
            "slug": "Structural-Matching-in-Computer-Vision-Using-Christmas-Kittler",
            "title": {
                "fragments": [],
                "text": "Structural Matching in Computer Vision Using Probabilistic Relaxation"
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "The theory of probabilistic relaxation for matching features extracted from 2D images is developed, derive as limiting cases the various heuristic formulae used by researchers in matching problems, and state the conditions under which they apply."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39886683"
                        ],
                        "name": "C. Fox",
                        "slug": "C.-Fox",
                        "structuredName": {
                            "firstName": "Colin",
                            "lastName": "Fox",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Fox"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145668185"
                        ],
                        "name": "G. Nicholls",
                        "slug": "G.-Nicholls",
                        "structuredName": {
                            "firstName": "Geoff",
                            "lastName": "Nicholls",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nicholls"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This is because the pseudolikelihood approximation used in this work for learning the parameters tends to overestimate the interaction parameter . Our MAP results match the observations made by Greig et al. [9], and Fox and Nicholls [ 6 ] for large values of in MRFs."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "In contrast, ICM is more resilient to the errors in parameter estimation and performs well even for large , which is consistent with the results of [9], [ 6 ], and Besag [1]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "One can use either sampling procedures [ 6 ] or use Belief Propagation to obtain an estimate of the MPM solution."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "For the DRF model, exact MAP solution can be computed if K 0:5 and 0. However, in the context of MRFs, the MAP solution has been shown to perform poorly for the Ising model when the interaction parameter, takes large values [9][ 6 ]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "ICM yields local maximum of the posterior and has been shown to give reasonably good results even when exact MAP performs poorly for large values of [9][ 6 ]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8163609,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fa3c0935020ad29dad3575cda4b9ffb70c46138f",
            "isKey": true,
            "numCitedBy": 31,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "In 1989 Greig, Porteous and Seheult showed that the maximum a posteriori (MAP) state can be exactly calculated for degraded binary images. Their interest was in assessing the performance of algorithms used to find the MAP state, such as simulated annealing. A secondary conclusion was that the MAP state, at least in the restricted setting of two-color images, does not provide a robust reconstruction of the true image. That result has been interpreted by some as indicating that the Ising MRF used by GPS is not a good prior model for such images. We show that such a judgement is premature as the MAP state does not well summarize the information in the posterior distribution in this case. In particular, the deviation of the MAP state from the mean, particularly at larger smoothing parameters, shows that the MAP state is not representative of the bulk of feasible reconstructions. We calculate other summary statistics that interpret and display the information in the posterior by implementing full Bayesian infe..."
            },
            "slug": "Exact-MAP-states-and-expectations-from-perfect-and-Fox-Nicholls",
            "title": {
                "fragments": [],
                "text": "Exact MAP states and expectations from perfect sampling: Greig, porteous and seheult revisited"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The deviation of theMAP state from the mean shows that the MAP state is not representative of the bulk of feasible reconstructions, and summary statistics that interpret and display the information in the posterior by implementing full Bayesian infe..."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144653004"
                        ],
                        "name": "V. Kolmogorov",
                        "slug": "V.-Kolmogorov",
                        "structuredName": {
                            "firstName": "Vladimir",
                            "lastName": "Kolmogorov",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Kolmogorov"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2984143"
                        ],
                        "name": "R. Zabih",
                        "slug": "R.-Zabih",
                        "structuredName": {
                            "firstName": "Ramin",
                            "lastName": "Zabih",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Zabih"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 171
                            }
                        ],
                        "text": "For binary classifications, MAP estimate can be computed exactly using the max-flow/min-cut type of algorithms if the probability distribution meets certain conditions [9][12]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 786967,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "30c15f9be29524e72b9744f8dc14faf2a122d65f",
            "isKey": false,
            "numCitedBy": 1925,
            "numCiting": 52,
            "paperAbstract": {
                "fragments": [],
                "text": "In the last few years, several new algorithms based on graph cuts have been developed to solve energy minimization problems in computer vision. Each of these techniques constructs a graph such that the minimum cut on the graph also minimizes the energy. Yet, because these graph constructions are complex and highly specific to a particular energy function, graph cuts have seen limited application to date. In this paper, we give a characterization of the energy functions that can be minimized by graph cuts. Our results are restricted to functions of binary variables. However, our work generalizes many previous constructions and is easily applicable to vision problems that involve large numbers of labels, such as stereo, motion, image restoration, and scene reconstruction. We give a precise characterization of what energy functions can be minimized using graph cuts, among the energy functions that can be written as a sum of terms containing three or fewer binary variables. We also provide a general-purpose construction to minimize such an energy function. Finally, we give a necessary condition for any energy function of binary variables to be minimized by graph cuts. Researchers who are considering the use of graph cuts to optimize a particular energy function can use our results to determine if this is possible and then follow our construction to create the appropriate graph. A software implementation is freely available."
            },
            "slug": "What-energy-functions-can-be-minimized-via-graph-Kolmogorov-Zabih",
            "title": {
                "fragments": [],
                "text": "What energy functions can be minimized via graph cuts?"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This work gives a precise characterization of what energy functions can be minimized using graph cuts, among the energy functions that can be written as a sum of terms containing three or fewer binary variables."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1773383"
                        ],
                        "name": "Guofang Xiao",
                        "slug": "Guofang-Xiao",
                        "structuredName": {
                            "firstName": "Guofang",
                            "lastName": "Xiao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Guofang Xiao"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144431498"
                        ],
                        "name": "M. Brady",
                        "slug": "M.-Brady",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brady",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brady"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144870105"
                        ],
                        "name": "J. Noble",
                        "slug": "J.-Noble",
                        "structuredName": {
                            "firstName": "Julia",
                            "lastName": "Noble",
                            "middleNames": [
                                "Alison"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Noble"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2108002908"
                        ],
                        "name": "Yongyue Zhang",
                        "slug": "Yongyue-Zhang",
                        "structuredName": {
                            "firstName": "Yongyue",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yongyue Zhang"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 2522789,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "41c96e979d6d182f25295784ff60799928b02ce0",
            "isKey": false,
            "numCitedBy": 200,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "Displayed ultrasound (US) B-mode images often exhibit tissue intensity inhomogeneities dominated by nonuniform beam attenuation within the body. This is a major problem for intensity-based, automatic segmentation of video-intensity images because conventional threshold-based or intensity-statistic-based approaches do not work well in the presence of such image distortions. Time gain compensation (TGC) is typically used in standard US machines in an attempt to overcome this. However this compensation method is position-dependent which means that different tissues in the same TGC time-range (or corresponding depth range) will be, incorrectly, compensated by the same amount. Compensation should really be tissue-type dependent but automating this step is difficult. The main contribution of this paper is to develop a method for simultaneous estimation of video-intensity inhomogeneities and segmentation of US image tissue regions. The method uses a combination of the maximum a posteriori (MAP) and Markov random field (MRF) methods to estimate the US image distortion field assuming it follows a multiplicative model while at the same time labeling image regions based on the corrected intensity statistics. The MAP step is used to estimate the intensity model parameters while the MRF step provides a novel way of incorporating the distributions of image tissue classes as a spatial smoothness constraint. We explain how this multiplicative model can be related to the ultrasonic physics of image formation to justify our approach. Experiments are presented on synthetic images and a gelatin phantom to evaluate quantitatively the accuracy of the method. We also discuss qualitatively the application of the method to clinical breast and cardiac US images. Limitations of the method and potential clinical applications are outlined in the conclusion."
            },
            "slug": "Segmentation-of-ultrasound-B-mode-images-with-Xiao-Brady",
            "title": {
                "fragments": [],
                "text": "Segmentation of ultrasound B-mode images with intensity inhomogeneity correction"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "A method for simultaneous estimation of video-intensity inhomogeneities and segmentation of US image tissue regions and how this multiplicative model can be related to the ultrasonic physics of image formation is explained to justify the approach."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Medical Imaging"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145801638"
                        ],
                        "name": "J. Kittler",
                        "slug": "J.-Kittler",
                        "structuredName": {
                            "firstName": "Josef",
                            "lastName": "Kittler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kittler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2779687"
                        ],
                        "name": "D. Pairman",
                        "slug": "D.-Pairman",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Pairman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Pairman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 3
                            }
                        ],
                        "text": "In [11], a technique has been presented that assumes the noise in the data at neighboring sites to be correlated, which is modeled using an auto-normal model."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 39528541,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "b6f9c5037ed7d0fb1ee1d5f64936b8ac497048dd",
            "isKey": false,
            "numCitedBy": 67,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "The use of contextuial information in classification of satellite imagery of clouds is considered. A general contextual classification rule is developed which is then simplified under some realistic assumptions made. for the label relationships of neighboring cloud image pixels. The resulting decision rule is defined in terms of transition probabilities between pairs of neighboring pixels. Experimental evaluation of the rule confirms its superiority over the conventional Bayes rule and provides justification for the assumption made."
            },
            "slug": "Contextual-Pattern-Recognition-Applied-to-Cloud-and-Kittler-Pairman",
            "title": {
                "fragments": [],
                "text": "Contextual Pattern Recognition Applied to Cloud Detection and Identification"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "A general contextual classification rule is developed which is then simplified under some realistic assumptions made and confirms its superiority over the conventional Bayes rule and provides justification for the assumption made."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Geoscience and Remote Sensing"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1744288"
                        ],
                        "name": "P. Gill",
                        "slug": "P.-Gill",
                        "structuredName": {
                            "firstName": "Philip",
                            "lastName": "Gill",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Gill"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143873253"
                        ],
                        "name": "W. Murray",
                        "slug": "W.-Murray",
                        "structuredName": {
                            "firstName": "Walter",
                            "lastName": "Murray",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Murray"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685738"
                        ],
                        "name": "M. H. Wright",
                        "slug": "M.-H.-Wright",
                        "structuredName": {
                            "firstName": "Margaret",
                            "lastName": "Wright",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. H. Wright"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 91
                            }
                        ],
                        "text": "(7) can be maximized by using line search methods for constrained maximization with bounds [8]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 20611582,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b8d9abd1c078573188b13d36c1b1efb7cb2fa865",
            "isKey": false,
            "numCitedBy": 7626,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "Practical Optimization MethodsFree eBook: Practical Aspects of Structural Optimization [1701.01450] Practical optimization for hybrid quantum Practical Optimization | 4e70c9cf5faf796993a61adc9f46f2c5Acces PDF Practical OptimizationPractical Bayesian Optimization of Machine Learning Particle Swarm Optimization (PSO) An Overview Practical Issues Optimization Algorithms in Physics Practical Mathematical Optimization Universit T BremenA Practical Price Optimization Approach for Omnichannel A Gentle Introduction to Stochastic Optimization AlgorithmsApplied Sciences | Free Full-Text | Evolutionary 0387986316 Practical Optimization Methods: with A Lecture on Model Predictive ControlPractical Optimization : Algorithms and Engineering Wiley Series in Discrete Mathematics and Optimization Ser PRACTICAL OPTIMIZATION uCozEvolutionary practical optimization | DeepDyveA Practical Guide To Hyperparameter Optimization.Blood platelet production: a novel approach for practical [PDF] Practical Bilevel Optimization Download and Read Stability and Sample-based Approximations of Composite Practical portfolio optimization in Python (2/3) machine (PDF) Practical Financial Optimization. Decision making A Multiobjective Optimization Model for Prevention and Particle swarm optimization WikipediaPractical Methods Of Optimization|RPractical Portfolio Optimization London Business SchoolBao: Making Learned Query Optimization PracticalApache Spark Core Practical Optimization DatabricksPractical Methods of Optimization by R. FletcherChapter 11 Nonlinear Optimization Examples4.7 Applied Optimization Problems – Calculus Volume 1Practical bayesian optimization using Goptuna | by Masashi Practical Optimization Methods For 4th Generation Cellular Facility location problems — Mathematical Optimization Practical optimization (2004 edition) | Open Library[J726.Ebook] PDF Download Practical Optimization of Multi-objective Exploration for Practical Optimization Practical Optimization: a Gentle Introduction has moved!?Practical Rod Pumping Optimization on Apple Books(PDF) Practical Optimization with MATLAB The Free StudyPractical portfolio optimization in Python (3/3) code (PDF) Practical, Fast and Robust Point Cloud Registration Numerical Optimization Stanford UniversityPractical Optimization Methods with Mathematica ApplicationsPractical Optimization | 4e70c9cf5faf796993a61adc9f46f2c5Search Engine Optimization: Practical Marketing TechniquesLagout.orgMeter Placement in Active Distribution System using Manual: Practical guide to optimization for mobiles Unity"
            },
            "slug": "Practical-optimization-Gill-Murray",
            "title": {
                "fragments": [],
                "text": "Practical optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "This ebook Practical Optimization by Philip E. Gill is presented in pdf format and the full version of this ebook in DjVu, ePub, doc, txt, PDF forms is presented."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49026551"
                        ],
                        "name": "D. Greig",
                        "slug": "D.-Greig",
                        "structuredName": {
                            "firstName": "Darryl",
                            "lastName": "Greig",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Greig"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "146294528"
                        ],
                        "name": "B. Porteous",
                        "slug": "B.-Porteous",
                        "structuredName": {
                            "firstName": "Baroness",
                            "lastName": "Porteous",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Porteous"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1887111"
                        ],
                        "name": "A. Seheult",
                        "slug": "A.-Seheult",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Seheult",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Seheult"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 159,
                                "start": 156
                            }
                        ],
                        "text": "However, in the context of MRFs, the MAP solution has been shown to perform poorly for the Ising model when the interaction parameter, β takes large values [9][6]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 56,
                                "start": 53
                            }
                        ],
                        "text": "for large β, which is consistent with the results of [9], [6], and Besag [1]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[9], and Fox and Nicholls [6] for large values of β in MRFs."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 168
                            }
                        ],
                        "text": "For binary classifications, MAP estimate can be computed exactly using the max-flow/min-cut type of algorithms if the probability distribution meets certain conditions [9][12]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 154,
                                "start": 151
                            }
                        ],
                        "text": "ICM yields local maximum of the posterior and has been shown to give reasonably good results even when exact MAP performs poorly for large values of β [9][6]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 115691220,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a717b20e99b76cb228b47694140ed3dce082b530",
            "isKey": true,
            "numCitedBy": 1257,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Exact-Maximum-A-Posteriori-Estimation-for-Binary-Greig-Porteous",
            "title": {
                "fragments": [],
                "text": "Exact Maximum A Posteriori Estimation for Binary Images"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144745619"
                        ],
                        "name": "S. German",
                        "slug": "S.-German",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "German",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. German"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "121982077"
                        ],
                        "name": "D. German",
                        "slug": "D.-German",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "German",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. German"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59916588,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a1f9fcf2ccc313a5018e536e76e75d1f7992937b",
            "isKey": false,
            "numCitedBy": 2218,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Stochastic-relaxation,-Gibbs-distributions,-and-the-German-German",
            "title": {
                "fragments": [],
                "text": "Stochastic relaxation, Gibbs distributions, and the Bayesian restoration of images"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52626911"
                        ],
                        "name": "T. Minka",
                        "slug": "T.-Minka",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Minka",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Minka"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 212,
                                "start": 208
                            }
                        ],
                        "text": "To initialize the parameters w in A(xi,y), we first learn these parameters using standard maximum likelihood logistic regression assuming all the labels xi to be independent given the data y for each image m [17]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 131,
                                "start": 127
                            }
                        ],
                        "text": "Newton’s method was used for maximization which has been shown to be much faster than other techniques for correlated features [17]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 118158295,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f90e71df8f88a278b22920e2e976947e637efad8",
            "isKey": false,
            "numCitedBy": 107,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Algorithms-for-maximum-likelihood-logistic-Minka",
            "title": {
                "fragments": [],
                "text": "Algorithms for maximum-likelihood logistic regression"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2003
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 226,
                                "start": 222
                            }
                        ],
                        "text": "In probabilistic relaxation labeling, either the labels ar e ssumed to be independent given the relational measurements at two or more sites [3] or conditionally independent in local neighborhood of a site given its label [10]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Combining evidence in probabilistic relaxation.Int"
            },
            "venue": {
                "fragments": [],
                "text": "Jour. Pattern Recog. Artificial Intelli. ,"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 38,
                                "start": 34
                            }
                        ],
                        "text": "p(y|x) = ∏ i∈S p(yi|xi) [1][4][15][22]."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "and Y"
            },
            "venue": {
                "fragments": [],
                "text": "Zhang. Segmentation of ultrasound b-mode images with intensity inhomogeneity correction.IEEE Trans. Med. Imaging  , 21(1):48–57"
            },
            "year": 2002
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 91
                            }
                        ],
                        "text": "(7) can be maximized by using line search methods for constrained maximization with bounds [8]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "and M"
            },
            "venue": {
                "fragments": [],
                "text": "H. Wright.Practical Optimization. Academic Press, San Diego"
            },
            "year": 1981
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proceedings of the Ninth IEEE International Conference on Computer Vision (ICCV 2003"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Ninth IEEE International Conference on Computer Vision (ICCV 2003"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Discriminative vs informative learning A class of discrete multiresolu - tion random fields and its application to image segmentation"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans . PAMI"
            },
            "year": 2000
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 17,
            "methodology": 11,
            "result": 4
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 27,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/Discriminative-random-fields:-a-discriminative-for-Kumar-Hebert/e54f01884e1fba4a0bbd2f0989ad21a16ebb13e3?sort=total-citations"
}