{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685272"
                        ],
                        "name": "J. Blinn",
                        "slug": "J.-Blinn",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Blinn",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Blinn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32920153"
                        ],
                        "name": "M. Newell",
                        "slug": "M.-Newell",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Newell",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Newell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Blinn and Newell [ 1 ] generalized Catmull's work and extended it to include environmental reflections."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 408793,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "40a6fff1cf2b6f43d4ecdefdf32a7138cf33be93",
            "isKey": false,
            "numCitedBy": 740,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "In 1974 Catmull developed a new algorithm for rendering images of bivariate surface patches. This paper describes extensions of this algorithm in the areas of texture simulation and lighting models. The parametrization of a patch defines a coordinate system which is used as a key for mapping patterns onto the surface. The intensity of the pattern at each picture element is computed as a weighted average of regions of the pattern definition function. The shape and size of this weighting function are chosen using digital signal processing theory. The patch rendering algorithm allows accurate computation of the surface normal to the patch at each picture element, permitting the simulation of mirror reflections. The amount of light coming from a given direction is modeled in a similar manner to the texture mapping and then added to the intensity obtained from the texture mapping. Several examples of images synthesized using these new techniques are included."
            },
            "slug": "Texture-and-reflection-in-computer-generated-images-Blinn-Newell",
            "title": {
                "fragments": [],
                "text": "Texture and reflection in computer generated images"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "Extensions of this algorithm in the areas of texture simulation and lighting models are described, including extensions of the parametrization of a patch which defines a coordinate system which is used as a key for mapping patterns onto the surface."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1976
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3159567"
                        ],
                        "name": "E. Feibush",
                        "slug": "E.-Feibush",
                        "structuredName": {
                            "firstName": "Eliot",
                            "lastName": "Feibush",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Feibush"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1801789"
                        ],
                        "name": "M. Levoy",
                        "slug": "M.-Levoy",
                        "structuredName": {
                            "firstName": "Marc",
                            "lastName": "Levoy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Levoy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144560093"
                        ],
                        "name": "R. L. Cook",
                        "slug": "R.-L.-Cook",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Cook",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. L. Cook"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 260,
                                "start": 247
                            }
                        ],
                        "text": "Generating the table is inexpensive enough (for reasonably-sized texture images) that it should not be an important consideration in deciding whether to use a mip map technique or the more accurate (and expensive) techniques of Blinn [2] and then Feibush et al. [5]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 68,
                                "start": 62
                            }
                        ],
                        "text": "The more accurate renditions afforded by more expensive means [2, 5] may do better in such situations."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 34
                            }
                        ],
                        "text": "Blinn [2] and later Feibush et al [5] discuss this problem in detail and implemeuted good, but very expensive solutions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 34144576,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a97e117427f3672fad3804dca3815fca0250de57",
            "isKey": false,
            "numCitedBy": 150,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Aliasing artifacts are eliminated from computer generated images of textured polygons by equivalently filtering both the texture and the edges of the polygons. Different filters can be easily compared because the weighting functions that define the shape of the filters are pre-computed and stored in lookup tables. A polygon subdivision algorithm removes the hidden surfaces so that the polygons are rendered sequentially to minimize accessing the texture definition files. An implementation of the texture rendering procedure is described."
            },
            "slug": "Synthetic-texturing-using-digital-filters-Feibush-Levoy",
            "title": {
                "fragments": [],
                "text": "Synthetic texturing using digital filters"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Aliasing artifacts are eliminated from computer generated images of textured polygons by equivalently filtering both the texture and the edges of the polygons."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '80"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2112865075"
                        ],
                        "name": "Lance Williams",
                        "slug": "Lance-Williams",
                        "structuredName": {
                            "firstName": "Lance",
                            "lastName": "Williams",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lance Williams"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10619616,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "63ffc8b9e57ba55c4e4eb499c73b664238ff711f",
            "isKey": false,
            "numCitedBy": 898,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "The mapping of images onto surfaces may substantially increase the realism and information content of computer-generated imagery. The projection of a flat source image onto a curved surface may involve sampling difficulties, however, which are compounded as the view of the surface changes. As the projected scale of the surface increases, interpolation between the original samples of the source image is necessary; as the scale is reduced, approximation of multiple samples in the source is required. Thus a constantly changing sampling window of view-dependent shape must traverse the source image. To reduce the computation implied by these requirements, a set of prefiltered source images may be created. This approach can be applied to particular advantage in animation, where a large number of frames using the same source image must be generated. This paper advances a “pyramidal parametric” prefiltering and sampling geometry which minimizes aliasing effects and assures continuity within and between target images. Although the mapping of texture onto surfaces is an excellent example of the process and provided the original motivation for its development, pyramidal parametric data structures admit of wider application. The aliasing of not only surface texture, but also highlights and even the surface representations themselves, may be minimized by pyramidal parametric means."
            },
            "slug": "Pyramidal-parametrics-Williams",
            "title": {
                "fragments": [],
                "text": "Pyramidal parametrics"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This paper advances a “pyramidal parametric” prefiltering and sampling geometry which minimizes aliasing effects and assures continuity within and between target images."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3132499"
                        ],
                        "name": "E. Catmull",
                        "slug": "E.-Catmull",
                        "structuredName": {
                            "firstName": "Edwin",
                            "lastName": "Catmull",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Catmull"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116707114"
                        ],
                        "name": "Alvy Ray Smith",
                        "slug": "Alvy-Ray-Smith",
                        "structuredName": {
                            "firstName": "Alvy",
                            "lastName": "Smith",
                            "middleNames": [
                                "Ray"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alvy Ray Smith"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5571412,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "958dc5c29c0f46fd988eb75a24ac4a7a17e5497c",
            "isKey": false,
            "numCitedBy": 207,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Currerntly texture mapping onto projections of 3-D surfaces is time consuming and subject to considerable aliasing errors. Usually the procedure is to perform some inverse mapping from the area of the pixel onto the surface texture. It is difficult to do this correctly. There is an alternate approach where the texture surface is transformed as a 2-D image until it conforms to a projection of a polygon placed arbitrarily in 3-space. The great advantage of this approach is that the 2-D transformation can be decomposed into two simple transforms, one in horizontal and the other in vertical scanline order. horizontal scanline order, Sophisticated light calculation is also time consuming and difficult to calculate correctly on projected polygons. Instead of calculating the lighting based on the position of the polygon, lights, and eye, the lights and eye can be transformed to a corresponding position for a unit square which we can consider to be a canonical polygon. After this canonical polygon is correctly textured and shaded it can be easily conformed to the projection of the 3-D surface."
            },
            "slug": "3-D-transformations-of-images-in-scanline-order-Catmull-Smith",
            "title": {
                "fragments": [],
                "text": "3-D transformations of images in scanline order"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Instead of calculating the lighting based on the position of the polygon, lights, and eye, the lights and eye can be transformed to a corresponding position for a unit square which the authors can consider to be a canonical polygon."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '80"
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3132499"
                        ],
                        "name": "E. Catmull",
                        "slug": "E.-Catmull",
                        "structuredName": {
                            "firstName": "Edwin",
                            "lastName": "Catmull",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Catmull"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 0
                            }
                        ],
                        "text": "Catmull and Smith [4] show a way of simplifying the calculation of the texture intensity by separating the convolution into two passes."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 33
                            }
                        ],
                        "text": "Blinn and Newell [1] generalized Catmull's work and extended it to include environmental reflections."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 17
                            }
                        ],
                        "text": "In 1974, Catmull [3] conceived and implemented the first system to use images of texture applied to surfaces to give the affect of actual texture."
                    },
                    "intents": []
                }
            ],
            "corpusId": 62099591,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c73706ebac75483c694a47613d81fd0b6d468180",
            "isKey": false,
            "numCitedBy": 930,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : This report presents a method for producing computer shaded pictures of curved surfaces. Three-dimensional curved patches are used, as contrasted with conventional methods using polygons. The method subdivides a patch into successively smaller subpatches until a subpatch is as small as a raster- element, at which time it can be displayed. In general this method could be very time consuming because of the great number of subdivisions that must take place; however, there is at least one very useful class of patches - the bicubic patch - that can be subdivided very quickly. Pitures produced with the method accurately portray the shading and silhouette of curved surfaces. In addition, photographs can be 'mapped' onto patches thus providing a means for putting texture on computer-generated pictures."
            },
            "slug": "A-subdivision-algorithm-for-computer-display-of-Catmull",
            "title": {
                "fragments": [],
                "text": "A subdivision algorithm for computer display of curved surfaces."
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "A method for producing computer shaded pictures of curved surfaces using three-dimensional curved patches, which can be 'mapped' onto patches thus providing a means for putting texture on computer-generated pictures."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48453558"
                        ],
                        "name": "V. Norton",
                        "slug": "V.-Norton",
                        "structuredName": {
                            "firstName": "V.",
                            "lastName": "Norton",
                            "middleNames": [
                                "Alan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Norton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2160274"
                        ],
                        "name": "A. Rockwood",
                        "slug": "A.-Rockwood",
                        "structuredName": {
                            "firstName": "Alyn",
                            "lastName": "Rockwood",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Rockwood"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3022740"
                        ],
                        "name": "Philip T. Skolmoski",
                        "slug": "Philip-T.-Skolmoski",
                        "structuredName": {
                            "firstName": "Philip",
                            "lastName": "Skolmoski",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Philip T. Skolmoski"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 34,
                                "start": 31
                            }
                        ],
                        "text": "Norton, Rockwood and Skomolski [9] report a method for limiting texture detail to the appropriate level by expressing"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 0
                            }
                        ],
                        "text": "Norton, Rockwood and Skomolski [9] report a method for limiting texture detail to the appropriate level by expressing @SIGGRAPH'84 Figure 1: Texture distortion texture as a sum of band-limited terms of increasing frequencies."
                    },
                    "intents": []
                }
            ],
            "corpusId": 2933014,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "985297534ba9ee5ce4d488fba92f1e8c2753f460",
            "isKey": false,
            "numCitedBy": 92,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "An object space method is given for interpolating between sampled and locally averaged signals, resulting in an antialiasing filter which provides a continuous transition from a sampled signal to its selectively dampened local averages. This method is applied to the three standard Euclidean dimensions and time, resulting in spatial and frame to frame coherence. The theory allows filtering of a variety of functions, including continuous and discrete representations of planar texture."
            },
            "slug": "Clamping:-A-method-of-antialiasing-textured-by-in-Norton-Rockwood",
            "title": {
                "fragments": [],
                "text": "Clamping: A method of antialiasing textured surfaces by bandwidth limiting in object space"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "An object space method is given for interpolating between sampled and locally averaged signals, resulting in an antialiasing filter which provides a continuous transition from a sampled signal to its selectively dampened local averages."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39217340"
                        ],
                        "name": "Henry Gouraud",
                        "slug": "Henry-Gouraud",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Gouraud",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Henry Gouraud"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Generating the table is inexpensive enough (for reasonably-sized texture images) that it should not be an important consideration in deciding whether to use a mip map technique or the more accurate (and expensive) techniques of Blinn [ 2 ] and then Feibush et al. [5]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Blinn [ 2 ] and later Feibush et al [5] discuss this problem in detail and implemeuted good, but very expensive solutions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Blinn [ 2 ] then further extended the notion (rather spectacularly!) to achieve the appearance of undulations on the surface (the earlier efforts achieved only flat texture, such as the fake wood texturing found on many plastic desk tops)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Ideally the texture should roll off smoothly into a uniform grey at the ends of the striped eggs in figure 3. The more accurate renditions afforded by more expensive means [ 2 , 5] may do better in such situations."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5185089,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e1e71a43b41452f7389420a3a6c1a1c32149c5c9",
            "isKey": true,
            "numCitedBy": 278,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : The report describes a method for producing shaded pictures of curved surfaces. It uses a small polygon approximation of the surface to solve efficiently the hidden parts detection, and then computes the shading on each polygon in such a way that visual discontinuities between adjacent polygons disappear, thus restoring the apparent smoothness of the surface and increasing greatly the realism of the pictures produced. The smooth shading technique described here has been used to produce a large variety of pictures of which several airplanes, a car, a human face and some mathematical surfaces are included to illustrate the effect of the method. (Author)"
            },
            "slug": "Computer-Display-of-Curved-Surfaces-Gouraud",
            "title": {
                "fragments": [],
                "text": "Computer Display of Curved Surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The smooth shading technique described here has been used to produce a large variety of pictures of which several airplanes, a car, a human face and some mathematical surfaces are included to illustrate the effect of the method."
            },
            "venue": {
                "fragments": [],
                "text": "Outstanding Dissertations in the Computer Sciences"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144881307"
                        ],
                        "name": "A. Fournier",
                        "slug": "A.-Fournier",
                        "structuredName": {
                            "firstName": "Alain",
                            "lastName": "Fournier",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Fournier"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2979072"
                        ],
                        "name": "D. Fussell",
                        "slug": "D.-Fussell",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Fussell",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Fussell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2645473"
                        ],
                        "name": "L. Carpenter",
                        "slug": "L.-Carpenter",
                        "structuredName": {
                            "firstName": "Loren",
                            "lastName": "Carpenter",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Carpenter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 166
                            }
                        ],
                        "text": "In a remotely similar vein, Haruyama and Barsky [8] describe implementation of a fractal texture synthesis technique as suggested by Fournier, Fussell, and Carpenter [6]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 14118248,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "843ffc65e93ca506fdbc8cab06c1caff990c05ba",
            "isKey": false,
            "numCitedBy": 683,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "A recurrent problem in generating realistic pictures by computers is to represent natural irregular objects and phenomena without undue time or space overhead. We develop a new and powerful solution to this computer graphics problem by modeling objects as sample paths of stochastic processes. Of particular interest are those stochastic processes which previously have been found to be useful models of the natural phenomena to be represented. One such model applicable to the representation of terrains, known as “fractional Brownian motion,” has been developed by Mandelbrot.\nThe value of a new approach to object modeling in computer graphics depends largely on the efficiency of the techniques used to implement the model. We introduce a new algorithm that computes a realistic, visually satisfactory approximation to fractional Brownian motion in faster time than with exact calculations. A major advantage of this technique is that it allows us to compute the surface to arbitrary levels of details without increasing the database. Thus objects with complex appearances can be displayed from a very small database. The character of the surface can be controlled by merely modifying a few parameters. A similar change allows complex motion to be created inexpensively."
            },
            "slug": "Computer-rendering-of-stochastic-models-Fournier-Fussell",
            "title": {
                "fragments": [],
                "text": "Computer rendering of stochastic models"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A new algorithm is introduced that computes a realistic, visually satisfactory approximation to fractional Brownian motion in faster time than with exact calculations, and allows complex motion to be created inexpensively."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1805951"
                        ],
                        "name": "S. Haruyama",
                        "slug": "S.-Haruyama",
                        "structuredName": {
                            "firstName": "Shinichiro",
                            "lastName": "Haruyama",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Haruyama"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1700557"
                        ],
                        "name": "B. Barsky",
                        "slug": "B.-Barsky",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Barsky",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Barsky"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 51,
                                "start": 48
                            }
                        ],
                        "text": "In a remotely similar vein, Haruyama and Barsky [8] describe implementation of a fractal texture synthesis technique as suggested by Fournier, Fussell, and Carpenter [6]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 18364005,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fb7d07295261b6a25084a989770497b597b3b339",
            "isKey": false,
            "numCitedBy": 67,
            "numCiting": 53,
            "paperAbstract": {
                "fragments": [],
                "text": "A new computer graphics technique generates complicated random textures, like those found on natural objects. Requiring little data, it allows easy control of textural properties."
            },
            "slug": "Using-Stochastic-Modeling-for-Texture-Generation-Haruyama-Barsky",
            "title": {
                "fragments": [],
                "text": "Using Stochastic Modeling for Texture Generation"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "A new computer graphics technique generates complicated random textures, like those found on natural objects, requiring little data and allowing easy control of textural properties."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Computer Graphics and Applications"
            },
            "year": 1984
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 5,
                                "start": 0
                            }
                        ],
                        "text": "Blinn and Newell [1] generalized Catmull's work and extended it to include environmental reflections."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 5,
                                "start": 0
                            }
                        ],
                        "text": "Blinn [2] then further extended the notion (rather spectacularly"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 9,
                                "start": 6
                            }
                        ],
                        "text": "Blinn [2] and later Feibush et al [5] discuss this problem in detail and implemeuted good, but very expensive solutions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 237,
                                "start": 234
                            }
                        ],
                        "text": "Generating the table is inexpensive enough (for reasonably-sized texture images) that it should not be an important consideration in deciding whether to use a mip map technique or the more accurate (and expensive) techniques of Blinn [2] and then Feibush et al."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 233,
                                "start": 228
                            }
                        ],
                        "text": "Generating the table is inexpensive enough (for reasonably-sized texture images) that it should not be an important consideration in deciding whether to use a mip map technique or the more accurate (and expensive) techniques of Blinn [2] and then Feibush et al. [5]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 9,
                                "start": 6
                            }
                        ],
                        "text": "Blinn [2] then further extended the notion (rather spectacularly!) to achieve the appearance of undulations on the surface (the earlier efforts achieved only flat texture, such as the fake wood texturing found on many plastic desk tops)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 68,
                                "start": 62
                            }
                        ],
                        "text": "The more accurate renditions afforded by more expensive means [2, 5] may do better in such situations."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Computer Display of Curved Surfaces\", PhD. Dissertation, Department of Computer Science, University  of Utah"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "middle: multiple table (2 1/4 min"
            },
            "venue": {
                "fragments": [],
                "text": "right: summed table (2 min.). Figure 4: Left: nearest pixel, middle: multiple table"
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 4,
            "methodology": 5
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 11,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Summed-area-tables-for-texture-mapping-Crow/8b22e1751f75be137b7b210981baccc1b9ab9222?sort=total-citations"
}