{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145062511"
                        ],
                        "name": "S. Seth",
                        "slug": "S.-Seth",
                        "structuredName": {
                            "firstName": "Sharad",
                            "lastName": "Seth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Seth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145266621"
                        ],
                        "name": "M. Viswanathan",
                        "slug": "M.-Viswanathan",
                        "structuredName": {
                            "firstName": "Mahesh",
                            "lastName": "Viswanathan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Viswanathan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 2530196,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "62a53caea5213ea177298d7b2aff292b1386c37a",
            "isKey": false,
            "numCitedBy": 434,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Gobbledoc, a system providing remote access to stored documents, which is based on syntactic document analysis and optical character recognition (OCR), is discussed. In Gobbledoc, image processing, document analysis, and OCR operations take place in batch mode when the documents are acquired. The document image acquisition process and the knowledge base that must be entered into the system to process a family of page images are described. The process by which the X-Y tree data structure converts a 2-D page-segmentation problem into a series of 1-D string-parsing problems that can be tackled using conventional compiler tools is also described. Syntactic analysis is used in Gobbledoc to divide each page into labeled rectangular blocks. Blocks labeled text are converted by OCR to obtain a secondary (ASCII) document representation. Since such symbolic files are better suited for computerized search than for human access to the document content and because too many visual layout clues are lost in the OCR process (including some special characters), Gobbledoc preserves the original block images for human browsing. Storage, networking, and display issues specific to document images are also discussed.<<ETX>>"
            },
            "slug": "A-prototype-document-image-analysis-system-for-Nagy-Seth",
            "title": {
                "fragments": [],
                "text": "A prototype document image analysis system for technical journals"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The document image acquisition process and the knowledge base that must be entered into the system to process a family of page images are described, and the process by which the X-Y tree data structure converts a 2-D page-segmentation problem into a series of 1-D string-parsing problems that can be tackled using conventional compiler tools."
            },
            "venue": {
                "fragments": [],
                "text": "Computer"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 58520344,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ca6a9a4f4f291e2c5e94a7b85f7fc1f8ddfb8aad",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Digitized documents are preprocessed for library archival and distribution. Pages from technical journals scanned at 300 dpi are recursively segmented with multiple alternating horizontal and vertical cuts according to publication-specific layout information. The resulting rectangular blocks are labeled concurrently in terms of functional components such as author block, title, abstract. Three specific applications for integrating paper-based information into an electronic environment are described. The first will allow library users to interactively select and view portions of a page-image, such as illustrations, subtitles, or text paragraphs, when either the screen resolution of their workstation or low transmission rates prevent viewing the bitmap of an entire page. The second application will automate the selection of suitable portions of the document ( e.g., abstracts) for subsequent optical character recognition for full-text search of journals and reports in paper form. The third application will automatically link pixel maps of illustrations with ASCII text files. All three applications are based on syntactic processing of binary document images."
            },
            "slug": "Towards-a-Structured-Document-Image-Utility-Nagy",
            "title": {
                "fragments": [],
                "text": "Towards a Structured-Document-Image Utility"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Three specific applications for integrating paper-based information into an electronic environment are described, which will allow library users to interactively select and view portions of a page-image when either the screen resolution of their workstation or low transmission rates prevent viewing the bitmap of an entire page."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2122930"
                        ],
                        "name": "J. Ha",
                        "slug": "J.-Ha",
                        "structuredName": {
                            "firstName": "Jaekyu",
                            "lastName": "Ha",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Ha"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1744200"
                        ],
                        "name": "I. T. Phillips",
                        "slug": "I.-T.-Phillips",
                        "structuredName": {
                            "firstName": "Ihsin",
                            "lastName": "Phillips",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. T. Phillips"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3361432,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e393d7d2a5a1f9bfd59db0c14a5a1e8c972f8f1d",
            "isKey": false,
            "numCitedBy": 104,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a method for extracting words, textlines and text blocks by analyzing the spatial configuration of bounding boxes of connected component on a given document image. The basic idea is that connected components of black pixels can be used as computational units in document image analysis. In this paper, the problem of extracting words, textlines and text blocks is viewed as a clustering problem in the 2-dimensional discrete domain. Our main strategy is that profiling analysis is utilized to measure horizontal or vertical gaps of (groups of) components during the process of image segmentation. For this purpose, we compute the smallest rectangular box, called the bounding box, which circumscribes a connected component. Those boxes are projected horizontally and/or vertically, and local and global projection profiles are analyzed for word, textline and text-block segmentation. In the last step of segmentation, the document decomposition hierarchy is produced from these segmented objects."
            },
            "slug": "Document-page-decomposition-by-the-bounding-box-Ha-Haralick",
            "title": {
                "fragments": [],
                "text": "Document page decomposition by the bounding-box project"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "The problem of extracting words, textlines and text blocks is viewed as a clustering problem in the 2-dimensional discrete domain and profiling analysis is utilized to measure horizontal or vertical gaps of (groups of) components during the process of image segmentation."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 13615381,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d91e0d202fa23b7a2e81c5b3b04eb4cc5327b0f9",
            "isKey": false,
            "numCitedBy": 144,
            "numCiting": 66,
            "paperAbstract": {
                "fragments": [],
                "text": "Document image understanding encompasses the technology required to make paper documents equivalent to other computer exchange media like floppies, tapes, and CDROMs. The physical reader of the paper document is the scanner just like the physical reader of the floppy is the floppy drive and the physical reader of the tape cartridge is the tape cartridge drive, and the physical reader of the CDROM is the CDROM drive. In the survey presented, we restrict ourselves to documents such as business letters, forms, and scientific and technical articles such as those found in archival journals and technical conferences. Understanding such documents involves estimating the rotation skew of each document page, determining the geometric page layout, labeling blocks as text or non-text, determining the read order for text blocks, recognizing the text of text blocks through an OCR system, determining the logical page layout, and formatting the data and information of the document in a suitable way for use by a word processing system or by an information retrieval system.<<ETX>>"
            },
            "slug": "Document-image-understanding:-geometric-and-logical-Haralick",
            "title": {
                "fragments": [],
                "text": "Document image understanding: geometric and logical layout"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "Document image understanding encompasses the technology required to make paper documents equivalent to other computer exchange media like floppies, tapes, and CDROMs and restricts ourselves to documents such as business letters, forms, and scientific and technical articles such as those found in archival journals and technical conferences."
            },
            "venue": {
                "fragments": [],
                "text": "1994 Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39789530"
                        ],
                        "name": "Akio Yamashita",
                        "slug": "Akio-Yamashita",
                        "structuredName": {
                            "firstName": "Akio",
                            "lastName": "Yamashita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Akio Yamashita"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2706492"
                        ],
                        "name": "Tomio Amano",
                        "slug": "Tomio-Amano",
                        "structuredName": {
                            "firstName": "Tomio",
                            "lastName": "Amano",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tomio Amano"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "73282614"
                        ],
                        "name": "Y. Hirayama",
                        "slug": "Y.-Hirayama",
                        "structuredName": {
                            "firstName": "Y.",
                            "lastName": "Hirayama",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Hirayama"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3061813"
                        ],
                        "name": "N. Itoh",
                        "slug": "N.-Itoh",
                        "structuredName": {
                            "firstName": "Nobuyasu",
                            "lastName": "Itoh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Itoh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2092508"
                        ],
                        "name": "Shin Katoh",
                        "slug": "Shin-Katoh",
                        "structuredName": {
                            "firstName": "Shin",
                            "lastName": "Katoh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Shin Katoh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2071129245"
                        ],
                        "name": "Takashi Mano",
                        "slug": "Takashi-Mano",
                        "structuredName": {
                            "firstName": "Takashi",
                            "lastName": "Mano",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Takashi Mano"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40393216"
                        ],
                        "name": "Kazuharu Toyokawa",
                        "slug": "Kazuharu-Toyokawa",
                        "structuredName": {
                            "firstName": "Kazuharu",
                            "lastName": "Toyokawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kazuharu Toyokawa"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 33411697,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b55e11c57429d4a7c01cebe3b4ed6e9b16b5cb51",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a document entry system called the Document Recognition System (DRS), which facilitates the conversion of printed documents into electronic form. DRS was developed on a personal computer (PC) with an adapter card for recognizing more than 3000 Kanji characters. It provides a flexible framework for object-oriented management of data and processing modules. The framework allows the user to change the combination of processing modules and to select pipelining (parallel processing) or sequential processing. DRS includes processing modules for layout analysis functions such as blob detection, block segmentation, and model matching, and for character recognition functions such as Kanji character recognition, Japanese postprocessing, postprocessing by a user, and error correction through a user interface. The character recognition functions on the card and the other processing-related recognition functions on the PC work cooperatively in the proposed framework. Within the basic framework, we have customized DRS for practical applications. Examples of successful applications-entry into a text database, creation of an electronic catalog, entry of family registration data, and entry of tag data in a manufacturing process-provide evidence of the processing accuracy and robustness of the framework."
            },
            "slug": "A-document-recognition-system-and-its-applications-Yamashita-Amano",
            "title": {
                "fragments": [],
                "text": "A document recognition system and its applications"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Examples of successful applications-entry into a text database, creation of an electronic catalog, entry of family registration data, and entry of tag data in a manufacturing process-provide evidence of the processing accuracy and robustness of the framework."
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. Dev."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36738748"
                        ],
                        "name": "Debashish Niyogi",
                        "slug": "Debashish-Niyogi",
                        "structuredName": {
                            "firstName": "Debashish",
                            "lastName": "Niyogi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Debashish Niyogi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696384"
                        ],
                        "name": "S. Srihari",
                        "slug": "S.-Srihari",
                        "structuredName": {
                            "firstName": "Sargur",
                            "lastName": "Srihari",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Srihari"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 2314813,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9349824a7e0a513667071df1c07833adb6f197bb",
            "isKey": false,
            "numCitedBy": 60,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "The analysis of a document image to derive a symbolic description of its structure and contents involves using spatial domain knowledge to classify the different printed blocks (e.g., text paragraphs), group them into logical units (e.g., newspaper stories), and determine the reading order of the text blocks within each unit. These steps describe the conversion of the physical structure of a document into its logical structure. We have developed a computational model for document logical structure derivation, in which a rule-based control strategy utilizes the data obtained from analyzing a digitized document image, and makes inferences using a multi-level knowledge base of document layout rules. The knowledge-based document logical structure derivation system (DeLoS) based on this model consists of a hierarchical rule-based control system to guide the block classification, grouping and read-ordering operations; a global data structure to store the document image data and incremental inferences; and a domain knowledge base to encode the rules governing document layout."
            },
            "slug": "Knowledge-based-derivation-of-document-logical-Niyogi-Srihari",
            "title": {
                "fragments": [],
                "text": "Knowledge-based derivation of document logical structure"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A computational model for document logical structure derivation is developed, in which a rule-based control strategy utilizes the data obtained from analyzing a digitized document image, and makes inferences using a multi-level knowledge base of document layout rules."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398550688"
                        ],
                        "name": "L. O'Gorman",
                        "slug": "L.-O'Gorman",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "O'Gorman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. O'Gorman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 22995244,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d85097da36118fbccfeb7802abf89bf4b4c63a3e",
            "isKey": false,
            "numCitedBy": 728,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Page layout analysis is a document processing technique used to determine the format of a page. This paper describes the document spectrum (or docstrum), which is a method for structural page layout analysis based on bottom-up, nearest-neighbor clustering of page components. The method yields an accurate measure of skew, within-line, and between-line spacings and locates text lines and text blocks. It is advantageous over many other methods in three main ways: independence from skew angle, independence from different text spacings, and the ability to process local regions of different text orientations within the same image. Results of the method shown for several different page formats and for randomly oriented subpages on the same image illustrate the versatility of the method. We also discuss the differences, advantages, and disadvantages of the docstrum with respect to other lay-out methods. >"
            },
            "slug": "The-Document-Spectrum-for-Page-Layout-Analysis-O'Gorman",
            "title": {
                "fragments": [],
                "text": "The Document Spectrum for Page Layout Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "The document spectrum (or docstrum), which is a method for structural page layout analysis based on bottom-up, nearest-neighbor clustering of page components, yields an accurate measure of skew, within-line, and between-line spacings and locates text lines and text blocks."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49983785"
                        ],
                        "name": "J. L. Fisher",
                        "slug": "J.-L.-Fisher",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Fisher",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. L. Fisher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1409052480"
                        ],
                        "name": "S. C. Hinds",
                        "slug": "S.-C.-Hinds",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Hinds",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. C. Hinds"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1402307078"
                        ],
                        "name": "D. D'Amato",
                        "slug": "D.-D'Amato",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "D'Amato",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. D'Amato"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61327298,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "23fdda45268bf3898a95bad889e7a169081c4a77",
            "isKey": false,
            "numCitedBy": 144,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "A rule-based system for automatically segmenting a document image into regions of text and nontext is presented. The initial stages of the system perform image enhancement functions such as adaptive thresholding, morphological processing, and skew detection and correction. The image segmentation process consists of smearing the original image via the run length smoothing algorithm, calculating the connected components locations and statistics, and filtering (segmenting) the image based on these statistics. The text regions can be converted (via an optical character reader) to a computer-searchable form, and the nontext regions can be extracted and preserved. The rule-based structure allows easy fine tuning of the algorithmic steps to produce robust rules, to incorporate additional tools (as they become available), and to handle special segmentation needs.<<ETX>>"
            },
            "slug": "A-rule-based-system-for-document-image-segmentation-Fisher-Hinds",
            "title": {
                "fragments": [],
                "text": "A rule-based system for document image segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "A rule-based system for automatically segmenting a document image into regions of text and nontext is presented and allows easy fine tuning of the algorithmic steps to produce robust rules, to incorporate additional tools (as they become available), and to handle special segmentation needs."
            },
            "venue": {
                "fragments": [],
                "text": "[1990] Proceedings. 10th International Conference on Pattern Recognition"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2270291"
                        ],
                        "name": "S. Tsujimoto",
                        "slug": "S.-Tsujimoto",
                        "structuredName": {
                            "firstName": "Shuichi",
                            "lastName": "Tsujimoto",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Tsujimoto"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3358140"
                        ],
                        "name": "H. Asada",
                        "slug": "H.-Asada",
                        "structuredName": {
                            "firstName": "Haruo",
                            "lastName": "Asada",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Asada"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62682454,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e5818edaaf099fd0d55344f9ee23f6609bb72367",
            "isKey": false,
            "numCitedBy": 95,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "A document understanding method based on the tree representation of document structures is proposed. It is shown that documents have an obvious hierarchical structure in their geometry which is represented by a tree. A small number of rules are introduced to transform the geometric structure into the logical structure which represents the semantics. The virtual field separator technique is employed to utilize the information carried by special constituents of documents such as field separators and frames, keeping the number of transformation rules small. Experimental results on a variety of document formats have shown that the proposed method is applicable to most of the documents commonly encountered in daily use, although there is still room for further refinement of the transformation rules.<<ETX>>"
            },
            "slug": "Understanding-multi-articled-documents-Tsujimoto-Asada",
            "title": {
                "fragments": [],
                "text": "Understanding multi-articled documents"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "Experimental results on a variety of document formats have shown that the proposed method is applicable to most of the documents commonly encountered in daily use, although there is still room for further refinement of the transformation rules."
            },
            "venue": {
                "fragments": [],
                "text": "[1990] Proceedings. 10th International Conference on Pattern Recognition"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2081746109"
                        ],
                        "name": "D. Drivas",
                        "slug": "D.-Drivas",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Drivas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Drivas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144434788"
                        ],
                        "name": "A. Amin",
                        "slug": "A.-Amin",
                        "structuredName": {
                            "firstName": "Adnan",
                            "lastName": "Amin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Amin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61785232,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1caa2d8edf58440c8e3f9c4a7e10faba0bb2fcf9",
            "isKey": false,
            "numCitedBy": 52,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents the use of analysing the connected components extracted from the binary image of a document page. Such an analysis provides a lot of useful information, and will be used to perform skew correction, segmentation and classification of the document. We present a new algorithm for determining the skew angle of lines of text in an image of a document with the advantage that it only performs one iteration to determine the skew angle. Experiments on over 30 pages show that the method works well on a wide variety of layouts, including sparse textual regions, mixed fonts, multiple columns, and even for documents with a high graphical content."
            },
            "slug": "Page-segmentation-and-classification-utilising-a-Drivas-Amin",
            "title": {
                "fragments": [],
                "text": "Page segmentation and classification utilising a bottom-up approach"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A new algorithm for determining the skew angles of lines of text in an image of a document with the advantage that it only performs one iteration to determine the skew angle is presented."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145820949"
                        ],
                        "name": "T. Pavlidis",
                        "slug": "T.-Pavlidis",
                        "structuredName": {
                            "firstName": "Theodosios",
                            "lastName": "Pavlidis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Pavlidis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2461436"
                        ],
                        "name": "Jiangying Zhou",
                        "slug": "Jiangying-Zhou",
                        "structuredName": {
                            "firstName": "Jiangying",
                            "lastName": "Zhou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jiangying Zhou"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23410608,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "999e76f9115af2741b0cd973d875163ae714d5da",
            "isKey": false,
            "numCitedBy": 281,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Page-segmentation-and-classification-Pavlidis-Zhou",
            "title": {
                "fragments": [],
                "text": "Page segmentation and classification"
            },
            "venue": {
                "fragments": [],
                "text": "CVGIP Graph. Model. Image Process."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116415943"
                        ],
                        "name": "B. Yu",
                        "slug": "B.-Yu",
                        "structuredName": {
                            "firstName": "Bin",
                            "lastName": "Yu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Yu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145295484"
                        ],
                        "name": "Anil K. Jain",
                        "slug": "Anil-K.-Jain",
                        "structuredName": {
                            "firstName": "Anil",
                            "lastName": "Jain",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anil K. Jain"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41609314,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ca920e10343757ba0d4151bc8ce152cbd5191bee",
            "isKey": false,
            "numCitedBy": 166,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-robust-and-fast-skew-detection-algorithm-for-Yu-Jain",
            "title": {
                "fragments": [],
                "text": "A robust and fast skew detection algorithm for generic documents"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2144128094"
                        ],
                        "name": "Jiming Liu",
                        "slug": "Jiming-Liu",
                        "structuredName": {
                            "firstName": "Jiming",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jiming Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39702442"
                        ],
                        "name": "Y. Tang",
                        "slug": "Y.-Tang",
                        "structuredName": {
                            "firstName": "Yuan",
                            "lastName": "Tang",
                            "middleNames": [
                                "Yan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Tang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2941896"
                        ],
                        "name": "Qi-Cai He",
                        "slug": "Qi-Cai-He",
                        "structuredName": {
                            "firstName": "Qi-Cai",
                            "lastName": "He",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qi-Cai He"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713795"
                        ],
                        "name": "C. Suen",
                        "slug": "C.-Suen",
                        "structuredName": {
                            "firstName": "Ching",
                            "lastName": "Suen",
                            "middleNames": [
                                "Yee"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Suen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5369728,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "92299a22f0c2d3f2d8b262e63f87020852ec165c",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a generic document segmentation and geometric relation labeling method with applications to document analysis. Unlike the previous document segmentation methods where text spacing, border lines, and/or a priori layout models based template processing are performed, the present method begins with a hierarchy of partitioned image layers where inhomogeneous higher-level regions are recursively positioned into lower-level rectangular subregions and at the same time lower-level smaller homogeneous regions are merged into larger homogeneous regions. The present method differs from the traditional split-and-merge segmentation method in that it orthogonally splits regions using thresholds adaptively computed from projection profiles."
            },
            "slug": "Adaptive-document-segmentation-and-geometric-and-Liu-Tang",
            "title": {
                "fragments": [],
                "text": "Adaptive document segmentation and geometric relation labeling: algorithms and experimental results"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The present method differs from the traditional split-and-merge segmentation method in that it orthogonally splits regions using thresholds adaptively computed from projection profiles."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 13th International Conference on Pattern Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1803149"
                        ],
                        "name": "A. Antonacopoulos",
                        "slug": "A.-Antonacopoulos",
                        "structuredName": {
                            "firstName": "Apostolos",
                            "lastName": "Antonacopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Antonacopoulos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2699810"
                        ],
                        "name": "T. Ritchings",
                        "slug": "T.-Ritchings",
                        "structuredName": {
                            "firstName": "Tim",
                            "lastName": "Ritchings",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Ritchings"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46947302,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "669e43cfb69f9625bd96e6b586463c82fa2b7967",
            "isKey": false,
            "numCitedBy": 48,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper introduces a new method for document page segmentation. This method is based on the analysis of the background white space that surrounds the printed regions on the page. It does not make any assumptions about the shape of the regions as opposed to most earlier approaches which assume that printed regions are rectangular. It is capable of identifying and describing regions of complex shapes more accurately than existing methods. It requires no a priori knowledge. The background white space is covered with tiles and the contour of each region is identified by tracing through these white tiles that encircle it. The method can segment page images with severe skew without skew correction. The white tiles on the image can also be used in subsequent document analysis processes such as the classification of the image regions."
            },
            "slug": "Flexible-page-segmentation-using-the-background-Antonacopoulos-Ritchings",
            "title": {
                "fragments": [],
                "text": "Flexible page segmentation using the background"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "This paper introduces a new method for document page segmentation based on the analysis of the background white space that surrounds the printed regions on the page that is capable of identifying and describing regions of complex shapes more accurately than existing methods."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 12th IAPR International Conference on Pattern Recognition, Vol. 3 - Conference C: Signal Processing (Cat. No.94CH3440-5)"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "15144597"
                        ],
                        "name": "Franck Lebourgeois",
                        "slug": "Franck-Lebourgeois",
                        "structuredName": {
                            "firstName": "Franck",
                            "lastName": "Lebourgeois",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Franck Lebourgeois"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2372426"
                        ],
                        "name": "Z. Bublinski",
                        "slug": "Z.-Bublinski",
                        "structuredName": {
                            "firstName": "Zbigniew",
                            "lastName": "Bublinski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Z. Bublinski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1739381"
                        ],
                        "name": "H. Emptoz",
                        "slug": "H.-Emptoz",
                        "structuredName": {
                            "firstName": "Hubert",
                            "lastName": "Emptoz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Emptoz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62602509,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7a2c3f55e7a84ad5fa5eaa577d8d58ee73e14e2b",
            "isKey": false,
            "numCitedBy": 47,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "Outlines a fast and efficient method for extracting graphics and text paragraphs from printed documents. The method presented is based on bottom-up approach to document analysis and it achieves very good performance in most cases. During the preprocessing characters are linked together to form blocks. Created blocks are segmented, labelled and merged into paragraphs. Simultaneously, graphics are extracted from the image. Algorithms for each step of processing are presented. Also, the obtained experimental results are included.<<ETX>>"
            },
            "slug": "A-fast-and-efficient-method-for-extracting-text-and-Lebourgeois-Bublinski",
            "title": {
                "fragments": [],
                "text": "A fast and efficient method for extracting text paragraphs and graphics from unconstrained documents"
            },
            "tldr": {
                "abstractSimilarityScore": 87,
                "text": "Outlines a fast and efficient method for extracting graphics and text paragraphs from printed documents based on bottom-up approach to document analysis and achieves very good performance in most cases."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings., 11th IAPR International Conference on Pattern Recognition. Vol.II. Conference B: Pattern Recognition Methodology and Systems"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1700821"
                        ],
                        "name": "F. Esposito",
                        "slug": "F.-Esposito",
                        "structuredName": {
                            "firstName": "Floriana",
                            "lastName": "Esposito",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Esposito"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738657"
                        ],
                        "name": "D. Malerba",
                        "slug": "D.-Malerba",
                        "structuredName": {
                            "firstName": "Donato",
                            "lastName": "Malerba",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Malerba"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145467353"
                        ],
                        "name": "G. Semeraro",
                        "slug": "G.-Semeraro",
                        "structuredName": {
                            "firstName": "Giovanni",
                            "lastName": "Semeraro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Semeraro"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14249115,
            "fieldsOfStudy": [
                "Business",
                "Computer Science"
            ],
            "id": "0082e7bd787ad1a9d5c1e74119df328044f5d4a0",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we present a hybrid approach to the problem of the document analysis in which the document image is segmented by means of a top-down technique and then basic blocks are grouped bottom-up in order to form complex layout components. In this latter process, called layout analysis, only generic knowledge on typesetting conventions is exploited. Such knowledge is independent of the particular class of processed documents and turns out to be valuable for a wide range of documents. Preliminary results of the layout analysis system LEX (Layout EXpert) show the methodological validity of this approach."
            },
            "slug": "A-knowledge-based-approach-to-the-layout-analysis-Esposito-Malerba",
            "title": {
                "fragments": [],
                "text": "A knowledge-based approach to the layout analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "A hybrid approach to the problem of the document analysis in which the document image is segmented by means of a top-down technique and then basic blocks are grouped bottom-up in order to form complex layout components."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1700821"
                        ],
                        "name": "F. Esposito",
                        "slug": "F.-Esposito",
                        "structuredName": {
                            "firstName": "Floriana",
                            "lastName": "Esposito",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Esposito"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738657"
                        ],
                        "name": "D. Malerba",
                        "slug": "D.-Malerba",
                        "structuredName": {
                            "firstName": "Donato",
                            "lastName": "Malerba",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Malerba"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145467353"
                        ],
                        "name": "G. Semeraro",
                        "slug": "G.-Semeraro",
                        "structuredName": {
                            "firstName": "Giovanni",
                            "lastName": "Semeraro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Semeraro"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "65753941"
                        ],
                        "name": "E. Annese",
                        "slug": "E.-Annese",
                        "structuredName": {
                            "firstName": "E.",
                            "lastName": "Annese",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Annese"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66898706"
                        ],
                        "name": "G. Scafuro",
                        "slug": "G.-Scafuro",
                        "structuredName": {
                            "firstName": "Giovanna",
                            "lastName": "Scafuro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Scafuro"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 57906470,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d816b0f178c5ea91501eddf8a828dd761e9d7013",
            "isKey": false,
            "numCitedBy": 64,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "A novel approach to automatic classification of digitized office documents based on the inductive generalization of their layout style, is presented. It is supported by the observation that for a number of printed documents it is possible to find a set of relevant and invariant layout features. These are geometrical characteristics automatically detected through a segmentation and layout analysis process. The learning step, in which significant examples of document classes are used to train the classification system, involves the novel idea of integrating parametric (numerical) and conceptual (symbolic) learning methods.<<ETX>>"
            },
            "slug": "An-experimental-page-layout-recognition-system-for-Esposito-Malerba",
            "title": {
                "fragments": [],
                "text": "An experimental page layout recognition system for office document automatic classification: an integrated approach for inductive generalization"
            },
            "tldr": {
                "abstractSimilarityScore": 98,
                "text": "A novel approach to automatic classification of digitized office documents based on the inductive generalization of their layout style, is presented, supported by the observation that for a number of printed documents it is possible to find a set of relevant and invariant layout features."
            },
            "venue": {
                "fragments": [],
                "text": "[1990] Proceedings. 10th International Conference on Pattern Recognition"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1789181"
                        ],
                        "name": "Bertrand Coüasnon",
                        "slug": "Bertrand-Coüasnon",
                        "structuredName": {
                            "firstName": "Bertrand",
                            "lastName": "Coüasnon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bertrand Coüasnon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1760753"
                        ],
                        "name": "J. Camillerapp",
                        "slug": "J.-Camillerapp",
                        "structuredName": {
                            "firstName": "Jean",
                            "lastName": "Camillerapp",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Camillerapp"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 16740341,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "02143c9cffc49ac78423d04c308a9d2872aadb93",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "Optical Music Recognition is a form of document analysis for which a priori knowledge is particularly important. Musical notation is governed by a substantial set of rules, but current systems fail to use them adequately. In complex scores, existing systems cannot overcome the well-known segmentation problems of document analysis, due mainly to the high density of music information. This paper proposes a new method of recognition which uses a grammar in order to formalize the syntactic rules and represent the context. However, where objects touch, there is a discrepancy between the way the existing knowledge (grammar) will describe an object and the way it is recognized, since touching objects have to be segmented first. Following a description of the grammar, this paper shall go on to propose the use of an operator to modify the way the grammar parses the image so that the system can deal with certain touching objects (e.g. where an accidental touches a notehead)."
            },
            "slug": "A-way-to-separate-knowledge-from-program-in-to-Coüasnon-Camillerapp",
            "title": {
                "fragments": [],
                "text": "A way to separate knowledge from program in structured document analysis: application to optical music recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A new method of recognition is proposed which uses a grammar in order to formalize the syntactic rules and represent the context and the use of an operator to modify the way the grammar parses the image so that the system can deal with certain touching objects."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1803149"
                        ],
                        "name": "A. Antonacopoulos",
                        "slug": "A.-Antonacopoulos",
                        "structuredName": {
                            "firstName": "Apostolos",
                            "lastName": "Antonacopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Antonacopoulos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2699810"
                        ],
                        "name": "T. Ritchings",
                        "slug": "T.-Ritchings",
                        "structuredName": {
                            "firstName": "Tim",
                            "lastName": "Ritchings",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Ritchings"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18873767,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "431c4db6a6b80693f7760fa07b710c7116ad783e",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "There is an increasingly pressing need to develop document analysis methods that are able to cope with images of documents containing printed regions of complex shapes. Contrary to the bounding-box representation used in most past page segmentation and classification approaches which assume rectangular regions, there is a need for a more flexible description which also retains most of the functionality of the representation by rectangles. In the first part of this paper, the practical considerations of describing and handling the complex-shaped regions are examined and an appropriate representation scheme is proposed. For page classification, a new approach based on the description of white space inside regions is presented. In contrast to previous page classification approaches, skewed and complex-shaped regions are handled efficiently and the features are derived with no need for time-consuming accesses of the pixel-based image data."
            },
            "slug": "Representation-and-classification-of-complex-shaped-Antonacopoulos-Ritchings",
            "title": {
                "fragments": [],
                "text": "Representation and classification of complex-shaped printed regions using white tiles"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "In contrast to previous page classification approaches, skewed and complex-shaped regions are handled efficiently and the features are derived with no need for time-consuming accesses of the pixel-based image data."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50738156"
                        ],
                        "name": "Teruo Akiyama",
                        "slug": "Teruo-Akiyama",
                        "structuredName": {
                            "firstName": "Teruo",
                            "lastName": "Akiyama",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Teruo Akiyama"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781078"
                        ],
                        "name": "N. Hagita",
                        "slug": "N.-Hagita",
                        "structuredName": {
                            "firstName": "Norihiro",
                            "lastName": "Hagita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Hagita"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 611741,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f8061d131bbaed4369e5879e4fedbe0ea03c17ed",
            "isKey": false,
            "numCitedBy": 257,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Automated-entry-system-for-printed-documents-Akiyama-Hagita",
            "title": {
                "fragments": [],
                "text": "Automated entry system for printed documents"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40562121"
                        ],
                        "name": "N. Amamoto",
                        "slug": "N.-Amamoto",
                        "structuredName": {
                            "firstName": "Naohiro",
                            "lastName": "Amamoto",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Amamoto"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "71197433"
                        ],
                        "name": "Shin Torigoe",
                        "slug": "Shin-Torigoe",
                        "structuredName": {
                            "firstName": "Shin",
                            "lastName": "Torigoe",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Shin Torigoe"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49788722"
                        ],
                        "name": "Yoshitaka Hirogaki",
                        "slug": "Yoshitaka-Hirogaki",
                        "structuredName": {
                            "firstName": "Yoshitaka",
                            "lastName": "Hirogaki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yoshitaka Hirogaki"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27805018,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6aced08ac04f06e282c1558921d0f3a087037a14",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "The development of a computational method for extracting character portions from a complicated document is described. The goal of the proposed method is to realize a practical document structure analysis for advanced optical character recognition systems with document databases. The authors mainly discuss a structural extraction technique called \"text area extraction\" which locates all text areas in 255 of the 309 (83%) evaluation documents.<<ETX>>"
            },
            "slug": "Block-segmentation-and-text-area-extraction-of-Amamoto-Torigoe",
            "title": {
                "fragments": [],
                "text": "Block segmentation and text area extraction of vertically/horizontally written document"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The authors mainly discuss a structural extraction technique called \"text area extraction\" which locates all text areas in 255 of the 309 (83%) evaluation documents."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1751773"
                        ],
                        "name": "M. Krishnamoorthy",
                        "slug": "M.-Krishnamoorthy",
                        "structuredName": {
                            "firstName": "Mukkai",
                            "lastName": "Krishnamoorthy",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Krishnamoorthy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145062511"
                        ],
                        "name": "S. Seth",
                        "slug": "S.-Seth",
                        "structuredName": {
                            "firstName": "Sharad",
                            "lastName": "Seth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Seth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145266621"
                        ],
                        "name": "M. Viswanathan",
                        "slug": "M.-Viswanathan",
                        "structuredName": {
                            "firstName": "Mahesh",
                            "lastName": "Viswanathan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Viswanathan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 16107554,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "717a4ae91ad20667f7ac03ce5538eff36313c299",
            "isKey": false,
            "numCitedBy": 163,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "A method for extracting alternating horizontal and vertical projection profiles are from nested sub-blocks of scanned page images of technical documents is discussed. The thresholded profile strings are parsed using the compiler utilities Lex and Yacc. The significant document components are demarcated and identified by the recursive application of block grammars. Backtracking for error recovery and branch and bound for maximum-area labeling are implemented with Unix Shell programs. Results of the segmentation and labeling process are stored in a labeled x-y tree. It is shown that families of technical documents that share the same layout conventions can be readily analyzed. Results from experiments in which more than 20 types of document entities were identified in sample pages from two journals are presented. >"
            },
            "slug": "Syntactic-Segmentation-and-Labeling-of-Digitized-Krishnamoorthy-Nagy",
            "title": {
                "fragments": [],
                "text": "Syntactic Segmentation and Labeling of Digitized Pages from Technical Journals"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "It is shown that families of technical documents that share the same layout conventions can be readily analyzed and backtracking for error recovery and branch and bound for maximum-area labeling are implemented with Unix Shell programs."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1896610"
                        ],
                        "name": "S. Randriamasy",
                        "slug": "S.-Randriamasy",
                        "structuredName": {
                            "firstName": "Sabine",
                            "lastName": "Randriamasy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Randriamasy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1820595"
                        ],
                        "name": "L. Vincent",
                        "slug": "L.-Vincent",
                        "structuredName": {
                            "firstName": "Luc",
                            "lastName": "Vincent",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Vincent"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6941199,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9f05833210f2b2e2f495594aeb98ff66e30c8fa1",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "A method for automatically evaluating the quality of document page segmentation algorithms is introduced. Many different zoning techniques are now available but there is no robust method available to benchmark and evaluate them reliably. Our proposed strategy is a region-based approach, in which segmentation results are compared with manually generated \"ground truth files\", describing all possible correct segmentations. A segmentation ground truthing scheme has been proposed. The evaluation of segmentation quality is achieved by testing the overlap between the two sets of regions. In fact, the regions are defined as the \"black\" pixels contained in the extracted polygons. An explicit specification of segmentation errors and a numerical evaluation are derived. The algorithm is simple and fast, and provides a multi-level output for each segmentation.<<ETX>>"
            },
            "slug": "Benchmarking-page-segmentation-algorithms-Randriamasy-Vincent",
            "title": {
                "fragments": [],
                "text": "Benchmarking page segmentation algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A method for automatically evaluating the quality of document page segmentation algorithms is introduced, in which segmentation results are compared with manually generated \"ground truth files\", describing all possible correct segmentations."
            },
            "venue": {
                "fragments": [],
                "text": "1994 Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145295484"
                        ],
                        "name": "Anil K. Jain",
                        "slug": "Anil-K.-Jain",
                        "structuredName": {
                            "firstName": "Anil",
                            "lastName": "Jain",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anil K. Jain"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39319377"
                        ],
                        "name": "Yu Zhong",
                        "slug": "Yu-Zhong",
                        "structuredName": {
                            "firstName": "Yu",
                            "lastName": "Zhong",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yu Zhong"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 39821816,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "14371d83ac90edc11b3604d4bf64915f99e45678",
            "isKey": false,
            "numCitedBy": 220,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Page-segmentation-using-tecture-analysis-Jain-Zhong",
            "title": {
                "fragments": [],
                "text": "Page segmentation using tecture analysis"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3055160"
                        ],
                        "name": "David J. Ittner",
                        "slug": "David-J.-Ittner",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Ittner",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David J. Ittner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5360061,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4bc5bf7115142885992f99516169ea24bf18b529",
            "isKey": false,
            "numCitedBy": 86,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "A system for isolating blocks, lines, words, and symbols within images of machine-printed textual documents that is, to a large existent, independent of language and writing system is described. This is achieved by exploiting a small number of nearly universal typesetting and layout conventions. The system does not require prior knowledge of page orientation (module 90/spl deg/), and copes well with nonzero skew and shear angles (within 10/spl deg/). Also it locates blocks of text without reliance on detailed a priori layout models, and in spite of unknown or mixed horizontal and vertical text-line orientations. Within blocks, it infers text-line orientation and isolates lines, without knowledge of the language, symbol set, text sizes, or the number of text lines. Segmentation into words and symbols, and determination of reading order, normally require some knowledge of the language: this is held to minimum by relying on shape-driven algorithms. The underlying algorithms are based on Fourier theory, digital signal processing, computational geometry, and statistical decision theory. Most of the computation occurs within algorithms that possess unambiguous semantics (that is, heuristics are kept to a minimum). The effectiveness of the method on English, Japanese, Hebrew, Thai, and Korean documents is discussed.<<ETX>>"
            },
            "slug": "Language-free-layout-analysis-Ittner-Baird",
            "title": {
                "fragments": [],
                "text": "Language-free layout analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "A system for isolating blocks, lines, words, and symbols within images of machine-printed textual documents that is, to a large existent, independent of language and writing system is described, achieved by exploiting a small number of nearly universal typesetting and layout conventions."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1945685"
                        ],
                        "name": "Don Sylwester",
                        "slug": "Don-Sylwester",
                        "structuredName": {
                            "firstName": "Don",
                            "lastName": "Sylwester",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Don Sylwester"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145062511"
                        ],
                        "name": "S. Seth",
                        "slug": "S.-Seth",
                        "structuredName": {
                            "firstName": "Sharad",
                            "lastName": "Seth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Seth"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 690733,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "0f1f02ed8cb0a5145cfa99df6f5be35e2c0cff7d",
            "isKey": false,
            "numCitedBy": 20,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Column segmentation logically precedes OCR in the document analysis process. The trainable algorithm XYCUT relies on horizontal and vertical binary profiles to produce an XY-tree representing the column structure of a page of a technical document in a single pass through the bit image. Training against ground truth adjusts a single, resolution independent, parameter using only local information and guided by an edit distance function. The algorithm correctly segments the page image for a (fairly) wide range of parameter values, although small, local and repairable errors may be made, an effect measured by a repair cost function."
            },
            "slug": "A-trainable,-single-pass-algorithm-for-column-Sylwester-Seth",
            "title": {
                "fragments": [],
                "text": "A trainable, single-pass algorithm for column segmentation"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "Column segmentation logically precedes OCR in the document analysis process and correctly segments the page image for a (fairly) wide range of parameter values, although small, local and repairable errors may be made, an effect measured by a repair cost function."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3277321"
                        ],
                        "name": "K. Kise",
                        "slug": "K.-Kise",
                        "structuredName": {
                            "firstName": "Koichi",
                            "lastName": "Kise",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Kise"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "113154928"
                        ],
                        "name": "O. Yanagida",
                        "slug": "O.-Yanagida",
                        "structuredName": {
                            "firstName": "Osamu",
                            "lastName": "Yanagida",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Yanagida"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143882780"
                        ],
                        "name": "S. Takamatsu",
                        "slug": "S.-Takamatsu",
                        "structuredName": {
                            "firstName": "Shinobu",
                            "lastName": "Takamatsu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Takamatsu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41049994,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "f5b0110c64d0bf696dc12bee3d3f2b97e87c7521",
            "isKey": false,
            "numCitedBy": 35,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a new method of page segmentation based on the analysis of background (white areas). The proposed method is capable of segmenting pages with non-rectangular layout as well as with various angles of skew. The characteristics of the method are as follows: (1) thinning of the background enables us to represent white areas of any shape as connected thin lines or chains and the robustness for tilted page images is also achieved by the representation; and (2) based on this representation, the task of page segmentation is defined as to find the loops enclosing printed areas. The task is achieved by eliminating unnecessary chains using not only a feature of white areas, but also a feature of black areas divided by a chain. Based on the experimental results and the comparison with previous methods, we discuss the advantages and limitations of the proposed method."
            },
            "slug": "Page-segmentation-based-on-thinning-of-background-Kise-Yanagida",
            "title": {
                "fragments": [],
                "text": "Page segmentation based on thinning of background"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "The proposed method is capable of segmenting pages with non-rectangular layout as well as with various angles of skew, and the advantages and limitations of the proposed method are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 13th International Conference on Pattern Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116415943"
                        ],
                        "name": "B. Yu",
                        "slug": "B.-Yu",
                        "structuredName": {
                            "firstName": "Bin",
                            "lastName": "Yu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Yu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145295484"
                        ],
                        "name": "Anil K. Jain",
                        "slug": "Anil-K.-Jain",
                        "structuredName": {
                            "firstName": "Anil",
                            "lastName": "Jain",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anil K. Jain"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 38916969,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6c41d71ca5ae222ab72d16f254edb5fbd4e2de93",
            "isKey": false,
            "numCitedBy": 134,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "Recent advances in intelligent character recognition are enabling us to address many challenging problems in document image analysis. One of them is intelligent form analysis. This paper describes a generic system for form dropout when the filled-in characters or symbols are either touching or crossing the form frames. We propose a method to separate these characters from form frames whose locations are unknown. Since some of the character strokes are either touching or crossing the form frames, we need to address the following three issues: 1) localization of form frames; 2) separation of characters and form frames; and 3) reconstruction of broken strokes introduced during separation. The form frame is automatically located by finding long straight lines based on the block adjacency graph. Form frame separation and character reconstruction are implemented by means of this graph. The proposed system includes form structure learning and form dropout. First, a form structure-based template is automatically generated from a blank form which includes form frames, preprinted data areas and skew angle. With this form template, our system can then extract both handwritten and machine-typed filled-in data. Experimental results on three different types of forms show the performance of our system. Further, the proposed method is robust to noise and skew that is introduced during scanning."
            },
            "slug": "A-Generic-System-for-Form-Dropout-Yu-Jain",
            "title": {
                "fragments": [],
                "text": "A Generic System for Form Dropout"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A generic system for form dropout when the filled-in characters or symbols are either touching or crossing the form frames and a method to separate these characters from form frames whose locations are unknown is proposed."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2111216375"
                        ],
                        "name": "Dacheng Wang",
                        "slug": "Dacheng-Wang",
                        "structuredName": {
                            "firstName": "Dacheng",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dacheng Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696384"
                        ],
                        "name": "S. Srihari",
                        "slug": "S.-Srihari",
                        "structuredName": {
                            "firstName": "Sargur",
                            "lastName": "Srihari",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Srihari"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26685555,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "873fa0ca7454bd1ca4de25128c522e088b635ddc",
            "isKey": false,
            "numCitedBy": 250,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Classification-of-newspaper-image-blocks-using-Wang-Srihari",
            "title": {
                "fragments": [],
                "text": "Classification of newspaper image blocks using texture analysis"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2148700"
                        ],
                        "name": "O. Akindele",
                        "slug": "O.-Akindele",
                        "structuredName": {
                            "firstName": "O.",
                            "lastName": "Akindele",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Akindele"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2128453"
                        ],
                        "name": "A. Belaïd",
                        "slug": "A.-Belaïd",
                        "structuredName": {
                            "firstName": "Abdel",
                            "lastName": "Belaïd",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Belaïd"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 41120654,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "34f76569e4e33d2572ece2ae268960423b89f29f",
            "isKey": false,
            "numCitedBy": 33,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "A page segmentation method that allows one to cut a document page image into polygonal blocks as well as into classical rectangular blocks is described. The intercolumn and interparagraph gaps are extracted as horizontal and vertical lines. The points of intersection between these lines are treated as vertices of polygonal blocks. With the aid of the 4-connected chain codes and an intersection table, simple isothetic polygonal blocks are constructed from these points of intersection.<<ETX>>"
            },
            "slug": "Page-segmentation-by-segment-tracing-Akindele-Belaïd",
            "title": {
                "fragments": [],
                "text": "Page segmentation by segment tracing"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "A page segmentation method that allows one to cut a document page image into polygonal blocks as well as into classical rectangular blocks is described."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723766"
                        ],
                        "name": "H. Baird",
                        "slug": "H.-Baird",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Baird",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Baird"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61890978,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "9b0ac5a41c2742de9695810dadab2c156028f730",
            "isKey": false,
            "numCitedBy": 94,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "An experimental printed-page reader that is easy to adapt to various languages is described. Changing the target language may involve simultaneous changes in symbol sets, typefaces, sizes of text, page layouts, linguistic contexts, and imaging defects. The strategy has been to isolate the effects of these sources of variation within separate, independent engineering subsystems. In this way, it has been possible to construct, with a minimum of manual effort, classifiers for arbitrary combinations of symbols, typefaces, sizes, and imaging defects. An attempt has been made to rid the algorithms of all language-specific rules, relying instead on automatic learning from examples and generalized table-driven methods. For some tasks it has been feasible to avoid language dependency altogether. Linguistic context can be exploited through data-directed filtering algorithms in a uniform and modular manner, so that preexisting tools developed by computational linguistics can readily be applied. These principles are illustrated by trials on English, Swedish, Tibetan, and special technical texts. >"
            },
            "slug": "Anatomy-of-a-versatile-page-reader-Baird",
            "title": {
                "fragments": [],
                "text": "Anatomy of a versatile page reader"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "An experimental printed-page reader that is easy to adapt to various languages is described, and an attempt has been made to rid the algorithms of all language-specific rules, relying instead on automatic learning from examples and generalized table-driven methods."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144081526"
                        ],
                        "name": "A. A. Zlatopolsky",
                        "slug": "A.-A.-Zlatopolsky",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Zlatopolsky",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. A. Zlatopolsky"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 36823878,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "47d84273587aa07a40c2b5171aa5b2a617e69663",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Automated-document-segmentation-Zlatopolsky",
            "title": {
                "fragments": [],
                "text": "Automated document segmentation"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit. Lett."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3454144"
                        ],
                        "name": "J. S. Payne",
                        "slug": "J.-S.-Payne",
                        "structuredName": {
                            "firstName": "Janet",
                            "lastName": "Payne",
                            "middleNames": [
                                "Susan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. S. Payne"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145564802"
                        ],
                        "name": "T. Stonham",
                        "slug": "T.-Stonham",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Stonham",
                            "middleNames": [
                                "John"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Stonham"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144140767"
                        ],
                        "name": "D. Patel",
                        "slug": "D.-Patel",
                        "structuredName": {
                            "firstName": "Devesh",
                            "lastName": "Patel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Patel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46942828,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "08c45a95a5cbdd1b2f2c05b72306dd0e8c058f16",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes the application of a novel texture recognition strategy, which involves the assembly of n/sup th/ order co-occurrence information within a processing window. The resulting spectrum is processed by a nearest neighbour classifier, and discontinuities in the classification as the operating window scans the image are recognized as texture boundaries. The technique is being applied for the first time to segmenting newsprint, in order to locate the text regions for effective data capture. Previous methods applied to the task discussed in the paper, have used run-length encoding and block analysis, Gabor filters, or component analysis. The co-occurrence method offers significant advantages in processing time and ease of implementation."
            },
            "slug": "Document-segmentation-using-texture-analysis-Payne-Stonham",
            "title": {
                "fragments": [],
                "text": "Document segmentation using texture analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "A novel texture recognition strategy, which involves the assembly of n/sup th/ order co-occurrence information within a processing window, is described, which offers significant advantages in processing time and ease of implementation."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 12th IAPR International Conference on Pattern Recognition, Vol. 3 - Conference C: Signal Processing (Cat. No.94CH3440-5)"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2122930"
                        ],
                        "name": "J. Ha",
                        "slug": "J.-Ha",
                        "structuredName": {
                            "firstName": "Jaekyu",
                            "lastName": "Ha",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Ha"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1744200"
                        ],
                        "name": "I. T. Phillips",
                        "slug": "I.-T.-Phillips",
                        "structuredName": {
                            "firstName": "Ihsin",
                            "lastName": "Phillips",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. T. Phillips"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17179084,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f03c5e7b1e66936544eaf329cbe38c57ccf5feb0",
            "isKey": false,
            "numCitedBy": 176,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "A top-down page segmentation technique known as the recursive X-Y cut decomposes a document image recursively into a set of rectangular blocks. This paper proposes that the recursive X-Y cut be implemented using bounding boxes of connected components of black pixels instead of using image pixels. The advantage is that great improvement can be achieved in computation. In fact, once bounding boxes of connected components are obtained, the recursive X-Y cut is completed within an order of a second on Sparc-10 workstations for letter-sized document images scanned at 900 dpi resolution."
            },
            "slug": "Recursive-X-Y-cut-using-bounding-boxes-of-connected-Ha-Haralick",
            "title": {
                "fragments": [],
                "text": "Recursive X-Y cut using bounding boxes of connected components"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This paper proposes that the recursive X-Y cut be implemented using bounding boxes of connected components of black pixels instead of using image pixels, so that great improvement can be achieved in computation."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145279674"
                        ],
                        "name": "A. Dengel",
                        "slug": "A.-Dengel",
                        "structuredName": {
                            "firstName": "Andreas",
                            "lastName": "Dengel",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Dengel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15374988,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d3fbe7c50b3a10691ee7f54e5bc12f540f88bc29",
            "isKey": false,
            "numCitedBy": 45,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Proposes an approach for automatically generating a decision tree which is applied as a model for the logical labeling of business letters. Instead of top-down determination of the discriminating attributes, the system inspects a finite set of document instances that are presented to a learner in a bottom-up position. The learner itself figures out local similarities, rates them with respect to the overall structure, and determines the best structural match of two instances (neighborhood). The entire decision tree is grown step by step deducing subtrees by forming generalizations from a neighborhood. Consequently, heuristics are learned for structurally discriminating documents during subsequent classification.<<ETX>>"
            },
            "slug": "Initial-learning-of-document-structure-Dengel",
            "title": {
                "fragments": [],
                "text": "Initial learning of document structure"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "An approach for automatically generating a decision tree which is applied as a model for the logical labeling of business letters, which inspects a finite set of document instances that are presented to a learner in a bottom-up position."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2174856"
                        ],
                        "name": "S. Zenzo",
                        "slug": "S.-Zenzo",
                        "structuredName": {
                            "firstName": "Silvano",
                            "lastName": "Zenzo",
                            "middleNames": [
                                "Di"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Zenzo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729018"
                        ],
                        "name": "L. Cinque",
                        "slug": "L.-Cinque",
                        "structuredName": {
                            "firstName": "Luigi",
                            "lastName": "Cinque",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Cinque"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1990702"
                        ],
                        "name": "S. Levialdi",
                        "slug": "S.-Levialdi",
                        "structuredName": {
                            "firstName": "Stefano",
                            "lastName": "Levialdi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Levialdi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37894930,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ef8ded12323a0a79fb55c79383d8174eb1821b10",
            "isKey": false,
            "numCitedBy": 88,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we suggest a variant of a binary image representation based on run length encoding. This variant allows one to build a \"graph representation\" for a number of computing tasks like component labeling, computations of Euler number, diameter and convex hull, and the detection of local extrema and multiple points. Finally, a running application in the raster-to-vector conversion of digital maps is provide."
            },
            "slug": "Run-Based-Algorithms-for-Binary-Image-Analysis-and-Zenzo-Cinque",
            "title": {
                "fragments": [],
                "text": "Run-Based Algorithms for Binary Image Analysis and Processing"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "A variant of a binary image representation based on run length encoding is suggested, which allows one to build a \"graph representation\" for a number of computing tasks like component labeling, computations of Euler number, diameter and convex hull, and the detection of local extrema and multiple points."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116415943"
                        ],
                        "name": "B. Yu",
                        "slug": "B.-Yu",
                        "structuredName": {
                            "firstName": "Bin",
                            "lastName": "Yu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Yu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145295484"
                        ],
                        "name": "Anil K. Jain",
                        "slug": "Anil-K.-Jain",
                        "structuredName": {
                            "firstName": "Anil",
                            "lastName": "Jain",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anil K. Jain"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153701268"
                        ],
                        "name": "M. Mohiuddin",
                        "slug": "M.-Mohiuddin",
                        "structuredName": {
                            "firstName": "Marzia",
                            "lastName": "Mohiuddin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Mohiuddin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61109635,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "e9f890d2ce8b6ef47301312a768366fec32ba1a0",
            "isKey": false,
            "numCitedBy": 63,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "Unlike simple letter envelopes which have a high degree of global spatial structure among a limited number of entities, many mail pieces such as magazines usually have an address block printed on a label which can be pasted in an arbitrary position and orientation among text, graphics and images on a magazine cover, which is often shrink wrapped. This work concentrates on address block location for complex mail pieces with an arbitrary layout of printed entities. Using a bottom-up approach, a pyramid model is created for the address block. Based on this model, some features are extracted for assigning a confidence value to the located address blocks. The typical processing time for locating a destination address block is 0.1 seconds on a SGI Indy workstation."
            },
            "slug": "Address-block-location-on-complex-mail-pieces-Yu-Jain",
            "title": {
                "fragments": [],
                "text": "Address block location on complex mail pieces"
            },
            "tldr": {
                "abstractSimilarityScore": 36,
                "text": "Using a bottom-up approach, a pyramid model is created for the address block and some features are extracted for assigning a confidence value to the located address blocks."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Fourth International Conference on Document Analysis and Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143961578"
                        ],
                        "name": "Kuo-Chin Fan",
                        "slug": "Kuo-Chin-Fan",
                        "structuredName": {
                            "firstName": "Kuo-Chin",
                            "lastName": "Fan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kuo-Chin Fan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2720398"
                        ],
                        "name": "Liang-Shen Wang",
                        "slug": "Liang-Shen-Wang",
                        "structuredName": {
                            "firstName": "Liang-Shen",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Liang-Shen Wang"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 45584563,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "27bcf85bab6fd4b9c6a7f30dff49913e76254f2b",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Classification-of-document-blocks-using-density-and-Fan-Wang",
            "title": {
                "fragments": [],
                "text": "Classification of document blocks using density feature and connectivity histogram"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit. Lett."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61651523,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "19b2308e9bbe77d2059706891a757bb90cb73049",
            "isKey": false,
            "numCitedBy": 130,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "It is argued that it is time for a major change of approach to optical character recognition (OCR) research. The traditional approach, focusing on the correct classification of isolated characters, has been exhausted. The demonstration of the superiority of a new classification method under operational conditions requires large experimental facilities and databases beyond the resources of most researchers. In any case, even perfect classification of individual characters is insufficient for the conversion of complex archival documents to a useful computer-readable form. Many practical OCR tasks require integrated treatment of entire documents and well-organized typographic and domain-specific knowledge. New OCR systems should take advantage of the typographic uniformity of paragraphs or other layout components. They should also exploit the unavoidable interaction with human operators to improve themselves without explicit 'training'. >"
            },
            "slug": "At-the-frontiers-of-OCR-Nagy",
            "title": {
                "fragments": [],
                "text": "At the frontiers of OCR"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "It is argued that it is time for a major change of approach to optical character recognition (OCR) research, and new OCR systems should take advantage of the typographic uniformity of paragraphs or other layout components."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32244730"
                        ],
                        "name": "R. Sivaramakrishnan",
                        "slug": "R.-Sivaramakrishnan",
                        "structuredName": {
                            "firstName": "Ramaswamy",
                            "lastName": "Sivaramakrishnan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Sivaramakrishnan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1744200"
                        ],
                        "name": "I. T. Phillips",
                        "slug": "I.-T.-Phillips",
                        "structuredName": {
                            "firstName": "Ihsin",
                            "lastName": "Phillips",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. T. Phillips"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2122930"
                        ],
                        "name": "J. Ha",
                        "slug": "J.-Ha",
                        "structuredName": {
                            "firstName": "Jaekyu",
                            "lastName": "Ha",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Ha"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3954428"
                        ],
                        "name": "S. Subramanium",
                        "slug": "S.-Subramanium",
                        "structuredName": {
                            "firstName": "Suresh",
                            "lastName": "Subramanium",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Subramanium"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 964787,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6bf02c6fbed2b2ef308f0b0d2c3eb733467a7d8e",
            "isKey": false,
            "numCitedBy": 23,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "A document can be divided into zones on the basis of its content. For example, a zone can be either text or non-text. This paper describes an algorithm to classify each given document zone into one of nine different classes. Features for each zone such as run length mean and variance, spatial mean and variance, fraction of the total number of black pixels in the zone, and the zone width ratio for each zone are extracted. Run length related features are computed along four different canonical directions. A decision tree classifier is used to assign a zone class on the basis of its feature vector. The performance on an independent test set was 97%."
            },
            "slug": "Zone-classification-in-a-document-using-the-method-Sivaramakrishnan-Phillips",
            "title": {
                "fragments": [],
                "text": "Zone classification in a document using the method of feature vector generation"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "An algorithm to classify each given document zone into one of nine different classes by using a decision tree classifier to assign a zone class on the basis of its feature vector."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1700821"
                        ],
                        "name": "F. Esposito",
                        "slug": "F.-Esposito",
                        "structuredName": {
                            "firstName": "Floriana",
                            "lastName": "Esposito",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Esposito"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1738657"
                        ],
                        "name": "D. Malerba",
                        "slug": "D.-Malerba",
                        "structuredName": {
                            "firstName": "Donato",
                            "lastName": "Malerba",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Malerba"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145467353"
                        ],
                        "name": "G. Semeraro",
                        "slug": "G.-Semeraro",
                        "structuredName": {
                            "firstName": "Giovanni",
                            "lastName": "Semeraro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Semeraro"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35702208,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c8f460360e932140827d341b2d1bfa65cb614b4a",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "A study on the possibility of adopting a supervised inductive learning approach to the problem of document understanding is presented. A representation language used to describe a page layout is introduced and the opportunity of extending such a language by means of intentionally defined predicates is discussed. Experimental results obtained by using a well-known learning system, FOCL, are presented. They confirm the exigency of redefining the problem of document understanding in terms of a new strategy of supervised inductive learning, called contextual learning. Some experiments in which a dependence hierarchy between concepts is defined show that contextual rules increase predictive accuracy and decrease learning time for labeling problems like document understanding.<<ETX>>"
            },
            "slug": "Automated-acquisition-of-rules-for-document-Esposito-Malerba",
            "title": {
                "fragments": [],
                "text": "Automated acquisition of rules for document understanding"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "Experimental results obtained by using a well-known learning system, FOCL, confirm the exigency of redefining the problem of document understanding in terms of a new strategy of supervised inductive learning, called contextual learning."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1744200"
                        ],
                        "name": "I. T. Phillips",
                        "slug": "I.-T.-Phillips",
                        "structuredName": {
                            "firstName": "Ihsin",
                            "lastName": "Phillips",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. T. Phillips"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2111237291"
                        ],
                        "name": "Su S. Chen",
                        "slug": "Su-S.-Chen",
                        "structuredName": {
                            "firstName": "Su",
                            "lastName": "Chen",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Su S. Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 3258255,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "de1580d4cc0c47e4985c8ce52d106c6a7432ff70",
            "isKey": false,
            "numCitedBy": 127,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "The design of a comprehensive standard document database for machine-printed documents is presented. The effort to produce a series of carefully ground-truthed document databases to be issued on CD-ROMs is described in detail. The databases can be utilized by the OCR and document understanding community as a common platform to develop, test, and evaluate their algorithms.<<ETX>>"
            },
            "slug": "CD-ROM-document-database-standard-Phillips-Chen",
            "title": {
                "fragments": [],
                "text": "CD-ROM document database standard"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "The design of a comprehensive standard document database for machine-printed documents is presented and can be utilized by the OCR and document understanding community as a common platform to develop, test, and evaluate their algorithms."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 2nd International Conference on Document Analysis and Recognition (ICDAR '93)"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145295484"
                        ],
                        "name": "Anil K. Jain",
                        "slug": "Anil-K.-Jain",
                        "structuredName": {
                            "firstName": "Anil",
                            "lastName": "Jain",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anil K. Jain"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145211604"
                        ],
                        "name": "K. Karu",
                        "slug": "K.-Karu",
                        "structuredName": {
                            "firstName": "Kalle",
                            "lastName": "Karu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Karu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 20133451,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bfbafbc47d9ad9722047bf7c15d88d9bf4762744",
            "isKey": false,
            "numCitedBy": 216,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "Texture segmentation using multichannel filtering involves applying a set of masks to an input image, and then grouping the pixels based on the responses to these masks. We solve the problem of finding an optimal set of masks by designing a neural network which is trained to maximize a relevant function. Two algorithms, the centroid algorithm and the gradient descent algorithm, are used to train the network. Experimental results on segmenting two natural textures and extracting barcodes in an image are reported, and the error rates compared for both the algorithms with different network configurations. The centroid algorithm gives better results in small parameter spaces, whereas the gradient descent algorithm works better with more parameters. Our method of automatically generating texture discrimination masks not only results in a good segmentation performance, but also reduces the dimensionality of the feature space compared to previously published multichannel filtering methods.<<ETX>>"
            },
            "slug": "Learning-texture-discrimination-masks-Jain-Karu",
            "title": {
                "fragments": [],
                "text": "Learning Texture Discrimination Masks"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The method of automatically generating texture discrimination masks not only results in a good segmentation performance, but also reduces the dimensionality of the feature space compared to previously published multichannel filtering methods."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145831634"
                        ],
                        "name": "D. Chetverikov",
                        "slug": "D.-Chetverikov",
                        "structuredName": {
                            "firstName": "Dmitry",
                            "lastName": "Chetverikov",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Chetverikov"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1780258"
                        ],
                        "name": "Jisheng Liang",
                        "slug": "Jisheng-Liang",
                        "structuredName": {
                            "firstName": "Jisheng",
                            "lastName": "Liang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jisheng Liang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2022820"
                        ],
                        "name": "József Kömüves",
                        "slug": "József-Kömüves",
                        "structuredName": {
                            "firstName": "József",
                            "lastName": "Kömüves",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "József Kömüves"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710238"
                        ],
                        "name": "R. Haralick",
                        "slug": "R.-Haralick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Haralick",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Haralick"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3371436,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1c5be6997177980d11d82829be8ff58ca9a2f92a",
            "isKey": false,
            "numCitedBy": 49,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "We consider the problem of zone classification in document image processing. Document blocks are labelled as text or nontext using texture features derived from a feature based interaction map (FBIM), a recently introduced general tool for texture analysis. The zone classification procedure proposed is tested on the comprehensive document image database UW-I created at the University of Washington in Seattle. Different classification procedures are considered. The performance ranges from 96% to 98% using 6 FBIM texture features only."
            },
            "slug": "Zone-classification-using-texture-features-Chetverikov-Liang",
            "title": {
                "fragments": [],
                "text": "Zone classification using texture features"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The zone classification procedure proposed is tested on the comprehensive document image database UW-I created at the University of Washington in Seattle and the performance ranges from 96% to 98% using 6 FBIM texture features only."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 13th International Conference on Pattern Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39702442"
                        ],
                        "name": "Y. Tang",
                        "slug": "Y.-Tang",
                        "structuredName": {
                            "firstName": "Yuan",
                            "lastName": "Tang",
                            "middleNames": [
                                "Yan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Tang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143607634"
                        ],
                        "name": "Hong Ma",
                        "slug": "Hong-Ma",
                        "structuredName": {
                            "firstName": "Hong",
                            "lastName": "Ma",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hong Ma"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46701493"
                        ],
                        "name": "Xiaogang Mao",
                        "slug": "Xiaogang-Mao",
                        "structuredName": {
                            "firstName": "Xiaogang",
                            "lastName": "Mao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Xiaogang Mao"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2118822004"
                        ],
                        "name": "Dan Liu",
                        "slug": "Dan-Liu",
                        "structuredName": {
                            "firstName": "Dan",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dan Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713795"
                        ],
                        "name": "C. Suen",
                        "slug": "C.-Suen",
                        "structuredName": {
                            "firstName": "Ching",
                            "lastName": "Suen",
                            "middleNames": [
                                "Yee"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Suen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34262339,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c31fa4fbc530c7ec28c5561cc09104cbba5da3d0",
            "isKey": false,
            "numCitedBy": 27,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a new approach to document analysis. The proposed approach is based on modified fractal signature. Instead of the time-consuming traditional approaches (top-down and bottom-up approaches) where iterative operations are necessary to break a document into blocks to extract its geometric (layout) structure, this new approach can divide a document into blocks in only one step. This approach can be used to process documents with high geometrical complexity. Experiments have been conducted to prove the proposed new approach for document processing."
            },
            "slug": "A-new-approach-to-document-analysis-based-on-Tang-Ma",
            "title": {
                "fragments": [],
                "text": "A new approach to document analysis based on modified fractal signature"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "This paper presents a new approach to document analysis based on modified fractal signature that can divide a document into blocks in only one step and be used to process documents with high geometrical complexity."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2499975"
                        ],
                        "name": "J. Kanai",
                        "slug": "J.-Kanai",
                        "structuredName": {
                            "firstName": "Junichi",
                            "lastName": "Kanai",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kanai"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688357"
                        ],
                        "name": "S. V. Rice",
                        "slug": "S.-V.-Rice",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Rice",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. V. Rice"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688975"
                        ],
                        "name": "T. Nartker",
                        "slug": "T.-Nartker",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Nartker",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Nartker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 30733052,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5bd99ebf0bbe9a8513350d9eae4f3570c99d559b",
            "isKey": false,
            "numCitedBy": 100,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Many current optical character recognition (OCR) systems attempt to decompose printed pages into a set of zones, each containing a single column of text, before converting the characters into coded form. The authors present a methodology for automatically assessing the accuracy of such decompositions, and demonstrate its use in evaluating six OCR systems. >"
            },
            "slug": "Automated-Evaluation-of-OCR-Zoning-Kanai-Rice",
            "title": {
                "fragments": [],
                "text": "Automated Evaluation of OCR Zoning"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "A methodology for automatically assessing the accuracy of optical character recognition decompositions is presented, and its use in evaluating six OCR systems is demonstrated."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116415943"
                        ],
                        "name": "B. Yu",
                        "slug": "B.-Yu",
                        "structuredName": {
                            "firstName": "Bin",
                            "lastName": "Yu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Yu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37838547,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f6eaca354660e70df0b0756d4270ea4284c853ca",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "A symbol-connected diagram is mainly composed of symbols and their connections. All symbols can be categorized into two groups: shape symbols and structure symbols. This paper proposes a system for automatic understanding of symbol-connected diagrams based on a graph, called the consistent attributed graph (CAG), which represents the diagram in a bottom-up fashion. The shape symbol processing is carried out by means of shape processing, followed by shape symbol identification with the use of two symbol windows in the CAG. Some experimental results for understanding logic circuit diagrams are given."
            },
            "slug": "Automatic-understanding-of-symbol-connected-Yu",
            "title": {
                "fragments": [],
                "text": "Automatic understanding of symbol-connected diagrams"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A system for automatic understanding of symbol-connected diagrams based on a graph, called the consistent attributed graph (CAG), which represents the diagram in a bottom-up fashion is proposed."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd International Conference on Document Analysis and Recognition"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52582926"
                        ],
                        "name": "Recognition",
                        "slug": "Recognition",
                        "structuredName": {
                            "firstName": "",
                            "lastName": "Recognition",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Recognition"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69344150"
                        ],
                        "name": "Iapr Tc",
                        "slug": "Iapr-Tc",
                        "structuredName": {
                            "firstName": "Iapr",
                            "lastName": "Tc",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Iapr Tc"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 69144170,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dd55b251fb3df65d030b45e9e5a18ec614fd440b",
            "isKey": false,
            "numCitedBy": 2,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "This text on document analysis and recognition is suitable for researchers, professors, practitioners, students and other computing professionals.\""
            },
            "slug": "Proceedings-of-the-Fourth-International-Conference-Recognition-Tc",
            "title": {
                "fragments": [],
                "text": "Proceedings of the Fourth International Conference on Document Analysis and Recognition, August 18-20, 1997, Ulm, Germany"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This text on document analysis and recognition is suitable for researchers, professors, practitioners, students and other computing professionals."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116415660"
                        ],
                        "name": "Bin Yu",
                        "slug": "Bin-Yu",
                        "structuredName": {
                            "firstName": "Bin",
                            "lastName": "Yu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bin Yu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38715439"
                        ],
                        "name": "Xinggang Lin",
                        "slug": "Xinggang-Lin",
                        "structuredName": {
                            "firstName": "Xinggang",
                            "lastName": "Lin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Xinggang Lin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115859002"
                        ],
                        "name": "Youshou Wu",
                        "slug": "Youshou-Wu",
                        "structuredName": {
                            "firstName": "Youshou",
                            "lastName": "Wu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Youshou Wu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "36417449"
                        ],
                        "name": "B. Yuan",
                        "slug": "B.-Yuan",
                        "structuredName": {
                            "firstName": "Baozong",
                            "lastName": "Yuan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Yuan"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 31557244,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "68f62f080c202948824048830a551dd3d943940c",
            "isKey": false,
            "numCitedBy": 12,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Isothetic-polygon-representation-for-contours-Yu-Lin",
            "title": {
                "fragments": [],
                "text": "Isothetic polygon representation for contours"
            },
            "venue": {
                "fragments": [],
                "text": "CVGIP Image Underst."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145062511"
                        ],
                        "name": "S. Seth",
                        "slug": "S.-Seth",
                        "structuredName": {
                            "firstName": "Sharad",
                            "lastName": "Seth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Seth"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59683040,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dc45263226de157763006aef70b681dbac744dcc",
            "isKey": false,
            "numCitedBy": 316,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "HIERARCHICAL-REPRESENTATION-OF-OPTICALLY-SCANNED-Nagy-Seth",
            "title": {
                "fragments": [],
                "text": "HIERARCHICAL REPRESENTATION OF OPTICALLY SCANNED DOCUMENTS"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398550688"
                        ],
                        "name": "L. O'Gorman",
                        "slug": "L.-O'Gorman",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "O'Gorman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. O'Gorman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3110392"
                        ],
                        "name": "R. Kasturi",
                        "slug": "R.-Kasturi",
                        "structuredName": {
                            "firstName": "Rangachar",
                            "lastName": "Kasturi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kasturi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28806157,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9a86dc89b61aa7466dae342842f79aeb9778320f",
            "isKey": false,
            "numCitedBy": 65,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Document-Image-Analysis-Systems-Guest-Editors'-to-O'Gorman-Kasturi",
            "title": {
                "fragments": [],
                "text": "Document Image Analysis Systems - Guest Editors' Introduction to the Special Issue"
            },
            "venue": {
                "fragments": [],
                "text": "Computer"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46391416,
            "fieldsOfStudy": [],
            "id": "d6ddc3eec5641b882c3918a94beb9e6d0701a24a",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Block segmentation and text extraction in mixed text/image documents"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Graph. Image Process."
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398550688"
                        ],
                        "name": "L. O'Gorman",
                        "slug": "L.-O'Gorman",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "O'Gorman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. O'Gorman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3110392"
                        ],
                        "name": "R. Kasturi",
                        "slug": "R.-Kasturi",
                        "structuredName": {
                            "firstName": "Rangachar",
                            "lastName": "Kasturi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kasturi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6575783,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c43505cc450b647f6f3b4a6f9004ae7d414e2bea",
            "isKey": false,
            "numCitedBy": 340,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Document-Image-Analysis-O'Gorman-Kasturi",
            "title": {
                "fragments": [],
                "text": "Document Image Analysis"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 53,
        "totalPages": 6
    },
    "page_url": "https://www.semanticscholar.org/paper/Document-Representation-and-Its-Application-to-Page-Jain-Yu/b39beea0f761152e65fac0e498af387821d887f1?sort=total-citations"
}