{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2655339"
                        ],
                        "name": "J. Lund",
                        "slug": "J.-Lund",
                        "structuredName": {
                            "firstName": "Jennifer",
                            "lastName": "Lund",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Lund"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 29379404,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "3400c22542bd041f97c2bc1fb452ee58c215ca77",
            "isKey": false,
            "numCitedBy": 501,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "A study of neuron morphology in Golgi Rapid and Kopsch preparations of area 17 of the monkey has shown three basic cell groups— pyramidal neurons, stellate neurons with spinous dendrites and stellate neurons with spine‐free or sparsely spined dendrites. These three neuron groups show different distributions in depth from pia to white matter and differ in their relationship to zones of concentrated termination of geniculo‐cortical axons. The neuron type most closely related to the laminae receiving a heavy geniculo‐cortical projection is the spinous stellate cell. This cell type is restricted to lamina IV. Included in this zone is the broadest band of geniculo‐cortical axon projection (lamina IVC), the horizontal fiber band (lamina IVB) comprising the major portion of the stria of Gennari (receiving little or no thalamic projection) and the narrow band of thalamo‐cortical fiber termination which occurs superficial to the stria of Gennari (lamina IVA). Pyramidal neuron cell bodies are almost totally excluded from lamina IVC and the apical dendrites of lower pyramidal neurons bear many fewer spines in lamina IVC than in laminae V and VI. The basal dendrites of upper pyramidal cells spread superficial and deep to lamina IVA rather than within it. Spine‐free stellate neurons occur at all cortical levels and sparselyspined varieties have not been impregnated in lamina IV, but occur in the other laminae."
            },
            "slug": "Organization-of-neurons-in-the-visual-cortex,-area-Lund",
            "title": {
                "fragments": [],
                "text": "Organization of neurons in the visual cortex, area 17, of the monkey (Macaca mulatta)"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "A study of neuron morphology in Golgi Rapid and Kopsch preparations of area 17 of the monkey has shown three basic cell groups— pyramidal neurons, stellate neurons with spinous dendrites and stellates neurons with spine‐free or sparsely spined dendritic groups."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of comparative neurology"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2090920"
                        ],
                        "name": "L. Garey",
                        "slug": "L.-Garey",
                        "structuredName": {
                            "firstName": "Laurence",
                            "lastName": "Garey",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Garey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144416252"
                        ],
                        "name": "T. Powell",
                        "slug": "T.-Powell",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Powell",
                            "middleNames": [
                                "Philip",
                                "Stroud"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Powell"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40042727,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c3c77593b9eab41813fe92bd4aba1a57512b981e",
            "isKey": false,
            "numCitedBy": 324,
            "numCiting": 56,
            "paperAbstract": {
                "fragments": [],
                "text": "The thalamic projection to the visual cortex has been studied in the cat and monkey by experimental light and electron microscopic techniques. After large lesions of the lateral geniculate nucleus degeneration is confined to the ipsilateral hemisphere. In the cat it is found in areas 17, 18 and 19 and in the lateral suprasylvian area, terminal degeneration occurring predominantly in layer IV, with less in layers I, III and V ; fibre degeneration crossing layers VI and V towards layer IV is coarser in area 18 than elsewhere. Some fine horizontal degenerating fibres are seen in layer I. In the monkey terminal degeneration is restricted to area 17; again degenerating fibres ascend to layer IV where there is dense fragmentation, but in contrast to the cat there is also a second, less dense, but distinct, band in layer Illb. A little fine, horizontal fibre degeneration is present in layer I and there is slight terminal degeneration in this site and in layer V. Electron microscopy shows that degenerating terminals are recognizable in the visual cortex at several stages according to survival period, but that most stages can exist simultaneously in any one site, and that all are associated with asymmetrical membrane thickenings. Mapping of electron microscopic sections confirms the laminar pattern seen with the light microscope. In area 17 of the cat and monkey and in area 19 of the cat over 80% of degenerating terminals end on dendritic spines, the rest making synaptic contact mainly with dendritic shafts, and very few with the soma of stellate cells, but in area 18 some 10 % are related to stellate cell bodies. In layer IV of all areas degenerating terminals tend to occur in clusters which are separated by approximately 100 μm. Where degenerating thalamic afferents end on cell somata or varicose dendrites almost all are identifiable as derived from stellate cells. Although it is difficult to identify positively the parent dendrites bearing the spines which receive the majority of the thalamo-cortical afferents, it is suggested that some, at least, of them may also originate from stellate cells."
            },
            "slug": "An-experimental-study-of-the-termination-of-the-in-Garey-Powell",
            "title": {
                "fragments": [],
                "text": "An experimental study of the termination of the lateral geniculo–cortical pathway in the cat and monkey"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Electron microscopy shows that degenerating terminals are recognizable in the visual cortex at several stages according to survival period, but that most stages can exist simultaneously in any one site, and that all are associated with asymmetrical membrane thickenings."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Royal Society of London. Series B. Biological Sciences"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6026198"
                        ],
                        "name": "F. Valverde",
                        "slug": "F.-Valverde",
                        "structuredName": {
                            "firstName": "Facundo",
                            "lastName": "Valverde",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Valverde"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26464593,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "01b00eb97ffbe064b3c3f6851fcafaa9b41c876e",
            "isKey": false,
            "numCitedBy": 171,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "In seeking for a functional schema of the organization of the visual centers, we have studied with the Golgi method the varieties and connections of short-axon cells and other related neurons in the middle layers of the striate area in the adult monkey. Short-axon cells in layer IV have been classified into stellate cells with recurrent ascending axons ending in layers III and IVa, and clewed cells with characteristic axonal nets localized in their own dendritic field. Short-axon cells have been found in clusters or glomeruli upon which terminal branches of cortical afferents have been observed. It is suggested that periglomerular stellate cells with ascending axons connect clusters of clewed cells with small, medium and large stellate and pyramidal cells of layers III and IVa, which in turn would activate the giant solitary cells of layer V through synaptic contacts along vertical descending axons. Two levels of cortical afferent ramifications in layers III and IVc have been identified. Their morphologic..."
            },
            "slug": "Short-axon-neuronal-subsystems-in-the-visual-cortex-Valverde",
            "title": {
                "fragments": [],
                "text": "Short axon neuronal subsystems in the visual cortex of the monkey."
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It is suggested that periglomerularStellate cells with ascending axons connect clusters of clewed cells with small, medium and large stellate and pyramidal cells of layers III and IVa, which in turn would activate the giant solitary cells of layer V through synaptic contacts along vertical descending axons."
            },
            "venue": {
                "fragments": [],
                "text": "The International journal of neuroscience"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107699573"
                        ],
                        "name": "M. Wilson",
                        "slug": "M.-Wilson",
                        "structuredName": {
                            "firstName": "M",
                            "lastName": "Wilson",
                            "middleNames": [
                                "E"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wilson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3652663"
                        ],
                        "name": "B. Cragg",
                        "slug": "B.-Cragg",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Cragg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Cragg"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38747219,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "f637391956073d4c6acb25695853911b081e0f18",
            "isKey": false,
            "numCitedBy": 191,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "The surprising claim of Glickstein, Miller & Smith (1964) that the lateral geniculate nucleus (LGN) in the cat emits a crossed projection through the corpus callosum to the contra-lateral visual cortex has important implications for work on split-brained cats (Myers, 1956) and monkeys (Downer, 1959). This claim was based on lesions made by a particular stereotaxic approach to the LGN, and we thought it worthwhile to see whether a different stereotaxic approach, which avoided the corpus callosum, would give the same result. We found no evidence of a crossed geniculo-striate projection in either cat or monkey, but in the course of this work made the unexpected finding that the LGN in the cat projects to three separate ipsi-lateral areas of neo-cortex. These comprise visual areas I and II and the lateral part of the middle suprasylvian gyrus. Visual areas I and II have been shown to correspond to areas 17 and 18 of Otsuka & Hassler (1962), by Bilge, Seneviratne & Whitteridge (1963) and Hubel & Wiesel (1965). We have not found these cytoarchitectonic boundaries sufficiently well defined to be useful for localizing the degenerated projections. Various control lesions have been made to determine whether the projections to visual area IL and the suprasylvian gyrus arise in the LGN or in neighbouring structures."
            },
            "slug": "Projections-from-the-lateral-geniculate-nucleus-in-Wilson-Cragg",
            "title": {
                "fragments": [],
                "text": "Projections from the lateral geniculate nucleus in the cat and monkey."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The unexpected finding that the LGN in the cat projects to three separate ipsi-lateral areas of neo-cortex, which comprise visual areas I and II and the lateral part of the middle suprasylvian gyrus is made."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of anatomy"
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7136759,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "c5f5311fa1f34159ab3a0a1d58da51cd0340a640",
            "isKey": false,
            "numCitedBy": 6319,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "1. The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light. Most cells can be categorized as simple, complex, or hypercomplex, with response properties very similar to those previously described in the cat. On the average, however, receptive fields are smaller, and there is a greater sensitivity to changes in stimulus orientation. A small proportion of the cells are colour coded."
            },
            "slug": "Receptive-fields-and-functional-architecture-of-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields and functional architecture of monkey striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "The striate cortex was studied in lightly anaesthetized macaque and spider monkeys by recording extracellularly from single units and stimulating the retinas with spots or patterns of light, with response properties very similar to those previously described in the cat."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1035815,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b952bab086707e7bee44f05762393e6b8a951415",
            "isKey": false,
            "numCitedBy": 1241,
            "numCiting": 57,
            "paperAbstract": {
                "fragments": [],
                "text": "THE RECEPTORS AND NERVE CELLS that make up the visual pathway must convey and interpret information on both the form and the color of retinal images. In higher mammals little is known about the degree to which nerve cells are specialized for handling these types of information. In a visual stimulus the importance of spatial attributes, and especially of dark-light contours, first became obvious with the discovery by Hartline (20 ) of lateral inhibition in the Limulus, a type of study that was extended to mammals when Kuffler (28) demonstrated t,hat the receptive fields of retinal ganglion cells in the cat are subdivided into a center and an opponent surround. The opponent principle, in which spatially separated excitatory and inhibitory regions are pitted against each other, has now been observed for retinal ganglion cells in the frog (1), the lizard (9), the rabbit (3), the rat (4), the ground squirrel (33), and the monkey (24). Similar effects have been seen in the lateral genie ulate bod .y and visual cortex in the cat (23, 25, 26), and also recently at these levels in the monkey. In 1958 De Valois and his collaborators (15) observed geniculate cells in the macaque monkey that were excited by one set of wavelengths and inhibited by another, making it apparent that in higher mammals the spectral composition of the stimulus was also an important variable. Similar opponent-color effects have since been described in the primate at the level of the retin .a1 ganglion cell (24), and in the visual cortex (34). I n the cat the absence or rarity of oppon .ent-color mecha nisms (19, 36 > may be related to an inferior ability to discriminate color (31, 32, 40); indeed since Svaetichin’s (41) original observation of opponent-color responses in the fish retina (Spotentials), similar response patterns have been seen only in animals thought to have good color vision. Given the existence of two opponent mechanisms system, one for the spatial variable and the other for in the monkey visual color, it is natural to ask whether these occupy the same channels, or are confined to separate groups of cells. In the goldfish it is clear from the work of Wagner, MacNichol, and Wolbarsht (43, 45) that opponent-color and opponent-spatial"
            },
            "slug": "Spatial-and-chromatic-interactions-in-the-lateral-Wiesel-Hubel",
            "title": {
                "fragments": [],
                "text": "Spatial and chromatic interactions in the lateral geniculate body of the rhesus monkey."
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The opponent principle, in which spatially separated excitatory and inhibitory regions are pitted against each other, has now been observed for retinal ganglion cells in the frog, the lizard, the rabbit, the rat, the ground squirrel, and the monkey."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3809364"
                        ],
                        "name": "V. Mountcastle",
                        "slug": "V.-Mountcastle",
                        "structuredName": {
                            "firstName": "Vernon",
                            "lastName": "Mountcastle",
                            "middleNames": [
                                "B."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Mountcastle"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6822072,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6ded76b03bd0612974d86a826ce70d2a2b143fb2",
            "isKey": false,
            "numCitedBy": 2208,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "THE PRESENT PAPER describes some observations upon the modality and topographical attributes of single neurons of the first somatic sensory area of the cat’s cerebral cortex, the analogue of the cortex of the postcentral gyrus in the primate brain. These data, together with others upon the response latencies of the cells of different layers of the cortex to peripheral stimuli, support an hypothesis of the functional organization of this cortical area. This is that the neurons which lie in narrow vertical columns, or cylinders, extending from layer II through layer VI make up an elementary unit of organization, for they are activated by stimulation of the same single class of peripheral receptors, from almost identical peripheral receptive fields, at latencies ers. It is early These which are not significantly different for the cells of the various layemphasized that this pattern of organization obtains only for the repetitiv neurons ‘e responses may be rela of ted cortical in quite neurons different to brief peripheral stimuli. organization patterns when analyzed in terms of later discharges. A report of these experiments was made to the American Physiological Society in September, 1955 (10, 17)."
            },
            "slug": "Modality-and-topographic-properties-of-single-of-Mountcastle",
            "title": {
                "fragments": [],
                "text": "Modality and topographic properties of single neurons of cat's somatic sensory cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "Observations upon the modality and topographical attributes of single neurons of the first somatic sensory area of the cat’s cerebral cortex, the analogue of the cortex of the postcentral gyrus in the primate brain, support an hypothesis of the functional organization of this cortical area."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4264071"
                        ],
                        "name": "T. Woolsey",
                        "slug": "T.-Woolsey",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Woolsey",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Woolsey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34864942"
                        ],
                        "name": "H. Loos",
                        "slug": "H.-Loos",
                        "structuredName": {
                            "firstName": "Hendrik",
                            "lastName": "Loos",
                            "middleNames": [
                                "van",
                                "der"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Loos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 90616040,
            "fieldsOfStudy": [
                "Biology",
                "Psychology"
            ],
            "id": "28ed528c12a7745697b8953389ef93b91e8d12c2",
            "isKey": false,
            "numCitedBy": 1761,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-structural-organization-of-layer-IV-in-the-(S-Woolsey-Loos",
            "title": {
                "fragments": [],
                "text": "The structural organization of layer IV in the somatosensory region (S I) of mouse cerebral cortex"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "88900034"
                        ],
                        "name": "P. Daniel",
                        "slug": "P.-Daniel",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Daniel",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Daniel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2837738"
                        ],
                        "name": "D. Whitteridge",
                        "slug": "D.-Whitteridge",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Whitteridge",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Whitteridge"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 29375114,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "831efb7246ac22a24c41570c7741ed1204fe2919",
            "isKey": false,
            "numCitedBy": 1107,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "On the basis of his extensive and elegant anatomical investigations on the visual cortex, Poliak (1932) suggested that a mathematical projection of the retina on the cerebral cortex must exist. Talbot & Marshall (1941) used physiological methods to map the central part of the visual field on to the posterolateral surface ofthe cortex in the monkey. They devised an index of cortical representation expressed as the increment of the angle, measured radially from the centre of gaze, which is represented on each millimetre of cortex. We have confirmed their observations and have extended the mapping to the buried visual cortex in the horizontal and vertical calcarine fissures. We have preferred to use the reciprocal of their index and to call it the cortical magnification, M. When this is measured along radii and at right angles to them, it provides the empirical quantitative relation which Polyak wanted. It also defines the shape and size of the visual receptive field. We have made such a surface, folded it and compared it with the calcarine cortex of the monkey. A preliminary account of this work has been published (Daniel & Whitteridge, 1959)."
            },
            "slug": "The-representation-of-the-visual-field-on-the-in-Daniel-Whitteridge",
            "title": {
                "fragments": [],
                "text": "The representation of the visual field on the cerebral cortex in monkeys"
            },
            "tldr": {
                "abstractSimilarityScore": 80,
                "text": "On the basis of his extensive and elegant anatomical investigations on the visual cortex, Poliak (1932) suggested that a mathematical projection of the retina on the cerebral cortex must exist and this work has made such a surface, folded it and compared it with the calcarine cortex of the monkey."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1961
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17055992,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "6b4fe4aa4d66fecc7b2869569002714d91d0b3f7",
            "isKey": false,
            "numCitedBy": 12432,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "What chiefly distinguishes cerebral cortex from other parts of the central nervous system is the great diversity of its cell types and interconnexions. It would be astonishing if such a structure did not profoundly modify the response patterns of fibres coming into it. In the cat's visual cortex, the receptive field arrangements of single cells suggest that there is indeed a degree of complexity far exceeding anything yet seen at lower levels in the visual system. In a previous paper we described receptive fields of single cortical cells, observing responses to spots of light shone on one or both retinas (Hubel & Wiesel, 1959). In the present work this method is used to examine receptive fields of a more complex type (Part I) and to make additional observations on binocular interaction (Part II). This approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours. In the past, the technique of recording evoked slow waves has been used with great success in studies of functional anatomy. It was employed by Talbot & Marshall (1941) and by Thompson, Woolsey & Talbot (1950) for mapping out the visual cortex in the rabbit, cat, and monkey. Daniel & Whitteiidge (1959) have recently extended this work in the primate. Most of our present knowledge of retinotopic projections, binocular overlap, and the second visual area is based on these investigations. Yet the method of evoked potentials is valuable mainly for detecting behaviour common to large populations of neighbouring cells; it cannot differentiate functionally between areas of cortex smaller than about 1 mm2. To overcome this difficulty a method has in recent years been developed for studying cells separately or in small groups during long micro-electrode penetrations through nervous tissue. Responses are correlated with cell location by reconstructing the electrode tracks from histological material. These techniques have been applied to"
            },
            "slug": "Receptive-fields,-binocular-interaction-and-in-the-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Receptive fields, binocular interaction and functional architecture in the cat's visual cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This method is used to examine receptive fields of a more complex type and to make additional observations on binocular interaction and this approach is necessary in order to understand the behaviour of individual cells, but it fails to deal with the problem of the relationship of one cell to its neighbours."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2627540,
            "fieldsOfStudy": [
                "Biology",
                "Medicine"
            ],
            "id": "77734bcbfe2e939b340d870bf676775a879f747a",
            "isKey": false,
            "numCitedBy": 1290,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "BEFORE A KITTEN OPENS ITS EYES, and long before the eyes are used in visual exploration, single cells of the primary visual cortex respond to natural stimulation with the same specificity as is found in the adult (5). This suggests that the anatomical connections between retina and striate cortex are for the most part innate. During the first 3 months of life the connections are highly susceptible to the effects of visual deprivation, to the extent that exclusion of all form and some light from one eye leads to a severe decline in the ability of that eye to influence cortical cells. Anatomical and physiological evidence suggests that the defect is chiefly, though not entirely, a cortical one (7-9). The object of the present study was to influence cortical connections by some means less drastic than covering one or both eyes. We wished if possible to alter the input in such a way that there would be no question of effects on the visual pathway below the level of the striate cortex. A method was suggested by the well-known clinical observation that a child with a squint (strabismus or nonparallel visual axes) may suffer a deterioration of vision in one eye (amblyopia ex anopsia). Since the visual pathways from the two eyes are for practical purposes separate up to the level of the striate cortex, it is unlikely that in these children the defect is in the retina or geniculate. An artificial squint therefore seemed to provide a possible means of obtaining a cortical defect while sparing the retina and lateral geniculate body. Accordingly , we produced a divergent strabismus by cutting one of the extraocular muscles in each of four newborn kittens, with the plan of testing vision and recording from single cortical cells after several months to a year. When at length each eye was tested in these kittens by observing the ani-mal's behavior with the other eye covered the results were disappointing: there was not the slightest suggestion of any defect in vision in either eye. This was not entirely unexpected, since with both eyes uncovered the animals had appeared to fix at times with one eye and at times with the other. At this stage there seemed to be little point in proceeding further, for there- ."
            },
            "slug": "Binocular-interaction-in-striate-cortex-of-kittens-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Binocular interaction in striate cortex of kittens reared with artificial squint."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The object of the present study was to influence cortical connections by some means less drastic than covering one or both eyes, and produced a divergent strabismus by cutting one of the extraocular muscles in each of four newborn kittens."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6171259,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "d7fb932bca642615fcbcf3f5d26b2c26666603d3",
            "isKey": false,
            "numCitedBy": 805,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Cells in the cat's striate cortex show marked specificity in their responses to restricted retinal stimulation (Hubel & Wiesel, 1959, 1962). The most effective stimulus shapes are long narrow rectangles of light ('slits'), dark bars against a light background ('dark bars'), and straight-line borders separating areas of different brightness ('edges'). A given cell responds vigorously when an appropriate stimulus is shone on the receptive field or moved across it, provided the stimulus is presented in a specific orientation. This orientation is termed the 'receptive-field axis orientation'. It is critical, and constant for any particular cell, but may differ for different cells. The visual cortex is subdivided into discrete regions or columns extending from surface to white matter, in which all cells have the same receptivefield axis orientation (Hubel & Wiesel, 1962). The present experiments were undertaken with the object of learning more about the anatomical configuration of the columns. We wished to have a clearer idea of their shape, especially if the walls of a column were, as previous work suggested, parallel to the radial fibre bundles of the cortex and perpendicular to the cortical layers, and whether the columns were uniform or irregular in their cross-sectional shape and size. Furthermore, we were curious to know if there was any relationship between the receptive-field axis orientations of neighbouring columns, or whether, on the contrary, the different columns were intermixed in a random way throughout the cortex. These questions were approached: (1) by making several deep, closely spaced, parallel micro-electrode penetrations, placing electrolytic lesions at every shift in receptive-field orientation, and(2) by making many short penetrations in a small cortical area, noting the axis orientation of cells lying in the upper one or two layers of cortex."
            },
            "slug": "Shape-and-arrangement-of-columns-in-cat's-striate-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Shape and arrangement of columns in cat's striate cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Questions were approached by making several deep, closely spaced, parallel micro-electrode penetrations, placing electrolytic lesions at every shift in receptive-field orientation, and by making many short penetrations in a small cortical area, noting the axis orientation of cells lying in the upper one or two layers of cortex."
            },
            "venue": {
                "fragments": [],
                "text": "The Journal of physiology"
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2334226"
                        ],
                        "name": "D. Hubel",
                        "slug": "D.-Hubel",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Hubel",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Hubel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2629471"
                        ],
                        "name": "T. Wiesel",
                        "slug": "T.-Wiesel",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Wiesel",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Wiesel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4278503,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "9c498f9e0eeea852f5476cdb0e0088dc9ccfcc1d",
            "isKey": false,
            "numCitedBy": 362,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Anatomical investigation of the monkey striate cortex supports the physiological concept that the cortex is subdivided vertically into columnar aggregates of cells. Here the shape and size of two independent and overlapping column systems are described."
            },
            "slug": "Anatomical-Demonstration-of-Columns-in-the-Monkey-Hubel-Wiesel",
            "title": {
                "fragments": [],
                "text": "Anatomical Demonstration of Columns in the Monkey Striate Cortex"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Anatomical investigation of the monkey striate cortex supports the physiological concept that the cortex is subdivided vertically into columnar aggregates of cells."
            },
            "venue": {
                "fragments": [],
                "text": "Nature"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4877571"
                        ],
                        "name": "L. Heimer",
                        "slug": "L.-Heimer",
                        "structuredName": {
                            "firstName": "Lennart",
                            "lastName": "Heimer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Heimer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144993651"
                        ],
                        "name": "A. Peters",
                        "slug": "A.-Peters",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Peters",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Peters"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 33847980,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5ab73bde021b7d4e321211a1f3c6e94f243d2e1b",
            "isKey": false,
            "numCitedBy": 106,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-electron-microscope-study-of-a-silver-stain-for-Heimer-Peters",
            "title": {
                "fragments": [],
                "text": "An electron microscope study of a silver stain for degenerating boutons."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1968
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "87382177"
                        ],
                        "name": "R. Fink",
                        "slug": "R.-Fink",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Fink",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Fink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4877571"
                        ],
                        "name": "L. Heimer",
                        "slug": "L.-Heimer",
                        "structuredName": {
                            "firstName": "Lennart",
                            "lastName": "Heimer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Heimer"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 37578384,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "417a4fe2675b23632843ae6bd9257f78a89235a7",
            "isKey": false,
            "numCitedBy": 1698,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Two-methods-for-selective-silver-impregnation-of-in-Fink-Heimer",
            "title": {
                "fragments": [],
                "text": "Two methods for selective silver impregnation of degenerating axons and their synaptic endings in the central nervous system."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144623827"
                        ],
                        "name": "W. Nauta",
                        "slug": "W.-Nauta",
                        "structuredName": {
                            "firstName": "Walle",
                            "lastName": "Nauta",
                            "middleNames": [
                                "J.",
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Nauta"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145949450"
                        ],
                        "name": "P. Gygax",
                        "slug": "P.-Gygax",
                        "structuredName": {
                            "firstName": "P.",
                            "lastName": "Gygax",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Gygax"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 40573128,
            "fieldsOfStudy": [
                "Medicine",
                "Chemistry"
            ],
            "id": "86ea42491b0df0f23b2c23fae5618c216c9dc63d",
            "isKey": false,
            "numCitedBy": 819,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "Frozen sections of formalin-fixed brains containing surgical lesions, were treated with 15% ethanol for 0.5 hr., soaked in 0.5% phosphomolybdic acid for 0.25–1.0 hr., and subsequently treated with 0.05% potassium permanganate for 4–10 min. (The duration of the latter treatment is critical and individually variable). Subsequent procedure is as follows: decolorize in a mixture of equal parts of 1% hydroquinone and 1% oxalic acid; wash thoroughly and soak sections in 1.5% silver nitrate for 20–30 min.; ammoniacal silver nitrate (silver nitrate 0.9 g., distilled water 20 ml., pure ethanol 10 ml., strong ammonia 1.8 ml., 2.5% sodium hydroxide 1.5 ml.) 0.5–1.0 min.; reduce in acidified formalin (distilled water 400 ml., pure ethanol 45 ml., 1% citric acid 13.5 ml., 10% formalin 13.5 ml.) 1 min.; wash, and pass section through 1% sodium thiosulfate (0.5–1.0 min.); wash thoroughly and pass sections through graded alcohols and xylene (3 changes); cover in neutral synthetic resin."
            },
            "slug": "Silver-impregnation-of-degenerating-axons-in-the-a-Nauta-Gygax",
            "title": {
                "fragments": [],
                "text": "Silver impregnation of degenerating axons in the central nervous system: a modified technic."
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "Frozen sections of formalin-fixed brains containing surgical lesions, were treated with 15% ethanol for 0.5 hr, and subsequently treated with 0.05% potassium permanganate for 4–10 min, and covered in neutral synthetic resin."
            },
            "venue": {
                "fragments": [],
                "text": "Stain technology"
            },
            "year": 1954
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40636767"
                        ],
                        "name": "G. Bonin",
                        "slug": "G.-Bonin",
                        "structuredName": {
                            "firstName": "Gerhardt",
                            "lastName": "Bonin",
                            "middleNames": [
                                "von"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Bonin"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 85049396,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "fd243b7720583a33ef7312a82995064e4d1313b6",
            "isKey": false,
            "numCitedBy": 47,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-striate-area-of-primates-Bonin",
            "title": {
                "fragments": [],
                "text": "The striate area of primates"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1942
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4138381"
                        ],
                        "name": "G. Poggio",
                        "slug": "G.-Poggio",
                        "structuredName": {
                            "firstName": "Gian",
                            "lastName": "Poggio",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Poggio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3809364"
                        ],
                        "name": "V. Mountcastle",
                        "slug": "V.-Mountcastle",
                        "structuredName": {
                            "firstName": "Vernon",
                            "lastName": "Mountcastle",
                            "middleNames": [
                                "B."
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Mountcastle"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6920236,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "b0ee4a6122e1534ebfe122c47a599b5de0284882",
            "isKey": false,
            "numCitedBy": 392,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "THE-FUNCTIONAL-PROPERTIES-OF-VENTROBASAL-THALAMIC-Poggio-Mountcastle",
            "title": {
                "fragments": [],
                "text": "THE FUNCTIONAL PROPERTIES OF VENTROBASAL THALAMIC NEURONSSTUDIED IN UNANESTHETIZED MONKEYS."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of neurophysiology"
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16711514"
                        ],
                        "name": "J. T. Wiitanen",
                        "slug": "J.-T.-Wiitanen",
                        "structuredName": {
                            "firstName": "J",
                            "lastName": "Wiitanen",
                            "middleNames": [
                                "T"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. T. Wiitanen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 34492850,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "32336d57b435b60016c4a2b2833c7c356040a484",
            "isKey": false,
            "numCitedBy": 178,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Selective-silver-impregnation-of-degenerating-axons-Wiitanen",
            "title": {
                "fragments": [],
                "text": "Selective silver impregnation of degenerating axons and axon terminals in the central nervous system of the monkey (Macaca mulatta)."
            },
            "venue": {
                "fragments": [],
                "text": "Brain research"
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "12924772"
                        ],
                        "name": "W. le Gros Clark",
                        "slug": "W.-le-Gros-Clark",
                        "structuredName": {
                            "firstName": "Wilfrid",
                            "lastName": "le Gros Clark",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. le Gros Clark"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4884026"
                        ],
                        "name": "S. Sunderland",
                        "slug": "S.-Sunderland",
                        "structuredName": {
                            "firstName": "Sydney",
                            "lastName": "Sunderland",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sunderland"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 27941289,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "e2b8bd60663db0eea66d479460614cc787dee3c5",
            "isKey": false,
            "numCitedBy": 46,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Structural-changes-in-the-isolated-visual-cortex.-Clark-Sunderland",
            "title": {
                "fragments": [],
                "text": "Structural changes in the isolated visual cortex."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of anatomy"
            },
            "year": 1939
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An experimental study of the t _-Anination of the lateral geniculo-cortical pathway in the cat and monkey"
            },
            "venue": {
                "fragments": [],
                "text": "Proc. Roy. SOC. Lond. B"
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Mountcastle 1963 The functional properties of ventrobasal thalamic neurons studied in unanesthetized monkeys"
            },
            "venue": {
                "fragments": [],
                "text": "J. Neurophysiol"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Intracortical distribution of lateral geniculate axons in cat and monkey"
            },
            "venue": {
                "fragments": [],
                "text": "Anat . Rec ."
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Heimer 1967 Two methods for selective silver impregnation of degenerating axons and their synaptic endings in the central nervous system"
            },
            "venue": {
                "fragments": [],
                "text": "Brain Res"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An experimental study of the t _ - Anination of the lateral geniculo - cortical pathway in the cat and monkey"
            },
            "venue": {
                "fragments": [],
                "text": "Proc . Roy . SOC . Lond . B ."
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Intracortical distribution of lateral geniculate axons in cat and monkey"
            },
            "venue": {
                "fragments": [],
                "text": "Anat. Rec"
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Projec - tions from the lateral geniculate nucleus in the cat and monkey"
            },
            "venue": {
                "fragments": [],
                "text": "J . Anat ."
            },
            "year": 1967
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Hubel 1966 Spatial and chromatic interactions in the lateral geniculate body of the lateral geniculate body of the Rhesus monkey"
            },
            "venue": {
                "fragments": [],
                "text": "J. Neurophysiol"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Van der Loos 1970 The structural organization of layer IV in the somatosensory region (SI) of mouse cerebral cortex"
            },
            "venue": {
                "fragments": [],
                "text": "Brain Res"
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 29,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/Laminar-and-columnar-distribution-of-fibers-in-the-Hubel-Wiesel/e5f4f49721eb3f6bdba304a06728327631e832bb?sort=total-citations"
}