{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1692450"
                        ],
                        "name": "C. Lagoze",
                        "slug": "C.-Lagoze",
                        "structuredName": {
                            "firstName": "Carl",
                            "lastName": "Lagoze",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Lagoze"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49570447"
                        ],
                        "name": "J. R. Davis",
                        "slug": "J.-R.-Davis",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Davis",
                            "middleNames": [
                                "Raymond"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. R. Davis"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 7453479,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "73c02fef0a94fd1fa4edc4478dcebe399058d299",
            "isKey": false,
            "numCitedBy": 135,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "As one of the five universities participating in the ARPA-sponsored Computer Science Technical Report project, we at Cornell have developed a digital library architecture called Dienst. Dienst is a protocol and implementation that provides Internet access to a distributed, decentralized multi-format document collection. The collection is managed by a set of interoperating Dienst servers distributed over the Internet. These servers provide three digital library services: repositories of multi-format documents; indexes into the document collection and search engines for these indexes; and user interfaces for browsing, searching, and accessing the collection."
            },
            "slug": "Dienst:-an-architecture-for-distributed-document-Lagoze-Davis",
            "title": {
                "fragments": [],
                "text": "Dienst: an architecture for distributed document libraries"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Dienst is a protocol and implementation that provides Internet access to a distributed, decentralized multi-format document collection that is managed by a set of interoperating Dienst servers distributed over the Internet."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145944286"
                        ],
                        "name": "D. Rus",
                        "slug": "D.-Rus",
                        "structuredName": {
                            "firstName": "Daniela",
                            "lastName": "Rus",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Rus"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144922029"
                        ],
                        "name": "D. Subramanian",
                        "slug": "D.-Subramanian",
                        "structuredName": {
                            "firstName": "Devika",
                            "lastName": "Subramanian",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Subramanian"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14795939,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9d133a8c19d41efb08e91dd6835dcbb763e5edfc",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents a novel architecture for building special-purpose agents for solving the information capture and access problem in large, unstructured data environments with uncertainty in data representation and interpretation. The key idea is to recognize and use underlying structure in such environments using simple components with specified performance guarantees connected by effective communication protocols. This paper brings together ideas from systems and theory: the design of mobile robots in unstructured physical environments, work in electronic libraries and know bets, topology, as well as the rich research in information retrieval and filtering to design a concrete software architecture for solving a wide range of highlevel user queries in multi-media environments."
            },
            "slug": "Multi-media-RISC-informatics:-retrieving-with-Rus-Subramanian",
            "title": {
                "fragments": [],
                "text": "Multi-media RISC informatics: retrieving information with simple structural components"
            },
            "venue": {
                "fragments": [],
                "text": "CIKM '93"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2018460"
                        ],
                        "name": "K. Kotay",
                        "slug": "K.-Kotay",
                        "structuredName": {
                            "firstName": "Keith",
                            "lastName": "Kotay",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Kotay"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6686226,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "716aa6a45938a19af72d8f5b2a955c68b2a0acff",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "As network information resources grow in size, it is often most efficient to process queries and updates at the site where the data is located. This processing can be accomplished by using a traditional client-server network interface, which constrains the client to the set of queries supported by the server, or requires the server to send all data to the client for processing. The former is inflexible; the latter is inefficient. Transportable agents, which support the movement of the client computation to the location of the remote resource, have the potential to be more flexible and more efficient. Transportable agents are capable of suspending their execution, transporting themselves to another host on a network, and resuming execution from the point at which they were suspended. Transportable agents consume fewer network resources and can support systems that do not have permanent network connections, such as mobile computers and personal digital assistants. We describe a prototype transportable-agent implementation that facilitates research in this area. Agents are written in a script language that supports agent relocation, and the language is processed at each host by an agent interpreter. Electronic mail and UNIX remote shell (rsh) are the two current transport mechanisms and we plan to explore others. We present a technical-report searching agent as a demonstration of the capabilities of our prototype implementation."
            },
            "slug": "Transportable-Agents-Kotay",
            "title": {
                "fragments": [],
                "text": "Transportable Agents"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A prototype transportable-agent implementation is described that facilitates research in this area and a technical-report searching agent is presented as a demonstration of the capabilities of this prototype implementation."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49570447"
                        ],
                        "name": "J. R. Davis",
                        "slug": "J.-R.-Davis",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Davis",
                            "middleNames": [
                                "Raymond"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. R. Davis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1692450"
                        ],
                        "name": "C. Lagoze",
                        "slug": "C.-Lagoze",
                        "structuredName": {
                            "firstName": "Carl",
                            "lastName": "Lagoze",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Lagoze"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 15068467,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "59241361e31e5a52ed0364406ad09a59926903bf",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "\"Drop-In\"-Publishing-with-the-World-Wide-Web-Davis-Lagoze",
            "title": {
                "fragments": [],
                "text": "\"Drop-In\" Publishing with the World Wide Web"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Networks ISDN Syst."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1690271"
                        ],
                        "name": "Henry A. Kautz",
                        "slug": "Henry-A.-Kautz",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Kautz",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Henry A. Kautz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1744679"
                        ],
                        "name": "B. Selman",
                        "slug": "B.-Selman",
                        "structuredName": {
                            "firstName": "Bart",
                            "lastName": "Selman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Selman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34633961"
                        ],
                        "name": "M. Coen",
                        "slug": "M.-Coen",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Coen",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Coen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15989099,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "55e9c98be17258a5743eefd30fbfe56940275413",
            "isKey": false,
            "numCitedBy": 76,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "he creation of software agents has generated much recent interest. A variety of approaches and prw jects use the term \" agents \"-ranging from adaptive user interfaces (W) to systems that use planning algorithms to generate shell scripts [ 1, 2, 41. In our own approach, agents assist users in a range of daily, mundane activities-setting up meetings, sending out papers, locating information in multiple databases, tracking the whereabouts of people, and so on. Our objective is to design agents that blend transparently into normal work environments, while relieving users of low-level adminis trative and clerical tasks. The practical aspects of software agents are taken seriously. Users should be able to assume the agents are reliable and predictable and the human user remains in ultimate control. One of the most difficult aspects of agent design is to define specific tasks that are both feasible using current technology, and are truly useful to the everyday user. Furthermore, it became clear during the testing of our initial protm type that users have little patience when it comes to interacting with software agents. We therefore paid special attention to the Ul aspects of our system. In particular, whenever possible, we opted for graphically oriented interfaces over pure text-based interfaces. In addition, reliability and error handling is crucial in all parts of a software agent system. The real world is unpredictable: messages between agents may be lost or delayed, pea-pie may respond inappropriately rounding the scheduling of a visitor to our laboratory. We designed and implemented a set of software agents to handle this task. We deliberately made no commitment in advance to a particular agent architecture. We then tested the system with ordinary users, providing feedback that led to many improvements in the design of the agents and the human/ agent interfaces, as well as to the development of a general and flexible framework for agent interaction. The key feature of the framework is the use of personal-ized agents called \" userbots \" that mediate communication between users and task-specific agents. We believe the bottom-up approach is crucial in identifying the necessary properties of a successful agent platform. Our initial experiments have already led us to formulate some key properties. Examples include the separation of task-specific agents from user-centered agents, the need to handle issues of security and privacy, and as mentioned earlier, the need for good human interfaces and high reliability. TaSkbOts …"
            },
            "slug": "Bottom-up-design-of-software-agents-Kautz-Selman",
            "title": {
                "fragments": [],
                "text": "Bottom-up design of software agents"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The objective is to design agents that blend transparently into normal work environments, while relieving users of low-level adminis trative and clerical tasks, and believes the bottom-up approach is crucial in identifying the necessary properties of a successful agent platform."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4940444"
                        ],
                        "name": "M. Genesereth",
                        "slug": "M.-Genesereth",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Genesereth",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Genesereth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2285915"
                        ],
                        "name": "Steven P. Ketchpel",
                        "slug": "Steven-P.-Ketchpel",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Ketchpel",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steven P. Ketchpel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2001042,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0aaf533cac246fcd83490cd0b8508ed0d886ab7d",
            "isKey": false,
            "numCitedBy": 2719,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "The software world is one of great richness and diversity. Many thousands of software products are available to users today, providing a wide variety of information and services in a wide variety of domains. While most of these programs provide their users with significant value when used in isolation, there is increasing demand for programs that can interoperate – to exchange information and services with other programs and thereby solve problems that cannot be solved alone. Part of what makes interoperation difficult is heterogeneity. Programs are written by different people, at different times, in different languages; and, as a result, they often provide different interfaces. The difficulties created by heterogeneity are exacerbated by dynamics in the software environment. Programs are frequently rewritten; new programs are added; old programs removed. Agent-based software engineering was invented to facilitate the creation of software able to interoperate in such settings. In this approach to software development, application programs are written as software agents, i.e. software “components” that communicate with their peers by exchanging messages in an expressive agent communication language. Agents can be as simple as subroutines; but typically they are larger entities with some sort of persistent control (e.g. distinct control threads within a single address space, distinct processes on a single machine, or separate processes on different machines). The salient feature of the language used by agents is its expressiveness. It allows for the exchange of data and logical information, individual commands and scripts (i.e. programs). Using this language, agents can communicate complex information and goals, directly or indirectly “programming” each other in useful ways. Agent-based software engineering is often compared to object-oriented programming. Like an “object”, an agent provides a message-based interface independent of its internal data structures and algorithms. The primary difference between the two approaches lies in the language of the interface. In general object-oriented programming, the meaning of a message can vary from one object to another. In agent-based software engineering, agents use a common language with an agent-independent semantics. The concept of agent-based software engineering raises a number of important questions."
            },
            "slug": "Software-agents-Genesereth-Ketchpel",
            "title": {
                "fragments": [],
                "text": "Software agents"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "In this approach to software development, application programs are written as software agents, i.e. software “components” that communicate with their peers by exchanging messages in an expressive agent communication language."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701876"
                        ],
                        "name": "P. Maes",
                        "slug": "P.-Maes",
                        "structuredName": {
                            "firstName": "Pattie",
                            "lastName": "Maes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Maes"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 59868493,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "a43bc0a1006c7bc6958a9d0fa79d62b9c6e23695",
            "isKey": false,
            "numCitedBy": 1322,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Publisher Summary Computers are becoming the vehicle for an increasing range of everyday activities. Acquisition of news and information, mail and even social interactions and entertainment have become more and more computer based. These technological developments are not in line with a change in the way people interact with computers. Techniques from the field of AI, in particular so-called autonomous agents, can be used to implement a complementary style of interaction, which has been referred to as indirect management. Agents assist users in a range of different ways. They hide the complexity of difficult tasks, they perform tasks on the user's behalf, they can train or teach the user, they help different users collaborate, and they monitor events and procedures. The chapter focuses on an approach to building interface agents. It presents results from several prototype agents that have been built using this approach, including agents that provide personalized assistance with meeting scheduling, email handling, electronic news filtering, and selection of entertainment."
            },
            "slug": "Agents-that-reduce-work-and-information-overload-Maes",
            "title": {
                "fragments": [],
                "text": "Agents that reduce work and information overload"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145944286"
                        ],
                        "name": "D. Rus",
                        "slug": "D.-Rus",
                        "structuredName": {
                            "firstName": "Daniela",
                            "lastName": "Rus",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Rus"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27959948"
                        ],
                        "name": "R. Gray",
                        "slug": "R.-Gray",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Gray",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gray"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143980068"
                        ],
                        "name": "D. Kotz",
                        "slug": "D.-Kotz",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Kotz",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Kotz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3506571,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b94323263419b30e6e78895c69b0f1ea69061813",
            "isKey": false,
            "numCitedBy": 79,
            "numCiting": 76,
            "paperAbstract": {
                "fragments": [],
                "text": "Transportable agents are autonomous programs. They can movethrough a heterogeneous network of computers migrating from host tohost under their own control. They can sense the state of thenetwork, monitor software conditions, and interact with other agentsor resources. The network-sensing tools allow our agents to adapt tothe network configuration and to navigate under the control ofreactive plans. In this paper we describe the design andimplementation of a transportable-agent system and focus on navigationtools that give our agents autonomy. We also discuss the intelligentand adaptive behavior of autonomous agents in distributed information-access tasks."
            },
            "slug": "Transportable-Information-Agents-Rus-Gray",
            "title": {
                "fragments": [],
                "text": "Transportable Information Agents"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The design and implementation of a transportable-agent system and focus on navigation tools that give agents autonomy are described and the intelligent and adaptive behavior of autonomous agents in distributed information-access tasks are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "AGENTS '97"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1684012"
                        ],
                        "name": "L. Gravano",
                        "slug": "L.-Gravano",
                        "structuredName": {
                            "firstName": "Luis",
                            "lastName": "Gravano",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Gravano"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398574232"
                        ],
                        "name": "H. Garcia-Molina",
                        "slug": "H.-Garcia-Molina",
                        "structuredName": {
                            "firstName": "Hector",
                            "lastName": "Garcia-Molina",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Garcia-Molina"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1693125"
                        ],
                        "name": "A. Tomasic",
                        "slug": "A.-Tomasic",
                        "structuredName": {
                            "firstName": "Anthony",
                            "lastName": "Tomasic",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Tomasic"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13997384,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8fc1b50c90069f2d1720aecf76ed03f0d402b36b",
            "isKey": false,
            "numCitedBy": 42,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "The popularity of information retrieval has led users to a new problem: finding which text databases (out of thousands of candidate choices) are the most relevant to a user. Answering a given query with a list of relevant databases is the text database discovery problem. The first part of this paper presents a practical method for attacking this problem based on estimating the result size of a query and a database. The method is termed GlOSS--Glossary of Servers Server. The second part of this paper evaluates GlOSS using four different semantics to answer a user''s queries. Real users'' queries were used in the experiments. We also describe several variations of GlOSS and compare their efficacy. In addition, we analyze the storage cost of our approach to the problem."
            },
            "slug": "The-Efficacy-of-GlOSS-for-the-Text-Database-Problem-Gravano-Garcia-Molina",
            "title": {
                "fragments": [],
                "text": "The Efficacy of GlOSS for the Text Database Discovery Problem"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A practical method for attacking the text database discovery problem based on estimating the result size of a query and a database is presented and GlOSS--Glossary of Servers Server is evaluated using four different semantics to answer a user''s queries."
            },
            "venue": {
                "fragments": [],
                "text": "SIGMOD 1993"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37319103"
                        ],
                        "name": "C. Pearce",
                        "slug": "C.-Pearce",
                        "structuredName": {
                            "firstName": "Claudia",
                            "lastName": "Pearce",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Pearce"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144440349"
                        ],
                        "name": "Charles K. Nicholas",
                        "slug": "Charles-K.-Nicholas",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Nicholas",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Charles K. Nicholas"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 16083739,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "615aaf74d35e22150189e522e44e4ee0a5bddab5",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "Methods and tools for finding documents relevant to a user’s needs in a very large corpus of documents can be found in the information retrieval, library science, and hypertext communities. Typically, these systems provide retrieval capabilities for fairly static corpora, their algorithms are language dependent, and they don’t perform well when presented with misspelled words or text that has been degraded by optical character recognition techniques. In addition, the capabilities needed by a variety of researchers, analysts, and investigative reporters from these methods and tools go beyond the traditional indexing systems. The ability to find related documents, to query using natural language, and to filter out desired information suggest a more interactive and robust user interface. We describe our work in progress for generating a dynamic hypertext environment that provides the capabilities of relating, querying, and iiltering in a largescale, dynamic environment that is robust in the sense that it is language independent and capable of dealing with misspelled words."
            },
            "slug": "Generating-a-dynamic-hypertext-environment-with-Pearce-Nicholas",
            "title": {
                "fragments": [],
                "text": "Generating a dynamic hypertext environment with n-gram analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This paper describes the work in progress for generating a dynamic hypertext environment that provides the capabilities of relating, querying, and iiltering in a largescale, dynamic environment that is robust in the sense that it is language independent and capable of dealing with misspelled words."
            },
            "venue": {
                "fragments": [],
                "text": "CIKM '93"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145944286"
                        ],
                        "name": "D. Rus",
                        "slug": "D.-Rus",
                        "structuredName": {
                            "firstName": "Daniela",
                            "lastName": "Rus",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Rus"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27959948"
                        ],
                        "name": "R. Gray",
                        "slug": "R.-Gray",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Gray",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gray"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143980068"
                        ],
                        "name": "D. Kotz",
                        "slug": "D.-Kotz",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Kotz",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Kotz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15017507,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c63a56d175074e6be078ad1786274ba99e19f809",
            "isKey": false,
            "numCitedBy": 47,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "We have designed and implemented autonomous software agents. Our agents are programs that can move independently through a heterogeneous network of computers. They can sense the state of the network, monitor software conditions, and interact with other agents. The network-sensing tools allow our agents to adapt to the network configuration and to navigate under the control of reactive plans. In this paper we illustrate the intelligent and adaptive behavior of autonomous agents in distributed information-gathering tasks."
            },
            "slug": "Autonomous-and-Adaptive-Agents-that-Gather-Rus-Gray",
            "title": {
                "fragments": [],
                "text": "Autonomous and Adaptive Agents that Gather Information"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "In this paper, the intelligent and adaptive behavior of autonomous agents in distributed information-gathering tasks are illustrated."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1741101"
                        ],
                        "name": "Oren Etzioni",
                        "slug": "Oren-Etzioni",
                        "structuredName": {
                            "firstName": "Oren",
                            "lastName": "Etzioni",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Oren Etzioni"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1780531"
                        ],
                        "name": "Daniel S. Weld",
                        "slug": "Daniel-S.-Weld",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Weld",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Daniel S. Weld"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2447472,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "050584e3b74d1d7f5396d379510ca5204f02bfc1",
            "isKey": false,
            "numCitedBy": 602,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "The Internet Softbot (software robot) is a fullyimplemented AI agent developed at the University of Washington (Etzioni, Lcsh, & Segal 1993). The softbot uses a UNIX shell and the World-Wide Web to interact with a wide range of internet resources. The softbot’s effectors include ftp, telnet, mail, and numerous file manipulation commaslds. Its sensors include internet facilities such as archie, gopher, netfind, and many more. The softbot is designed to incorporate new facilities into its repertoirc as they become available. The softbot’s \"added value\" is three-fold. First, it provides an integrated and expressive interface to the internet. Second, the softbot dynamically chooses which facilities to invoke, and in what sequence. For example, the softbot might use netfind to determine David McAllester’s e-mail address. Since it knows that netfind requires a person’s institution as input, the softbot would first search bibliographic databases for a technical report by McAllester which would reveal his institutkm, and then feed that information to netfind. Third, the softbot fluidly backtracks from one facility to another based on information collected at run time. As a result., the softbot’s behavior changes in response to transient system conditions (e.g., the UUCP gateway is down). In this article, we focus on the ideas underlying the softbot-based interface."
            },
            "slug": "A-softbot-based-interface-to-the-Internet-Etzioni-Weld",
            "title": {
                "fragments": [],
                "text": "A softbot-based interface to the Internet"
            },
            "tldr": {
                "abstractSimilarityScore": 85,
                "text": "The Internet Softbot (software robot) is a fullyimplemented AI agent developed at the University of Washington that uses a UNIX shell and the World-Wide Web to interact with a wide range of internet resources."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27959948"
                        ],
                        "name": "R. Gray",
                        "slug": "R.-Gray",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Gray",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gray"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11529876,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3526ef225228823ab9a8cb915a4280023c1b9c81",
            "isKey": false,
            "numCitedBy": 409,
            "numCiting": 163,
            "paperAbstract": {
                "fragments": [],
                "text": "A mobile agent is an autonomous program that can migrate under its own control from machine to machine in a heterogeneous network. In other words, the program can suspend its execution at an arbitrary point, transport itself to another machine, and then resume execution from the point of suspension. Mobile agents have the potential to provide a {\\em single, general framework} in which a wide range of distributed applications can be implemented efficiently and easily. Several challenges must be faced, however, most notably reducing migration overhead, protecting a machine from malicious agents (and an agent from malicious machines), and insulating the agent against network and machine failures. Agent Tcl is a mobile-agent system under development at Dartmouth College that has evolved from a Tcl-only system into a multiple-language system that currently supports Tcl, Java, and Scheme. In this thesis, we examine the motivation behind mobile agents, describe the base Agent Tcl system and its security mechanisms for protecting a machine against malicious agents, and analyze the system''s current performance. Finally, we discuss the security, fault-tolerance and performance enhancements that will be necessary for Agent Tcl and mobile agents in general to realize their full potential."
            },
            "slug": "Agent-Tcl:-A-Flexible-and-Secure-Mobile-Agent-Gray",
            "title": {
                "fragments": [],
                "text": "Agent Tcl: A Flexible and Secure Mobile-Agent System"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The motivation behind mobile agents is examined, the base Agent Tcl system and its security mechanisms for protecting a machine against malicious agents are described, and the system''s current performance is analyzed."
            },
            "venue": {
                "fragments": [],
                "text": "Tcl/Tk Workshop"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145944286"
                        ],
                        "name": "D. Rus",
                        "slug": "D.-Rus",
                        "structuredName": {
                            "firstName": "Daniela",
                            "lastName": "Rus",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Rus"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34736316"
                        ],
                        "name": "K. Summers",
                        "slug": "K.-Summers",
                        "structuredName": {
                            "firstName": "Kristen",
                            "lastName": "Summers",
                            "middleNames": [
                                "Maria"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Summers"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60453794,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "283fbac96fc1f7460a5f8105c6afae6835807883",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "We present and analyze efficient algorithms for the automated recognition and interpretation of layout structures in electronic documents. The key idea is to use the patterns in the distribution of white space in a document to recognize and interpret its components. The recognition algorithm divides the document into a hierarchy of logical elements; the interpretation algorithms classify these divisions as base-text, tables, indented lists, polygonal drawings, and graphs. We present experimental data and discuss an information access application. Our methodology allows the automatic markup of documents\\footnote{For instance in the SGML format} and the creation of multi-level indices and browsing tools for electronic libraries."
            },
            "slug": "Using-White-Space-for-Automated-Document-Rus-Summers",
            "title": {
                "fragments": [],
                "text": "Using White Space for Automated Document Structuring"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The key idea is to use the patterns in the distribution of white space in a document to recognize and interpret its components to allow the automatic markup of documents and the creation of multi-level indices and browsing tools for electronic libraries."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716902"
                        ],
                        "name": "Marti A. Hearst",
                        "slug": "Marti-A.-Hearst",
                        "structuredName": {
                            "firstName": "Marti",
                            "lastName": "Hearst",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Marti A. Hearst"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2302203"
                        ],
                        "name": "C. Plaunt",
                        "slug": "C.-Plaunt",
                        "structuredName": {
                            "firstName": "Christian",
                            "lastName": "Plaunt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Plaunt"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5390627,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "74ade10f9ce9247c2cc853e2b29775a400eb0c6c",
            "isKey": false,
            "numCitedBy": 428,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "We argue that the advent of large volumes of full-length text, as opposed to short texts like abstracts and newswire, should be accompanied by corresponding new approaches to information access. Toward this end, we discuss the merits of imposing structure on full-length text documents; that is, a partition of the text into coherent multi-paragraph units that represent the pattern of subtopics that comprise the text. Using this structure, we can make a distinction between the main topics, which occur throughout the length of the text, and the subtopics, which are of only limited extent. We discuss why recognition of subtopic structure is important and how, to some degree of accuracy, it can be found. We describe a new way of specifying queries on full-length documents and then describe an experiment in which making use of the recognition of local structure achieves better results on a typical information retrieval task than does a standard IR measure."
            },
            "slug": "Subtopic-structuring-for-full-length-document-Hearst-Plaunt",
            "title": {
                "fragments": [],
                "text": "Subtopic structuring for full-length document access"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "It is argued that the advent of large volumes of full-length text, as opposed to short texts like abstracts and newswire, should be accompanied by corresponding new approaches to information access and a partition of the text into coherent multi-paragraph units that represent the pattern of subtopics that comprise the text."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2530543"
                        ],
                        "name": "B. Donald",
                        "slug": "B.-Donald",
                        "structuredName": {
                            "firstName": "Bruce",
                            "lastName": "Donald",
                            "middleNames": [
                                "Randall"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Donald"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143784744"
                        ],
                        "name": "J. Jennings",
                        "slug": "J.-Jennings",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Jennings",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Jennings"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145944286"
                        ],
                        "name": "D. Rus",
                        "slug": "D.-Rus",
                        "structuredName": {
                            "firstName": "Daniela",
                            "lastName": "Rus",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Rus"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2274653,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6b80c618c4bab9146d314021c96d886a2e5029d2",
            "isKey": false,
            "numCitedBy": 32,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "We have designed and implemented multi-agent strategies for manipulation tasks by distributing mechanically-based sequential algorithms across several autonomous spatially-separated agents, such as mobile robots. Our experience using mobile robots for the manipulation of large objects (couches, boxes, file cabinets, etc.) leads us to recommend a minimalist architecture for multi-agent programming. In particular, our methodology has led us to derive asynchronous distributed strategies that require no direct communication between agents, and very sparse geometric and dynamic models of the objects our robots manipulate. We argue for a design principle called supermodularity, which is orthogonal both to the notion of modularity in cognitive AI and also to horizontal decomposition (the non-modularity advocated in the subsumption/connectionist literature.) Finally, we discuss a simple mobotscheme infrastructure to implement supermodular architectures. In the past few years we have programmed many supermodular m..."
            },
            "slug": "Minimalism-Distribution-Supermodularity-Donald-Jennings",
            "title": {
                "fragments": [],
                "text": "Minimalism Distribution Supermodularity"
            },
            "venue": {
                "fragments": [],
                "text": "J. Exp. Theor. Artif. Intell."
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40975594"
                        ],
                        "name": "Tom Michael Mitchell",
                        "slug": "Tom-Michael-Mitchell",
                        "structuredName": {
                            "firstName": "Tom",
                            "lastName": "Mitchell",
                            "middleNames": [
                                "Michael"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tom Michael Mitchell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145727186"
                        ],
                        "name": "R. Caruana",
                        "slug": "R.-Caruana",
                        "structuredName": {
                            "firstName": "Rich",
                            "lastName": "Caruana",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Caruana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1758106"
                        ],
                        "name": "Dayne Freitag",
                        "slug": "Dayne-Freitag",
                        "structuredName": {
                            "firstName": "Dayne",
                            "lastName": "Freitag",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dayne Freitag"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14828509"
                        ],
                        "name": "J. McDermott",
                        "slug": "J.-McDermott",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "McDermott",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. McDermott"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39787642"
                        ],
                        "name": "David Zabowski",
                        "slug": "David-Zabowski",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Zabowski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David Zabowski"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8528878,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a9565f70db3a6b5e4ff1df272238b8d7a84a1337",
            "isKey": false,
            "numCitedBy": 511,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "Personal software assistants that help users with tasks like finding information, scheduling calendars, or managing work-flow will require significant customization to each individual user. For example, an assistant that helps schedule a particular user’s calendar will have to know that user’s scheduling preferences. This paper explores the potential of machine learning methods to automatically create and maintain such customized knowledge for personal software assistants. We describe the design of one particular learning assistant: a calendar manager, called CAP (Calendar APprentice), that learns user scheduling preferences from experience. Results are summarized from approximately five user-years of experience, during which CAP has learned an evolving set of several thousand rules that characterize the scheduling preferences of its users. Based on this experience, we suggest that machine learning methods may play an important role in future personal software assistants."
            },
            "slug": "Experience-with-a-learning-personal-assistant-Mitchell-Caruana",
            "title": {
                "fragments": [],
                "text": "Experience with a learning personal assistant"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The design of one particular learning assistant is described: a calendar manager, called CAP (Calendar APprentice), that learns user scheduling preferences from experience and suggests that machine learning methods may play an important role in future personal software assistants."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144430625"
                        ],
                        "name": "S. Robertson",
                        "slug": "S.-Robertson",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Robertson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Robertson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 43247455,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0b9afaaf29f129253d480490559f05b756b5dcbf",
            "isKey": false,
            "numCitedBy": 111,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "Information retrieval systems have been the subject of experimental testing for some twenty years now. Like any field in this position, a fair amount of know-how has accumulated about the proper conduct of such investigations. The object of this book is to distil this know-how; the object of this chapter is to set the scene. Thus I will be introducing the basic ideas, sketching in some of the main problem areas, and generally preparing the reader for the more specific or concrete chapters that follow. Van Rijsbergen takes up the question of the evaluation of retrieval effectiveness in Chapter 3; in Chapter 4, Belkin considers information retrieval in a wider context; and in Chapter 5, Tague gets down to the detail of conducting experiments."
            },
            "slug": "The-methodology-of-information-retrieval-experiment-Robertson",
            "title": {
                "fragments": [],
                "text": "The methodology of information retrieval experiment"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This chapter is to set the scene, introducing the basic ideas, sketching in some of the main problem areas, and generally preparing the reader for the more specific or concrete chapters that follow."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145916951"
                        ],
                        "name": "G. Nagy",
                        "slug": "G.-Nagy",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Nagy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Nagy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145062511"
                        ],
                        "name": "S. Seth",
                        "slug": "S.-Seth",
                        "structuredName": {
                            "firstName": "Sharad",
                            "lastName": "Seth",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Seth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145266621"
                        ],
                        "name": "M. Viswanathan",
                        "slug": "M.-Viswanathan",
                        "structuredName": {
                            "firstName": "Mahesh",
                            "lastName": "Viswanathan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Viswanathan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 2530196,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "62a53caea5213ea177298d7b2aff292b1386c37a",
            "isKey": false,
            "numCitedBy": 434,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Gobbledoc, a system providing remote access to stored documents, which is based on syntactic document analysis and optical character recognition (OCR), is discussed. In Gobbledoc, image processing, document analysis, and OCR operations take place in batch mode when the documents are acquired. The document image acquisition process and the knowledge base that must be entered into the system to process a family of page images are described. The process by which the X-Y tree data structure converts a 2-D page-segmentation problem into a series of 1-D string-parsing problems that can be tackled using conventional compiler tools is also described. Syntactic analysis is used in Gobbledoc to divide each page into labeled rectangular blocks. Blocks labeled text are converted by OCR to obtain a secondary (ASCII) document representation. Since such symbolic files are better suited for computerized search than for human access to the document content and because too many visual layout clues are lost in the OCR process (including some special characters), Gobbledoc preserves the original block images for human browsing. Storage, networking, and display issues specific to document images are also discussed.<<ETX>>"
            },
            "slug": "A-prototype-document-image-analysis-system-for-Nagy-Seth",
            "title": {
                "fragments": [],
                "text": "A prototype document image analysis system for technical journals"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The document image acquisition process and the knowledge base that must be entered into the system to process a family of page images are described, and the process by which the X-Y tree data structure converts a 2-D page-segmentation problem into a series of 1-D string-parsing problems that can be tackled using conventional compiler tools."
            },
            "venue": {
                "fragments": [],
                "text": "Computer"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2530543"
                        ],
                        "name": "B. Donald",
                        "slug": "B.-Donald",
                        "structuredName": {
                            "firstName": "Bruce",
                            "lastName": "Donald",
                            "middleNames": [
                                "Randall"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Donald"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 6733068,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d3433789790294caa31904647260f7c0aeb00cbd",
            "isKey": false,
            "numCitedBy": 163,
            "numCiting": 65,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "On-Information-Invariants-in-Robotics-Donald",
            "title": {
                "fragments": [],
                "text": "On Information Invariants in Robotics"
            },
            "venue": {
                "fragments": [],
                "text": "Artif. Intell."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145470231"
                        ],
                        "name": "Kwan Y. Wong",
                        "slug": "Kwan-Y.-Wong",
                        "structuredName": {
                            "firstName": "Kwan",
                            "lastName": "Wong",
                            "middleNames": [
                                "Y."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kwan Y. Wong"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34896449"
                        ],
                        "name": "R. Casey",
                        "slug": "R.-Casey",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Casey",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Casey"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1880661"
                        ],
                        "name": "F. Wahl",
                        "slug": "F.-Wahl",
                        "structuredName": {
                            "firstName": "Friedrich",
                            "lastName": "Wahl",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Wahl"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 15921038,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7abca302c74d2f5adfd323a28e26d40b019df2b5",
            "isKey": false,
            "numCitedBy": 594,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper outlines the requirements and components for a proposed Document Analysis System, which assists a user in encoding printed documents for computer processing. Several critical functions have been investigated and the technical approaches are discussed. The first is the segmentation and classification of digitized printed documents into regions of text and images. A nonlinear, run-length smoothing algorithm has been used for this purpose. By using the regular features of text lines, a linear adaptive classification scheme discriminates text regions from others. The second technique studied is an adaptive approach to the recognition of the hundreds of font styles and sizes that can occur on printed documents. A preclassifier is constructed during the input process and used to speed up a well-known pattern-matching method for clustering characters from an arbitrary print source into a small sample of prototypes. Experimental results are included."
            },
            "slug": "Document-Analysis-System-Wong-Casey",
            "title": {
                "fragments": [],
                "text": "Document Analysis System"
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "The requirements and components for a proposed Document Analysis System, which assists a user in encoding printed documents for computer processing, are outlined and several critical functions have been investigated and the technical approaches are discussed."
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. Dev."
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2530543"
                        ],
                        "name": "B. Donald",
                        "slug": "B.-Donald",
                        "structuredName": {
                            "firstName": "Bruce",
                            "lastName": "Donald",
                            "middleNames": [
                                "Randall"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Donald"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143784744"
                        ],
                        "name": "J. Jennings",
                        "slug": "J.-Jennings",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Jennings",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Jennings"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2117380759"
                        ],
                        "name": "Russell G. Brown",
                        "slug": "Russell-G.-Brown",
                        "structuredName": {
                            "firstName": "Russell",
                            "lastName": "Brown",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Russell G. Brown"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7142743,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4181f2a146e7472cb03f10f254039b98cb621986",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 55,
            "paperAbstract": {
                "fragments": [],
                "text": "A principled theory of sensing and action is crucial in developing task-level programming for autonomous mobile robots. A framework for such a theory is proposed, providing both a precise vocabulary and also appropriate computational machinery for working with issues of information flow in and through a robot system equipped with various types of sensors and operating in a dynamic unstructured environment. The authors focus on the problem of constructing virtual sensors out of concrete sensors. Virtual sensors may be defined in terms of existing concrete sensors. A method of task-directed construction of such virtual sensors is described. Virtual sensors are queried in robot programs much as their concrete counterparts are. In allowing the task to direct the composition of virtual sensors, robot programs which are organized in such a way as to guide the robot toward acquiring the information it needs to accomplish the task can be derived. Many information-acquisition and representational issues are made explicit.<<ETX>>"
            },
            "slug": "Constructive-recognizability-for-task-directed-Donald-Jennings",
            "title": {
                "fragments": [],
                "text": "Constructive recognizability for task-directed robot programming"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "A framework for a principled theory of sensing and action is proposed, providing both a precise vocabulary and also appropriate computational machinery for working with issues of information flow in and through a robot system equipped with various types of sensors and operating in a dynamic unstructured environment."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings 1992 IEEE International Conference on Robotics and Automation"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72419159"
                        ],
                        "name": "R. Brooks",
                        "slug": "R.-Brooks",
                        "structuredName": {
                            "firstName": "Rodney",
                            "lastName": "Brooks",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Brooks"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7454683,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dab20ffbe49cf1e3eeb347ae5fc5ca06018f08af",
            "isKey": false,
            "numCitedBy": 1426,
            "numCiting": 63,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Elephants-don't-play-chess-Brooks",
            "title": {
                "fragments": [],
                "text": "Elephants don't play chess"
            },
            "venue": {
                "fragments": [],
                "text": "Robotics Auton. Syst."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "98455338"
                        ],
                        "name": "Y. Tsuji",
                        "slug": "Y.-Tsuji",
                        "structuredName": {
                            "firstName": "Yoshitake",
                            "lastName": "Tsuji",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Tsuji"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2774704"
                        ],
                        "name": "H. Kami",
                        "slug": "H.-Kami",
                        "structuredName": {
                            "firstName": "Hiroyuki",
                            "lastName": "Kami",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Kami"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46906628"
                        ],
                        "name": "M. Mizuno",
                        "slug": "M.-Mizuno",
                        "structuredName": {
                            "firstName": "Masaaki",
                            "lastName": "Mizuno",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Mizuno"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116800754"
                        ],
                        "name": "Toshiyuki Tanaka",
                        "slug": "Toshiyuki-Tanaka",
                        "structuredName": {
                            "firstName": "Toshiyuki",
                            "lastName": "Tanaka",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Toshiyuki Tanaka"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115481082"
                        ],
                        "name": "Haruhiko Tanaka",
                        "slug": "Haruhiko-Tanaka",
                        "structuredName": {
                            "firstName": "Haruhiko",
                            "lastName": "Tanaka",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Haruhiko Tanaka"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3052051"
                        ],
                        "name": "M. Iwashita",
                        "slug": "M.-Iwashita",
                        "structuredName": {
                            "firstName": "Masao",
                            "lastName": "Iwashita",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Iwashita"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33977461"
                        ],
                        "name": "T. Temma",
                        "slug": "T.-Temma",
                        "structuredName": {
                            "firstName": "Tsutomu",
                            "lastName": "Temma",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Temma"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15215724,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5919df40a680b210520f6ea223487e9da9e27e66",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "1. Abstract A document input system, with character recognition technique, is used for converting printed matter, such as books and magazines, into code-format information. In order to improve this document input system's performance, an appropriate document structure analysis technique is indispen~able(''~'). When storing data from general printed documents into a database, it is necessary to represent the document structure. Therefore, a document layout structure generation method is especially important(*)(6). For this purpose, the authors have developed a document image structure analysis method to generate a layout structure, as well as to detect such document elements as characters, pictures and figures. This method was developed on a personal computer. Its usability is described in this paper."
            },
            "slug": "Document-Recognition-System-with-Layout-Structure-Tsuji-Kami",
            "title": {
                "fragments": [],
                "text": "Document Recognition System with Layout Structure Generator"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The authors have developed a document image structure analysis method to generate a layout structure, as well as to detect such document elements as characters, pictures and figures."
            },
            "venue": {
                "fragments": [],
                "text": "MVA"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1797808"
                        ],
                        "name": "G. Salton",
                        "slug": "G.-Salton",
                        "structuredName": {
                            "firstName": "Gerard",
                            "lastName": "Salton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Salton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144009691"
                        ],
                        "name": "C. Buckley",
                        "slug": "C.-Buckley",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Buckley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Buckley"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 37
                            }
                        ],
                        "text": "We can interpret \nthe classical work [Salton and Buckley 1990; Salton and McGill 1983] in information retrieval (IR) as \nfollows: the data environment is text; the unit of structure is typically a word; the detectors constructed \nin the IR literature are pattern matchers over words; the segmenters…"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 17637032,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "2ebb3dd597bbd7028d8c68bcf509e5bb09ea1e78",
            "isKey": false,
            "numCitedBy": 1442,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "Relevance feedback is an automatic process, introduced over 20 years ago, designed to produce query formulations following an initial retrieval operation. The principal relevance feedback methods described over the years are examined briefly, and evaluation data are included to demonstrate the effectiveness of the various methods. Prescriptions are given for conducting text retrieval operations iteratively using relevance feedback."
            },
            "slug": "Improving-retrieval-performance-by-relevance-Salton-Buckley",
            "title": {
                "fragments": [],
                "text": "Improving retrieval performance by relevance feedback"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Prescriptions are given for conducting text retrieval operations iteratively using relevance feedback, and evaluation data are included to demonstrate the effectiveness of the various methods."
            },
            "venue": {
                "fragments": [],
                "text": "J. Am. Soc. Inf. Sci."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143624243"
                        ],
                        "name": "M. Blum",
                        "slug": "M.-Blum",
                        "structuredName": {
                            "firstName": "Manuel",
                            "lastName": "Blum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Blum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1700801"
                        ],
                        "name": "D. Kozen",
                        "slug": "D.-Kozen",
                        "structuredName": {
                            "firstName": "Dexter",
                            "lastName": "Kozen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Kozen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 17
                            }
                        ],
                        "text": "A GCD algorithm [Blum and Kozen 1978] can \nbe used to determine the type, if any, of the overall matrix and thus to decide whether the matrix represents \na table."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 11806648,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "4950d1e46c678c87fae195bbb9974d5ce63c1e80",
            "isKey": false,
            "numCitedBy": 201,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "About the same time, A.N. Shah gave a finite autom~ton with 5 pebbles which could search an arbitrary maze (the autonlaton may drop a pebble on a cell it is visiting, then upon returning to that cell later on can sense the pebble's presence, and if desired pick it up and move it to a new cell). Shah also conjectured that fewer than 5 pebbles would not suffice. The first of our two main results is that, contrary to Shah's conjecture, the search can be implemented with just two pebbles. The question is still open whether a finite automaton with just one pebble can search any maze."
            },
            "slug": "On-the-power-of-the-compass-(or,-why-mazes-are-to-Blum-Kozen",
            "title": {
                "fragments": [],
                "text": "On the power of the compass (or, why mazes are easier to search than graphs)"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The first of the two main results is that, contrary to Shah's conjecture, the search can be implemented with just two pebbles and the question is still open whether a finite automaton with just one pebble can search any maze."
            },
            "venue": {
                "fragments": [],
                "text": "19th Annual Symposium on Foundations of Computer Science (sfcs 1978)"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699184"
                        ],
                        "name": "G. Robertson",
                        "slug": "G.-Robertson",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Robertson",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Robertson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1777393"
                        ],
                        "name": "J. Mackinlay",
                        "slug": "J.-Mackinlay",
                        "structuredName": {
                            "firstName": "Jock",
                            "lastName": "Mackinlay",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mackinlay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1720492"
                        ],
                        "name": "S. Card",
                        "slug": "S.-Card",
                        "structuredName": {
                            "firstName": "Stuart",
                            "lastName": "Card",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Card"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 121,
                                "start": 100
                            }
                        ],
                        "text": "The work most relevant to our project is that of the information visualization group at Xerox \nParc [Robertson et al. 1993]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2463503,
            "fieldsOfStudy": [
                "Art",
                "Computer Science"
            ],
            "id": "5ea10bb467520ed6b3816617b1e423f60ebab45c",
            "isKey": false,
            "numCitedBy": 336,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "INTRODUCTION Information Visualization uses computer graphics and interactive animation to stimulate recognition of patterns and structure in information. It does so by exploiting the human perceptual system in ways similar to Scientific Visualization, which allows scientists to perceive patterns in large data collections. While Scientific Visualization typically works on data from simulations of physical processes, Information Visualization works on the structure of information inherent in large information spaces. This video shows a prototype system, called the Information Visualizer, and two information visualization techniques used to access information both by structure and by content. Cone Trees are used for visualizing hierarchical information structures. The Perspective Wall is used for visualizing linear information structures. Both techniques use 3D to maximize effective use of available screen space and enable visualization of the whole structure. Interactive animation is used to shift some of the user’s cognitive load to the human perceptual system. The video concludes with a series of examples from an application scenario, based on managing an organization."
            },
            "slug": "Information-visualization-using-3D-interactive-Robertson-Mackinlay",
            "title": {
                "fragments": [],
                "text": "Information visualization using 3D interactive animation"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This video shows a prototype system, called the Information Visualizer, and two information visualization techniques used to access information both by structure and by content, and a series of examples from an application scenario, based on managing an organization."
            },
            "venue": {
                "fragments": [],
                "text": "CHI"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1720178"
                        ],
                        "name": "J. Balcázar",
                        "slug": "J.-Balcázar",
                        "structuredName": {
                            "firstName": "José",
                            "lastName": "Balcázar",
                            "middleNames": [
                                "Luís"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Balcázar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145486523"
                        ],
                        "name": "Josep Díaz",
                        "slug": "Josep-Díaz",
                        "structuredName": {
                            "firstName": "Josep",
                            "lastName": "Díaz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Josep Díaz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1708773"
                        ],
                        "name": "J. Gabarró",
                        "slug": "J.-Gabarró",
                        "structuredName": {
                            "firstName": "Joaquim",
                            "lastName": "Gabarró",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gabarró"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 71,
                                "start": 51
                            }
                        ],
                        "text": "We represent an agent \nin the language of circuits [Balca´zar et al. 1988]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 19215407,
            "fieldsOfStudy": [
                "Linguistics"
            ],
            "id": "4d1e15c60ddf1ff1db11becdabc74bbf983e5e91",
            "isKey": false,
            "numCitedBy": 670,
            "numCiting": 115,
            "paperAbstract": {
                "fragments": [],
                "text": "This is the first volume of a systematic two-volume presentation of the various areas of research on structural complexity. The theory of algorithmic complexity, a part of the mathematical theory of computation, can be approached from several points of view, one of which is the structural one. This volume is written for undergraduate students who have taken a first course in Formal Language Theory. It presents the basic concepts of structural complexity, thus providing the background necessary for the understanding of complexity theory. The second corrected edition has been extended by an appendix with recent results on nondeterministic space classes and updated with regard to the bibliographical remarks and the references."
            },
            "slug": "Structural-Complexity-I-Balcázar-Díaz",
            "title": {
                "fragments": [],
                "text": "Structural Complexity I"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This volume is written for undergraduate students who have taken a first course in Formal Language Theory and presents the basic concepts of structural complexity, thus providing the background necessary for the understanding of complexity theory."
            },
            "venue": {
                "fragments": [],
                "text": "Texts in Theoretical Computer Science An EATCS Series"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1797808"
                        ],
                        "name": "G. Salton",
                        "slug": "G.-Salton",
                        "structuredName": {
                            "firstName": "Gerard",
                            "lastName": "Salton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Salton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144321599"
                        ],
                        "name": "M. McGill",
                        "slug": "M.-McGill",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "McGill",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. McGill"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 180,
                                "start": 175
                            }
                        ],
                        "text": "For example, the ability to recognize the logical and layout structure of documents provides \nautomatic support for the SGML-like markup of documents that text retrievers like Smart require. for \nnontext environments, structures based on geometry and other domains are necessary for content-directed \nretrieval of information."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 189,
                                "start": 167
                            }
                        ],
                        "text": "These structures have evolved as conventions \nfor organizing documents and can be naturally exploited as filters to select 1Conventional word-based \nsystems like Smart [Salton and McGill 1983] are also structure­based ICA systems."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 46,
                                "start": 41
                            }
                        ],
                        "text": "3We use \nthe information retrieval system Smart [Allen and Salton 1993] to cluster on this topic."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 84,
                                "start": 62
                            }
                        ],
                        "text": "We can interpret \nthe classical work [Salton and Buckley 1990; Salton and McGill 1983] in information retrieval (IR) as \nfollows: the data environment is text; the unit of structure is typically a word; the detectors constructed \nin the IR literature are pattern matchers over words; the segmenters…"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 155,
                                "start": 133
                            }
                        ],
                        "text": "Our long-term goal is to computationally characterize methods such \nas statistics over character sequences [Pearce and Nicholas 1993; Salton and McGill 1983], statistics \nover word occurrence, layout and geometry, and other notions of structure with respect to information \ncontent."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 43685115,
            "fieldsOfStudy": [
                "Medicine"
            ],
            "id": "49af3e80343eb80c61e727ae0c27541628c7c5e2",
            "isKey": true,
            "numCitedBy": 12605,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Some people may be laughing when looking at you reading in your spare time. Some may be admired of you. And some may want be like you who have reading hobby. What about your own feel? Have you felt right? Reading is a need and a hobby at once. This condition is the on that will make you feel that you must read. If you know are looking for the book enPDFd introduction to modern information retrieval as the choice of reading, you can find here."
            },
            "slug": "Introduction-to-Modern-Information-Retrieval-Salton-McGill",
            "title": {
                "fragments": [],
                "text": "Introduction to Modern Information Retrieval"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "Reading is a need and a hobby at once and this condition is the on that will make you feel that you must read."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1706504"
                        ],
                        "name": "J. Hopcroft",
                        "slug": "J.-Hopcroft",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Hopcroft",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hopcroft"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1742391"
                        ],
                        "name": "J. Ullman",
                        "slug": "J.-Ullman",
                        "structuredName": {
                            "firstName": "Jeffrey",
                            "lastName": "Ullman",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Ullman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 31901407,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "41a88a490d7ba9e383ecb16c4290083413a08258",
            "isKey": false,
            "numCitedBy": 13820,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Introduction-to-Automata-Theory,-Languages-and-Hopcroft-Ullman",
            "title": {
                "fragments": [],
                "text": "Introduction to Automata Theory, Languages and Computation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72419159"
                        ],
                        "name": "R. Brooks",
                        "slug": "R.-Brooks",
                        "structuredName": {
                            "firstName": "Rodney",
                            "lastName": "Brooks",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Brooks"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10542804,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4af77aafa93f810e403461e5ee911287aa16d76e",
            "isKey": false,
            "numCitedBy": 9081,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "A new architecture for controlling mobile robots is described. Layers of control system are built to let the robot operate at increasing levels of competence. Layers are made up of asynchronous modules that communicate over low-bandwidth channels. Each module is an instance of a fairly simple computational machine. Higher-level layers can subsume the roles of lower levels by suppressing their outputs. However, lower levels continue to function as higher levels are added. The result is a robust and flexible robot control system. The system has been used to control a mobile robot wandering around unconstrained laboratory areas and computer machine rooms. Eventually it is intended to control a robot that wanders the office areas of our laboratory, building maps of its surroundings using an onboard arm to perform simple tasks."
            },
            "slug": "A-robust-layered-control-system-for-a-mobile-robot-Brooks",
            "title": {
                "fragments": [],
                "text": "A robust layered control system for a mobile robot"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "A new architecture for controlling mobile robots is described, building a robust and flexible robot control system that has been used to control a mobile robot wandering around unconstrained laboratory areas and computer machine rooms."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE J. Robotics Autom."
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2270291"
                        ],
                        "name": "S. Tsujimoto",
                        "slug": "S.-Tsujimoto",
                        "structuredName": {
                            "firstName": "Shuichi",
                            "lastName": "Tsujimoto",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Tsujimoto"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3358140"
                        ],
                        "name": "H. Asada",
                        "slug": "H.-Asada",
                        "structuredName": {
                            "firstName": "Haruo",
                            "lastName": "Asada",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Asada"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62000868,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1248ffebf372e65e2ced57f014d8dd933050ab30",
            "isKey": false,
            "numCitedBy": 153,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "The document image processes used in a recently developed text reading system are described. The system consists of three major components: document analysis, document understanding, and character segmentation/recognition. The document analysis component extracts lines of text from a page for recognition. The document understanding component extracts logical relationships between the document constituents. The character segmentation/recognition component extracts characters from a text line and recognizes them. Experiments on more than a hundred documents have proved that the proposed approaches to document analysis and document understanding are robust even for multicolumned and multiarticle documents containing graphics and photographs, and that the proposed character segmentation/recognition method is robust enough to cope with omnifont characters which frequently touch each other. >"
            },
            "slug": "Major-components-of-a-complete-text-reading-system-Tsujimoto-Asada",
            "title": {
                "fragments": [],
                "text": "Major components of a complete text reading system"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "Experiments have proved that the proposed approaches to document analysis and document understanding are robust even for multicolumned and multiarticle documents containing graphics and photographs, and thatThe proposed character segmentation/recognition method is robust enough to cope with omnifont characters which frequently touch each other."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2911738"
                        ],
                        "name": "D. Angluin",
                        "slug": "D.-Angluin",
                        "structuredName": {
                            "firstName": "Dana",
                            "lastName": "Angluin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Angluin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1741124"
                        ],
                        "name": "L. Valiant",
                        "slug": "L.-Valiant",
                        "structuredName": {
                            "firstName": "Leslie",
                            "lastName": "Valiant",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Valiant"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 1279641,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d2bab38d12c4ee82319cc89d16bca21b301a7138",
            "isKey": false,
            "numCitedBy": 666,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The main purpose of this paper is to give techniques for analysing the probabilistic performance of certain kinds of algorithms, and hence to suggest some fast algorithms with provably desirable probabilistic behaviour. The particular problems we consider are: finding Hamiltonian circuits in directed graphs (DHC), finding Hamiltonian circuits in undirected graphs (UHC), and finding perfect matchings in undirected graphs (PM). We show that for each problem there is an algorithm that is extremely fast (0(n(log n)2) for DHC and UHC, and 0(nlog n) for PM), and which with probability tending to one finds a solution in randomly chosen graphs of sufficient density. These results contrast with the known NP-completeness of the first two problems [2,12] and the best worst-case upper bound known of 0(n2.5) for the last [9]."
            },
            "slug": "Fast-probabilistic-algorithms-for-hamiltonian-and-Angluin-Valiant",
            "title": {
                "fragments": [],
                "text": "Fast Probabilistic Algorithms for Hamiltonian Circuits and Matchings"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "It is shown that for each problem there is an algorithm that is extremely fast, and which with probability tending to one finds a solution in randomly chosen graphs of sufficient density, and the results contrast with the known NP-completeness of the first two problems."
            },
            "venue": {
                "fragments": [],
                "text": "J. Comput. Syst. Sci."
            },
            "year": 1979
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34878566"
                        ],
                        "name": "H. Fujisawa",
                        "slug": "H.-Fujisawa",
                        "structuredName": {
                            "firstName": "Hiromichi",
                            "lastName": "Fujisawa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Fujisawa"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737939"
                        ],
                        "name": "Y. Nakano",
                        "slug": "Y.-Nakano",
                        "structuredName": {
                            "firstName": "Yasuaki",
                            "lastName": "Nakano",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Nakano"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6572034"
                        ],
                        "name": "K. Kurino",
                        "slug": "K.-Kurino",
                        "structuredName": {
                            "firstName": "K.",
                            "lastName": "Kurino",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Kurino"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62753568,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "118c2465b0f00736c743883be62a45eca580cf8c",
            "isKey": false,
            "numCitedBy": 255,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "A pattern-oriented segmentation method for optical character recognition that leads to document structure analysis is presented. As a first example, segmentation of handwritten numerals that touch are treated. Connected pattern components are extracted, and spatial interrelations between components are measured and grouped into meaningful character patterns. Stroke shapes are analyzed and a method of finding the touching positions that separates about 95% of connected numerals correctly is described. Ambiguities are handled by multiple hypotheses and verification by recognition. An extended form of pattern-oriented segmentation, tabular form recognition, is considered. Images of tabular forms are analyzed, and frames in the tabular structure are extracted. By identifying semantic relationships between label frames and data frames, information on the form can be properly recognized. >"
            },
            "slug": "Segmentation-methods-for-character-recognition:-to-Fujisawa-Nakano",
            "title": {
                "fragments": [],
                "text": "Segmentation methods for character recognition: from segmentation to document structure analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "A pattern- oriented segmentation method for optical character recognition that leads to document structure analysis is presented, and an extended form of pattern-oriented segmentation, tabular form recognition, is considered."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3142223"
                        ],
                        "name": "M. Lesk",
                        "slug": "M.-Lesk",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Lesk",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Lesk"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 8687061,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3b7c7739ac1d7687bd03f6715e5100bfce40b02d",
            "isKey": false,
            "numCitedBy": 23,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "A major online file of chemical journal literature complete with graphics is being developed to test theusability of fully eleckonic access to documents. Thetest file will include tenyears of the American Chemical Society’s online journals, supplemented with the graphics from the paper publibation, mdthekdexing of thewticles from Chemical Abs&acts. Ourgoals are(l) to assess the effectiveness and acceptability of electronic access to primary journals as compared with paper, and (2) to identify the most desirable functions of the user interface to an electronic system of journals, including in particular a comparison of page image display with Ascii display interfaces. This paper describes the chemical journal data, the interfaces for searching and reading it, and the experiments being done."
            },
            "slug": "The-CORE-electronic-chemistry-library-Lesk",
            "title": {
                "fragments": [],
                "text": "The CORE electronic chemistry library"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The chemical journal data, the interfaces for searching and reading it, and the experiments being done are described, to assess the effectiveness and acceptability of electronic access to primary journals as compared with paper."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR '91"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713089"
                        ],
                        "name": "D. Huttenlocher",
                        "slug": "D.-Huttenlocher",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Huttenlocher",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Huttenlocher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102957487"
                        ],
                        "name": "Jae J. Noh",
                        "slug": "Jae-J.-Noh",
                        "structuredName": {
                            "firstName": "Jae",
                            "lastName": "Noh",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jae J. Noh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116003"
                        ],
                        "name": "W. Rucklidge",
                        "slug": "W.-Rucklidge",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Rucklidge",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Rucklidge"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 474612,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "4bba44fd7661f2f1665cd32f7880614ed0303dcf",
            "isKey": false,
            "numCitedBy": 280,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "The authors describe a model-based method for tracking nonrigid objects moving in a complex scene. The method operates by extracting two-dimensional models of an object from a sequence of images. The basic idea underlying the technique is to decompose the image of a solid object moving in space into two components: a two-dimensional motion and a two-dimensional shape change. The motion component is factored out and the shape change is represented explicitly by a sequence of two-dimensional models, one corresponding to each image frame. The major assumption underlying the method is that the two-dimensional shape of an object will change slowly from one frame to the next. There is no assumption, however, that the two-dimensional image motion between successive frames will be small.<<ETX>>"
            },
            "slug": "Tracking-non-rigid-objects-in-complex-scenes-Huttenlocher-Noh",
            "title": {
                "fragments": [],
                "text": "Tracking non-rigid objects in complex scenes"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "A model-based method for tracking nonrigid objects moving in a complex scene by extracting two-dimensional models of an object from a sequence of images to decompose the image of a solid object moving in space into two components."
            },
            "venue": {
                "fragments": [],
                "text": "1993 (4th) International Conference on Computer Vision"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145295484"
                        ],
                        "name": "Anil K. Jain",
                        "slug": "Anil-K.-Jain",
                        "structuredName": {
                            "firstName": "Anil",
                            "lastName": "Jain",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Anil K. Jain"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1757655"
                        ],
                        "name": "S. Bhattacharjee",
                        "slug": "S.-Bhattacharjee",
                        "structuredName": {
                            "firstName": "Sushil",
                            "lastName": "Bhattacharjee",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Bhattacharjee"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 17365363,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "adc0ca85d1a8033b3e3d886a3417365f5d56f59d",
            "isKey": false,
            "numCitedBy": 100,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Address-block-location-on-envelopes-using-Gabor-Jain-Bhattacharjee",
            "title": {
                "fragments": [],
                "text": "Address block location on envelopes using Gabor filters"
            },
            "venue": {
                "fragments": [],
                "text": "Pattern Recognit."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69393819"
                        ],
                        "name": "J. Munkres",
                        "slug": "J.-Munkres",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Munkres",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Munkres"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 116902902,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "3f107f1b9ffb1d191f41fcd2d132e6c4c8aa2f5d",
            "isKey": false,
            "numCitedBy": 1334,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "Topology: a first course , Topology: a first course , کتابخانه دیجیتال و فن آوری اطلاعات دانشگاه امام صادق(ع)"
            },
            "slug": "Topology;-a-first-course-Munkres",
            "title": {
                "fragments": [],
                "text": "Topology; a first course"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1974
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70416525"
                        ],
                        "name": "W. Hoeffding",
                        "slug": "W.-Hoeffding",
                        "structuredName": {
                            "firstName": "Wassily",
                            "lastName": "Hoeffding",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Hoeffding"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 121341745,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "c66db9b93d75c0ff52e7f84605b8389345307006",
            "isKey": false,
            "numCitedBy": 8037,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract Upper bounds are derived for the probability that the sum S of n independent random variables exceeds its mean ES by a positive number nt. It is assumed that the range of each summand of S is bounded or bounded above. The bounds for Pr {S – ES ≥ nt} depend only on the endpoints of the ranges of the summands and the mean, or the mean and the variance of S. These results are then used to obtain analogous inequalities for certain sums of dependent random variables such as U statistics and the sum of a random sample without replacement from a finite population."
            },
            "slug": "Probability-inequalities-for-sum-of-bounded-random-Hoeffding",
            "title": {
                "fragments": [],
                "text": "Probability Inequalities for sums of Bounded Random Variables"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66357154"
                        ],
                        "name": "D. Sankhoff",
                        "slug": "D.-Sankhoff",
                        "structuredName": {
                            "firstName": "D",
                            "lastName": "Sankhoff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Sankhoff"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "10398168"
                        ],
                        "name": "J. Kruskal",
                        "slug": "J.-Kruskal",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Kruskal",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kruskal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 57425668,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ee996c5985353bc90d3415f1414d28aefb2834bb",
            "isKey": false,
            "numCitedBy": 475,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "1. An overview of sequence comparison Joseph B. Kruskal Part I. Macromolecular Sequences: 2. Recognition of patterns in genetic sequences Bruce W. Erickson and Peter H. Sellers 3. Fast algorithms to determine RNA secondary structures containing multiple loops David Sankoff, Joseph B. Kruskal, Sylvie Mainville and Robert J. Cedergren Part II. Time-Warping, Continuous Functions, and Speech Processing 4. The symmetric time-warping problem: from continuous to discrete Joseph B. Kruskal and Mark Liberman 5. Use of dynamic programming in a syllable-based continuous speech recognition system Melvyn J. Hunt, Matthew Lennig and Paul Mermelstein 6. Application of sequence comparison to the study of bird songs David W. Bradley and Richard A. Bradley Part III. Variations on a Theme: Algorithms for Related Problems: 7. On the complexity of the extended string-to-string correction problem Robert A. Wagner 8. An analysis of the general tree-editing problem Andrew S. Noetzel and Stanley M. Selkow 9. Simultaneous comparison of three or more sequences related by a tree David Sankoff and Robert J. Cedergren 10. An anthology of algorithms and concepts for sequence comparison Joseph B. Kruskal and David Sankoff 11. Dissimilarity measures for clustering strings James M. Coggins Part IV. Computational Complexity: 12. Recent results on the complexity of common-subsequence problems 13. Formal-language error correction Robert A. Wagner 14. How to computer string-edit distances quickly William J. Masek and Michael S. Paterson Part V. Random Sequences: 15. An upper-bound technique for lengths of common subsequences Vaclav Chvatal and David Sankoff 16. Probabilistic behavior of longest-common-subsequence length Joseph Deken 17. Common subsequences and monotone subsequences David Sankoff and Sylvie Mainville Author index Subject index."
            },
            "slug": "Time-Warps,-String-Edits,-and-Macromolecules-Sankhoff-Kruskal",
            "title": {
                "fragments": [],
                "text": "Time Warps, String Edits, and Macromolecules"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper presents an anthology of algorithms and concepts for sequence comparison, an overview of sequence comparison Joseph B. Kruskal and David Sankoff, and some recent results on the complexity of common-subsequence problems."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713089"
                        ],
                        "name": "D. Huttenlocher",
                        "slug": "D.-Huttenlocher",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Huttenlocher",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Huttenlocher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2901136"
                        ],
                        "name": "G. Klanderman",
                        "slug": "G.-Klanderman",
                        "structuredName": {
                            "firstName": "Gregory",
                            "lastName": "Klanderman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Klanderman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116003"
                        ],
                        "name": "W. Rucklidge",
                        "slug": "W.-Rucklidge",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Rucklidge",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Rucklidge"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8027136,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "85efeeb25d8e363606d94c8fadaa922ba9b93a37",
            "isKey": false,
            "numCitedBy": 3913,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "The Hausdorff distance measures the extent to which each point of a model set lies near some point of an image set and vice versa. Thus, this distance can be used to determine the degree of resemblance between two objects that are superimposed on one another. Efficient algorithms for computing the Hausdorff distance between all possible relative positions of a binary image and a model are presented. The focus is primarily on the case in which the model is only allowed to translate with respect to the image. The techniques are extended to rigid motion. The Hausdorff distance computation differs from many other shape comparison methods in that no correspondence between the model and the image is derived. The method is quite tolerant of small position errors such as those that occur with edge detectors and other feature extraction methods. It is shown that the method extends naturally to the problem of comparing a portion of a model against an image. >"
            },
            "slug": "Comparing-Images-Using-the-Hausdorff-Distance-Huttenlocher-Klanderman",
            "title": {
                "fragments": [],
                "text": "Comparing Images Using the Hausdorff Distance"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Efficient algorithms for computing the Hausdorff distance between all possible relative positions of a binary image and a model are presented and it is shown that the method extends naturally to the problem of comparing a portion of a model against an image."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2111216375"
                        ],
                        "name": "Dacheng Wang",
                        "slug": "Dacheng-Wang",
                        "structuredName": {
                            "firstName": "Dacheng",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dacheng Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696384"
                        ],
                        "name": "S. Srihari",
                        "slug": "S.-Srihari",
                        "structuredName": {
                            "firstName": "Sargur",
                            "lastName": "Srihari",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Srihari"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26685555,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "873fa0ca7454bd1ca4de25128c522e088b635ddc",
            "isKey": false,
            "numCitedBy": 250,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Classification-of-newspaper-image-blocks-using-Wang-Srihari",
            "title": {
                "fragments": [],
                "text": "Classification of newspaper image blocks using texture analysis"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1693256"
                        ],
                        "name": "D. Sankoff",
                        "slug": "D.-Sankoff",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Sankoff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Sankoff"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "10398168"
                        ],
                        "name": "J. Kruskal",
                        "slug": "J.-Kruskal",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Kruskal",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kruskal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1403841706"
                        ],
                        "name": "Time Warps Eds",
                        "slug": "Time-Warps-Eds",
                        "structuredName": {
                            "firstName": "Time",
                            "lastName": "Eds",
                            "middleNames": [
                                "Warps"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Time Warps Eds"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52535398"
                        ],
                        "name": "String Edits",
                        "slug": "String-Edits",
                        "structuredName": {
                            "firstName": "String",
                            "lastName": "Edits",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "String Edits"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 129,
                                "start": 105
                            }
                        ],
                        "text": "To express \nthis more rigorously, let M be a metric for string comparison (we use the Levenshtein metric [Sankoff \nand Kruskal 1983])."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 56729381,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "24ff739a7ade6b79ad92440b0f5f2a9a5fb838af",
            "isKey": false,
            "numCitedBy": 1351,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A mudflap assembly for use with a dump vehicle having dual tires at the rear end thereof and including a pair of flexible flap sections one of which is supported by a rigid member adjacent the dual tires and the other is located above and to the rear of the rigid member and is secured at its upper end to the dump body. The rigid member is pivotally connected to the dump body and is combined with a cable which assures that the attached flap section maintains substantially the same position when the dump body is in the lowered-carry-position or raised-dump-position."
            },
            "slug": "Macromolecules:-the-theory-and-practice-of-sequence-Sankoff-Kruskal",
            "title": {
                "fragments": [],
                "text": "Macromolecules: the theory and practice of sequence comparison"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A mudflap assembly for use with a dump vehicle having dual tires at the rear end thereof and including a pair of flexible flap sections that assures that the attached flap section maintains substantially the same position when the dump body is in the lowered-carry-position or raised-dump-position."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 50,
                                "start": 46
                            }
                        ],
                        "text": "Bib Agent knows all the error messages of the Alex system and provides customized \nroutines to handle them."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 48,
                                "start": 39
                            }
                        ],
                        "text": "Bib Agent \nis built on top of the Alex [Cate 1992] file system which provides users transparent access to files \nlocated in all the FTP sites over the world."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "Alex: A global file system."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 81,
                                "start": 77
                            }
                        ],
                        "text": "In some cases, Bib Agent asks the user to help resolve an error message from \nAlex."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 49,
                                "start": 38
                            }
                        ],
                        "text": "Bib Agent is built on top of the Alex [Cate 1992] file system which provides users transparent access to files located in all the FTP sites over the world."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Alex: A global file system"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Usenix Conference on File Systems. USENIX Assoc., Berkeley, Calif."
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 16
                            }
                        ],
                        "text": "The proposal by Kahn and Cerf [1988] for organizing architectures for retrieving information from electronic repositories provides the context for the problem addressed in this article."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 94,
                                "start": 76
                            }
                        ],
                        "text": "Our agent architecture can also be used to \nset up Personal Library Systems [Kahn and Cerf 1988] that selectively view, organize, and update contents \nof an electronic library for individual use."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 95,
                                "start": 75
                            }
                        ],
                        "text": "Our agent architecture can also be used to set up Personal Library Systems [Kahn and Cerf 1988] “that selectively view, organize, and update contents” of an electronic library for individual use."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The world of knowbots"
            },
            "venue": {
                "fragments": [],
                "text": "Report to the Corporation for National Research Initiative, Arlington, Va."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16318570"
                        ],
                        "name": "H. Kucera",
                        "slug": "H.-Kucera",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Kucera",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Kucera"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35097577"
                        ],
                        "name": "W. Francis",
                        "slug": "W.-Francis",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Francis",
                            "middleNames": [
                                "Nelson"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Francis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "75103111"
                        ],
                        "name": "W. Twaddell",
                        "slug": "W.-Twaddell",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Twaddell",
                            "middleNames": [
                                "Freeman"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Twaddell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3576908"
                        ],
                        "name": "M. L. Marckworth",
                        "slug": "M.-L.-Marckworth",
                        "structuredName": {
                            "firstName": "Mary",
                            "lastName": "Marckworth",
                            "middleNames": [
                                "Lois"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. L. Marckworth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2054518662"
                        ],
                        "name": "Laura M. Bell",
                        "slug": "Laura-M.-Bell",
                        "structuredName": {
                            "firstName": "Laura",
                            "lastName": "Bell",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Laura M. Bell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40418506"
                        ],
                        "name": "J. Carroll",
                        "slug": "J.-Carroll",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Carroll",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Carroll"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 143602821,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "b7780f292c48e504e3a2724e54c205e6c6221932",
            "isKey": false,
            "numCitedBy": 6758,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computational-analysis-of-present-day-American-Kucera-Francis",
            "title": {
                "fragments": [],
                "text": "Computational analysis of present-day American English"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1720178"
                        ],
                        "name": "J. Balcázar",
                        "slug": "J.-Balcázar",
                        "structuredName": {
                            "firstName": "José",
                            "lastName": "Balcázar",
                            "middleNames": [
                                "Luís"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Balcázar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145486523"
                        ],
                        "name": "Josep Díaz",
                        "slug": "Josep-Díaz",
                        "structuredName": {
                            "firstName": "Josep",
                            "lastName": "Díaz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Josep Díaz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1708773"
                        ],
                        "name": "J. Gabarró",
                        "slug": "J.-Gabarró",
                        "structuredName": {
                            "firstName": "Joaquim",
                            "lastName": "Gabarró",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gabarró"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 71,
                                "start": 51
                            }
                        ],
                        "text": "We represent an agent \nin the language of circuits [Balca´zar et al. 1988]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 120534669,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "47d63996612a89209035acdbf7bf58f5a2fb605b",
            "isKey": false,
            "numCitedBy": 172,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Structural-complexity-1-Balcázar-Díaz",
            "title": {
                "fragments": [],
                "text": "Structural complexity 1"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "81527851"
                        ],
                        "name": "B. Kahle",
                        "slug": "B.-Kahle",
                        "structuredName": {
                            "firstName": "Brewster",
                            "lastName": "Kahle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Kahle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "122830698"
                        ],
                        "name": "A. Medlar",
                        "slug": "A.-Medlar",
                        "structuredName": {
                            "firstName": "Arthur",
                            "lastName": "Medlar",
                            "middleNames": [
                                "Walton"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Medlar"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 59770433,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "671a527f625b498b3dde057d390ada8769bf64be",
            "isKey": false,
            "numCitedBy": 250,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-information-system-for-corporate-users:-wide-Kahle-Medlar",
            "title": {
                "fragments": [],
                "text": "An information system for corporate users: wide area information servers"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 82
                            }
                        ],
                        "text": "These modules fit on a transportable platform called Agent-Tcl2 [Gray 1995; 1996; Rus et al. 1997]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 53246349,
            "fieldsOfStudy": [],
            "id": "abf59f42fb20ba7775b93bd7bfca4613e056df3a",
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Transportable Information Agents"
            },
            "venue": {
                "fragments": [],
                "text": "Agents"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50065247"
                        ],
                        "name": "Jacques Cohen",
                        "slug": "Jacques-Cohen",
                        "structuredName": {
                            "firstName": "Jacques",
                            "lastName": "Cohen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jacques Cohen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 111,
                                "start": 101
                            }
                        ],
                        "text": "Consider the task of finding precision-recall measures for a specific collection (such \nas the CACM) [Cohen 1993] from a scanned archive of technical reports."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 116
                            }
                        ],
                        "text": "The GUI community \nhas developed a range of visual methods for interacting with large information sets such as CACM [Cohen \n1993]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 72
                            }
                        ],
                        "text": "For example, to find precision-recall measures for the CACM \ncollection [Cohen 1993] from a given article, the designer uses knowledge that the answer to the query \nis found in tabular form."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5208291,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cbe3f25bf1cea355b465e1f03f94e4801721843d",
            "isKey": false,
            "numCitedBy": 197,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Concurrent-object-oriented-programming-Cohen",
            "title": {
                "fragments": [],
                "text": "Concurrent object-oriented programming"
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34693971"
                        ],
                        "name": "M. Schwartz",
                        "slug": "M.-Schwartz",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Schwartz",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Schwartz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32305196"
                        ],
                        "name": "Alan Emtage",
                        "slug": "Alan-Emtage",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Emtage",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alan Emtage"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "81527851"
                        ],
                        "name": "B. Kahle",
                        "slug": "B.-Kahle",
                        "structuredName": {
                            "firstName": "Brewster",
                            "lastName": "Kahle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Kahle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145098336"
                        ],
                        "name": "C. Neuman",
                        "slug": "C.-Neuman",
                        "structuredName": {
                            "firstName": "Clifford",
                            "lastName": "Neuman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Neuman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61517669,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ba431eb7c29ed62de30d15cccd7d9eabd4b0467c",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Comparison-of-Internet-Resource-Discovery-;-Schwartz-Emtage",
            "title": {
                "fragments": [],
                "text": "A Comparison of Internet Resource Discovery Approaches ; CU-CS-601-92"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1797808"
                        ],
                        "name": "G. Salton",
                        "slug": "G.-Salton",
                        "structuredName": {
                            "firstName": "Gerard",
                            "lastName": "Salton",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Salton"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 34382228,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3f2f6772d96d972e3b2da5aaa8a0f2feefdf827f",
            "isKey": false,
            "numCitedBy": 3884,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Automatic-Text-Processing:-The-Transformation,-and-Salton",
            "title": {
                "fragments": [],
                "text": "Automatic Text Processing: The Transformation, Analysis, and Retrieval of Information by Computer"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2095083"
                        ],
                        "name": "N. Belkin",
                        "slug": "N.-Belkin",
                        "structuredName": {
                            "firstName": "Nicholas",
                            "lastName": "Belkin",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Belkin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144456145"
                        ],
                        "name": "W. Bruce Croft",
                        "slug": "W.-Bruce-Croft",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Croft",
                            "middleNames": [
                                "Bruce"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Bruce Croft"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 14679722,
            "fieldsOfStudy": [
                "Computer Science",
                "Geology"
            ],
            "id": "6e8793d54d8fcb008f808ac1aff9cefbc4225ac9",
            "isKey": false,
            "numCitedBy": 1499,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "Information filtering systems are designed for unstructured or semistructured data, as opposed to database applications, which use very structured data. The systems also deal primarily with textual information, but they may also entail images, voice, video or other data types that are part of multimedia information systems. Information filtering systems also involve a large amount of data and streams of incoming data, whether broadcast from a remote source or sent directly by other sources. Filtering is based on descriptions of individual or group information preferences, or profiles, that typically represent long-term interests. Filtering also implies removal of data from an incoming stream rather than finding data in the stream; users see only the data that is extracted. Models of information retrieval and filtering, and lessons for filtering from retrieval research are presented."
            },
            "slug": "Information-filtering-and-information-retrieval:-of-Belkin-Croft",
            "title": {
                "fragments": [],
                "text": "Information filtering and information retrieval: two sides of the same coin?"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "Models of information retrieval and filtering, and lessons for filtering from retrieval research are presented; users see only the data that is extracted."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1729041"
                        ],
                        "name": "J. Canny",
                        "slug": "J.-Canny",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Canny",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Canny"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144344283"
                        ],
                        "name": "Ken Goldberg",
                        "slug": "Ken-Goldberg",
                        "structuredName": {
                            "firstName": "Ken",
                            "lastName": "Goldberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ken Goldberg"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 107546810,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "fead38a4cdbf915c0cae2a92534c0607a6f570b6",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-RISC-Paradigm-for-Industrial-Robotics-Canny-Goldberg",
            "title": {
                "fragments": [],
                "text": "A RISC Paradigm for Industrial Robotics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 78,
                                "start": 54
                            }
                        ],
                        "text": "We draw inspiration from robotics [Brooks 1986; 1990; Donald \net al. 1993; 1995] to design information agents."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Minimalism 1 distribution 5 supermodularity"
            },
            "venue": {
                "fragments": [],
                "text": "J. Exper. Theoret. Artif. Intell. To be published."
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 34
                            }
                        ],
                        "text": "We draw inspiration from robotics [Brooks 1986; 1990; Donald et al. 1993; 1995] to design information agents."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 78,
                                "start": 54
                            }
                        ],
                        "text": "We draw inspiration from robotics [Brooks 1986; 1990; Donald \net al. 1993; 1995] to design information agents."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Information invariants for cooperating autonomous mobile robots"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the International Symposium on Robotics Research. Carnegie-Mellon Univ., Pittsburgh, Pa."
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The identiication of text relations using automatic hypertext linking"
            },
            "venue": {
                "fragments": [],
                "text": "the Workshop on Intelligent Hypertext, the ACM Conference on Information Knowledge Management"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The World of Knowbots, report to the Corporation for National Research Initiative"
            },
            "venue": {
                "fragments": [],
                "text": "The World of Knowbots, report to the Corporation for National Research Initiative"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Overview of Wide Area Information Servers, WAIS on-line documentation"
            },
            "venue": {
                "fragments": [],
                "text": "Overview of Wide Area Information Servers, WAIS on-line documentation"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A logical structure analysis system for documents"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the second international symposium on interoperable information systems"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The identification of text relations using automatic hypertext linking"
            },
            "venue": {
                "fragments": [],
                "text": "the Workshop on Intelligent Hypertext, The ACM Conference on Information Knowledge Management"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Overview and Programming Guide to the Mind Image Management Systems"
            },
            "venue": {
                "fragments": [],
                "text": "Overview and Programming Guide to the Mind Image Management Systems"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Misc: 486 CPU Heat Sink Fan (Clips on to any 486 CPU) -> $15"
            },
            "venue": {
                "fragments": [],
                "text": "Misc: 486 CPU Heat Sink Fan (Clips on to any 486 CPU) -> $15"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 131,
                                "start": 123
                            }
                        ],
                        "text": "The graphical-user-interface community has developed a range of visual methods for interacting with large information sets [CACM93]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "vol"
            },
            "venue": {
                "fragments": [],
                "text": "36, no. 4,"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A comparison of Internet discovery approaches"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Syst"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Information ltering and information retrieval: two sides of the same coin?"
            },
            "venue": {
                "fragments": [],
                "text": "Communications of the ACM"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The identification of text relations using automatic hypertext linking"
            },
            "venue": {
                "fragments": [],
                "text": "the Workshop on Intelligent Hypertext, The ACM Conference on Information Knowledge Management. ACM, New York."
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Overview of wide area information servers. WAIS Online Doc"
            },
            "venue": {
                "fragments": [],
                "text": "Online"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The CORE electronic library"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of SIGIR"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Yesha editors, Advances in digital libraries"
            },
            "venue": {
                "fragments": [],
                "text": "Lecture Notes in Computer Science"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Alex: A global file system"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Usenix Conference on File Systems. USENIX Assoc"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Clock Doubler) (Intel CPU) -> $580 Local Bus Upgrades: VESA local bus ISA boards (2 VESA/ISA slots, 6 ISA slots) Add $10 486 Motherboard w"
            },
            "venue": {
                "fragments": [],
                "text": "cache for all 486 boards Add $ CPU, 256k Cache -> $105 486 VESA Local Bus Motherboard w/ NO CPU, 2 VLB"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A transportable Agent System"
            },
            "venue": {
                "fragments": [],
                "text": "Proceeedings of the CIKM Workshop on Intelligent Agents"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The world of knowbots. Report to the Corporation for National Research Initiative, Arlington, Va. 100 @BULLET Daniela Rus and"
            },
            "venue": {
                "fragments": [],
                "text": "Devika Subramanian ACM Transactions on Information Systems"
            },
            "year": 1988
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Alex: a global le system"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Usenix Conference on File Systems"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Paradigm for Industrial Robotics"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the International Conference on Robotics and Automation"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Using whitespace for automated document structuring Advances in Digital Libraries"
            },
            "venue": {
                "fragments": [],
                "text": "Lecture Notes in Computer Science"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 151,
                                "start": 130
                            }
                        ],
                        "text": "The methods are developed in the context of very specific applications; \nsegment­ing pages of technical journals [Nagy et al. 1992; Wang and Srihari 1989] and locating address \nblocks in letters [Jain and Bhattacharjee 1992]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Classiication of newspaper image blocks using texture analysis"
            },
            "venue": {
                "fragments": [],
                "text": "Computer Vision, Graphics, and Image Processing"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Overview of wide area information servers"
            },
            "venue": {
                "fragments": [],
                "text": "WAIS Online Doc. Online 15 (Sept. 5), 56–60."
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Elephants don't play chess, Design of Autonomous Agents"
            },
            "venue": {
                "fragments": [],
                "text": "Elephants don't play chess, Design of Autonomous Agents"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Information invariants for cooperating autonomous mobile robots"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the International Symposium on Robotics Research"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Commun"
            },
            "venue": {
                "fragments": [],
                "text": "ACM 36, 4 (Apr.)."
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 111,
                                "start": 101
                            }
                        ],
                        "text": "Consider the task of finding precision-recall measures for a specific collection (such \nas the CACM) [Cohen 1993] from a scanned archive of technical reports."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 116
                            }
                        ],
                        "text": "The GUI community \nhas developed a range of visual methods for interacting with large information sets such as CACM [Cohen \n1993]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 72
                            }
                        ],
                        "text": "For example, to find precision-recall measures for the CACM \ncollection [Cohen 1993] from a given article, the designer uses knowledge that the answer to the query \nis found in tabular form."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Commun. ACM"
            },
            "venue": {
                "fragments": [],
                "text": "Commun. ACM"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Information Invariants in Robotics, to appear, Artiicial Intelligence"
            },
            "venue": {
                "fragments": [],
                "text": "Information Invariants in Robotics, to appear, Artiicial Intelligence"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "CACM93] Communications of the ACM"
            },
            "venue": {
                "fragments": [],
                "text": "CACM93] Communications of the ACM"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The CORE electronic library"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of SIGIR. ACM, New York. MAES, P. 1994. Agents that reduce work and information overload. Commun. ACM 37, 7"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 129,
                                "start": 116
                            }
                        ],
                        "text": "We have tested the independence of the distribution of white space by extensive experiments with Splus \n[Statistical Sciences 1991]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Splus Reference Manual. Statistical Sciences, Inc"
            },
            "venue": {
                "fragments": [],
                "text": "Splus Reference Manual. Statistical Sciences, Inc"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Splus Reference Manual, Statistical Sciences,Inc"
            },
            "venue": {
                "fragments": [],
                "text": "Splus Reference Manual, Statistical Sciences,Inc"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Mobile Agents for Mobile Computers , submitted to MOBICOM96"
            },
            "venue": {
                "fragments": [],
                "text": "Mobile Agents for Mobile Computers , submitted to MOBICOM96"
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Comparing images using the Hausdorr distance, to appear"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Overview and programming guide to the Mind image management systems"
            },
            "venue": {
                "fragments": [],
                "text": "Tech. Rep. X9000627"
            },
            "year": 1991
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "February 1996 Customizing Information Capture and Access @BULLET"
            },
            "venue": {
                "fragments": [],
                "text": "February 1996 Customizing Information Capture and Access @BULLET"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Active model acquisition for near-sensorless manipulation with mobile robots"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the IASTED Conference on Robotics and Automation"
            },
            "year": 1993
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 4,
            "methodology": 16
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 93,
        "totalPages": 10
    },
    "page_url": "https://www.semanticscholar.org/paper/Customizing-information-capture-and-access-Rus-Subramanian/e9c6887986159246f98648b5a9b432b41f5e17a3?sort=total-citations"
}