{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784213"
                        ],
                        "name": "R. Bajcsy",
                        "slug": "R.-Bajcsy",
                        "structuredName": {
                            "firstName": "Ruzena",
                            "lastName": "Bajcsy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Bajcsy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3931003"
                        ],
                        "name": "R. Lieberson",
                        "slug": "R.-Lieberson",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Lieberson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Lieberson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4402076"
                        ],
                        "name": "M. Reivich",
                        "slug": "M.-Reivich",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Reivich",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Reivich"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42388945,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "a81dc1dec913629f3548fb5d9139c1a3101fbf84",
            "isKey": false,
            "numCitedBy": 294,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A system of computer programs is described which, for the first time, is able to use computerized tomographic data to automatically locate, measure, and describe anatomical structures of interest with accuracy and consistency. Input to the system consists of any digitized radiographic data. Computer assisted tomographic (CAT) scans of the head were used in this first implementation. Using these data and a predefined atlas picture representing an idealized view of the average normal image, an individualized atlas was created. From the individualized atlas, structure size, density, location displacement, and distortion may be calculated. The individualized atlas created using high resolution data, such as the CAT scan, may then be directly superimposed on pictures obtained using lower resolution modalities, such as positron emission tomographic scan images. This allows the precise location of structures poorly visualized by the secondary imaging modality. This system is capable of using either two- or three-dimensional data."
            },
            "slug": "A-computerized-system-for-the-elastic-matching-of-Bajcsy-Lieberson",
            "title": {
                "fragments": [],
                "text": "A computerized system for the elastic matching of deformed radiographic images to idealized atlas images."
            },
            "tldr": {
                "abstractSimilarityScore": 91,
                "text": "A system of computer programs is described which is able to use computerized tomographic data to automatically locate, measure, and describe anatomical structures of interest with accuracy and consistency."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of computer assisted tomography"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2251336"
                        ],
                        "name": "D. Burr",
                        "slug": "D.-Burr",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Burr",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Burr"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121016326,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "5c2a1a48cc37963ce148727d88f38f85c1edd104",
            "isKey": false,
            "numCitedBy": 173,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-dynamic-model-for-image-registration-Burr",
            "title": {
                "fragments": [],
                "text": "A dynamic model for image registration"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 630502,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a931f49f06fdc0c5b339de9fb8e9e496ac98a300",
            "isKey": false,
            "numCitedBy": 337,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Multilevel-computational-processes-for-visual-Terzopoulos",
            "title": {
                "fragments": [],
                "text": "Multilevel computational processes for visual surface reconstruction"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69464182"
                        ],
                        "name": "C. Broit",
                        "slug": "C.-Broit",
                        "structuredName": {
                            "firstName": "Chaim",
                            "lastName": "Broit",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Broit"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118309065,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "7e4568e7516b91437743d9a1bf82a248a08eb256",
            "isKey": false,
            "numCitedBy": 411,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Motivated by the need to locate and identify objects in three dimensional CT images, an optimal registration method for matching two and three dimensional deformed images has been developed. This method was used to find optimal mappings between CT images and an atlas image of the same anatomy. Using these mappings, object boundaries from the atlas was superimposed on the CT images. \nA cost function of the form DEFORMATION-SIMILARITY is associated with each mapping between the two images. The mapping obtained by our registration process is optimal with respect to this cost function. The registration process simulates a model in which one of the images made from an elastic material is deformed until it matches the other image. The cross correlation function which measures the similarity between the two images serves as a potential function from which the forces required to deform the image are derived. The deformation part of the cost function is measured by the strain energy of the deformed image. Therefore, the cost function of a mapping is given in this model by the total energy of the elastic image. \nThe optimal mapping is obtained by finding the equilibrium state of the elastic image, which by definition corresponds to a local minimum of the total energy. The equilibrium state is obtained by solving a set of partial differential equations taken from the linear theory of elasticity. These equations are solved iteratively using the finite differences approximation on a grid which describes the mapping. \nThe image function in a spherical region around each grid point is described by its projections on a set of orthogonal functions. The cross correlation function between the image functions in two regions is computed from these projections which, serve as the components of a feature vector associated with the grid points. In each iteration step of the process, the values of the projections are modified according to the currently approximated deformation. \nThe method was tested by registering several two and three dimensional image pairs. It can also be used to obtain the optimal mapping between two regions from a set of corresponding points (with and without error estimates) in these regions."
            },
            "slug": "Optimal-registration-of-deformed-images-Broit",
            "title": {
                "fragments": [],
                "text": "Optimal registration of deformed images"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809905"
                        ],
                        "name": "A. Witkin",
                        "slug": "A.-Witkin",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Witkin",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Witkin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143602141"
                        ],
                        "name": "M. Kass",
                        "slug": "M.-Kass",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Kass",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Kass"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 33337600,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "268559fe889fd17fa4b624c2d791e2386c3a3b35",
            "isKey": false,
            "numCitedBy": 50,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a paradigm for shape and motion reconstruction based on dynamic energy constraints. Objects are modeled as deformable elastic bodies and constraints derived from image data are modeled as eztemal forces applied to these bodies. The eztemal constraint forces are designed to mold a deformable body into a configuration tent satisfies the constraints, making the model consistent with the images. We present a particular shape model whose internal forces induce a preference for surface continuity and axial symmetry. We develop a constraint force for dynamic stereo images and present results for the recovery of shape and non-rigid motion from natural imagery."
            },
            "slug": "Energy-Constraints-on-Deformable-Models:-Recovering-Terzopoulos-Witkin",
            "title": {
                "fragments": [],
                "text": "Energy Constraints on Deformable Models: Recovering Shape and Non-Rigid Motion"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A particular shape model is presented whose internal forces induce a preference for surface continuity and axial symmetry, and results for the recovery of shape and non-rigid motion from natural imagery are presented."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 3183634,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "28c3dbd8324dac29046249331035280d528744bc",
            "isKey": false,
            "numCitedBy": 433,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "Image analysis problems, posed mathematically as variational principles or as partial differential equations, are amenable to numerical solution by relaxation algorithms that are local, iterative, and often parallel. Although they are well suited structurally for implementation on massively parallel, locally interconnected computational architectures, such distributed algorithms are seriously handi capped by an inherent inefficiency at propagating constraints between widely separated processing elements. Hence, they converge extremely slowly when confronted by the large representations of early vision. Application of multigrid methods can overcome this drawback, as we showed in previous work on 3-D surface reconstruction. In this paper, we develop multiresolution iterative algorithms for computing lightness, shape-from-shading, and optical flow, and we examine the efficiency of these algorithms using synthetic image inputs. The multigrid methodology that we describe is broadly applicable in early vision. Notably, it is an appealing strategy to use in conjunction with regularization analysis for the efficient solution of a wide range of ill-posed image analysis problems."
            },
            "slug": "Image-Analysis-Using-Multigrid-Relaxation-Methods-Terzopoulos",
            "title": {
                "fragments": [],
                "text": "Image Analysis Using Multigrid Relaxation Methods"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This paper develops multiresolution iterative algorithms for computing lightness, shape-from-shading, and optical flow and examines the efficiency of these algorithms using synthetic image inputs, and describes the multigrid methodology that is broadly applicable in early vision."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Pattern Analysis and Machine Intelligence"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144189092"
                        ],
                        "name": "John C. Platt",
                        "slug": "John-C.-Platt",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Platt",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "John C. Platt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3021334"
                        ],
                        "name": "A. Barr",
                        "slug": "A.-Barr",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Barr",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Barr"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4564909"
                        ],
                        "name": "K. Fleischer",
                        "slug": "K.-Fleischer",
                        "structuredName": {
                            "firstName": "Kurt",
                            "lastName": "Fleischer",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Fleischer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 52800005,
            "fieldsOfStudy": [
                "Materials Science"
            ],
            "id": "f3d2c717e2b04e87f6c4ea32f16d8b8e45c86a09",
            "isKey": false,
            "numCitedBy": 2146,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "The theory of elasticity describes deformable materials such as rubber, cloth, paper, and flexible metals. We employ elasticity theory to construct differential equations that model the behavior of non-rigid curves, surfaces, and solids as a function of time. Elastically deformable models are active: they respond in a natural way to applied forces, constraints, ambient media, and impenetrable obstacles. The models are fundamentally dynamic and realistic animation is created by numerically solving their underlying differential equations. Thus, the description of shape and the description of motion are unified."
            },
            "slug": "Elastically-deformable-models-Terzopoulos-Platt",
            "title": {
                "fragments": [],
                "text": "Elastically deformable models"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The description of shape and the description of motion are unified and differential equations that model the behavior of non-rigid curves, surfaces, and solids as a function of time are constructed."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145372532"
                        ],
                        "name": "J. Cracraft",
                        "slug": "J.-Cracraft",
                        "structuredName": {
                            "firstName": "Joel",
                            "lastName": "Cracraft",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Cracraft"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105872"
                        ],
                        "name": "F. Bookstein",
                        "slug": "F.-Bookstein",
                        "structuredName": {
                            "firstName": "Fred",
                            "lastName": "Bookstein",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Bookstein"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 87790225,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8d5f84c3a09a02cfb356c79421c64106f57768c8",
            "isKey": false,
            "numCitedBy": 363,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "One. Introduction: On the Absence of Geometry from Morphometrics.- First Part. The Measurement of Biological Shape.- Two. Shapes and Measures of Shape.- A. Properties of the Euclidean Plane and Euclidean Space.- B. Outlines and Homologous Landmarks.- C. Definitions of Shape, Shape Change, Shape Measurement.- D. Shapes as Data.- Three. Critique of an Applied Field: Conventional Cephalometrics.- A. Landmarks, Curvature, and Growth.- B. Registration.- Four. New Statistical Methods for Shape.- A. Analysis of the Tangent Angle Function.- 1. History.- 2. Sampling from the tangent angle function.- 3. Conic replacement curves and their estimation Fit of a conic to a point - Geometric interpretation - Estimator for a circle - Estimation for the general conic - Computation of the extremum -Linear constraints.- 4. Conic splining Joint conic fitting under constraint -An example - Application - Analysis of parameters.- B. Extension to Three Dimensions: A Sketch.- C. Skeletons Definition - A multivariate statistical method - Bibliographic note.- Second Part. The Measurement of Shape Change Using Biorthogonal Grids.- Five. The Study of Shape Transformation after D'Arcy Thompson.- A. The Original Method.- 1. Thompson's own work.- 2. Later examples.- 3. Difficulties.- B. Analysis of Growth Gradients.- C. Simulations.- D. Other Morphometric Schemes Vector displacements - Multivariate morphometrics.- Six. The Method of Biorthogonal Grids.- A. Representation of Affine Transformations.- B. General Lines of Growth and Biorthogonal Grids.- C. Summarizing the Grids.- Technical Note 1. Existence and Form of Biorthogonal Grids.- Technical Note 2. Interpolation from Landmark Locations and Arcs The measure of roughness - The vector space and its associated functions - Interpolation from boundary values - Interpolation from boundary values and interior points - Note on computation.- Technical Note 3. Construction of Integral Curves.- Technical Note 4. On Homologous Points.- Seven. Examples of Biorthogonal Analysis.- A. Comparison of Square and Biorthogonal Grids: Thompson's Diodon Figure.- B. Phylogeny and Ontogeny of Primate Crania.- 1. Functional craniology and craniometrics.- 2. Data for this exercise.- 3. Two types of transformations.- 4. Comparative ontogeny of the apes and man.- Eight. Future Directions for Transformation Analysis.- A. Statistical Methods The symmetric tensor field - Concordance -Linear methods.- B. Computation Other kinds of information about homology -Three dimensions.- C. Likely Applications Computed tomography - Orthodontics - Developmental biology.- Nine. Envoi.- Literature Cited."
            },
            "slug": "The-Measurement-of-Biological-Shape-and-Shape-Cracraft-Bookstein",
            "title": {
                "fragments": [],
                "text": "The Measurement of Biological Shape and Shape Change."
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This chapter discusses the study of Shape Transformation after D'Arcy Thompson, which involves two types of transformations: functional craniology and craniometrics and multivariate morphometrics."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39645022"
                        ],
                        "name": "D. Brandt",
                        "slug": "D.-Brandt",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Brandt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Brandt"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5919303,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "e02ce144d3b524ef77569b9bcbcffec7540d0193",
            "isKey": false,
            "numCitedBy": 3238,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "The boundary-value problem is discretized on several grids (or finite-element spaces) of widely different mesh sizes. Interactions between these levels enable us (i) to solve the possibly nonlinear system of n discrete equations in 0(n) operations (40n additions and shifts for Poisson problems); (ii) to conveniently adapt the discretization (the local mesh size, local order of approximation, etc.) to the evolving solution in a nearly optimal way, obtaining \"°°-order\" approximations and low n, even when singularities are present. General theoretical analysis of the numerical process. Numerical experiments with linear and nonlinear, elliptic and mixed-type (transonic flow) problemsconfirm theoretical predictions. Similar techniques for initial-value problems are briefly"
            },
            "slug": "Multi-level-adaptive-solutions-to-boundary-value-Brandt",
            "title": {
                "fragments": [],
                "text": "Multi-level adaptive solutions to boundary-value problems math comptr"
            },
            "tldr": {
                "abstractSimilarityScore": 65,
                "text": "The boundary-value problem is discretized on several grids (or finite-element spaces) of widely different mesh sizes, enabling us to conveniently adapt the discretization to the evolving solution in a nearly optimal way, obtaining \"°°-order\" approximations and low n, even when singularities are present."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143750010"
                        ],
                        "name": "R. Hartley",
                        "slug": "R.-Hartley",
                        "structuredName": {
                            "firstName": "Ralph",
                            "lastName": "Hartley",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Hartley"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 28707466,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "93bf3804db027644bf1ecede9aed0379d3b237e9",
            "isKey": false,
            "numCitedBy": 29,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-Gaussian-weighted-multiresolution-edge-detector-Hartley",
            "title": {
                "fragments": [],
                "text": "A Gaussian-weighted multiresolution edge detector"
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Vis. Graph. Image Process."
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2080797"
                        ],
                        "name": "J. Dengler",
                        "slug": "J.-Dengler",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Dengler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Dengler"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118769990,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "bd6ea03a9e135f649ab327ead3ccfa9e42feda99",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "The Dynamic Pyramid is a tool for analyzing monocular moving image sequences. Its process for achieving correspondence between successive frames is based on the physical model of the elastic membrane, where the cost function consisting of the similarity between the frames and the deformation of the transformation vector field is minimized."
            },
            "slug": "Local-motion-estimation-with-the-dynamic-pyramid-Dengler",
            "title": {
                "fragments": [],
                "text": "Local motion estimation with the dynamic pyramid"
            },
            "tldr": {
                "abstractSimilarityScore": 73,
                "text": "The Dynamic Pyramid is a tool for analyzing monocular moving image sequences based on the physical model of the elastic membrane, where the cost function consisting of the similarity between the frames and the deformation of the transformation vector field is minimized."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1913418"
                        ],
                        "name": "B. Widrow",
                        "slug": "B.-Widrow",
                        "structuredName": {
                            "firstName": "Bernard",
                            "lastName": "Widrow",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Widrow"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 195703395,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "15a0f30ad2efee0b1f6d7143f3b770ad774da746",
            "isKey": false,
            "numCitedBy": 78,
            "numCiting": 76,
            "paperAbstract": {
                "fragments": [],
                "text": "Template matching is a fundamental technique of pattern recognition. Although this technique is very general, its applicability has been limited because of the difficulty often encountered when fitting templates to natural data. Natural patterns are often distorted, misshapen, stretched in size, fuzzy, rotated, translated, observed at an unusual perspective, etc. Flexible templates (rubber masks) have been devised which, when fitted to natural data, can be used for measurement, data reduction, data smoothing, and classification of highly irregular waveforms and image shapes. These problems had been largely unsolved by existing template matching methods."
            },
            "slug": "The-\"Rubber-Mask\"-Technique-I.-Pattern-Measurement-Widrow",
            "title": {
                "fragments": [],
                "text": "The \"Rubber-Mask\" Technique I. Pattern Measurement and Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "Flexible templates (rubber masks) have been devised which, when fitted to natural data, can be used for measurement, data reduction, data smoothing, and classification of highly irregular waveforms and image shapes."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2302358"
                        ],
                        "name": "P. Burt",
                        "slug": "P.-Burt",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Burt",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Burt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8018433,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "83074157d165b6245915508d891b2d0cd066f3ad",
            "isKey": false,
            "numCitedBy": 6693,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a technique for image encoding in which local operators of many scales but identical shape serve as the basis functions. The representation differs from established techniques in that the code elements are localized in spatial frequency as well as in space. Pixel-to-pixel correlations are first removed by subtracting a lowpass filtered copy of the image from the image itself. The result is a net data compression since the difference, or error, image has low variance and entropy, and the low-pass filtered image may represented at reduced sample density. Further data compression is achieved by quantizing the difference image. These steps are then repeated to compress the low-pass image. Iteration of the process at appropriately expanded scales generates a pyramid data structure. The encoding process is equivalent to sampling the image with Laplacian operators of many scales. Thus, the code tends to enhance salient image features. A further advantage of the present code is that it is well suited for many image analysis tasks as well as for image compression. Fast algorithms are described for coding and decoding."
            },
            "slug": "The-Laplacian-Pyramid-as-a-Compact-Image-Code-Burt-Adelson",
            "title": {
                "fragments": [],
                "text": "The Laplacian Pyramid as a Compact Image Code"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "A technique for image encoding in which local operators of many scales but identical shape serve as the basis functions, which tends to enhance salient image features and is well suited for many image analysis tasks as well as for image compression."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Commun."
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2465976"
                        ],
                        "name": "M. Fischler",
                        "slug": "M.-Fischler",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Fischler",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Fischler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3394928"
                        ],
                        "name": "R. Elschlager",
                        "slug": "R.-Elschlager",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Elschlager",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Elschlager"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14554383,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "719da2a0ddd38e78151e1cb2db31703ea8b2e490",
            "isKey": false,
            "numCitedBy": 1527,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "The primary problem dealt with in this paper is the following. Given some description of a visual object, find that object in an actual photograph. Part of the solution to this problem is the specification of a descriptive scheme, and a metric on which to base the decision of \"goodness\" of matching or detection."
            },
            "slug": "The-Representation-and-Matching-of-Pictorial-Fischler-Elschlager",
            "title": {
                "fragments": [],
                "text": "The Representation and Matching of Pictorial Structures"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "The primary problem dealt with in this paper is the specification of a descriptive scheme, and a metric on which to base the decision of \"goodness\" of matching or detection."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728511"
                        ],
                        "name": "K. Stüben",
                        "slug": "K.-Stüben",
                        "structuredName": {
                            "firstName": "Klaus",
                            "lastName": "Stüben",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Stüben"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3308411"
                        ],
                        "name": "U. Trottenberg",
                        "slug": "U.-Trottenberg",
                        "structuredName": {
                            "firstName": "Ulrich",
                            "lastName": "Trottenberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Trottenberg"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61738420,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3c849a483b25a4d8e9484fbd17baaa1f63d4f1e4",
            "isKey": false,
            "numCitedBy": 576,
            "numCiting": 78,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Multigrid-methods:-Fundamental-algorithms,-model-Stüben-Trottenberg",
            "title": {
                "fragments": [],
                "text": "Multigrid methods: Fundamental algorithms, model problem analysis and applications"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1982
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750924"
                        ],
                        "name": "Demetri Terzopoulos",
                        "slug": "Demetri-Terzopoulos",
                        "structuredName": {
                            "firstName": "Demetri",
                            "lastName": "Terzopoulos",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Demetri Terzopoulos"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26705393,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "efadad5b0d52daa3b31b26f0b988bda73ec0e923",
            "isKey": false,
            "numCitedBy": 117,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Multiresolution-computation-of-visible-surface-Terzopoulos",
            "title": {
                "fragments": [],
                "text": "Multiresolution computation of visible-surface representations"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1984
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 16,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Multiresolution-elastic-matching-Bajcsy-Kovacic/36c9356db20ab4eace62d86e0a576fa6382d84b9?sort=total-citations"
}