{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39685930"
                        ],
                        "name": "A. Schödl",
                        "slug": "A.-Schödl",
                        "structuredName": {
                            "firstName": "Arno",
                            "lastName": "Schödl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Schödl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1717841"
                        ],
                        "name": "R. Szeliski",
                        "slug": "R.-Szeliski",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Szeliski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Szeliski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745260"
                        ],
                        "name": "D. Salesin",
                        "slug": "D.-Salesin",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Salesin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Salesin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145955800"
                        ],
                        "name": "Irfan Essa",
                        "slug": "Irfan-Essa",
                        "structuredName": {
                            "firstName": "Irfan",
                            "lastName": "Essa",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Irfan Essa"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 43
                            }
                        ],
                        "text": "These results improve upon video textures [Sch¨odl et al. 2000] and comparefa­vorably \nagainst dynamic textures [Soatto et al. 2001]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 221,
                                "start": 203
                            }
                        ],
                        "text": "Mostpreviousworkontextureisgearedtowards2D \nimages,but the texture problem in a very similar form also appears in three dimensions for the generation \nof spatio-temporal textures [Szum­mer and Picard 1996; Sch¨odl et al. 2000;Wei andLevoy 2000; Bar-Joseph \net al. 2001]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 219107796,
            "fieldsOfStudy": [
                "Computer Science",
                "Art"
            ],
            "id": "b1cfc0aab0b3b4c2abf030479d8a663d747a6501",
            "isKey": false,
            "numCitedBy": 642,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper introduces a new type of medium, called a video texture, which has qualities somewhere between those of a photograph and a video. A video texture provides a continuous infinitely varying stream of images. While the individual frames of a video texture may be repeated from time to time, the video sequence as a whole is never repeated exactly. Video textures can be used in place of digital photos to infuse a static image with dynamic qualities and explicit actions. We present techniques for analyzing a video clip to extract its structure, and for synthesizing a new, similar looking video of arbitrary length. We combine video textures with view morphing techniques to obtain 3D video textures. We also introduce video-based animation, in which the synthesis of video textures can be guided by a user through high-level interactive controls. Applications of video textures and their extensions include the display of dynamic scenes on web pages, the creation of dynamic backdrops for special effects and games, and the interactive control of video-based animation."
            },
            "slug": "Video-textures-Schödl-Szeliski",
            "title": {
                "fragments": [],
                "text": "Video textures"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This paper presents techniques for analyzing a video clip to extract its structure, and for synthesizing a new, similar looking video of arbitrary length, and combines video textures with view morphing techniques to obtain 3D video textures."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2821129"
                        ],
                        "name": "M. Ashikhmin",
                        "slug": "M.-Ashikhmin",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Ashikhmin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Ashikhmin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 403573,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fdc959a9403c92bf99247f482713e795cc4ebd42",
            "isKey": false,
            "numCitedBy": 870,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a simple texture synthesis algorithm that is well-suited for a specific class of naturally occurring textures. This class includes quasi-repeating patterns consisting of small objects of familiar but irregular size, such as flower fields, pebbles, forest undergrowth, bushes and tree branches. The algorithm starts from a sample image and generates a new image of arbitrary size the appearance of which is similar to that of the original image. This new image does not change the basic spatial frequencies the original image; instead it creates an image that is a visually similar, and is of a size set by the user. This method is fast and its implementation is straightforward. We extend the algorithm to allow direct user input for interactive control over the texture synthesis process. This allows the user to indicate large-scale properties of the texture appearance using a standard painting-style interface, and to choose among various candidate textures the algorithm can create by performing different number of iterations."
            },
            "slug": "Synthesizing-natural-textures-Ashikhmin",
            "title": {
                "fragments": [],
                "text": "Synthesizing natural textures"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The algorithm is extended to allow direct user input for interactive control over the texture synthesis process, which allows the user to indicate large-scale properties of the texture appearance using a standard painting-style interface, and to choose among various candidate textures the algorithm can create by performing different number of iterations."
            },
            "venue": {
                "fragments": [],
                "text": "I3D '01"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34437150"
                        ],
                        "name": "Li-yi Wei",
                        "slug": "Li-yi-Wei",
                        "structuredName": {
                            "firstName": "Li-yi",
                            "lastName": "Wei",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Li-yi Wei"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1801789"
                        ],
                        "name": "M. Levoy",
                        "slug": "M.-Levoy",
                        "structuredName": {
                            "firstName": "Marc",
                            "lastName": "Levoy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Levoy"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3131710,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e1e1a39534aed2cf4894896de75d0ba1fa75ab6a",
            "isKey": false,
            "numCitedBy": 1601,
            "numCiting": 73,
            "paperAbstract": {
                "fragments": [],
                "text": "Texture synthesis is important for many applications in computer graphics, vision, and image processing. However, it remains difficult to design an algorithm that is both efficient and capable of generating high quality results. In this paper, we present an efficient algorithm for realistic texture synthesis. The algorithm is easy to use and requires only a sample texture as input. It generates textures with perceived quality equal to or better than those produced by previous techniques, but runs two orders of magnitude faster. This permits us to apply texture synthesis to problems where it has traditionally been considered impractical. In particular, we have applied it to constrained synthesis for image editing and temporal texture generation. Our algorithm is derived from Markov Random Field texture models and generates textures through a deterministic searching process. We accelerate this synthesis process using tree-structured vector quantization."
            },
            "slug": "Fast-texture-synthesis-using-tree-structured-vector-Wei-Levoy",
            "title": {
                "fragments": [],
                "text": "Fast texture synthesis using tree-structured vector quantization"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper presents an efficient algorithm for realistic texture synthesis derived from Markov Random Field texture models and generates textures through a deterministic searching process that accelerates this synthesis process using tree-structured vector quantization."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '00"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1397939637"
                        ],
                        "name": "Z. Bar-Joseph",
                        "slug": "Z.-Bar-Joseph",
                        "structuredName": {
                            "firstName": "Ziv",
                            "lastName": "Bar-Joseph",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Z. Bar-Joseph"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1387872181"
                        ],
                        "name": "Ran El-Yaniv",
                        "slug": "Ran-El-Yaniv",
                        "structuredName": {
                            "firstName": "Ran",
                            "lastName": "El-Yaniv",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ran El-Yaniv"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1684384"
                        ],
                        "name": "Dani Lischinski",
                        "slug": "Dani-Lischinski",
                        "structuredName": {
                            "firstName": "Dani",
                            "lastName": "Lischinski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dani Lischinski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27379268"
                        ],
                        "name": "M. Werman",
                        "slug": "M.-Werman",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Werman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Werman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16444914,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "855a139a12adbc70e6f7c8bb38ce252be419c55d",
            "isKey": false,
            "numCitedBy": 252,
            "numCiting": 50,
            "paperAbstract": {
                "fragments": [],
                "text": "We present an algorithm based on statistical learning for synthesizing static and time-varying textures matching the appearance of an input texture. Our algorithm is general and automatic and it works well on various types of textures, including 1D sound textures, 2D texture images, and 3D texture movies. The same method is also used to generate 2D texture mixtures that simultaneously capture the appearance of a number of different input textures. In our approach, input textures are treated as sample signals generated by a stochastic process. We first construct a tree representing a hierarchical multiscale transform of the signal using wavelets. From this tree, new random trees are generated by learning and sampling the conditional probabilities of the paths in the original tree. Transformation of these random trees back into signals results in new random textures. In the case of 2D texture synthesis, our algorithm produces results that are generally as good as or better than those produced by previously described methods in this field. For texture mixtures, our results are better and more general than those produced by earlier methods. For texture movies, we present the first algorithm that is able to automatically generate movie clips of dynamic phenomena such as waterfalls, fire flames, a school of jellyfish, a crowd of people, etc. Our results indicate that the proposed technique is effective and robust."
            },
            "slug": "Texture-Mixing-and-Texture-Movie-Synthesis-Using-Bar-Joseph-El-Yaniv",
            "title": {
                "fragments": [],
                "text": "Texture Mixing and Texture Movie Synthesis Using Statistical Learning"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "This work presents an algorithm based on statistical learning for synthesizing static and time-varying textures matching the appearance of an input texture and it is the first algorithm that is able to automatically generate movie clips of dynamic phenomena."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Vis. Comput. Graph."
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1763086"
                        ],
                        "name": "Alexei A. Efros",
                        "slug": "Alexei-A.-Efros",
                        "structuredName": {
                            "firstName": "Alexei",
                            "lastName": "Efros",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alexei A. Efros"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768236"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Freeman",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 20,
                                "start": 6
                            }
                        ],
                        "text": "Input Image Quilting \nGraph cut Input Image Quilting Graph cut Rotation &#38; Mirroring Figure9: ComparisonofourgraphcutalgorithmwithImageQuilting[Efrosand \nFreeman2001]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 291,
                                "start": 288
                            }
                        ],
                        "text": "The algorithm \nworks by reformulating the Figure 1: Image texture synthesis by placing small patches at var­ious offsets \nfollowed by the computation of a seam that enforces visual smoothness betweentheexistingpixelsandthenewly \nplaced patch.  problem as a minimum cost graph cut problem: the MRF grid is augmented with special nodes, \nand a minimum cut of this grid be­tween two special terminal nodes is computed."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "MRFs have been studied extensively \nin the context of computer vision [Li 1995]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 31
                            }
                        ],
                        "text": "Thanks \nalso to the authors of [Efros and Freeman 2001], [Wei and Levoy2000]and [Bar-Joseph et al. 2001] for \nsharing their raw footage and results via their respective web sites to facilitate direct comparisons."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 54
                            }
                        ],
                        "text": "Hence, all techniques that model the texture as a MRF [DeBonet 1997; Efros and Leung 1999; Efros and Freeman 2001; Wei and Levoy 2000] compute some approximation to the optimal solution."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 65
                            }
                        ],
                        "text": "We also compare some of our results with that \nof Image Quilting [Efros and Free­man 2001] in Figure 9."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 76
                            }
                        ],
                        "text": "In our case, we use a graph cut technique to optimize the \nlikelihood of the MRF."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 88,
                                "start": 64
                            }
                        ],
                        "text": "We also compare some of our results with that of Image Quilting [Efros and Freeman 2001] in Figure 9."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 190,
                                "start": 187
                            }
                        ],
                        "text": "The primary contribution of this paper is an algorithm \nfor texture synthesis, which after .nd­ing a good patch offset, computes the best patch seam (the seam \nyielding the highest possible MRF likelihood among all possible seams for that offset)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 54,
                                "start": 30
                            }
                        ],
                        "text": "Thanks also to the authors of [Efros and Freeman 2001], [Wei and Levoy 2000] and [Bar-Joseph et al."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 84
                            }
                        ],
                        "text": "This concept of per­ceptual similarity has been formalized as a Markov Random \nField (MRF)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 113,
                                "start": 91
                            }
                        ],
                        "text": "Hence, all techniques that model the texture as a MRF [DeBonet 1997; Efros and Leung 1999; Efros and \nFreeman 2001;Wei and Levoy2000] compute some approxi­mation to the optimal solution."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 172,
                                "start": 92
                            }
                        ],
                        "text": "Across different synthesis techniques, textures are often described as Markov Random Fields [DeBonet 1997; Efros and Leung 1999; Efros and Freeman 2001; Wei and Levoy 2000]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 151,
                                "start": 129
                            }
                        ],
                        "text": "Across \ndifferent synthesis techniques, textures are often de­scribed as Markov Random Fields [DeBonet 1997; \nEfros and Leung 1999; Efros and Freeman 2001; Wei and Levoy 2000]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 89,
                                "start": 75
                            }
                        ],
                        "text": "The quilting result for KEYBOARD was generated using our \nimplementation of Image Quilting; the result for OLIVES is courtesy of Efros and Freeman."
                    },
                    "intents": []
                }
            ],
            "corpusId": 9334387,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dd7bf950093fc65f3ae6ad79666ce1077f9dfb2e",
            "isKey": true,
            "numCitedBy": 2463,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a simple image-based method of generating novel visual appearance in which a new image is synthesized by stitching together small patches of existing images. We call this process image quilting. First, we use quilting as a fast and very simple texture synthesis algorithm which produces surprisingly good results for a wide range of textures. Second, we extend the algorithm to perform texture transfer — rendering an object with a texture taken from a different object. More generally, we demonstrate how an image can be re-rendered in the style of a different image. The method works directly on the images and does not require 3D information."
            },
            "slug": "Image-quilting-for-texture-synthesis-and-transfer-Efros-Freeman",
            "title": {
                "fragments": [],
                "text": "Image quilting for texture synthesis and transfer"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This work uses quilting as a fast and very simple texture synthesis algorithm which produces surprisingly good results for a wide range of textures and extends the algorithm to perform texture transfer — rendering an object with a texture taken from a different object."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2360881"
                        ],
                        "name": "D. Heeger",
                        "slug": "D.-Heeger",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Heeger",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Heeger"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "116003860"
                        ],
                        "name": "J. Bergen",
                        "slug": "J.-Bergen",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bergen",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bergen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 53246434,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "829f2aac091d511455022e52e641d42fb034e310",
            "isKey": false,
            "numCitedBy": 747,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a method for synthesizing images that match the texture appearanceof a given digitized sample. This synthesis is completely automatic and requires only the “target” texture as input. It allows generation of as much texture as desired so that any object can be covered. It can be used to produce solid textures for creating textured 3-d objects without the distortions inherent in texture mapping. It can also be used to synthesize texture mixtures, images that look a bit like each of several digitized samples. The approach is based on a model of human texture perception, and has potential to be a practically useful tool for graphics applications."
            },
            "slug": "Pyramid-based-texture-analysis/synthesis-Heeger-Bergen",
            "title": {
                "fragments": [],
                "text": "Pyramid-based texture analysis/synthesis"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "This paper describes a method for synthesizing images that match the texture appearance of a given digitized sample, based on a model of human texture perception, and has potential to be a practically useful tool for graphics applications."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145911537"
                        ],
                        "name": "C. Soler",
                        "slug": "C.-Soler",
                        "structuredName": {
                            "firstName": "Cyril",
                            "lastName": "Soler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Soler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710314"
                        ],
                        "name": "Marie-Paule Cani",
                        "slug": "Marie-Paule-Cani",
                        "structuredName": {
                            "firstName": "Marie-Paule",
                            "lastName": "Cani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Marie-Paule Cani"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1766538"
                        ],
                        "name": "Alexis Angelidis",
                        "slug": "Alexis-Angelidis",
                        "structuredName": {
                            "firstName": "Alexis",
                            "lastName": "Angelidis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alexis Angelidis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 71,
                                "start": 68
                            }
                        ],
                        "text": "However, the search can be accelerated using FastFourierTrans­forms \n(FFT) [Kilthauetal."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 94
                            }
                        ],
                        "text": "The third term isaconvolutionoftheinputwiththeoutputandcanbe computedin O(nlog(n)) time using FFT."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 11
                            }
                        ],
                        "text": "The use of FFT-based accelera­tionin \nour search algorithmswasa hugefactorin improvingef."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "FFT-Based Acceleration: The SSD-based algorithms de­scribedin Section4 canbe computationallyexpensiveif \nthe search is carried out naively."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 75
                            }
                        ],
                        "text": "However, the search can be accelerated using Fast Fourier Transforms (FFT) [Kilthau et al. 2002; Soler et al. 2002] ."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 66
                            }
                        ],
                        "text": "The computation for im­ages is quitefast, mainly due to the use of FFT-based search."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 254,
                                "start": 251
                            }
                        ],
                        "text": "Since \nn is extremely large for images and especiallyforvideo,wegetahugespeedupusingthismethod fora 150 ×100 \n×30 video sequence, n 106, and the time required to search for a new patch reduces from around 10 minutes \n(using naive search) to 5seconds(using FFT-based search)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 13918091,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d8c6f5302ad3b97d5e3d683b356bbf60b526fc52",
            "isKey": true,
            "numCitedBy": 147,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a multi-scale algorithm for mapping a texture defined by an input image onto an arbitrary surface. It avoids the generation and storage of a new, specific texture. The idea is to progressively cover the surface by texture patches of various sizes and shapes, selected from a single input image. The process starts with large patches. A mapping that minimizes the texture fitting error with already textured neighbouring patches is selected. When this error is above a threshold, the patch is split into smaller ones, and the algorithm recursively looks for good fits at a smaller scale. The process ends when the surface is entirely covered. Our results show that the method correctly handles a wide set of texture patterns, which can be used at different mapping scales. Hierarchical texture mapping only outputs texture coordinates in the original texture for each triangle of the initial mesh. Rendering is therefore easy and memory cost minimal. Moreover the initial geometry is preserved."
            },
            "slug": "Hierarchical-pattern-mapping-Soler-Cani",
            "title": {
                "fragments": [],
                "text": "Hierarchical pattern mapping"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "A multi-scale algorithm for mapping a texture defined by an input image onto an arbitrary surface that avoids the generation and storage of a new, specific texture."
            },
            "venue": {
                "fragments": [],
                "text": "ACM Trans. Graph."
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2155276610"
                        ],
                        "name": "Lin Liang",
                        "slug": "Lin-Liang",
                        "structuredName": {
                            "firstName": "Lin",
                            "lastName": "Liang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lin Liang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1681442"
                        ],
                        "name": "Ce Liu",
                        "slug": "Ce-Liu",
                        "structuredName": {
                            "firstName": "Ce",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ce Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1742571"
                        ],
                        "name": "Ying-Qing Xu",
                        "slug": "Ying-Qing-Xu",
                        "structuredName": {
                            "firstName": "Ying-Qing",
                            "lastName": "Xu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ying-Qing Xu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143632999"
                        ],
                        "name": "B. Guo",
                        "slug": "B.-Guo",
                        "structuredName": {
                            "firstName": "Baining",
                            "lastName": "Guo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Guo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144154486"
                        ],
                        "name": "H. Shum",
                        "slug": "H.-Shum",
                        "structuredName": {
                            "firstName": "Harry",
                            "lastName": "Shum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Shum"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15448589,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e02295601663f95d8df87adbe159cbd39b685543",
            "isKey": false,
            "numCitedBy": 718,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "We present an algorithm for synthesizing textures from an input sample. This patch-based sampling algorithm is fast and it makes high-quality texture synthesis a real-time process. For generating textures of the same size and comparable quality, patch-based sampling is orders of magnitude faster than existing algorithms. The patch-based sampling algorithm works well for a wide variety of textures ranging from regular to stochastic. By sampling patches according to a nonparametric estimation of the local conditional MRF density function, we avoid mismatching features across patch boundaries. We also experimented with documented cases for which pixel-based nonparametric sampling algorithms cease to be effective but our algorithm continues to work well."
            },
            "slug": "Real-time-texture-synthesis-by-patch-based-sampling-Liang-Liu",
            "title": {
                "fragments": [],
                "text": "Real-time texture synthesis by patch-based sampling"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "An algorithm for synthesizing textures from an input sample by sampling patches according to a nonparametric estimation of the local conditional MRF density function, to avoid mismatching features across patch boundaries."
            },
            "venue": {
                "fragments": [],
                "text": "TOGS"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143632999"
                        ],
                        "name": "B. Guo",
                        "slug": "B.-Guo",
                        "structuredName": {
                            "firstName": "Baining",
                            "lastName": "Guo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Guo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "93596028"
                        ],
                        "name": "H. Shum",
                        "slug": "H.-Shum",
                        "structuredName": {
                            "firstName": "Heung-yeung",
                            "lastName": "Shum",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Shum"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1742571"
                        ],
                        "name": "Ying-Qing Xu",
                        "slug": "Ying-Qing-Xu",
                        "structuredName": {
                            "firstName": "Ying-Qing",
                            "lastName": "Xu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ying-Qing Xu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14980760,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bfc75d79183f6f3b4640a63ff7bb5a63b3e19796",
            "isKey": false,
            "numCitedBy": 187,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a procedural method for synthesizing large textures from an input texture sample. The basis of our algorithm is the chaos mosaic, a technique for synthesizing textures with an even and visually stochastic distribution of the local features of the input sample. The chaos mosaic is fast. For synthesizing textures of the same size and comparable quality, our algorithm is orders of magnitude faster than existing algorithms. On a PC we can synthesize a 512 512 texture from a 64 64 sample in just 0.03 second. More importantly, the chaos mosaic facilitates memory efficient texture rendering through procedural texturing. Like traditional solid texture techniques, the chaos mosaic allows us to synthesize and render synthetic textures that, if stored explicitly as textures, would require prohibitively large amount of storage. As an example, we demonstrate that an 100k 100k synthetic texture can be interactively visualized on a modest PC without suffering from latency. Finally, the chaos mosaic can drastically reduce the bandwidth for interactive 3D graphics delivered across the internet."
            },
            "slug": "Chaos-Mosaic:-Fast-and-Memory-Efficient-Texture-Guo-Shum",
            "title": {
                "fragments": [],
                "text": "Chaos Mosaic: Fast and Memory Efficient Texture Synthesis"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The chaos mosaic allows us to synthesize and render synthetic textures that, if stored explicitly as textures, would require prohibitively large amount of storage and drastically reduce the bandwidth for interactive 3D graphics delivered across the internet."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1763086"
                        ],
                        "name": "Alexei A. Efros",
                        "slug": "Alexei-A.-Efros",
                        "structuredName": {
                            "firstName": "Alexei",
                            "lastName": "Efros",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alexei A. Efros"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145266088"
                        ],
                        "name": "T. Leung",
                        "slug": "T.-Leung",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Leung",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Leung"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 291,
                                "start": 288
                            }
                        ],
                        "text": "The algorithm \nworks by reformulating the Figure 1: Image texture synthesis by placing small patches at var­ious offsets \nfollowed by the computation of a seam that enforces visual smoothness betweentheexistingpixelsandthenewly \nplaced patch.  problem as a minimum cost graph cut problem: the MRF grid is augmented with special nodes, \nand a minimum cut of this grid be­tween two special terminal nodes is computed."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "MRFs have been studied extensively \nin the context of computer vision [Li 1995]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 54
                            }
                        ],
                        "text": "Hence, all techniques that model the texture as a MRF [DeBonet 1997; Efros and Leung 1999; Efros and Freeman 2001; Wei and Levoy 2000] compute some approximation to the optimal solution."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 76
                            }
                        ],
                        "text": "In our case, we use a graph cut technique to optimize the \nlikelihood of the MRF."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 190,
                                "start": 187
                            }
                        ],
                        "text": "The primary contribution of this paper is an algorithm \nfor texture synthesis, which after .nd­ing a good patch offset, computes the best patch seam (the seam \nyielding the highest possible MRF likelihood among all possible seams for that offset)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 84
                            }
                        ],
                        "text": "This concept of per­ceptual similarity has been formalized as a Markov Random \nField (MRF)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 89,
                                "start": 69
                            }
                        ],
                        "text": "Hence, all techniques that model the texture as a MRF [DeBonet 1997; Efros and Leung 1999; Efros and \nFreeman 2001;Wei and Levoy2000] compute some approxi­mation to the optimal solution."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 172,
                                "start": 92
                            }
                        ],
                        "text": "Across different synthesis techniques, textures are often described as Markov Random Fields [DeBonet 1997; Efros and Leung 1999; Efros and Freeman 2001; Wei and Levoy 2000]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 127,
                                "start": 107
                            }
                        ],
                        "text": "Across \ndifferent synthesis techniques, textures are often de­scribed as Markov Random Fields [DeBonet 1997; \nEfros and Leung 1999; Efros and Freeman 2001; Wei and Levoy 2000]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 221583955,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bba3264d6794538381687ad6e151a7f42f3872a9",
            "isKey": true,
            "numCitedBy": 1647,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "A non-parametric method for texture synthesis is proposed. The texture synthesis process grows a new image outward from an initial seed, one pixel at a time. A Markov random field model is assumed, and the conditional distribution of a pixel given all its neighbors synthesized so far is estimated by querying the sample image and finding all similar neighborhoods. The degree of randomness is controlled by a single perceptually intuitive parameter. The method aims at preserving as much local structure as possible and produces good results for a wide variety of synthetic and real-world textures."
            },
            "slug": "Texture-synthesis-by-non-parametric-sampling-Efros-Leung",
            "title": {
                "fragments": [],
                "text": "Texture synthesis by non-parametric sampling"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "A non-parametric method for texture synthesis that aims at preserving as much local structure as possible and produces good results for a wide variety of synthetic and real-world textures."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Seventh IEEE International Conference on Computer Vision"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39226969"
                        ],
                        "name": "Eric N. Mortensen",
                        "slug": "Eric-N.-Mortensen",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Mortensen",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eric N. Mortensen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144055367"
                        ],
                        "name": "W. Barrett",
                        "slug": "W.-Barrett",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Barrett",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Barrett"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 180,
                                "start": 127
                            }
                        ],
                        "text": "Interactive Merging and Blending: One application of the graph cut technique is interactive image synthesis along the lines of [Mortensen and Barrett 1995; Brooks and Dodgson 2002]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 156,
                                "start": 130
                            }
                        ],
                        "text": "B. Interactive Merging and Blending: One application ofthe \ngraph cut technique is interactive image synthesis along the lines of [Mortensen and Barrett 1995; Brooks \nand Dodgson 2002]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 4374741,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "41093fe0f19cb37b239a62adb5f2c0cd058fec83",
            "isKey": false,
            "numCitedBy": 878,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new, interactive tool called Intelligent Scissors which we use for image segmentation and composition. Fully automated segmentation is an unsolved problem, while manual tracing is inaccurate and laboriously unacceptable. However, Intelligent Scissors allow objects within digital images to be extracted quickly and accurately using simple gesture motions with a mouse. When the gestured mouse position comes in proximity to an object edge, a live-wire boundary “snaps” to, and wraps around the object of interest. Live-wire boundary detection formulates discrete dynamic programming (DP) as a two-dimensional graph searching problem. DP provides mathematically optimal boundaries while greatly reducing sensitivity to local noise or other intervening structures. Robustness is further enhanced with on-the-fly training which causes the boundary to adhere to the specific type of edge currently being followed, rather than simply the strongest edge in the neighborhood. Boundary cooling automatically freezes unchanging segments and automates input of additional seed points. Cooling also allows the user to be much more free with the gesture path, thereby increasing the efficiency and finesse with which boundaries can be extracted. Extracted objects can be scaled, rotated, and composited using live-wire masks and spatial frequency equivalencing. Frequency equivalencing is performed by applying a Butterworth filter which matches the lowest frequency spectra to all other image components. Intelligent Scissors allow creation of convincing compositions from existing images while dramatically increasing the speed and precision with which objects can be extracted."
            },
            "slug": "Intelligent-scissors-for-image-composition-Mortensen-Barrett",
            "title": {
                "fragments": [],
                "text": "Intelligent scissors for image composition"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Intelligent Sc scissors allows objects within digital images to be extracted quickly and accurately using simple gesture motions with a mouse, and allows creation of convincing compositions from existing images while dramatically increasing the speed and precision with which objects can be extracted."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2116758319"
                        ],
                        "name": "Yizhou Wang",
                        "slug": "Yizhou-Wang",
                        "structuredName": {
                            "firstName": "Yizhou",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yizhou Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145380991"
                        ],
                        "name": "Song-Chun Zhu",
                        "slug": "Song-Chun-Zhu",
                        "structuredName": {
                            "firstName": "Song-Chun",
                            "lastName": "Zhu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Song-Chun Zhu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6558099,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9ffed80f00a4e881be031d9ed4f27f62e235de1f",
            "isKey": false,
            "numCitedBy": 61,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "Natural scenes contain rich stochastic motion patterns which are characterized by the movement of a large number of small elements, such as falling snow, raining, flying birds, firework and waterfall. In this paper, we call these motion patterns textured motion and present a generative method that combines statistical models and algorithms from both texture and motion analysis. The generative method includes the following three aspects. 1). Photometrically, an image is represented as a superposition of linear bases in atomic decomposition using an overcomplete dictionary, such as Gabor or Laplacian. Such base representation is known to be generic for natural images, and it is low dimensional as the number of bases is often 100 times smaller than the number of pixels. 2). Geometrically, each moving element (called moveton), such as the individual snowflake and bird, is represented by a deformable template which is a group of several spatially adjacent bases. Such templates are learned through clustering. 3). Dynamically, the movetons are tracked through the image sequence by a stochastic algorithm maximizing a posterior probability. A classic second order Markov chain model is adopted for the motion dynamics. The sources and sinks of the movetons are modeled by birth and death maps. We adopt an EM-like stochastic gradient algorithm for inference of the hidden variables: bases, movetons, birth/death maps, parameters of the dynamics. The learned models are also verified through synthesizing random textured motion sequences which bear similar visual appearance with the observed sequences."
            },
            "slug": "A-Generative-Method-for-Textured-Motion:-Analysis-Wang-Zhu",
            "title": {
                "fragments": [],
                "text": "A Generative Method for Textured Motion: Analysis and Synthesis"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "A generative method that combines statistical models and algorithms from both texture and motion analysis and an EM-like stochastic gradient algorithm for inference of the hidden variables: bases, movetons, birth/death maps, parameters of the dynamics."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "118024862"
                        ],
                        "name": "S. Brooks",
                        "slug": "S.-Brooks",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Brooks",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Brooks"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743917"
                        ],
                        "name": "N. Dodgson",
                        "slug": "N.-Dodgson",
                        "structuredName": {
                            "firstName": "Neil",
                            "lastName": "Dodgson",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Dodgson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 180,
                                "start": 127
                            }
                        ],
                        "text": "Interactive Merging and Blending: One application of the graph cut technique is interactive image synthesis along the lines of [Mortensen and Barrett 1995; Brooks and Dodgson 2002]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 181,
                                "start": 158
                            }
                        ],
                        "text": "B. Interactive Merging and Blending: One application ofthe \ngraph cut technique is interactive image synthesis along the lines of [Mortensen and Barrett 1995; Brooks \nand Dodgson 2002]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 964020,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cc460463780841cf3ec331c8f747e6e226c94602",
            "isKey": false,
            "numCitedBy": 66,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a simple method of interactive texture editing that utilizes self-similarity to replicate intended operations globally over an image. Inspired by the recent successes of hierarchical approaches to texture synthesis, this method also uses multi-scale neighborhoods to assess the similarity of pixels within a texture. However, neighborhood matching is not employed to generate new instances of a texture. We instead locate similar neighborhoods for the purpose of replicating editing operations on the original texture itself, thereby creating a fundamentally new texture. This general approach is applied to texture painting, cloning and warping. These global operations are performed interactively, most often directed with just a single mouse movement."
            },
            "slug": "Self-similarity-based-texture-editing-Brooks-Dodgson",
            "title": {
                "fragments": [],
                "text": "Self-similarity based texture editing"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "A simple method of interactive texture editing that utilizes self-similarity to replicate intended operations globally over an image, applied to texture painting, cloning and warping."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1722325"
                        ],
                        "name": "J. Bonet",
                        "slug": "J.-Bonet",
                        "structuredName": {
                            "firstName": "Jeremy",
                            "lastName": "Bonet",
                            "middleNames": [
                                "S.",
                                "De"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bonet"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 291,
                                "start": 288
                            }
                        ],
                        "text": "The algorithm \nworks by reformulating the Figure 1: Image texture synthesis by placing small patches at var­ious offsets \nfollowed by the computation of a seam that enforces visual smoothness betweentheexistingpixelsandthenewly \nplaced patch.  problem as a minimum cost graph cut problem: the MRF grid is augmented with special nodes, \nand a minimum cut of this grid be­tween two special terminal nodes is computed."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "MRFs have been studied extensively \nin the context of computer vision [Li 1995]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 54
                            }
                        ],
                        "text": "Hence, all techniques that model the texture as a MRF [DeBonet 1997; Efros and Leung 1999; Efros and Freeman 2001; Wei and Levoy 2000] compute some approximation to the optimal solution."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 76
                            }
                        ],
                        "text": "In our case, we use a graph cut technique to optimize the \nlikelihood of the MRF."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 190,
                                "start": 187
                            }
                        ],
                        "text": "The primary contribution of this paper is an algorithm \nfor texture synthesis, which after .nd­ing a good patch offset, computes the best patch seam (the seam \nyielding the highest possible MRF likelihood among all possible seams for that offset)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 84
                            }
                        ],
                        "text": "This concept of per­ceptual similarity has been formalized as a Markov Random \nField (MRF)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 67,
                                "start": 55
                            }
                        ],
                        "text": "Hence, all techniques that model the texture as a MRF [DeBonet 1997; Efros and Leung 1999; Efros and \nFreeman 2001;Wei and Levoy2000] compute some approxi­mation to the optimal solution."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 172,
                                "start": 92
                            }
                        ],
                        "text": "Across different synthesis techniques, textures are often described as Markov Random Fields [DeBonet 1997; Efros and Leung 1999; Efros and Freeman 2001; Wei and Levoy 2000]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 105,
                                "start": 93
                            }
                        ],
                        "text": "Across \ndifferent synthesis techniques, textures are often de­scribed as Markov Random Fields [DeBonet 1997; \nEfros and Leung 1999; Efros and Freeman 2001; Wei and Levoy 2000]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1908692,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "18bc39207b4d24eabf9d98649db53563d9c2e3fd",
            "isKey": true,
            "numCitedBy": 726,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper outlines a technique for treating input texture images as probability density estimators from which new textures, with similar appearance and structural properties, can be sampled. In a two-phase process, the input texture is first analyzed by measuring the joint occurrence of texture discrimination features at multiple resolutions. In the second phase, a new texture is synthesized by sampling successive spatial frequency bands from the input texture, conditioned on the similar joint occurrence of features at lower spatial frequencies. Textures synthesized with this method more successfully capture the characteristics of input textures than do previous techniques."
            },
            "slug": "Multiresolution-sampling-procedure-for-analysis-and-Bonet",
            "title": {
                "fragments": [],
                "text": "Multiresolution sampling procedure for analysis and synthesis of texture images"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "A technique for treating input texture images as probability density estimators from which new textures, with similar appearance and structural properties, can be sampled, which more successfully capture the characteristics of input textures than do previous techniques."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2302358"
                        ],
                        "name": "P. Burt",
                        "slug": "P.-Burt",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Burt",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Burt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 38
                            }
                        ],
                        "text": "We also use multi-resolution splining [Burt and Adelson 1983] of patches across seams, which is helpful when the seams are too obvious, but it also tends to reduce the contrast of the image or video when a lot of small patches have been placed in the output."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 39
                            }
                        ],
                        "text": "We also use multi-resolution splining \n[Burt and Adelson 1983] of patches across seams, which is helpful when the seams are too obvious, but \nit also tends to reduce the contrast of the image or video when a lot of small patches have been placed \nin the output."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 316610,
            "fieldsOfStudy": [
                "Environmental Science",
                "Mathematics"
            ],
            "id": "54f6217c2ab0031a935b2ed682dbd189012c6e0b",
            "isKey": false,
            "numCitedBy": 1204,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "We define a multiresolution spline technique for combining two or more images into a larger image mosaic. In this procedure, the images to be splined are first decomposed into a set of band-pass filtered component images. Next, the component images in each spatial frequency hand are assembled into a corresponding bandpass mosaic. In this step, component images are joined using a weighted average within a transition zone which is proportional in size to the wave lengths represented in the band. Finally, these band-pass mosaic images are summed to obtain the desired image mosaic. In this way, the spline is matched to the scale of features within the images themselves. When coarse features occur near borders, these are blended gradually over a relatively large distance without blurring or otherwise degrading finer image details in the neighborhood of th e border."
            },
            "slug": "A-multiresolution-spline-with-application-to-image-Burt-Adelson",
            "title": {
                "fragments": [],
                "text": "A multiresolution spline with application to image mosaics"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "A multiresolution spline technique for combining two or more images into a larger image mosaic is defined and coarse features occur near borders are blended gradually over a relatively large distance without blurring or otherwise degrading finer image details in the neighborhood of th e border."
            },
            "venue": {
                "fragments": [],
                "text": "TOGS"
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34679741"
                        ],
                        "name": "S. Li",
                        "slug": "S.-Li",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Li"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 857008,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c5634533a7daecde097a230484df5f0913dd9410",
            "isKey": false,
            "numCitedBy": 1418,
            "numCiting": 241,
            "paperAbstract": {
                "fragments": [],
                "text": "From the Publisher: \nMarkov random field (MRF) theory provides a basis for modeling contextual constraints in visual processing and interpretation. It enables us to develop optimal vision algorithms systematically when used with optimization principles. This book presents a comprehensive study on the use of MRFs for solving computer vision problems. The book covers the following parts essential to the subject: introduction to fundamental theories, formulations of MRF vision models, MRF parameter estimation, and optimization algorithms. Various vision models are presented in a unified framework, including image restoration and reconstruction, edge and region segmentation, texture, stereo and motion, object matching and recognition, and pose estimation. This book is an excellent reference for researchers working in computer vision, image processing, statistical pattern recognition, and applications of MRFs. It is also suitable as a text for advanced courses in these areas."
            },
            "slug": "Markov-Random-Field-Modeling-in-Computer-Vision-Li",
            "title": {
                "fragments": [],
                "text": "Markov Random Field Modeling in Computer Vision"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This book presents a comprehensive study on the use of MRFs for solving computer vision problems, and covers the following parts essential to the subject: introduction to fundamental theories, formulations of MRF vision models, MRF parameter estimation, and optimization algorithms."
            },
            "venue": {
                "fragments": [],
                "text": "Computer Science Workbench"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33523605"
                        ],
                        "name": "J. Portilla",
                        "slug": "J.-Portilla",
                        "structuredName": {
                            "firstName": "Javier",
                            "lastName": "Portilla",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Portilla"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2475577,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "37afeac49518877dc96a3ca2ec3ebdfc5305e0a9",
            "isKey": false,
            "numCitedBy": 1811,
            "numCiting": 96,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a universal statistical model for texture images in the context of an overcomplete complex wavelet transform. The model is parameterized by a set of statistics computed on pairs of coefficients corresponding to basis functions at adjacent spatial locations, orientations, and scales. We develop an efficient algorithm for synthesizing random images subject to these constraints, by iteratively projecting onto the set of images satisfying each constraint, and we use this to test the perceptual validity of the model. In particular, we demonstrate the necessity of subgroups of the parameter set by showing examples of texture synthesis that fail when those parameters are removed from the set. We also demonstrate the power of our model by successfully synthesizing examples drawn from a diverse collection of artificial and natural textures."
            },
            "slug": "A-Parametric-Texture-Model-Based-on-Joint-of-Portilla-Simoncelli",
            "title": {
                "fragments": [],
                "text": "A Parametric Texture Model Based on Joint Statistics of Complex Wavelet Coefficients"
            },
            "tldr": {
                "abstractSimilarityScore": 64,
                "text": "A universal statistical model for texture images in the context of an overcomplete complex wavelet transform is presented, demonstrating the necessity of subgroups of the parameter set by showing examples of texture synthesis that fail when those parameters are removed from the set."
            },
            "venue": {
                "fragments": [],
                "text": "International Journal of Computer Vision"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1832462"
                        ],
                        "name": "F. Crow",
                        "slug": "F.-Crow",
                        "structuredName": {
                            "firstName": "Franklin",
                            "lastName": "Crow",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Crow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 181,
                                "start": 170
                            }
                        ],
                        "text": "The first two terms in (6) are sum of squares of pixel values over sub-blocks of the image or video and can be computed efficiently in O(n) time using summed-area tables [Crow 1984]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 198,
                                "start": 189
                            }
                        ],
                        "text": "I(p-t)O(p) (6) p pp The .rst two terms in (6) are sum of squares of pixel values over sub-blocks \nof the image or video and can be computed ef.ciently in O(n) time using summed-area tables [Crow 1984]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2210332,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "8b22e1751f75be137b7b210981baccc1b9ab9222",
            "isKey": false,
            "numCitedBy": 1468,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Texture-map computations can be made tractable through use of precalculated tables which allow computational costs independent of the texture density. The first example of this technique, the “mip” map, uses a set of tables containing successively lower-resolution representations filtered down from the discrete texture function. An alternative method using a single table of values representing the integral over the texture function rather than the function itself may yield superior results at similar cost. The necessary algorithms to support the new technique are explained. Finally, the cost and performance of the new technique is compared to previous techniques."
            },
            "slug": "Summed-area-tables-for-texture-mapping-Crow",
            "title": {
                "fragments": [],
                "text": "Summed-area tables for texture mapping"
            },
            "tldr": {
                "abstractSimilarityScore": 82,
                "text": "Texture-map computations can be made tractable through use of precalculated tables which allow computational costs independent of the texture density, and the cost and performance of the new technique is compared to previous techniques."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '84"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1868870"
                        ],
                        "name": "Steven L. Kilthau",
                        "slug": "Steven-L.-Kilthau",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Kilthau",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steven L. Kilthau"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680726"
                        ],
                        "name": "M. S. Drew",
                        "slug": "M.-S.-Drew",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Drew",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. S. Drew"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143670380"
                        ],
                        "name": "T. Möller",
                        "slug": "T.-Möller",
                        "structuredName": {
                            "firstName": "Torsten",
                            "lastName": "Möller",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Möller"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 71,
                                "start": 68
                            }
                        ],
                        "text": "However, the search can be accelerated using FastFourierTrans­forms \n(FFT) [Kilthauetal."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 94
                            }
                        ],
                        "text": "The third term isaconvolutionoftheinputwiththeoutputandcanbe computedin O(nlog(n)) time using FFT."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 14,
                                "start": 11
                            }
                        ],
                        "text": "The use of FFT-based accelera­tionin \nour search algorithmswasa hugefactorin improvingef."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "FFT-Based Acceleration: The SSD-based algorithms de­scribedin Section4 canbe computationallyexpensiveif \nthe search is carried out naively."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 75
                            }
                        ],
                        "text": "However, the search can be accelerated using Fast Fourier Transforms (FFT) [Kilthau et al. 2002; Soler et al. 2002] ."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 66
                            }
                        ],
                        "text": "The computation for im­ages is quitefast, mainly due to the use of FFT-based search."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 254,
                                "start": 251
                            }
                        ],
                        "text": "Since \nn is extremely large for images and especiallyforvideo,wegetahugespeedupusingthismethod fora 150 ×100 \n×30 video sequence, n 106, and the time required to search for a new patch reduces from around 10 minutes \n(using naive search) to 5seconds(using FFT-based search)."
                    },
                    "intents": []
                }
            ],
            "corpusId": 12145763,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ed7886f94fc280f5b254e12fdae9eca9780ec68a",
            "isKey": true,
            "numCitedBy": 77,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new algorithm for solving the block matching problem which is independent of image content and is faster than other full-search methods. The method employs a novel data structure called the windowed-sum-squared-table, and uses the fast Fourier transform (FFT) in its computation of the sum squared difference (SSD) metric. Use of the SSD metric allows for higher peak signal to noise ratios than other fast block matching algorithms which require the sum of absolute difference (SAD) metric. However, because of the complex floating point and integer math used in our computation of the SSD metric, our method is aimed at software implementations only. Test results show that our method has a running time 13%-29% of that for the exhaustive search, depending on the size of the search range."
            },
            "slug": "Full-search-content-independent-block-matching-on-Kilthau-Drew",
            "title": {
                "fragments": [],
                "text": "Full search content independent block matching based on the fast Fourier transform"
            },
            "tldr": {
                "abstractSimilarityScore": 75,
                "text": "A new algorithm for solving the block matching problem which is independent of image content and is faster than other full-search methods, and uses the fast Fourier transform in its computation of the sum squared difference (SSD) metric."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. International Conference on Image Processing"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1778989"
                        ],
                        "name": "M. Szummer",
                        "slug": "M.-Szummer",
                        "structuredName": {
                            "firstName": "Martin",
                            "lastName": "Szummer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Szummer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719389"
                        ],
                        "name": "Rosalind W. Picard",
                        "slug": "Rosalind-W.-Picard",
                        "structuredName": {
                            "firstName": "Rosalind",
                            "lastName": "Picard",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rosalind W. Picard"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 201,
                                "start": 178
                            }
                        ],
                        "text": "Mostpreviousworkontextureisgearedtowards2D \nimages,but the texture problem in a very similar form also appears in three dimensions for the generation \nof spatio-temporal textures [Szum­mer and Picard 1996; Sch¨odl et al. 2000;Wei andLevoy 2000; Bar-Joseph \net al. 2001]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 275,
                                "start": 186
                            }
                        ],
                        "text": "Most previous work on texture is geared towards 2D images, but the texture problem in a very similar form also appears in three dimensions for the generation of spatio-temporal textures [Szummer and Picard 1996; Schödl et al. 2000; Wei and Levoy 2000; Bar-Joseph et al. 2001]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15426108,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dd6b50322a2850a66c0363719dff58f9c788af92",
            "isKey": false,
            "numCitedBy": 347,
            "numCiting": 53,
            "paperAbstract": {
                "fragments": [],
                "text": "Temporal textures are textures with motion. Examples include wavy water, rising steam and fire. We model image sequences of temporal textures using the spatio-temporal autoregressive model (STAR). This model expresses each pixel as a linear combination of surrounding pixels lagged both in space and in time. The model provides a base for both recognition and synthesis. We show how the least squares method can accurately estimate model parameters for large, causal neighborhoods with more than 1000 parameters. Synthesis results show that the model can adequately capture the spatial and temporal characteristics of many temporal textures. A 95% recognition rate is achieved for a 135 element database with 15 texture classes."
            },
            "slug": "Temporal-texture-modeling-Szummer-Picard",
            "title": {
                "fragments": [],
                "text": "Temporal texture modeling"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "This work model image sequences of temporal textures using the spatio-temporal autoregressive model (STAR), which expresses each pixel as a linear combination of surrounding pixels lagged both in space and in time."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 3rd IEEE International Conference on Image Processing"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745921"
                        ],
                        "name": "R. Sedgewick",
                        "slug": "R.-Sedgewick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Sedgewick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Sedgewick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 83
                            }
                        ],
                        "text": "Findingthebestcutforagraph \ncanhaveaworst-case O(n2) cost for a graph with n nodes [Sedgewick 2001]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 99,
                                "start": 85
                            }
                        ],
                        "text": "This is a classical graph problem \ncalled min­cut or max-.ow [Ford and Fulkerson 1962; Sedgewick 2001] and algorithms for solving it are \nwell understood and easy to code."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 59700363,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dff44745cb1491514c40eabeaff174ac5da2b8e3",
            "isKey": false,
            "numCitedBy": 67,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Once again, Robert Sedgewick provides a current and comprehensive introduction to important algorithms. The focus this time is on graph algorithms, which are increasingly critical for a wide range of applications, such as network connectivity, circuit design, scheduling, transaction processing, and resource allocation. In this book, Sedgewick offers the same successful blend of theory and practice with concise implementations that can be tested on real applications, which has made his work popular with programmers for many years. Algorithms in C, Third Edition, Part 5: Graph Algorithms is the second book in Sedgewick's thoroughly revised and rewritten series. The first book, Parts 1-4, addresses fundamental algorithms, data structures, sorting, and searching. A forthcoming third book will focus on strings, geometry, and a range of advanced algorithms. Each book's expanded coverage features new algorithms and implementations, enhanced descriptions and diagrams, and a wealth of new exercises for polishing skills. A focus on abstract data types makes the programs more broadly useful and relevant for the modern object-oriented programming environment.Coverage includes: A complete overview of graph properties and types Diagraphs and DAGs Minimum spanning trees Shortest paths Network flows Diagrams, sample C code, and detailed algorithm descriptions The Web site for this book (http://www.cs.princeton.edu/~rs/) provides additional source code for programmers along with numerous support materials for educators.A landmark revision, Algorithms in C, Third Edition, Part 5 provides a complete tool set for programmers to implement, debug, and use graph algorithms across a wide range of computer applications."
            },
            "slug": "Algorithms-in-c,-part-5:-graph-algorithms,-third-Sedgewick",
            "title": {
                "fragments": [],
                "text": "Algorithms in c, part 5: graph algorithms, third edition"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "Algorithms in C, Third Edition, Part 5: Graph Algorithms is the second book in Sedgewick's thoroughly revised and rewritten series and provides a complete tool set for programmers to implement, debug, and use graph algorithms across a wide range of computer applications."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745921"
                        ],
                        "name": "R. Sedgewick",
                        "slug": "R.-Sedgewick",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Sedgewick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Sedgewick"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 83
                            }
                        ],
                        "text": "Findingthebestcutforagraph \ncanhaveaworst-case O(n2) cost for a graph with n nodes [Sedgewick 2001]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 107,
                                "start": 91
                            }
                        ],
                        "text": "Finding the best cut for a graph can have a worst-case O(n2) cost for a graph with n nodes [Sedgewick 2001]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 99,
                                "start": 85
                            }
                        ],
                        "text": "This is a classical graph problem \ncalled min­cut or max-.ow [Ford and Fulkerson 1962; Sedgewick 2001] and algorithms for solving it are \nwell understood and easy to code."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 101,
                                "start": 60
                            }
                        ],
                        "text": "This is a classical graph problem called mincut or max-flow [Ford and Fulkerson 1962; Sedgewick 2001] and algorithms for solving it are well understood and easy to code."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 59724468,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "af4005703974594c0818de957200269075c68ac0",
            "isKey": true,
            "numCitedBy": 142,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Thu, 28 Feb 2019 15:55:00 GMT algorithms in c part 5 pdf This book presents a unified treatment of many different kinds of planning algorithms. The subject lies at the crossroads between robotics, control theory, artificial ... Sun, 03 Mar 2019 05:36:00 GMT Planning Algorithms / Motion Planning Algorithm design refers to a method or mathematical process for problem-solving and engineering algorithms. The design of algorithms is part of many solution theories ... Fri, 22 Feb 2019 18:54:00 GMT Algorithm Wikipedia This is a collection of algorithms for sorting and searching. Des criptions are brief and intuitive, with just enough theory thrown in to make you nervous. Sat, 02 Mar 2019 06:34:00 GMT by Tom Niemann ePaperPress Buy The Art of Computer Programming, Volume 4A: Combinatorial Algorithms, Part 1 on Amazon.com FREE SHIPPING on qualified orders Sat, 02 Mar 2019 04:54:00 GMT The Art of Computer Programming, Volume 4A: Combinatorial ..."
            },
            "slug": "Algorithms-in-C-:-Part-5-:-Graph-Algo-rithms-Sedgewick",
            "title": {
                "fragments": [],
                "text": "Algorithms in C : Part 5 : Graph Algo-rithms"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "This book presents a unified treatment of many different kinds of planning algorithms, which are at the crossroads between robotics, control theory, artificial intelligence, and engineering algorithms."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "118588681"
                        ],
                        "name": "Milton Siegel",
                        "slug": "Milton-Siegel",
                        "structuredName": {
                            "firstName": "Milton",
                            "lastName": "Siegel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Milton Siegel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2458887"
                        ],
                        "name": "L. R. Ford",
                        "slug": "L.-R.-Ford",
                        "structuredName": {
                            "firstName": "Lester",
                            "lastName": "Ford",
                            "middleNames": [
                                "Randolph"
                            ],
                            "suffix": "Jr."
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. R. Ford"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2093820"
                        ],
                        "name": "D. R. Fulkerson",
                        "slug": "D.-R.-Fulkerson",
                        "structuredName": {
                            "firstName": "Delbert",
                            "lastName": "Fulkerson",
                            "middleNames": [
                                "Ray"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. R. Fulkerson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 83,
                                "start": 60
                            }
                        ],
                        "text": "This is a classical graph problem \ncalled min­cut or max-.ow [Ford and Fulkerson 1962; Sedgewick 2001] and algorithms for solving it are \nwell understood and easy to code."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 101,
                                "start": 60
                            }
                        ],
                        "text": "This is a classical graph problem called mincut or max-flow [Ford and Fulkerson 1962; Sedgewick 2001] and algorithms for solving it are well understood and easy to code."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 124184373,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d0b6b09d516d2ae1015cc40cce32dac80d0f042a",
            "isKey": false,
            "numCitedBy": 3534,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "In this classic book, first published in 1962, L. R. Ford, Jr., and D. R. Fulkerson set the foundation for the study of network flow problems. The models and algorithms introduced in Flows in Networks are used widely today in the fields of transportation systems, manufacturing, inventory planning, image processing, and Internet traffic. The techniques presented by Ford and Fulkerson spurred the development of powerful computational tools for solving and analyzing network flow models, and also furthered the understanding of linear programming. In addition, the book helped illuminate and unify results in combinatorial mathematics while emphasizing proofs based on computationally efficient construction. Flows in Networks is rich with insights that remain relevant to current research in engineering, management, and other sciences. This landmark work belongs on the bookshelf of every researcher working with networks."
            },
            "slug": "Flows-in-Networks-Siegel-Ford",
            "title": {
                "fragments": [],
                "text": "Flows in Networks."
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "The techniques presented by Ford and Fulkerson spurred the development of powerful computational tools for solving and analyzing network flow models, and also furthered the understanding of linear programming."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1962
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40194660"
                        ],
                        "name": "P. Saisan",
                        "slug": "P.-Saisan",
                        "structuredName": {
                            "firstName": "Payam",
                            "lastName": "Saisan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Saisan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1736352"
                        ],
                        "name": "Gianfranco Doretto",
                        "slug": "Gianfranco-Doretto",
                        "structuredName": {
                            "firstName": "Gianfranco",
                            "lastName": "Doretto",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gianfranco Doretto"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "39092098"
                        ],
                        "name": "Y. Wu",
                        "slug": "Y.-Wu",
                        "structuredName": {
                            "firstName": "Ying",
                            "lastName": "Wu",
                            "middleNames": [
                                "Nian"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Wu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1715959"
                        ],
                        "name": "Stefano Soatto",
                        "slug": "Stefano-Soatto",
                        "structuredName": {
                            "firstName": "Stefano",
                            "lastName": "Soatto",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Stefano Soatto"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 214,
                                "start": 194
                            }
                        ],
                        "text": "Parametric models cannot synthesize as large a variety of textures as other models described here, but provide better model generalization and are more amenable to introspection and recognition [Saisan et al. 2001]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 212,
                                "start": 194
                            }
                        ],
                        "text": "Parametric models cannot synthesize \nas large a variety of textures as other models de­scribed here,but provide better model generalization \nand are more amenable to introspection and recognition [Saisan et al. 2001]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15943114,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "1ab4ac0a0e23947fcccf93c3ca26be700f0c361f",
            "isKey": false,
            "numCitedBy": 349,
            "numCiting": 69,
            "paperAbstract": {
                "fragments": [],
                "text": "Dynamic textures are sequences of images that exhibit some form of temporal stationarity, such as waves, steam, and foliage. We pose the problem of recognizing and classifying dynamic textures in the space of dynamical systems where each dynamic texture is uniquely represented. Since the space is non-linear, a distance between models must be defined We examine three different distances in the space of autoregressive models and assess their power."
            },
            "slug": "Dynamic-texture-recognition-Saisan-Doretto",
            "title": {
                "fragments": [],
                "text": "Dynamic texture recognition"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "This work poses the problem of recognizing and classifying dynamic textures in the space of dynamical systems where each dynamic texture is uniquely represented and examines three different distances in thespace of autoregressive models and assess their power."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the 2001 IEEE Computer Society Conference on Computer Vision and Pattern Recognition. CVPR 2001"
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 104,
                                "start": 86
                            }
                        ],
                        "text": "This is true only if we ensure that M is a metric (satis.es \nthe triangle inequality) [Boykov et al. 1999], which is true if the norm in Equation (1) is a metric."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 153
                            }
                        ],
                        "text": "Acknowledgements We would like to thank Professor Ramin Zabih and his students \nat Cornell University for sharing their code for computing graph min-cut [Boykov et al. 1999]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 106,
                                "start": 86
                            }
                        ],
                        "text": "This is true only if we ensure that M is a metric (satisfies the triangle inequality) [Boykov et al. 1999], which is true if the norm in Equation (1) is a metric."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 155,
                                "start": 135
                            }
                        ],
                        "text": "We would like to thank Professor Ramin Zabih and his students at Cornell University for sharing their code for computing graph min-cut [Boykov et al. 1999]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 74,
                                "start": 54
                            }
                        ],
                        "text": "Our graph cut formulation is equivalent to the one in [Boykov et al. 1999] and the addition of patches corresponds to the α-expansion step in their work."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 55
                            }
                        ],
                        "text": "Our \ngraph cut formulation is equivalent to the one in [Boykov et al. 1999] and the addition of patches corresponds \nto the a-expansion step in their work."
                    },
                    "intents": []
                }
            ],
            "corpusId": 45232003,
            "fieldsOfStudy": [],
            "id": "a57520b68e73b5e1fc3668b443daf74ebe957cc7",
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Fast Approximate Energy Minimization via Graph Cuts"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 128,
                                "start": 110
                            }
                        ],
                        "text": "These results improve upon video textures [Sch¨odl et al. 2000] and comparefa­vorably \nagainst dynamic textures [Soatto et al. 2001]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 53
                            }
                        ],
                        "text": "2000] and compare favorably against dynamic textures [Soatto et al. 2001]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 80,
                                "start": 62
                            }
                        ],
                        "text": "Wehave \nalso applied (our implementation of) dynamic textures [Soatto et al. 2001] to WATERFALL A, the result \nof which is much blurrier than our result."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 62
                            }
                        ],
                        "text": "We have also applied (our implementation of) dynamic textures [Soatto et al. 2001] to WATERFALL A, the result of which is much blurrier than our result."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 9550994,
            "fieldsOfStudy": [],
            "id": "025bd7af83536761e93eb81d244b4e8b12a9e355",
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Dynamic textures"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings Eighth IEEE International Conference on Computer Vision. ICCV 2001"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49026551"
                        ],
                        "name": "D. Greig",
                        "slug": "D.-Greig",
                        "structuredName": {
                            "firstName": "Darryl",
                            "lastName": "Greig",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Greig"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "146294528"
                        ],
                        "name": "B. Porteous",
                        "slug": "B.-Porteous",
                        "structuredName": {
                            "firstName": "Baroness",
                            "lastName": "Porteous",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Porteous"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1887111"
                        ],
                        "name": "A. Seheult",
                        "slug": "A.-Seheult",
                        "structuredName": {
                            "firstName": "Allan",
                            "lastName": "Seheult",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Seheult"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 58,
                                "start": 41
                            }
                        ],
                        "text": "Among other techniques us­ing graph cuts [Greig et al. 1989], we have chosen a \ntechnique by Boykov et al. [1999], which is particularly suited for the type of cost function found in \ntexture synthesis."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 40
                            }
                        ],
                        "text": "Among other techniques using graph cuts [Greig et al. 1989], we have chosen a technique by Boykov et al."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 115691220,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a717b20e99b76cb228b47694140ed3dce082b530",
            "isKey": false,
            "numCitedBy": 1257,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Exact-Maximum-A-Posteriori-Estimation-for-Binary-Greig-Porteous",
            "title": {
                "fragments": [],
                "text": "Exact Maximum A Posteriori Estimation for Binary Images"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Video textures. Proceedings of SIGGRAPH 2000"
            },
            "venue": {
                "fragments": [],
                "text": "Video textures. Proceedings of SIGGRAPH 2000"
            },
            "year": 2000
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 8,
            "methodology": 15,
            "result": 4
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 28,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/Graphcut-textures:-image-and-video-synthesis-using-Kwatra-Schödl/55c3ecb47aebba55a9de761c0e4dc0fd6d8d28b0?sort=total-citations"
}